{
  "bookName": "1 Kings",
  "totalEntries": 235,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "1 Kings 1:1",
          "verseText": "as it is stated: “Now King David was old and stricken in years; and they covered him with clothes, but he could get no heat”",
          "talmudLocation": "Berakhot 62b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-10",
          "talmudFullText": "The Talmud continues with a homiletic interpretation of the verse: <b>“Then David arose, and cut off the corner of Saul’s robe privily”</b> (I Samuel 24:4). <b>R' Yosei ben Ḥanina, said: Anyone who treats clothing with contempt, </b> like David who tore Saul’s robe for no reason, will be punished in that <b>ultimately he will not benefit from</b> his garments, <b>as it is stated: “Now King David was old and stricken in years; and they covered him with clothes, but he could get no heat”</b> (I Kings 1:1)."
        },
        {
          "verseLocation": "1 Kings 1:2",
          "verseText": "“And be a companion [ sokhenet ] unto him;",
          "talmudLocation": "Avodah Zarah 4b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4b#section-3",
          "talmudFullText": "The donkey further <b>said to</b> Balaam: <b>“Upon which you have ridden. ”</b> Balaam <b>said to it: Merely at irregular occurrences. </b> The donkey <b>said to him: “All your life long unto this day”</b> (Numbers 22:30). The donkey added: <b>And moreover, I perform for you riding during the day, and marriage, </b> i.e., sex, <b>during the night. </b> The Talmud explains: This is derived from the following comparison: <b>It is written here</b> that Balaam’s donkey said: <b>“Was I ever wont [<i>hahasken hiskanti</i>] to do so to you”</b> (Numbers 22:30), <b>and it is written there, </b> with regard to Abishag the Shunammite and King David: <b>“And be a companion [<i>sokhenet</i>] unto him; </b> and let her lie in your bosom” (I Kings 1:2). This teaches that the term <i>hiskanti</i> alludes to sex."
        },
        {
          "verseLocation": "1 Kings 1:2",
          "verseText": "as it is written: “And his servants said to him, Let there be sought for my lord the king a young virgin”",
          "talmudLocation": "Megillah 12b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-15",
          "talmudFullText": "<b>“In everything a prudent man acts with knowledge”; this</b> statement is referring to <b>David, </b> who also sought a wife for himself, <b>as it is written: “And his servants said to him, Let there be sought for my lord the king a young virgin”</b> (I Kings 1:2). Since he sought one maiden, <b>whoever had a daughter brought her to him, </b> for everyone wanted his daughter to be the king’s wife. With regard to the continuation of the verse: <b>“But a fool unfolds his folly”</b> (Proverbs 13:16), <b>this</b> statement <b>is</b> referring to <b>Ahasuerus, as it is written: “And let the king appoint officers”</b> to seek out many maidens. Since it became clear that the king would have sex with all of them, but in the end he would choose only one as his bride, <b>whoever had a daughter hid her from him. </b>"
        },
        {
          "verseLocation": "1 Kings 1:2",
          "verseText": "“And let her be a companion [ sokhenet ] to him”",
          "talmudLocation": "Sanhedrin 105b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105b#section-4",
          "talmudFullText": "The donkey continued: <b>Moreover, I perform a conjugal act for you</b> and we engage in bestiality <b>at night. </b> From where is this derived? <b>It is written here: “Was I ever wont [<i>hahasken hiskanti</i>]</b> to do so to you” (Numbers 22:30)? <b>And it is written there</b> with regard to Abishag the Shunammite: <b>“And let her be a companion [<i>sokhenet</i>] to him”</b> (I Kings 1:2). Just as the root <i>samekh</i>, <i>kaf</i>, <i>nun</i> indicates sexual sex in the case of Abishag, the same is true with regard to the donkey. Balaam was unable to best his donkey in a debate."
        },
        {
          "verseLocation": "1 Kings 1:2",
          "verseText": "“And let her be a companion [ sokhenet ] to him;",
          "talmudLocation": "Sanhedrin 26b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/26b#section-2",
          "talmudFullText": "<b>R' Elazar says: Shebna was a hedonist. It is written here: “Go, get yourself to this steward [<i>hasokhen</i>], </b> to Shebna, who is over the house” (Isaiah 22:15), <b>and it is written there</b> with regard to Abishag the Shunammite: <b>“And let her be a companion [<i>sokhenet</i>] to him; </b> and let her lie in your bosom, that my lord the king may get heat” (I Kings 1:2)."
        },
        {
          "verseLocation": "1 Kings 1:3",
          "verseText": "in the days of David, as it is written: “And they sought a beautiful maiden”",
          "talmudLocation": "Bava Batra 15b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-6",
          "talmudFullText": "<b>R' Yehoshua ben Korḥa says: Job</b> lived <b>in the days of Ahasuerus, as it is stated: “And in all the world were no women found so beautiful as the daughters of Job”</b> (Job 42:15). In <b>which generation were beautiful women sought? You must say it was the generation of Ahasuerus</b> (Esther, chapter 2). The Talmud asks: <b>But</b> why not <b>say</b> it was <b>in the days of David, as it is written: “And they sought a beautiful maiden”</b> (I Kings 1:3)? The Talmud answers: <b>There, </b> in the time of David, they searched <b>“throughout the territory of Israel”</b> (I Kings 1:3), whereas <b>here, </b> in the time of <b>Ahasuerus, </b> they searched <b>throughout the world, </b> as is similarly stated with regard to Job’s daughters."
        },
        {
          "verseLocation": "1 Kings 1:4",
          "verseText": "“And the damsel was very fair [ yafa ad me’od ]”",
          "talmudLocation": "Sanhedrin 39b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-21",
          "talmudFullText": "The chapter closes with the explication of a verse stated with regard to Abishag, who attended King David before his death: <b>“And the damsel was very fair [<i>yafa ad me’od</i> ]”</b> (I Kings 1:4). <b>R' Ḥanina bar Pappa says: She still did not reach half the beauty of Sarah, as it is written: </b> “<i>Ad me’od</i>,” which can be translated as <b>“up to very</b> fair,” <b>but not including</b> the praise of <b>“very</b> fair. ” By contrast, it is written concerning Sarah: “She was very fair” (Genesis 12:14)."
        },
        {
          "verseLocation": "1 Kings 1:5",
          "verseText": "“Now Adonijah, son of Haggith, exalted himself, saying: I will be king”",
          "talmudLocation": "Avodah Zarah 44a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/44a#section-18",
          "talmudFullText": "Similarly, the verse states: <b>“Now Adonijah, son of Haggith, exalted himself, saying: I will be king”</b> (I Kings 1:5). <b>Rav Yehuda says</b> that <b>Rav says: </b> The term “exalted himself” <b>teaches that he sought to</b> have the crown <b>fit him, but it did not fit him. </b>"
        },
        {
          "verseLocation": "1 Kings 1:5",
          "verseText": "“And he prepared for himself chariots and riders and fifty people to run before him”",
          "talmudLocation": "Avodah Zarah 44a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/44a#section-19",
          "talmudFullText": "The verse continues: <b>“And he prepared for himself chariots and riders and fifty people to run before him”</b> (I Kings 1:5). The Talmud asks: <b>What</b> is <b>the novelty of these</b> actions, since other wealthy people do the same, even if they are not the sons of kings with designs on the throne? It is <b>taught</b> in a <i>baraita</i> that what was unique was that the runners <b>all had</b> their <b>spleens removed and had the soles of their feet hollowed, </b> i.e., flesh from their feet was removed, and these two procedures enhanced their speed."
        },
        {
          "verseLocation": "1 Kings 1:5",
          "verseText": "“Now Adonijah, son of Haggith, exalted himself, saying: I will be king”",
          "talmudLocation": "Sanhedrin 21b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21b#section-4",
          "talmudFullText": "Apropos Amnon, the Talmud cites traditions about another son of David: <b>“Now Adonijah, son of Haggith, exalted himself, saying: I will be king”</b> (I Kings 1:5). <b>Rav Yehuda says</b> that <b>Rav says: </b> The term “exalted himself” <b>teaches that he sought</b> for the monarchy <b>to fit him, but it did not fit him. </b>"
        },
        {
          "verseLocation": "1 Kings 1:5",
          "verseText": "“And he prepared for himself chariots and riders and fifty people to run before him”",
          "talmudLocation": "Sanhedrin 21b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21b#section-5",
          "talmudFullText": "The verse continues: <b>“And he prepared for himself chariots and riders and fifty people to run before him”</b> (I Kings 1:5). The Talmud asks: <b>What is the novelty</b> of these actions, since other wealthy people do the same, even if they are not the sons of kings, with designs on the throne? <b>Rav Yehuda says</b> that <b>Rav says: </b> What was unique was that the runners <b>all had</b> their <b>spleens removed and had the soles of their feet hollowed, </b> removing the flesh of their feet, and these two procedures enhanced their speed."
        },
        {
          "verseLocation": "1 Kings 1:6",
          "verseText": "“And he was also a very handsome man; and she gave birth to him after Absalom,”",
          "talmudLocation": "Bava Batra 109b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/109b#section-10",
          "talmudFullText": "In connection with this, <b>R' Yoḥanan says in the name of R' Shimon ben Yoḥai: From here</b> it is learned <b>that corruption is linked to one who is corrupt, </b> as this man was linked to Manasseh and Judah despite having no familial connection to them. <b>R' Yosei bar Ḥanina says: </b> That concept can be seen <b>from here, </b> in the matter of Adonijah, the son of David: <b>“And he was also a very handsome man; and she gave birth to him after Absalom, ”</b> (I Kings 1:6) <b>but Adonijah wasn’t the son of Haggith and Absalom was the son of Maachah, </b> so why does the verse state: “And she gave birth to him after Absalom,” as if they were sons of the same mother? <b>Rather, since Adonijah acted</b> in a manner fit for <b>Absalom, who</b> also <b>rebelled against the monarchy, the verse linked him to Absalom, </b> referring to him as his full brother. <b>Here too, </b> with regard to Jonathan, <b>since he acted</b> as <b>Manasseh acted, the verse linked him to Manasseh. </b>"
        },
        {
          "verseLocation": "1 Kings 1:9",
          "verseText": "it is written here: “And Adonijah slaughtered sheep and cattle and fatlings by the stone of Zoheleth”",
          "talmudLocation": "Sanhedrin 110a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/110a#section-8",
          "talmudFullText": "Apropos the prohibition of perpetuating a dispute, <b>R' Yosei says: </b> With regard to <b>anyone who disputes the reign of the house of David, it is fitting for a snake to bite him. </b> As <b>it is written here: “And Adonijah slaughtered sheep and cattle and fatlings by the stone of Zoheleth”</b> (I Kings 1:9); <b>and it is written there: “With the poison of crawling things [<i>zoḥalei</i>] of the dust”</b> (Deuteronomy 32:24). Adonijah, who rebelled against his father, King David, was fit to be bitten by a snake."
        },
        {
          "verseLocation": "1 Kings 1:15",
          "verseText": "Call Bathsheba to me. And it is written: “And Bathsheba went in to the king into the chamber;",
          "talmudLocation": "Sanhedrin 22a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-14",
          "talmudFullText": "Abishag <b>said to him: When the thief is lacking</b> what to steal, <b>he makes himself like a man of peace. </b> In other words, she was saying that since King David was physically unable to have sex, he devised an excuse not to marry her. King David <b>said to</b> his attendants: <b>Call Bathsheba to me. And it is written: “And Bathsheba went in to the king into the chamber; </b> now the king was very old and Abishag the Shunammite ministered to the king” (I Kings 1:15). <b>Rav Yehuda says</b> that <b>Rav says: At that time, Bathsheba wiped</b> herself <b>with thirteen cloths, </b> corresponding to the number of words in the verse, indicating that she had sex with King David thirteen times."
        },
        {
          "verseLocation": "1 Kings 1:31",
          "verseText": "as it is stated: “Then Bathsheba bowed [ vatikod ] with her face to the ground”",
          "talmudLocation": "Berakhot 34b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/34b#section-3",
          "talmudFullText": "Having mentioned Solomon bowing, the Talmud distinguishes between various types of bowing. <b>A baraita states</b> in a <i>baraita</i>: The term <b><i>kidda</i></b> means bowing <b>upon</b> one’s <b>face, </b> with his face toward the ground, <b>as it is stated: “Then Bathsheba bowed [<i>vatikod</i>] with her face to the ground”</b> (I Kings 1:31). <b><i>Keria</i></b> means bowing <b>upon one’s knees, as</b> regarding Solomon <b>it is stated: </b> He finished praying and <b>“he rose from before the altar of YHWH, from kneeling [<i>mikkeroa</i>] upon his knees. ”</b> Finally, <b><i>hishtaḥava’a</i>, that is</b> bowing with <b>one’s hands and legs spread</b> in total submission, <b>as it is stated</b> in Jacob’s question to Joseph in response to his dream: <b>“Shall we, I and your mother and your brothers, come and bow down [<i>lehishtaḥavot</i>] to you to the ground? ”</b> (Genesis 37:10)."
        },
        {
          "verseLocation": "1 Kings 1:31",
          "verseText": "as it is stated: “Then Bathsheba bowed [ vatikod ] with her face to the ground”",
          "talmudLocation": "Megillah 22b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/22b#section-16",
          "talmudFullText": "Apropos Rav’s practice of prostrating himself, the Talmud continues with a discussion of different forms of bowing. <b>A baraita states</b> in a <i>baraita</i>: The term <b><i>kidda</i></b> indicates falling <b>upon</b> one’s <b>face, </b> with one’s face toward the ground, <b>as it is stated: “Then Bathsheba bowed [<i>vatikod</i>] with her face to the ground”</b> (I Kings 1:31). <b><i>Keria</i></b> means bowing <b>upon one’s knees, as it is stated</b> with regard to Solomon: He finished praying and “he rose from before the altar of YHWH, <b>from kneeling [<i>mikkeroa</i>] upon his knees”</b> (I Kings 8:54). Finally, <b><i>hishtaḥava’a</i>, that is</b> bowing with one’s <b>arms and legs spread</b> in total submission, <b>as it is stated</b> that Jacob asked, in response to Joseph’s dream: <b>“Shall I and your mother and your brothers indeed come to bow down [<i>lehishtaḥavot</i>] to you to the ground? ”</b> (Genesis 37:10)."
        },
        {
          "verseLocation": "1 Kings 1:31",
          "verseText": "states: “Then Bathsheba bowed [ vatikkod ] with her face to the ground”",
          "talmudLocation": "Shevuot 16b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/16b#section-9",
          "talmudFullText": "The Talmud discusses the different forms of bowing in greater detail. <b>A baraita states: </b> The term <b><i>kidda</i></b> indicates falling <b>upon</b> one’s <b>face, and so</b> the verse <b>states: “Then Bathsheba bowed [<i>vatikkod</i>] with her face to the ground”</b> (I Kings 1:31). <b><i>Keria</i></b> means descending <b>upon</b> one’s <b>knees, and so</b> the verse <b>states</b> with regard to Solomon: “He rose from before the altar of YHWH, <b>from kneeling [<i>mikero’a</i>] upon his knees”</b> (I Kings 8:54). <b><i>Hishtaḥava’a</i>, this</b> is prostrating oneself while <b>spreading </b>one’s <b>arms and legs</b> in total submission, <b>and so</b> the verse <b>states</b> that Jacob asked, in response to Joseph’s relating of his dream: <b>“Shall I and your mother and your brothers indeed come to bow down [<i>lehishtaḥavot</i>] to you to the ground”</b> (Genesis 37:10), i.e., spread out completely on the ground."
        },
        {
          "verseLocation": "1 Kings 1:33",
          "verseText": "A king precedes a High Priest, as it is stated: “And the king said unto them: Take with you the servants of your lord”",
          "talmudLocation": "Horayot 13a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/13a#section-11",
          "talmudFullText": "<b>A king precedes a High Priest, as it is stated: “And the king said unto them: Take with you the servants of your lord”</b> (I Kings 1:33). King David was referring to himself as lord when speaking to Zadok the priest."
        },
        {
          "verseLocation": "1 Kings 1:34",
          "verseText": "A High Priest precedes a prophet, as it is stated: “And let Zadok the priest and Nathan the prophet anoint him there”",
          "talmudLocation": "Horayot 13a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/13a#section-12",
          "talmudFullText": "<b>A High Priest precedes a prophet, as it is stated: “And let Zadok the priest and Nathan the prophet anoint him there”</b> (I Kings 1:34); <b>Zadok</b> is written <b>before Natan. And</b> similarly, the prophet <b>says: “Hear now, Joshua the High Priest, you and your colleagues</b> who sit before you, for they are men that are a sign; for behold, I will bring forth My servant Zemah” (Zechariah 3:8). One <b>might</b> have thought that these colleagues <b>were laymen. </b> Therefore, <b>the verse states: “For they are men that are a sign, ” and “sign”</b> means <b>nothing other than a prophet, as it is stated: “And he gives you a sign or a wonder”</b> (Deuteronomy 13:2)."
        },
        {
          "verseLocation": "1 Kings 1:40",
          "verseText": "so that the earth rent with the sound of them”",
          "talmudLocation": "Chullin 90b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/90b#section-12",
          "talmudFullText": "<b>The Torah spoke</b> employing <b>exaggerated language, </b> as it is written: “Hear, Israel: You are passing over the Jordan this day, to go in to dispossess nations greater and mightier than you, <b>cities great and fortified up to heaven”</b> (Deuteronomy 9:1), whereas the fortifications obviously did not actually reach up to heaven. <b>The Prophets spoke</b> employing <b>exaggerated language, </b> as it is written with regard to the coronation of King Solomon: “And all the people came up after him, and the people piped with pipes, and rejoiced with great joy, <b>so that the earth rent with the sound of them”</b> (I Kings 1:40), where the verse means merely that the sound was very loud."
        },
        {
          "verseLocation": "1 Kings 1:40",
          "verseText": "so that the earth rent with the sound of them”",
          "talmudLocation": "Tamid 29a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/tamid/29a#section-10",
          "talmudFullText": "The <b>prophets spoke</b> employing <b>exaggerated language, as it is written</b> with regard to the coronation of King Solomon: “And all the people of the land came up after him, and the people <b>piped with pipes, </b> and rejoiced with great joy, <b>so that the earth rent with the sound of them”</b> (I Kings 1:40). The verse merely means that the sound was very great, not that it actually caused the earth to split."
        },
        {
          "verseLocation": "1 Kings 1:47",
          "verseText": "“May God make the name of Solomon better than your name and make his throne greater than your throne [ mikisekha ]”",
          "talmudLocation": "Sanhedrin 105b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105b#section-13",
          "talmudFullText": "Apropos Ruth, matriarch of the Davidic line, the Talmud cites that which <b>Rava said to Rabba bar Mari: It is written</b> that the servants of David said to David: <b>“May God make the name of Solomon better than your name and make his throne greater than your throne [<i>mikisekha</i>]”</b> (I Kings 1:47). Rava asks: <b>Is it proper conduct to speak to a king in that manner</b> and say that his son will be greater than he is? Rabba bar Mari <b>said to</b> Rava: <b>She said to him: </b> May the throne of Solomon be <b>of the nature</b> of your throne."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "1 Kings 2:8",
          "verseText": "who cursed me with a grievous [ nimretzet ] curse",
          "talmudLocation": "Shabbat 105a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/105a#section-4",
          "talmudFullText": "<b>The school of R' Natan said</b> that there is another abbreviation in the Torah. In the verse: “And the angel of YHWH said to him: Why did you hit your donkey these three times? Behold I have come out as an adversary <b>because your way is contrary [<i>yarat</i>] against me”</b> (Numbers 22:32). <i>Yarat</i> is an abbreviation for: The donkey <b>feared [<i>yare’a</i>], it saw [<i>ra’ata</i>], </b> and <b>it turned aside [<i>nateta</i>]. The school of R' Yishmael taught: </b> The word <b><i>karmel</i></b> in the verse: “And bread, and toasted grain flour, and toasted grain [<i>karmel</i>]” (Leviticus 23:14) means: <b>A full kernel [<i>kar maleh</i>], </b> i.e., the seed fills the stalk. <b>Rav Aḥa bar Ya’akov said</b> in King David’s words: “And behold, with you is Shimi ben Gera from Benjamin, of Bahurim, <b>who cursed me with a grievous [<i>nimretzet</i>] curse</b> on the day that I went to Mahanaim” (I Kings 2:8). The word <i>nimretzet</i> is an <b>abbreviation</b> for: <b>He is an adulterer [<i>noef</i>], he is a Moabite [<i>Moavi</i>], he is a murderer [<i>rotze’aḥ</i>], he is an oppressor [<i>tzorer</i>], he is an abomination [<i>to’eva</i>]. </b>"
        },
        {
          "verseLocation": "1 Kings 2:8",
          "verseText": "“Maḥanaim”",
          "talmudLocation": "Yevamot 13b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/13b#section-6",
          "talmudFullText": "<b>As it is taught</b> in a <i>baraita</i>: <b>R' Neḥemya says</b> that with regard to <b>any word that requires</b> the letter <b><i>lamed</i> at its beginning, </b> meaning: To, <b>the verse</b> at times <b>placed</b> a letter <b><i>heh</i> at its end, </b> but the meaning is the same. <b>And the school of R' Yishmael taught: For example, </b> the term: To <b>“Elim”</b> (Exodus 16:1) can be rendered as <b>“<i>Elima</i>”</b> (Exodus 15:27) instead of <i>le’Elim</i>; <b>“Maḥanaim”</b> (I Kings 2:8) becomes <b>“<i>Maḥanaima</i>”</b> (II Samuel 17:24); <b>“<i>Mitzraim</i>”</b> (e.g., Genesis 13:1) into <b>“<i>Mitzraima</i>”</b> (Genesis 12:10); Divlatayim is <b>“<i>Divlataima</i>”</b> (Numbers 33:46); to <i>Yerushalaim</i> is <b>“<i>Yerushalaima</i>”</b> (Ezekiel 8:3); and <b>“<i>midbara</i>”</b> (Joshua 18:12) means: To the wilderness [<i>midbar</i>]. All these words that contain the letter <i>heh</i> at the end mean the same as if there were a <i>lamed</i> at the beginning."
        },
        {
          "verseLocation": "1 Kings 2:11",
          "verseText": "in Hebron he reigned seven years, and in Jerusalem he reigned thirty-three years”",
          "talmudLocation": "Sanhedrin 107b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107b#section-1",
          "talmudFullText": "<b>in Hebron he reigned seven years, and in Jerusalem he reigned thirty-three years”</b> (I Kings 2:11). <b>And it is written: “In Hebron he reigned over Judah seven years and six months</b> and in Jerusalem he reigned for thirty-three years over all Israel and Judah” (II Samuel 5:5). <b>And those six months, </b> the prophet <b>did not tally</b> them as part of the forty years of King David’s reign. <b>Conclude from it</b> that there were six months that he was not considered king because he <b>was afflicted with tzara'at. </b>"
        },
        {
          "verseLocation": "1 Kings 2:11",
          "verseText": "As it is written: “And the days that David reigned over Israel were forty years: Seven years he reigned in Hebron,",
          "talmudLocation": "Zevachim 119a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/119a#section-1",
          "talmudFullText": "<b>As it is written: “And the days that David reigned over Israel were forty years: Seven years he reigned in Hebron, </b> and thirty-three years he reigned in Jerusalem” (I Kings 2:11). In the first year that David reigned in Jerusalem he brought the Ark there from Kiriath Jearim. The Ark was therefore in Kiriath Jearim for twenty years. When the thirty-three years of David’s reign in Jerusalem are added to these, there are a total of fifty-three years from the destruction of Shiloh. During all of these years, and at the beginning of Solomon’s reign, the Tabernacle was in Nov and Gibeon (see I Kings 3:4)."
        },
        {
          "verseLocation": "1 Kings 2:19",
          "verseText": "“And he caused a throne to be set for the king’s mother”",
          "talmudLocation": "Bava Batra 91b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/91b#section-12",
          "talmudFullText": "<b>“Those who dwelt among plantations, ” this</b> is referring to <b>Solomon, who in his kingship</b> was <b>similar to a plant. “And hedges [<i>ugdera</i>], ” this</b> is the <b>Sanhedrin, which fenced [<i>gaderu</i>] in the breaches of the Jewish people</b> by means of ordinances. <b>“There they dwelt occupied in the king’s work, ” this</b> is referring to <b>Ruth the Moabite, who saw the kingship of Solomon, </b> the <b>grandson of her grandson. As it is stated</b> about Solomon: <b>“And he caused a throne to be set for the king’s mother”</b> (I Kings 2:19), <b>and R' Elazar says: </b> This means <b>for the mother of the</b> dynasty of <b>kingship, </b> i.e., Ruth."
        },
        {
          "verseLocation": "1 Kings 2:25",
          "verseText": "encountered and touched it, as it is written: “And he encountered him and he died”",
          "talmudLocation": "Chullin 18b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/18b#section-11",
          "talmudFullText": "<b>A dilemma was raised before</b> the rabbis: Does encountered mean <b>encountered and touched it, as it is written: “And he encountered him and he died”</b> (I Kings 2:25); <b>or perhaps</b> it means <b>encountered but did not touch, like that which is written: “And the angels of God encountered him”</b> (Genesis 32:2)?"
        },
        {
          "verseLocation": "1 Kings 2:26",
          "verseText": "As it is written: “And to Ebiathar the priest the king said: Get to Anatoth to your fields, for you are deserving of death. But I will not put you to death today, because you carried the Ark of the Lord God before David my father, and because you have been afflicted in all that my father was afflicted”",
          "talmudLocation": "Yoma 77a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/77a#section-9",
          "talmudFullText": "§ The Talmud returns to the issue of whether refraining from bathing is considered affliction. <b>If you wish, say</b> instead: The fact <b>that bathing is considered affliction, from where do we</b> derive this? <b>As it is written: “And to Ebiathar the priest the king said: Get to Anatoth to your fields, for you are deserving of death. But I will not put you to death today, because you carried the Ark of YHWH God before David my father, and because you have been afflicted in all that my father was afflicted”</b> (I Kings 2:26). <b>And it is written with regard to David: “For they said the people is hungry, and weary, and thirsty in the wilderness”</b> (II Samuel 17:29). <b>Hunger</b> means <b>from</b> lack of <b>bread</b> to eat, <b>and thirst</b> means <b>from</b> lack of <b>water</b> to drink. The word <b>weary</b> means lack <b>from what? Is it not from bathing? </b> The comparison of the verses suggests that that too is affliction. The Talmud challenges: <b>And perhaps</b> “weary” means from lack of <b>wearing shoes? </b> Therefore, this does not teach us that refraining from bathing is considered an affliction."
        },
        {
          "verseLocation": "1 Kings 2:28",
          "verseText": "as it is written: “And Joab fled to the Tent of God and grasped the horns of the altar”",
          "talmudLocation": "Makkot 12a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/12a#section-2",
          "talmudFullText": "§ The Mishnah teaches: If <b>the verdict of</b> a murderer was decided at a time when there was no High Priest, and likewise in the cases of one who unintentionally killed a High Priest and in the case of a High Priest who killed unintentionally, the unintentional murderer never leaves the city of refuge. And one who is exiled may not leave the city at all; even if the Jewish people require his services, and even if he is the general of the army of the Jewish people like Joab ben Zeruiah, he does not leave the city of refuge ever. <b>Rav Yehuda says</b> that <b>Rav says: Joab made two errors at that moment, </b> when he fled from Solomon, <b>as it is written: “And Joab fled to the Tent of God and grasped the horns of the altar”</b> (I Kings 2:28)."
        },
        {
          "verseLocation": "1 Kings 2:28",
          "verseText": "that it is written: “And Joab fled to the tent of the Lord and caught hold of the horns of the altar”",
          "talmudLocation": "Sanhedrin 48b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-12",
          "talmudFullText": "The Talmud raises another difficulty: <b>Granted, according to the one who says</b> that <b>the property of</b> those executed by the king belongs <b>to the king, that is</b> the reason <b>that it is written: “And Joab fled to the tent of YHWH and caught hold of the horns of the altar”</b> (I Kings 2:28), describing Joab’s actions after it became known that he supported Adonijah, <b>and</b> furthermore <b>it is written: “And he said, I will not leave, for here I will die”</b> (I Kings 2:30). Joab did not want to be put to death by the king because he did not want his property to pass into the king’s possession. <b>But according to the one who says</b> that <b>the property of</b> those executed by the king belongs <b>to</b> their <b>heirs, what difference</b> did taking refuge in the Sanctuary make <b>to him? </b> The Talmud answers: Joab fled to the sanctuary in order <b>to live a short while</b> longer. Consequently, there is no proof from here to either side of the dispute."
        },
        {
          "verseLocation": "1 Kings 2:28",
          "verseText": "rebelled against the king, as it is written: “Then tidings came to Joab, for Joab had followed after Adonijah, though he had not followed after Absalom.",
          "talmudLocation": "Sanhedrin 49a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/49a#section-7",
          "talmudFullText": "Solomon continued: <b>Rather, </b> the opposite is true. <b>That man, </b> you, Joab, <b>rebelled against the king, as it is written: “Then tidings came to Joab, for Joab had followed after Adonijah, though he had not followed after Absalom. </b> And Joab fled to the tent of YHWH and caught hold of the horns of the altar” (I Kings 2:28). Joab followed Adonijah, thereby rebelling against Solomon, the lawful king."
        },
        {
          "verseLocation": "1 Kings 2:30",
          "verseText": "it is written: “And he said, I will not leave, for here I will die”",
          "talmudLocation": "Sanhedrin 48b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-12",
          "talmudFullText": "The Talmud raises another difficulty: <b>Granted, according to the one who says</b> that <b>the property of</b> those executed by the king belongs <b>to the king, that is</b> the reason <b>that it is written: “And Joab fled to the tent of YHWH and caught hold of the horns of the altar”</b> (I Kings 2:28), describing Joab’s actions after it became known that he supported Adonijah, <b>and</b> furthermore <b>it is written: “And he said, I will not leave, for here I will die”</b> (I Kings 2:30). Joab did not want to be put to death by the king because he did not want his property to pass into the king’s possession. <b>But according to the one who says</b> that <b>the property of</b> those executed by the king belongs <b>to</b> their <b>heirs, what difference</b> did taking refuge in the Sanctuary make <b>to him? </b> The Talmud answers: Joab fled to the sanctuary in order <b>to live a short while</b> longer. Consequently, there is no proof from here to either side of the dispute."
        },
        {
          "verseLocation": "1 Kings 2:30",
          "verseText": "“And Benaiah brought the king word back, saying: So said Joab, and so he answered me”",
          "talmudLocation": "Sanhedrin 48b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-13",
          "talmudFullText": "§ The Talmud continues to discuss the incident involving Joab. After Joab took refuge in the Sanctuary and King Solomon sent Benaiah, son of Jehoiada, to fall upon him, Benaiah ordered Joab to leave the sanctuary, whereupon Joab refused. The verse then states: <b>“And Benaiah brought the king word back, saying: So said Joab, and so he answered me”</b> (I Kings 2:30). The Talmud explains: Joab <b>said to him: Go and say to</b> Solomon: <b>You cannot perform two</b> actions <b>to this man, </b> i.e., to me, Joab. <b>If you kill him, </b> i.e., me, <b>you</b> and your descendants <b>will receive the curses with which your father cursed me. And if</b> you do <b>not</b> wish to receive those curses, <b>let him go so that he may receive the curses with which your father cursed him. </b> And the next verse states: <b>“And the king said to him: Do as he has said, and fall upon him, and bury him. ”</b> Solomon thereby accepted his father’s curses upon himself and his descendants."
        },
        {
          "verseLocation": "1 Kings 2:32",
          "verseText": "better than he”",
          "talmudLocation": "Sanhedrin 49a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/49a#section-14",
          "talmudFullText": "§ The verse states that Solomon said to Benaiah, son of Jehoiada, concerning Joab: <b>“And YHWH shall return the blood upon his own head, for he fell upon two men more righteous</b> and <b>better than he”</b> (I Kings 2:32). The Talmud explains: Amasa and Abner were <b>“better”</b> that Joab, <b>as they interpreted</b> the words <b><i>akh</i> and <i>rak</i></b> in a restrictive manner that limited the king’s authority, <b>while he did not interpret</b> them in that way, demonstrating that they were greater than him in Torah. Amasa and Abner were also <b>“more righteous”</b> than Joab, <b>as they</b> both received <b>oral</b> instructions directly from Saul to slay the priests of Nov <b>and they did not do</b> so, <b>whereas</b> Joab was instructed by David <b>in a letter</b> to kill Uriah and <b>he did</b> so."
        },
        {
          "verseLocation": "1 Kings 2:34",
          "verseText": "“And he was buried in his own house, in the wilderness”",
          "talmudLocation": "Sanhedrin 49a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/49a#section-16",
          "talmudFullText": "The verse states with regard to Joab: <b>“And he was buried in his own house, in the wilderness”</b> (I Kings 2:34). The Talmud asks: <b>Is that to say</b> that Joab’s <b>house</b> was <b>a wilderness? Rav Yehuda says</b> that <b>Rav says: </b> Joab’s house was <b>like the wilderness; just as the wilderness is</b> freely <b>open to all, so too, Joab’s house</b> was freely <b>open to all, </b> as he generously opened his house to the poor and made them feel like members of the household. <b>Alternatively, </b> Joab’s house was <b>like the wilderness; just as the wilderness is clean of theft and sexual immorality, </b> as it is uninhabited, <b>so too, Joab’s house was clean of theft and sexual immorality, </b> owing to his righteousness. As for the verse: <b>“And Joab kept alive the rest of the city”</b> (I Chronicles 11:8), <b>Rav Yehuda says: </b> Not only would Joab feed the poor, but <b>he would even give them</b> treats of types of <b>small fish</b> so they would lack for nothing."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "1 Kings 3:1",
          "verseText": "“And Solomon married the daughter of Pharaoh, king of Egypt”",
          "talmudLocation": "Yevamot 76a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/76a#section-16",
          "talmudFullText": "<b>Rav Yosef raised an objection</b> from the verse that states: <b>“And Solomon married the daughter of Pharaoh, king of Egypt”</b> (I Kings 3:1), which indicates that there can, in fact, be valid marriage even with non-Jews. The Talmud answers: Before Solomon took Pharaoh’s daughter as his wife, <b>he converted her. </b> The Talmud asks: <b>But isn’t</b> it so that <b>they did not accept converts, neither in the days of David nor in the days of Solomon? </b> The Talmud answers: <b>But isn’t the reason</b> that they did not accept converts during those periods <b>only</b> due <b>to</b> concern that the converts were not acting for the sake of Heaven but in fact desired the power of <b>the table of kings, </b> David and Solomon?"
        },
        {
          "verseLocation": "1 Kings 3:1",
          "verseText": "married”",
          "talmudLocation": "Yevamot 76b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/76b#section-4",
          "talmudFullText": "<b>Rav Pappa said: Shall we stand up and raise an objection from Solomon? Solomon did not marry anyone, as it is written in his regard: “Of the nations concerning which YHWH said to the children of Israel, You shall not go among them, neither shall they come among you; for surely they will turn away your heart after their gods; Solomon cleaved to these in love”</b> (I Kings 11:2). Solomon cleaved to these women in love, but was not legally married to them. As Solomon had other forbidden wives, the case of Pharaoh’s daughter presents no special difficulty. In fact, none of these marriages were valid at all. <b>But</b> the phrase <b>“and</b> Solomon <b>married”</b> (I Kings 3:1) that appears in connection with Pharaoh’s daughter is <b>difficult, </b> as it indicates that this marriage was in fact valid."
        },
        {
          "verseLocation": "1 Kings 3:4",
          "verseText": "“A thousand burnt-offerings did Solomon offer up”",
          "talmudLocation": "Sotah 47a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-3",
          "talmudFullText": "<b>But didn’t Rav Yehuda say</b> that <b>Rav says: A person should always engage in Torah</b> study <b>and</b> in performance of <b>mitzvot, even</b> if he does so <b>not for their own sake, as through</b> such acts performed <b>not for their own sake, </b> one will <b>come</b> to perform them <b>for their own sake. </b> He proves the value of a mitzva done not for its own sake: <b>As in reward for the forty-two offerings that Balak, king of Moab, brought, he merited that Ruth descended from him, from whom</b> King <b>Solomon descended, about whom it is written</b> that he brought many offerings: <b>“A thousand burnt-offerings did Solomon offer up”</b> (I Kings 3:4). <b>And R' Yosei ben Ḥoni</b> similarly <b>says: Ruth was the daughter of Eglon, son of Balak. </b> These rabbis state that Balak’s reward was to have Ruth descend from him, not that a number of Jewish people perish. The Talmud answers: <b>His desire, in any event, was to curse</b> the Jewish people, and his reward for sacrificing his offerings was that the curse was fulfilled in the incident involving Elisha, as well."
        },
        {
          "verseLocation": "1 Kings 3:4",
          "verseText": "“A thousand burnt offerings did Solomon offer upon that altar”",
          "talmudLocation": "Zevachim 59b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/59b#section-1",
          "talmudFullText": "<b>But isn’t it already stated</b> with regard to the altar that Moses built: <b>“A thousand burnt offerings did Solomon offer upon that altar”</b> (I Kings 3:4), <b>while with regard to the Eternal House, </b> i.e., the Temple, <b>it states: “And Solomon offered for the sacrifice of peace offerings, which he offered to YHWH, two and twenty thousand cattle</b> and one hundred and twenty thousand sheep” (I Kings 8:63)?"
        },
        {
          "verseLocation": "1 Kings 3:27",
          "verseText": "as it is written: “And the king answered and said: Give her the living child, and do not slay him; she is his mother”",
          "talmudLocation": "Makkot 23b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/23b#section-14",
          "talmudFullText": "This occurred <b>in the court of Solomon, </b> when the Holy Spirit appeared in the dispute between two prostitutes over who was the mother of the surviving child, <b>as it is written: “And the king answered and said: Give her the living child, and do not slay him; she is his mother”</b> (I Kings 3:27). <b>How did</b> Solomon <b>know</b> that she was the mother? <b>Perhaps she was devious</b> and was not the mother of the surviving child at all. Rather, <b>a bat kol emerged and said: She is his mother. </b>"
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "1 Kings 4:3",
          "verseText": "these two Cushites who would stand before Solomon: “Elihoreph and Ahijah, the sons of Shisha”",
          "talmudLocation": "Sukkah 53a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/53a#section-5",
          "talmudFullText": "The Talmud relates with regard to <b>these two Cushites who would stand before Solomon: “Elihoreph and Ahijah, the sons of Shisha”</b> (I Kings 4:3), and <b>they were scribes of Solomon. One day</b> Solomon <b>saw that the Angel of Death was sad. He said to him: Why are you sad? He said to him: They are asking me</b> to take the lives of <b>these two Cushites who are sitting here. </b> Solomon <b>handed them to the demons</b> in his service, <b>and sent them to the district of Luz, </b> where the Angel of Death has no dominion. <b>When they arrived at the district of Luz, they died. </b>"
        },
        {
          "verseLocation": "1 Kings 4:7",
          "verseText": "pillar [ netziv ] is a term for the month? As it is written: “And Solomon had twelve officers [ netzivim ] over all Israel, and they provided for the king and his household for a month in the year”",
          "talmudLocation": "Sanhedrin 12a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/12a#section-8",
          "talmudFullText": "The Talmud asks about the language of the coded message. <b>From where may</b> it <b>be inferred that this</b> word <b>pillar [<i>netziv</i>] is a term for the month? As it is written: “And Solomon had twelve officers [<i>netzivim</i>] over all Israel, and they provided for the king and his household for a month in the year”</b> (I Kings 4:7). This indicates that each <i>netziv</i> was responsible for a particular month. Once this verse was quoted, the Talmud inquires: <b>But isn’t it written</b> afterward: <b>“And one officer that was in the land”</b> (I Kings 4:19), indicating that there were more than twelve <i>netzivim</i>? <b>Rav Yehuda and Rav Naḥman</b> offer answers. <b>One says: One</b> officer was <b>appointed over all of</b> the others. <b>And one says: </b> The extra officer <b>corresponded to the intercalated month. </b> If the year had an additional month, he was responsible for the king’s provisions during that month."
        },
        {
          "verseLocation": "1 Kings 4:19",
          "verseText": "“And one officer that was in the land”",
          "talmudLocation": "Sanhedrin 12a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/12a#section-8",
          "talmudFullText": "The Talmud asks about the language of the coded message. <b>From where may</b> it <b>be inferred that this</b> word <b>pillar [<i>netziv</i>] is a term for the month? As it is written: “And Solomon had twelve officers [<i>netzivim</i>] over all Israel, and they provided for the king and his household for a month in the year”</b> (I Kings 4:7). This indicates that each <i>netziv</i> was responsible for a particular month. Once this verse was quoted, the Talmud inquires: <b>But isn’t it written</b> afterward: <b>“And one officer that was in the land”</b> (I Kings 4:19), indicating that there were more than twelve <i>netzivim</i>? <b>Rav Yehuda and Rav Naḥman</b> offer answers. <b>One says: One</b> officer was <b>appointed over all of</b> the others. <b>And one says: </b> The extra officer <b>corresponded to the intercalated month. </b> If the year had an additional month, he was responsible for the king’s provisions during that month."
        },
        {
          "verseLocation": "1 Kings 4:20",
          "verseText": "when the Jewish people were very numerous, as it is written with regard to them: “Judea and Israel were many, as the sand that is by the sea in multitude,",
          "talmudLocation": "Bava Metzia 28a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/28a#section-17",
          "talmudFullText": "The Talmud explains the answer: <b>During the First Temple</b> period, <b>when the Jewish people were very numerous, as it is written with regard to them: “Judea and Israel were many, as the sand that is by the sea in multitude, </b> eating and drinking and rejoicing” (I Kings 4:20), <b>we need that much</b> time for them to travel from Jerusalem to the farthest reaches of Eretz Yisrael, due to the wide distribution of the large population. <b>During the Second Temple</b> period, <b>when the Jewish people were not very numerous, as it is written: “The whole congregation together was forty and two thousand three hundred and sixty”</b> (Ezra 2:64), <b>we do not need that much</b> time for them to travel from Jerusalem to the farthest reaches of Eretz Yisrael, due to the limited distribution of the small population."
        },
        {
          "verseLocation": "1 Kings 4:20",
          "verseText": "Israel and Judah, as it is stated: “Judah and Israel were many, as the sand which is by the sea",
          "talmudLocation": "Bava Metzia 86b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/86b#section-4",
          "talmudFullText": "The Talmud answers: <b>There, </b> with regard to Abraham, he prepared <b>three oxen for three people, </b> whereas <b>here, </b> in the case of Solomon, his wives would prepare a feast <b>for the entire</b> realms of <b>Israel and Judah, as it is stated: “Judah and Israel were many, as the sand which is by the sea</b> in multitude, eating and drinking and making merry” (I Kings 4:20). Abraham’s feast was proportionately greater than that of Solomon."
        },
        {
          "verseLocation": "1 Kings 4:20",
          "verseText": "about which it is written: “Judah and Israel were many as the sand that is by the sea”",
          "talmudLocation": "Zevachim 61b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/61b#section-9",
          "talmudFullText": "<b>Abaye said to him: Now, </b> if in <b>the First Temple</b> era, <b>about which it is written: “Judah and Israel were many as the sand that is by the sea”</b> (I Kings 4:20), the altar <b>was sufficient, </b> how could it be that in <b>the Second Temple</b> era, <b>about which it is written: “The whole congregation together was forty</b> and two <b>thousand</b> three hundred and sixty” (Ezra 2:64), the altar <b>was not sufficient? </b> Rav Yosef <b>said to</b> Abaye: <b>There, </b> in the First Temple, a <b>heavenly fire</b> would <b>assist them</b> and consume the offerings. <b>Here, </b> in the Second Temple, there was <b>no heavenly fire</b> that would <b>assist them. </b> Therefore, they needed a larger area in which to burn the offerings."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "1 Kings 5:4",
          "verseText": "“For he had dominion over all the region on this side of the river, from Tiphsah even to Gaza”",
          "talmudLocation": "Megillah 11a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-21",
          "talmudFullText": "<b>On a similar</b> note, <b>you say</b> with regard to Solomon: <b>“For he had dominion over all the region on this side of the river, from Tiphsah even to Gaza”</b> (I Kings 5:4), and also with regard to this <b>Rav and Shmuel</b> disagreed. <b>One said: Tiphsah is at one end of the world, whereas Gaza is at the other end of the world. And one said: Tiphsah and Gaza are situated next to each other, </b> and the verse means to say as follows: <b>Just as</b> Solomon <b>reigned</b> with ease <b>over</b> the adjacent <b>Tiphsah and Gaza, so too, he reigned</b> with ease <b>over the entire world. </b>"
        },
        {
          "verseLocation": "1 Kings 5:4",
          "verseText": "as it is stated: “For he had dominion over all the region on this side of the river, from Tiphsah even to Gaza”",
          "talmudLocation": "Sanhedrin 20b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/20b#section-15",
          "talmudFullText": "§ The Talmud cites another tradition about Solomon’s kingdom. <b>Reish Lakish says: Initially, Solomon ruled</b> even <b>over the supernal</b> worlds, <b>as it is stated: “Then Solomon sat on the throne of YHWH”</b> (I Chronicles 29:23), indicating that his kingdom was like YHWH’s kingdom, reigning over all worlds. <b>But ultimately, </b> after he married foreign wives, <b>he ruled over</b> only <b>the lower</b> worlds, <b>as it is stated: “For he had dominion over all the region on this side of the river, from Tiphsah even to Gaza”</b> (I Kings 5:4)."
        },
        {
          "verseLocation": "1 Kings 5:5",
          "verseText": "“And Judah and Israel dwelt safely, every man under his vine and under his fig tree”",
          "talmudLocation": "Sanhedrin 106a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106a#section-15",
          "talmudFullText": "<b>R' Yoḥanan says: Everywhere that it is stated: And he dwelt, it is nothing other than an expression of pain, </b> of an impending calamity, <b>as it is stated: “And Israel dwelt in Shittim, and the people began to commit harlotry with the daughters of Moab”</b> (Numbers 25:1). It is stated: <b>“And Jacob dwelt in the land where his father had sojourned in the land of Canaan”</b> (Genesis 37:1), and it is stated thereafter: <b>“And Joseph brought evil report of them to his father”</b> (Genesis 37:2), which led to the sale of Joseph. <b>And it is stated: “And Israel dwelt</b> in the land of Egypt <b>in the land of Goshen”</b> (Genesis 47:27), and it is stated thereafter: <b>“And the time drew near that Israel was to die”</b> (Genesis 47:29). It is stated: <b>“And Judah and Israel dwelt safely, every man under his vine and under his fig tree”</b> (I Kings 5:5), and it is stated thereafter: <b>“And YHWH raised up an adversary to Solomon, Hadad the Edomite; he was of the king’s seed in Edom”</b> (I Kings 11:14)."
        },
        {
          "verseLocation": "1 Kings 5:6",
          "verseText": "“And Solomon had forty thousand stalls of horses for his chariots”",
          "talmudLocation": "Sanhedrin 21b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21b#section-13",
          "talmudFullText": "§ <b>Rav Yehuda raises a contradiction: It is written</b> in one verse: <b>“And Solomon had forty thousand stalls of horses for his chariots”</b> (I Kings 5:6), <b>and it is written</b> in another verse: <b>“And Solomon had four thousand stalls for horses</b> and chariots” (II Chronicles 9:25). <b>How</b> can <b>these</b> texts be reconciled? <b>If there were forty thousand large stables [<i>itztablaot</i>], each and every one</b> of them <b>had in it four thousand stalls, </b> or rows, <b>for horses. And</b> alternatively, <b>if there were four thousand large stables, each and every one had in it forty thousand stalls for horses. </b> Therefore the two verses are reconciled."
        },
        {
          "verseLocation": "1 Kings 5:8",
          "verseText": "as it is written: “Barley and hay for the horses and swift steeds”",
          "talmudLocation": "Pesachim 3b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/3b#section-14",
          "talmudFullText": "The Talmud continues to cite examples of clean language: <b>Yoḥanan from Ḥakuk went to the villages. When he came, they said to him: </b> Did the <b>wheat</b> crop <b>develop nicely? </b> Reluctant to say that the wheat crop did not develop nicely, <b>he said to them: </b> The <b>barley</b> crop <b>developed nicely, </b> leaving them to draw their own conclusion. <b>They said to him, </b> mockingly: <b>Go out and inform the horses and donkeys</b> about the barley, <b>as it is written: “Barley and hay for the horses and swift steeds”</b> (I Kings 5:8). The Talmud asks: <b>What could he have said</b> to better express the bad news euphemistically? The Talmud answers: He could have said: <b>Last year’s wheat</b> crop <b>developed nicely. Alternatively, </b> he could have said that this year’s crop of <b>lentils, </b> which is also food for people, <b>has developed nicely. </b>"
        },
        {
          "verseLocation": "1 Kings 5:11",
          "verseText": "Heman",
          "talmudLocation": "Bava Batra 15a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15a#section-10",
          "talmudFullText": "The Talmud asks: The <i>baraita</i> <b>counts Moses</b> among the ten elders whose works are included in the book of Psalms, <b>and it</b> also <b>counts Heman. But doesn’t Rav say: </b> The <b>Heman</b> mentioned in the Bible (I Kings 5:11) <b>is</b> the same person as <b>Moses? </b> This is proven by the fact that <b>it is written here: “Heman”</b> (Psalms 88:1), which is Aramaic for trusted, <b>and it is written there</b> about Moses: <b>“For he is the trusted one in all My house”</b> (Numbers 12:7). The Talmud answers: <b>There were two Hemans, </b> one of whom was Moses, and the other a Temple singer from among the descendants of Samuel."
        },
        {
          "verseLocation": "1 Kings 5:12",
          "verseText": "said? Wasn’t it already stated: “And he spoke three thousand proverbs,",
          "talmudLocation": "Megillah 7a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/7a#section-10",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i>: <b>R' Shimon ben Menasya says: </b> The book of <b>Ecclesiastes does not render the hands ritually impure because it is the wisdom of Solomon, </b> and not divinely inspired. <b>They said to him: </b> It was certainly divinely inspired and that is the reason that the book of Ecclesiastes was added to the canon; <b>as was it this alone that</b> Solomon <b>said? Wasn’t it already stated: “And he spoke three thousand proverbs, </b> and his poems were a thousand and five” (I Kings 5:12)? Solomon spoke many proverbs, but only a portion of them were canonized in the Bible. Apparently, what is unique about those in Ecclesiastes is that they were divinely inspired. <b>And it says: “Add you not unto his words”</b> (Proverbs 30:6)."
        },
        {
          "verseLocation": "1 Kings 5:28",
          "verseText": "“A month they were in Lebanon, and two months at home”",
          "talmudLocation": "Ketubot 62a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/62a#section-1",
          "talmudFullText": "The Talmud explains its query: Although a man can legally make any agreement with his wife to limit her conjugal rights, <b>how much</b> is an acceptable <b>manner for this matter? Rav said: </b> The husband may spend <b>a month here, </b> in the study hall, <b>and</b> then must spend <b>a month at home. </b> The allusion to this is <b>as it is stated</b> with regard to reserve units serving in King David’s army: <b>“In any matter of the courses, which came in and went out month by month throughout all the months of the year”</b> (I Chronicles 27:1). <b>And R' Yoḥanan said: </b> He may spend <b>one month here, </b> in the study hall, <b>and</b> then <b>two</b> months <b>in his home, as it is stated</b> with regard to workers who worked in the construction of the Temple: <b>“A month they were in Lebanon, and two months at home”</b> (I Kings 5:28)."
        },
        {
          "verseLocation": "1 Kings 5:29",
          "verseText": "joined the Jewish people, as it is stated: “And Solomon had seventy thousand that bore burdens and eighty thousand that were hewers in the mountains”",
          "talmudLocation": "Yevamot 79a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/79a#section-10",
          "talmudFullText": "<b>Immediately, one hundred and fifty thousand</b> converts <b>joined the Jewish people, as it is stated: “And Solomon had seventy thousand that bore burdens and eighty thousand that were hewers in the mountains”</b> (I Kings 5:29), all of whom were converts. The Talmud asks: <b>But perhaps</b> these carriers and hewers <b>were Jews? </b> The Talmud answers: <b>This cannot enter your mind, as it is written: “But of the children of Israel Solomon made no slaves”</b> (I Kings 9:22)."
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "1 Kings 6:1",
          "verseText": "But isn’t it written: “And it came to pass [ vayhi ] in the four hundred and eightieth year”",
          "talmudLocation": "Megillah 10b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-10",
          "talmudFullText": "The Talmud cites additional verses where <i>vayhi</i> is not indicative of impending grief: <b>But isn’t it written: “And it came to pass [<i>vayhi</i>] in the four hundred and eightieth year”</b> (I Kings 6:1), which discusses the joyous occasion of the building of the Temple? <b>And</b> furthermore, <b>isn’t it written: “And it came to pass [<i>vayhi</i>] when Jacob saw Rachel”</b> (Genesis 29:10), which was a momentous occasion? <b>And isn’t it written: “And it was [<i>vayhi</i>] evening, and it was [<i>vayhi</i>] morning, one day”</b> (Genesis 1:5)? <b>And isn’t there the second</b> day of Creation, <b>and isn’t there the 3rd</b> day, where the term <i>vayhi</i> is used? <b>And aren’t there many</b> verses in the Bible in which the term <i>vayhi</i> appears and no grief ensues? Apparently, the proposed principle is incorrect."
        },
        {
          "verseLocation": "1 Kings 6:1",
          "verseText": "that in Nisan the Patriarchs were born? As it is stated: “And it came to pass in the four hundred and eightieth year after the children of Israel were come out of the land of Egypt, in the fourth year, in the month of Ziv”",
          "talmudLocation": "Rosh Hashanah 11a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/11a#section-9",
          "talmudFullText": "<b>R' Yehoshua says: From where</b> is it derived <b>that in Nisan the Patriarchs were born? As it is stated: “And it came to pass in the four hundred and eightieth year after the children of Israel were come out of the land of Egypt, in the 4th year, in the month of Ziv”</b> (I Kings 6:1). This means <b>in the month in which the radiant ones [<i>zivtanei</i>] of the world, </b> the Patriarchs, <b>were born. </b>"
        },
        {
          "verseLocation": "1 Kings 6:1",
          "verseText": "only from Nisan? As it is stated: “And it came to pass in the four hundred and eightieth year after the children of Israel were come out of the land of Egypt, in the fourth year of Solomon’s reign over Israel, in the month Ziv, which is the second month,",
          "talmudLocation": "Rosh Hashanah 2b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/2b#section-7",
          "talmudFullText": "§ <b>R' Yoḥanan said: From where</b> is it derived <b>that one counts</b> the years of kings’ reigns <b>only from Nisan? As it is stated: “And it came to pass in the four hundred and eightieth year after the children of Israel were come out of the land of Egypt, in the 4th year of Solomon’s reign over Israel, in the month Ziv, which is the second month, </b> that he began to build the house of YHWH” (I Kings 6:1). This verse <b>juxtaposes the reign of Solomon to the exodus from Egypt: Just as</b> one counts the years since <b>the exodus from Egypt from Nisan, </b> when the Jewish people left Egypt, <b>so too, </b> one counts the years of <b>Solomon’s reign from Nisan. </b>"
        },
        {
          "verseLocation": "1 Kings 6:1",
          "verseText": "Nisan? As it is stated: “And it came to pass in the four hundred and eightieth year after the children of Israel were come out of the land of Egypt,",
          "talmudLocation": "Rosh Hashanah 3a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/3a#section-11",
          "talmudFullText": "It <b>is taught</b> in a <i>baraita</i> <b>in accordance with</b> the opinion <b>of R' Yoḥanan: From where</b> is it derived <b>that one counts</b> the years of <b>kings’</b> reigns <b>only from</b> the month of <b>Nisan? As it is stated: “And it came to pass in the four hundred and eightieth year after the children of Israel were come out of the land of Egypt, </b> in the 4th year of Solomon’s reign over Israel, in the month Ziv, which is the second month, that he began to build the house of YHWH” (I Kings 6:1). <b>And it is written: “And Aaron the priest went up to Mount Hor at the commandment of YHWH, </b> and died there, in the fortieth year after the children of Israel were come out of the land of Egypt, in the 5th month, on the first day of the month” (Numbers 33:38). <b>And it is</b> later <b>written: “And it came to pass in the fortieth year, in the eleventh month, </b> on the first of the month, that Moses spoke to the children of Israel” (Deuteronomy 1:3)."
        },
        {
          "verseLocation": "1 Kings 6:2",
          "verseText": "It is written: “And the house that King Solomon built for the Lord, was sixty cubits in length, and twenty cubits in width, and its height was thirty cubits”",
          "talmudLocation": "Bava Batra 98b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/98b#section-14",
          "talmudFullText": "§ Apropos the building of the Sanctuary, the Talmud relates the following incident: <b>R' Ḥanina</b> once <b>went out to the villages</b> to teach Torah there, and <b>he raised a contradiction between</b> two <b>verses</b> that detail the dimensions of the Sanctuary: <b>It is written: “And the house that King Solomon built for YHWH, was sixty cubits in length, and twenty cubits in width, and its height was thirty cubits”</b> (I Kings 6:2). <b>But it is</b> also <b>written: “And before the partition was twenty cubits in length, and twenty cubits in width, and its height was twenty cubits”</b> (I Kings 6:20). The first verse states that its height was thirty cubits, whereas the second verse states that its height was only twenty cubits. <b>He said to</b> the villagers that the reason for the difference is that <b>when</b> the latter verse <b>calculated</b> the height, it did so <b>from the</b> upper <b>edge of the cherubs and upward, </b> as the cherubs themselves stood ten cubits high."
        },
        {
          "verseLocation": "1 Kings 6:2",
          "verseText": "And it is written: “And the house that King Solomon built for the Lord, its length was sixty cubits, and its breadth twenty cubits, and its height thirty cubits”",
          "talmudLocation": "Sanhedrin 7a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/7a#section-15",
          "talmudFullText": "<b>And it is written: “And the house that King Solomon built for YHWH, its length was sixty cubits, and its breadth twenty cubits, and its height thirty cubits”</b> (I Kings 6:2). <b>And at the end, </b> when Israel sinned, the whole of the space of the Temple was not expansive enough for the Shekhina to rest within it, as <b>it is written: “Thus says YHWH: The heaven is My throne, and the earth is My footstool; where is the house that you may build for Me? </b> And where is the place that may be My resting place? ” (Isaiah 66:1). In times of discord, the Temple is an insufficient resting place for the Shekhina."
        },
        {
          "verseLocation": "1 Kings 6:2",
          "verseText": "the eternal Temple, as it is written: “And the house which King Solomon built for the Lord, its length was sixty cubits, and its breadth twenty cubits, and its height thirty cubits”",
          "talmudLocation": "Sukkah 5b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/5b#section-8",
          "talmudFullText": "<b>Rather, </b> the dimension of the <i>sukka</i> is not derived from the Ark; one instead <b>derived it from</b> the dimensions of <b>the eternal Temple, as it is written: “And the house which King Solomon built for YHWH, its length was sixty cubits, and its breadth twenty cubits, and its height thirty cubits”</b> (I Kings 6:2). <b>And it is written: “The height of the first cherub was ten cubits, and likewise was the second cherub”</b> (I Kings 6:26). <b>And it is taught</b> in a <i>baraita</i>: <b>Just as we find in the eternal Temple</b> that the <b>cherubs stand</b> reaching <b>one-3rd</b> the height <b>of the Temple, </b> as each cherub was ten cubits high and the Temple was thirty cubits high, <b>in the Tabernacle as well, </b> the <b>cherubs stand</b> reaching <b>one-3rd</b> the height of the Tabernacle."
        },
        {
          "verseLocation": "1 Kings 6:2",
          "verseText": "because it is written: “And the House that King Solomon built for the Lord was sixty cubits in length, and its width was twenty cubits, and its height was thirty cubits”",
          "talmudLocation": "Yoma 52a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/52a#section-4",
          "talmudFullText": "<b>Ravina strongly objects to this</b> opinion: <b>What is the reason</b> for this uncertainty? <b>If we say</b> it is <b>because it is written: “And the House that King Solomon built for YHWH was sixty cubits in length, and its width was twenty cubits, and its height was thirty cubits”</b> (I Kings 6:2), <b>and it is written: “And the House, that is, the Sanctuary, was forty cubits long”</b> (I Kings 6:17), <b>and it is written: “And before the partition twenty cubits in length, and twenty cubits in width, and twenty cubits in height”</b> (I Kings 6:20), <b>and</b> therefore <b>we do not know whether the one-cubit partition</b> was part <b>of these twenty</b> cubits of the Holy of Holies or part <b>of these forty</b> cubits of the Sanctuary, then this problem can be resolved."
        },
        {
          "verseLocation": "1 Kings 6:4",
          "verseText": "“And he made for the House, windows narrow and broad”",
          "talmudLocation": "Menachot 86b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/86b#section-7",
          "talmudFullText": "With regard the Temple built by King Solomon, the verse states: <b>“And he made for the House, windows narrow and broad”</b> (I Kings 6:4). The rabbis <b>taught</b> in a <i>baraita</i>: Typically, windows are constructed to widen toward the inside in order that the light from the outside would be dispersed throughout the room. For the Temple, God said: Make the windows <b>narrow within and broad without, </b> as <b>I do not require its illumination. </b> On the contrary, the light of the Temple is to be radiated outward."
        },
        {
          "verseLocation": "1 Kings 6:6",
          "verseText": "a gallery, as it is written: “The bottommost gallery [ hayyatzia ] was five cubits wide”",
          "talmudLocation": "Bava Batra 61a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/61a#section-3",
          "talmudFullText": "<b>Rav Yosef taught: </b> A small structure attached to a building <b>has three names</b> in the Bible: <b>Gallery [<i>yatzia</i>], side chamber [<i>tzela</i>], </b> and <b>cell [<i>ta</i>]. </b> Such a structure is called <b>a gallery, as it is written: “The bottommost gallery [<i>hayyatzia</i>] was five cubits wide”</b> (I Kings 6:6). It is also called <b>a side chamber, as it is written: “And the side chambers [<i>vehatzelaot</i>] were one over another, thirty-three times”</b> (Ezekiel 41:6). Additionally, it is called <b>a cell, as it is written: “And the cell [<i>vehata</i>] was one reed long, and one reed wide; and the space between the cells was five cubits”</b> (Ezekiel 40:7). <b>And if you wish, say</b> instead that it can be seen that a small structure attached to a building is called a cell <b>from here, </b> as was taught in the Mishnah (<i>Middot</i> 4:7): <b>The wall of the Sanctuary</b> was <b>six</b> cubits wide, <b>and the cell [<i>vehata</i>]</b> in back of it was <b>six</b> cubits wide, and <b>the wall of the cell</b> was <b>five</b> cubits wide."
        },
        {
          "verseLocation": "1 Kings 6:7",
          "verseText": "that brought the shamir to the Temple.",
          "talmudLocation": "Chullin 63a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/63a#section-3",
          "talmudFullText": "<b>Rav Yehuda says: </b> As for the <b><i>shalakh</i>, </b> listed as a non-kosher bird (see Leviticus 11:17), <b>this is</b> the bird <b>that scoops [<i>sholeh</i>] fish out of the sea. </b> The <b><i>dukhifat</i></b> (see Leviticus 11:19) is the bird <b>whose comb</b> seems <b>bent [<i>hodo kafut</i>]</b> due to its thickness. The Talmud notes: <b>This is also taught</b> in a <i>baraita</i>: The <b><i>dukhifat</i></b> is the bird <b>whose comb</b> seems <b>bent, and this is</b> the bird <b>that brought the <i>shamir</i> to the Temple. </b> As recounted in tractate <i>Gittin</i> (68b), King Solomon required a unique worm called the <i>shamir</i> to carve stones of the Temple, as the verse states: “There was neither hammer nor ax nor any tool of iron heard in the house, while it was in building” (I Kings 6:7)."
        },
        {
          "verseLocation": "1 Kings 6:7",
          "verseText": "“For the house, when it was being built, was built of stone made ready at the quarry;",
          "talmudLocation": "Gittin 68a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/68a#section-7",
          "talmudFullText": "<b>The Master said: Here they interpreted</b> it: <b>Male demons and female demons. </b> The Talmud asks: <b>Why was it necessary for</b> Solomon, the author of Ecclesiastes, to have <b>male demons and female demons? </b> The Talmud answers: <b>As it is written</b> with regard to the building of the Temple: <b>“For the house, when it was being built, was built of stone made ready at the quarry; </b> and there was neither hammer nor axe nor any tool of iron heard in the house, while it was being built” (I Kings 6:7). Solomon <b>said to the rabbis: How shall I make</b> it so that the stone will be precisely cut without using iron? <b>They said to him: There is a</b> creature called <b>a <i>shamir</i></b> that can cut the stones, <b>which Moses brought</b> and used to cut <b>the stones of the ephod. </b>"
        },
        {
          "verseLocation": "1 Kings 6:7",
          "verseText": "with which Solomon built the Temple, as it is stated: “For the house, when it was built, was built of whole stone from the quarry”",
          "talmudLocation": "Sotah 48b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/48b#section-10",
          "talmudFullText": "§ The Mishnah taught: <b>From</b> the time <b>when the</b> First <b>Temple was destroyed the <i>shamir</i> ceased</b> to exist. <b>A baraita states: </b> This <b><i>shamir</i></b> is the creature <b>with which Solomon built the Temple, as it is stated: “For the house, when it was built, was built of whole stone from the quarry”</b> (I Kings 6:7). Now <b>these words</b> should be understood exactly <b>as they are written, </b> that King Solomon took whole stones and shaped them by having the <i>shamir</i> do the cutting. This is <b>the statement of R' Yehuda. </b>"
        },
        {
          "verseLocation": "1 Kings 6:7",
          "verseText": "were not heard in the house when it was being built”",
          "talmudLocation": "Sotah 48b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/48b#section-11",
          "talmudFullText": "<b>R' Neḥemya said to him: And is it possible to say so? But isn’t it already stated: “All these were costly stones, </b> according to the measures of hewn stones, <b>sawed with saws”</b> (II Kings 7:9), which indicates that saws, which are iron implements, were used to shape the stones? <b>If so, what</b> is the meaning when <b>the verse states: </b> “And hammer, ax, and any tool of iron <b>were not heard in the house when it was being built”</b> (I Kings 6:7)? It means <b>that he would prepare</b> the stones <b>outside</b> the Temple Mount using tools, <b>and bring</b> them <b>inside</b> already cut, so that no iron tools were used inside the Temple itself. <b>R'</b> Yehuda HaNasi <b>said: The statement of R' Yehuda</b> that no iron tools were used <b>appears</b> to be correct <b>with regard to the Temple stones, and the statement of R' Neḥemya</b> that tools were used appears to be correct <b>with regard to the stones of the</b> king’s own <b>house. </b>"
        },
        {
          "verseLocation": "1 Kings 6:7",
          "verseText": "of whole stone",
          "talmudLocation": "Tamid 26b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/tamid/26b#section-7",
          "talmudFullText": "§ The Mishnah teaches that the Chamber of the Hearth was <b>surrounded</b> by <b>rows of stone</b> that protruded from the walls and that served as benches. The Talmud asks: <b>What are</b> these <b>rows</b> of stone? They are rows of <b>chiseled stones by which</b> the priests <b>ascend to</b> another row of <b>stone, </b> where they could lie down. The Talmud asks: <b>And would they split</b> the <b>stones</b> in the process of building the Temple? <b>But isn’t it written: “For the Temple, when it was being built, </b> was built <b>of whole stone</b> made ready at the quarry; and there was neither hammer nor ax nor any tool of iron heard in the Temple, while it was being built” (I Kings 6:7)?"
        },
        {
          "verseLocation": "1 Kings 6:17",
          "verseText": "and it is written: “And the House, that is, the Sanctuary, was forty cubits long”",
          "talmudLocation": "Yoma 52a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/52a#section-4",
          "talmudFullText": "<b>Ravina strongly objects to this</b> opinion: <b>What is the reason</b> for this uncertainty? <b>If we say</b> it is <b>because it is written: “And the House that King Solomon built for YHWH was sixty cubits in length, and its width was twenty cubits, and its height was thirty cubits”</b> (I Kings 6:2), <b>and it is written: “And the House, that is, the Sanctuary, was forty cubits long”</b> (I Kings 6:17), <b>and it is written: “And before the partition twenty cubits in length, and twenty cubits in width, and twenty cubits in height”</b> (I Kings 6:20), <b>and</b> therefore <b>we do not know whether the one-cubit partition</b> was part <b>of these twenty</b> cubits of the Holy of Holies or part <b>of these forty</b> cubits of the Sanctuary, then this problem can be resolved."
        },
        {
          "verseLocation": "1 Kings 6:19",
          "verseText": "“And he prepared a partition in the midst of the House within to set there the Ark of the Covenant of the Lord”",
          "talmudLocation": "Yoma 52a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/52a#section-8",
          "talmudFullText": "§ <b>And this is what R' Yoḥanan said: Yosef of Hutzal raised a dilemma</b> with regard to the verse: <b>“And he prepared a partition in the midst of the House within to set there the Ark of the Covenant of YHWH”</b> (I Kings 6:19). This was his <b>dilemma</b> that <b>was raised before</b> the rabbis: With regard to <b>what</b> case <b>is</b> the verse <b>speaking? </b>"
        },
        {
          "verseLocation": "1 Kings 6:20",
          "verseText": "written: “And before the partition was twenty cubits in length, and twenty cubits in width, and its height was twenty cubits”",
          "talmudLocation": "Bava Batra 98b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/98b#section-14",
          "talmudFullText": "§ Apropos the building of the Sanctuary, the Talmud relates the following incident: <b>R' Ḥanina</b> once <b>went out to the villages</b> to teach Torah there, and <b>he raised a contradiction between</b> two <b>verses</b> that detail the dimensions of the Sanctuary: <b>It is written: “And the house that King Solomon built for YHWH, was sixty cubits in length, and twenty cubits in width, and its height was thirty cubits”</b> (I Kings 6:2). <b>But it is</b> also <b>written: “And before the partition was twenty cubits in length, and twenty cubits in width, and its height was twenty cubits”</b> (I Kings 6:20). The first verse states that its height was thirty cubits, whereas the second verse states that its height was only twenty cubits. <b>He said to</b> the villagers that the reason for the difference is that <b>when</b> the latter verse <b>calculated</b> the height, it did so <b>from the</b> upper <b>edge of the cherubs and upward, </b> as the cherubs themselves stood ten cubits high."
        },
        {
          "verseLocation": "1 Kings 6:20",
          "verseText": "“And before the Sanctuary, which was twenty cubits in length,",
          "talmudLocation": "Megillah 10b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-17",
          "talmudFullText": "The Talmud comments: <b>This is also taught</b> in a <i>baraita</i>: <b>The Ark crafted by Moses had ten cubits</b> of empty space <b>on each side. And it is written</b> in the description of Solomon’s Temple: <b>“And before the Sanctuary, which was twenty cubits in length, </b> and twenty cubits in breadth” (I Kings 6:20). The place “before the Sanctuary” is referring to the Holy of Holies. It was twenty by twenty cubits. If there were ten cubits of empty space on either side of the Ark, apparently the Ark itself occupied no space. <b>And it is written: And the wing of one of the cherubs was ten cubits and the wing of the other cherub was ten cubits; </b> the wings of the cherubs occupied the entire area. If so, <b>where was the Ark itself standing? Rather, </b> must one <b>not conclude from it</b> that the Ark <b>stood by means of a miracle</b> and occupied no space?"
        },
        {
          "verseLocation": "1 Kings 6:20",
          "verseText": "and it is written: “And before the partition twenty cubits in length, and twenty cubits in width, and twenty cubits in height”",
          "talmudLocation": "Yoma 52a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/52a#section-4",
          "talmudFullText": "<b>Ravina strongly objects to this</b> opinion: <b>What is the reason</b> for this uncertainty? <b>If we say</b> it is <b>because it is written: “And the House that King Solomon built for YHWH was sixty cubits in length, and its width was twenty cubits, and its height was thirty cubits”</b> (I Kings 6:2), <b>and it is written: “And the House, that is, the Sanctuary, was forty cubits long”</b> (I Kings 6:17), <b>and it is written: “And before the partition twenty cubits in length, and twenty cubits in width, and twenty cubits in height”</b> (I Kings 6:20), <b>and</b> therefore <b>we do not know whether the one-cubit partition</b> was part <b>of these twenty</b> cubits of the Holy of Holies or part <b>of these forty</b> cubits of the Sanctuary, then this problem can be resolved."
        },
        {
          "verseLocation": "1 Kings 6:24",
          "verseText": "as it is stated: “And five cubits was one wing of the cherub, and five cubits was the second wing of the cherub; ten cubits from the tip of its wings until the tip of its wings”",
          "talmudLocation": "Bava Batra 99a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/99a#section-3",
          "talmudFullText": "<b>Rabbenai says</b> that <b>Shmuel says: </b> The <b>cherubs stood miraculously</b> and did not occupy any physical space, <b>as it is stated: “And five cubits was one wing of the cherub, and five cubits was the second wing of the cherub; ten cubits from the tip of its wings until the tip of its wings”</b> (I Kings 6:24). Accordingly, the wings of two cherubs, standing side by side, would occupy the entire twenty cubits width of the Sanctuary. But if so, <b>where, </b> in what space, <b>were their bodies standing? </b> Since their wings alone, which protruded from the sides of cherubs’ bodies, occupied twenty cubits, there was no room left in which their bodies could stand. <b>Rather, </b> one must <b>conclude from</b> the verse that the cherubs <b>stood miraculously</b> and did not occupy any physical space."
        },
        {
          "verseLocation": "1 Kings 6:26",
          "verseText": "And it is written: “The height of the first cherub was ten cubits, and likewise was the second cherub”",
          "talmudLocation": "Sukkah 5b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/5b#section-8",
          "talmudFullText": "<b>Rather, </b> the dimension of the <i>sukka</i> is not derived from the Ark; one instead <b>derived it from</b> the dimensions of <b>the eternal Temple, as it is written: “And the house which King Solomon built for YHWH, its length was sixty cubits, and its breadth twenty cubits, and its height thirty cubits”</b> (I Kings 6:2). <b>And it is written: “The height of the first cherub was ten cubits, and likewise was the second cherub”</b> (I Kings 6:26). <b>And it is taught</b> in a <i>baraita</i>: <b>Just as we find in the eternal Temple</b> that the <b>cherubs stand</b> reaching <b>one-3rd</b> the height <b>of the Temple, </b> as each cherub was ten cubits high and the Temple was thirty cubits high, <b>in the Tabernacle as well, </b> the <b>cherubs stand</b> reaching <b>one-3rd</b> the height of the Tabernacle."
        },
        {
          "verseLocation": "1 Kings 6:29",
          "verseText": "As it is written: “And he carved all the walls of the house round about with carved figures of cherubs and palm trees and open flowers,",
          "talmudLocation": "Yoma 54a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54a#section-17",
          "talmudFullText": "<b>Rav Aḥa bar Ya’akov said: Actually, </b> Rav Ketina’s statement is referring <b>to</b> the <b>Second Temple: </b> There was a curtain at the entrance of the Holy of Holies, <b>and</b> indeed <b>there were images of cherubs there, </b> i.e., drawn or engraved pictures of the cherubs on the walls. <b>As it is written: “And he carved all the walls of the house round about with carved figures of cherubs and palm trees and open flowers, </b> within and without” (I Kings 6:29), and it is further stated: <b>“And he overlaid them with gold fitted upon the graven work”</b> (I Kings 6:35), which teaches that in addition to the cherubs within the sacred place, other cherubs were drawn on the walls."
        },
        {
          "verseLocation": "1 Kings 6:35",
          "verseText": "“And he overlaid them with gold fitted upon the graven work”",
          "talmudLocation": "Yoma 54a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54a#section-17",
          "talmudFullText": "<b>Rav Aḥa bar Ya’akov said: Actually, </b> Rav Ketina’s statement is referring <b>to</b> the <b>Second Temple: </b> There was a curtain at the entrance of the Holy of Holies, <b>and</b> indeed <b>there were images of cherubs there, </b> i.e., drawn or engraved pictures of the cherubs on the walls. <b>As it is written: “And he carved all the walls of the house round about with carved figures of cherubs and palm trees and open flowers, </b> within and without” (I Kings 6:29), and it is further stated: <b>“And he overlaid them with gold fitted upon the graven work”</b> (I Kings 6:35), which teaches that in addition to the cherubs within the sacred place, other cherubs were drawn on the walls."
        },
        {
          "verseLocation": "1 Kings 6:36",
          "verseText": "three rows of hewn stone and a row of cedar beams”",
          "talmudLocation": "Rosh Hashanah 4a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/4a#section-5",
          "talmudFullText": "The Talmud raises a question: <b>Is that to say</b> that <b>Solomon did not do this</b> very same thing when he built the first Temple? <b>Isn’t it written: </b> “And he built the inner court, <b>three rows of hewn stone and a row of cedar beams”</b> (I Kings 6:36)? The Talmud answers: <b>Solomon placed</b> the wood <b>above</b> the stone foundation, so that even if the Temple were burned, the stone foundation would remain, <b>whereas</b> Cyrus <b>placed</b> it <b>below, </b> so that if he were to set fire to the Temple, the whole structure would collapse. Also, <b>Solomon sunk</b> the wood <b>into the building</b> in order to make it less flammable, whereas Cyrus <b>did not sink it into the building. </b> Furthermore, <b>Solomon plastered</b> the wood over <b>with plaster</b> to prevent it from catching fire, <b>whereas</b> Cyrus <b>did not plaster</b> the wood over <b>with plaster. </b>"
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "1 Kings 7:9",
          "verseText": "stones that are planed, as it is written: “All these were of costly stones, according to the measures of chiseled stones [ gazit ],",
          "talmudLocation": "Bava Batra 3a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/3a#section-15",
          "talmudFullText": "§ The Mishnah teaches: In <b>a place where it is customary to build</b> such a wall with non-chiseled stone [<i>gevil</i>], or chiseled stone [<i>gazit</i>], or small bricks [<i>kefisin</i>], or large bricks [<i>leveinim</i>], they must build the wall with that material. The Talmud identifies the various building materials: <b><i>Gevil</i></b> refers to <b>stones that are not planed. <i>Gazit</i></b> means <b>stones that are planed, as it is written: “All these were of costly stones, according to the measures of chiseled stones [<i>gazit</i>], </b> sawed with saws, within and without” (I Kings 7:9). This teaches that chiseled stones are those that have been planed and smoothened. <b><i>Kefisin</i></b> refers to <b>small bricks. <i>Leveinim</i></b> means <b>large bricks. </b>"
        },
        {
          "verseLocation": "1 Kings 7:10",
          "verseText": "stones of ten cubits, and stones of eight cubits”",
          "talmudLocation": "Tamid 26b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/tamid/26b#section-8",
          "talmudFullText": "<b>Abaye said: </b> It was prohibited to use iron implements to cut the stones only inside the Temple area. In this case it was permitted to have chiseled stones, <b>as</b> the builders <b>prepared</b> the stones in another location. <b>And</b> the builders <b>initially brought small stones and large stones</b> with which to build the Temple, <b>as it is written: </b> “And the foundation was of costly stones, even great stones, <b>stones of ten cubits, and stones of eight cubits”</b> (I Kings 7:10). Accordingly, the larger stones were used for the lower tier, while the smaller stones were for the higher tier, forming protruding benches upon which the priests could sleep."
        },
        {
          "verseLocation": "1 Kings 7:23",
          "verseText": "“And he made a molten sea, ten cubits from the one brim to the other: It was round all about, and its height was five cubits; and a line of thirty cubits did circle it round about”",
          "talmudLocation": "Eruvin 14a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/14a#section-19",
          "talmudFullText": "The Talmud asks: <b>From where are these matters, </b> this ratio between circumference and diameter, derived? <b>R' Yoḥanan said</b> that <b>the verse said</b> with regard to King Solomon: <b>“And he made a molten sea, ten cubits from the one brim to the other: It was round all about, and its height was five cubits; and a line of thirty cubits did circle it round about”</b> (I Kings 7:23)."
        },
        {
          "verseLocation": "1 Kings 7:23",
          "verseText": "Solomon built,",
          "talmudLocation": "Pesachim 109b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/109b#section-3",
          "talmudFullText": "The Talmud responds: <b>What is the difficulty? Perhaps</b> the priest <b>would immerse it in the sea that</b> King <b>Solomon built, </b> which was a very wide ritual bath, as it states: “And he made the molten sea of ten cubits from brim to brim, round in compass” (I Kings 7:23). <b>As R' Ḥiyya taught: The sea that Solomon built contained</b> the volume of water of <b>one hundred and fifty ritual purification baths. </b> It was certainly possible to immerse even large vessels in this sea."
        },
        {
          "verseLocation": "1 Kings 7:26",
          "verseText": "“And it was a handbreadth thick; and its brim was wrought as the brim of a cup, as the petals of a lily; it contained two thousand bat ”",
          "talmudLocation": "Eruvin 14a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/14a#section-21",
          "talmudFullText": "<b>Rav Pappa said: With regard to its brim, it is written</b> that <b>the brim</b> is as <b>the petals of a lily, </b> as stated in the verse: <b>“And it was a handbreadth thick; and its brim was wrought as the brim of a cup, as the petals of a lily; it contained two thousand <i>bat</i>”</b> (I Kings 7:26). The brim was very thin."
        },
        {
          "verseLocation": "1 Kings 7:36",
          "verseText": "And it is written: “According to the space of each with loyot ”",
          "talmudLocation": "Yoma 54a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54a#section-18",
          "talmudFullText": "<b>And it is written: “According to the space of each with <i>loyot</i>”</b> (I Kings 7:36). The Talmud asks: <b>What is</b> the meaning of: <b>“According to the space of each with <i>loyot</i>”? Rabba bar Rav Sheila said: </b>"
        },
        {
          "verseLocation": "1 Kings 7:45",
          "verseText": "burnished brass”",
          "talmudLocation": "Arakhin 10b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/10b#section-13",
          "talmudFullText": "The <i>baraita</i> concludes: <b>These two</b> copper <b>vessels, </b> the cymbal and the mortar, <b>were remnants from the First Temple and they were damaged and they</b> could <b>not be repaired</b> in an effective manner. <b>And</b> it was <b>with regard to</b> the copper vessels constructed for the First Temple that <b>David said: </b> “All these vessels, which Hiram made for King Solomon, in the House of YHWH, were of <b>burnished brass”</b> (I Kings 7:45), and, in a parallel verse, <b>“bright brass”</b> (II Chronicles 4:16). <b>And with regard to</b> these two items <b>it states</b> in the verse describing the vessels that Ezra brought to Jerusalem: <b>“And vessels of fine golden brass, two, precious as gold”</b> (Ezra 8:27)."
        },
        {
          "verseLocation": "1 Kings 7:48",
          "verseText": "and the Table upon which the shewbread was, of gold”",
          "talmudLocation": "Menachot 99a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/99a#section-5",
          "talmudFullText": "§ <b>A baraita states</b> in a <i>baraita</i>: <b>Solomon built ten tables</b> that were situated in the Sanctuary, in addition to Moses’ Table, <b>but</b> the priests <b>would arrange</b> the shewbread <b>only upon</b> the Table <b>of Moses. </b> This is derived from a verse, <b>as it is stated: </b> “And Solomon made all the vessels that were in the House of YHWH, the golden altar, <b>and the Table upon which the shewbread was, of gold”</b> (I Kings 7:48), indicating that the shewbread was placed on only one Table."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "1 Kings 8:2",
          "verseText": "that in Tishrei the Patriarchs were born? As it is stated: “And all the men of Israel assembled themselves before King Solomon at the feast in the month of the mighty [ eitanim ],",
          "talmudLocation": "Rosh Hashanah 11a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/11a#section-7",
          "talmudFullText": "The <i>baraita</i> continues: <b>R' Eliezer says: From where</b> is it derived <b>that in Tishrei the Patriarchs were born? As it is stated: “And all the men of Israel assembled themselves before King Solomon at the feast in the month of the mighty [<i>eitanim</i>], </b> which is the 7th month” (I Kings 8:2), i.e., Tishrei. What is the meaning of the phrase: The month of the mighty? It is <b>the month in which the mighty ones of the world, </b> i.e., the Patriarchs, <b>were born. </b>"
        },
        {
          "verseLocation": "1 Kings 8:6",
          "verseText": "place",
          "talmudLocation": "Sotah 33b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/33b#section-12",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> (<i>Tosefta</i> 8:2) that <b>R' Yosei says: In three</b> different <b>places the priests carried the Ark. </b> They carried it <b>when</b> the Jewish people <b>crossed the Jordan, and when they surrounded Jericho</b> (Joshua 6:6), <b>and when they returned it to its</b> proper <b>place</b> in the Holy of Holies during the reign of King Solomon (I Kings 8:6)."
        },
        {
          "verseLocation": "1 Kings 8:8",
          "verseText": "“And the staves were so long",
          "talmudLocation": "Menachot 98a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/98a#section-22",
          "talmudFullText": "The Talmud asks: <b>And</b> with regard to <b>its staves, from where do we</b> derive that they were placed along the length of the Temple, from east to west? This is derived <b>as it is taught</b> in a <i>baraita</i>: The verse states: <b>“And the staves were so long</b> that the ends of the staves were seen from the holy place before the Sanctuary, but they could not be seen outside” (I Kings 8:8). One <b>might</b> have thought that the staves <b>did not touch the Curtain</b> separating the Sanctuary and the Holy of Holies, and did not protrude at all. Therefore, <b>the verse states: </b> “The ends of the staves <b>were seen. ” If</b> the verse had stated only: “The ends of the staves <b>were seen, ”</b> one <b>might</b> have thought that the staves <b>tear through the Curtain and emerge</b> into the Sanctuary. Therefore, <b>the verse states: “They could not be seen outside. ” How</b> can <b>these</b> texts be reconciled?"
        },
        {
          "verseLocation": "1 Kings 8:8",
          "verseText": "Rabbi Yehuda ben Lakish says: The Ark was buried in its place, as it is stated: “And the ends of the staves were seen from the sacred place before the partition, but they could not be seen without; and they are there to this day”",
          "talmudLocation": "Yoma 53b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/53b#section-16",
          "talmudFullText": "<b>R' Yehuda ben Lakish says: The Ark was buried in its place, as it is stated: “And the ends of the staves were seen from the sacred place before the partition, but they could not be seen without; and they are there to this day”</b> (I Kings 8:8). The expression “to this day” means forever, as the text might be read at any time. This teaches that the Ark is hidden in its place."
        },
        {
          "verseLocation": "1 Kings 8:8",
          "verseText": "as it is stated: “And the staves were so long",
          "talmudLocation": "Yoma 54a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54a#section-1",
          "talmudFullText": "<b>all her splendor”</b> (Lamentations 1:6). <b>What is</b> the meaning of: <b>“All her splendor [<i>hadara</i>]”? </b> It means: <b>Her chamber [<i>ḥadra</i>], </b> i.e., something that was hidden within the innermost chambers, namely the Ark. <b>You, </b> R' Shimon ben Yoḥai, <b>what do you say</b> in response to this? <b>He said to him: As I say, the Ark was buried in its place</b> and not exiled, <b>as it is stated: “And the staves were so long</b> that the ends of the staves were seen from the sacred place before the partition, but they could not be seen without; and they are there to this day” (I Kings 8:8)."
        },
        {
          "verseLocation": "1 Kings 8:8",
          "verseText": "“But they could not be seen without”",
          "talmudLocation": "Yoma 54a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54a#section-9",
          "talmudFullText": "§ <b>R' Yehuda raised a contradiction. It is written: “The ends of the staves were seen, ” and it is written</b> in that same verse: <b>“But they could not be seen without”</b> (I Kings 8:8). <b>How</b> can one reconcile this contradiction? <b>They were seen and</b> yet <b>not seen, </b> i.e., the staves were partially visible. <b>This was also taught</b> in a <i>baraita</i>: <b>“The ends of the staves were seen”; </b> one <b>might</b> have thought that <b>they did not move from their position</b> and did not protrude at all. Therefore, <b>the verse states: “And the staves were so long. ”</b> One <b>might</b> have thought that <b>they ripped through the curtain and emerged</b> on the other side; therefore, <b>the verse states: “They could not be seen without. ”</b>"
        },
        {
          "verseLocation": "1 Kings 8:9",
          "verseText": "As it is stated: “There was nothing in the Ark except the two tablets of stone which Moses put there”",
          "talmudLocation": "Bava Batra 14a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/14a#section-10",
          "talmudFullText": "What biblical source indicates that a Torah scroll was placed there? <b>As it is stated: “There was nothing in the Ark except the two tablets of stone which Moses put there”</b> (I Kings 8:9). <b>What</b> does <b>“there was nothing in the Ark except”</b> mean? This is an example of <b>a restriction following a restriction, </b> as both terms, “nothing” and “except,” indicate that the Ark was empty. <b>And</b> there is a hermeneutical principle that <b>a restriction following a restriction serv</b>es <b>only to amplify</b> and include other matters. In this case, it serves <b>to include a Torah scroll that lies in the Ark. </b>"
        },
        {
          "verseLocation": "1 Kings 8:9",
          "verseText": "tablets were placed in the Ark,",
          "talmudLocation": "Bava Batra 14b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/14b#section-4",
          "talmudFullText": "The Talmud asks: <b>And</b> according to <b>R' Meir, where were the</b> silver <b>columns placed? </b> The Talmud answers: <b>Outside</b> the Ark. The Talmud further asks: <b>And from where does R' Meir</b> derive that <b>the broken pieces of the</b> first set of <b>tablets were placed in the Ark, </b> as the verse from which R' Yehuda learns this: “There was nothing in the Ark except” (I Kings 8:9), is needed by R' Meir to teach that the Torah scroll was placed there? The Talmud answers: <b>He derives</b> this point <b>from what Rav Huna</b> expounded, <b>as Rav Huna says: What</b> is the meaning of that <b>which is written: </b> “The Ark of God, <b>whereupon is called the Name, the name of YHWH of hosts that sits upon the cherubs”</b> (II Samuel 6:2)? The phrase “the name, the name of YHWH” <b>teaches that</b> both <b>the</b> second <b>tablets and the broken pieces of the</b> first set of <b>tablets were placed in the Ark. </b>"
        },
        {
          "verseLocation": "1 Kings 8:13",
          "verseText": "Michael, the great minister, stands and sacrifices an offering upon it, as it is stated: “I have surely built a house of Zevul for You, a place for You to dwell forever”",
          "talmudLocation": "Chagigah 12b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12b#section-6",
          "talmudFullText": "<b><i>Zevul</i>, </b> abode, <b>is</b> the location <b>of</b> the heavenly <b>Jerusalem and</b> the heavenly <b>Temple, and</b> there the heavenly <b>altar is built, and</b> the angel <b>Michael, the great minister, stands and sacrifices an offering upon it, as it is stated: “I have surely built a house of <i>Zevul</i> for You, a place for You to dwell forever”</b> (I Kings 8:13). <b>And from where do we</b> derive <b>that</b> <i>Zevul</i> <b>is called heaven? As it is written: “Look down from heaven and see, from Your holy and glorious abode [<i>Zevul</i>]”</b> (Isaiah 63:15)."
        },
        {
          "verseLocation": "1 Kings 8:13",
          "verseText": "only to the Temple, as it is stated: “I have built You a house for dwelling [ zevul ] in”",
          "talmudLocation": "Rosh Hashanah 17a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-5",
          "talmudFullText": "<b>Gehenna will terminate, but they</b> still <b>will not terminate, as it is stated: “And their form shall wear away the netherworld, so that there be no dwelling for Him”</b> (Psalms 49:15); that is to say, Gehenna itself will be worn away before their punishment has come to an end. <b>And why</b> are they punished <b>so severely? Because they stretched out their hands against</b> God’s <b>dwelling, </b> the Temple, and everything else that is sanctified, <b>as it is stated: “So that there be no dwelling [<i>zevul</i>] for Him. ” Dwelling [<i>zevul</i>] is referring</b> here <b>only to the Temple, as it is stated: “I have built You a house for dwelling [<i>zevul</i>] in”</b> (I Kings 8:13). <b>And about them Hannah said: “The adversaries of YHWH shall be broken in pieces”</b> (I Samuel 2:10)."
        },
        {
          "verseLocation": "1 Kings 8:28",
          "verseText": "it is stated: “To hear the song and the prayer",
          "talmudLocation": "Berakhot 31a:25",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31a#section-25",
          "talmudFullText": "<i>Halakhot</i> regarding the order of the prayers were also learned from the prayers of biblical characters. I <b>might have</b> thought <b>that one should request his own needs first, and afterwards recite prayers</b> of thanksgiving and praise; <b>it has already been articulated by Solomon</b> that this is not so, as in Solomon’s prayer at the dedication of the Holy Temple <b>it is stated: “To hear the song and the prayer</b> that Your servant prays before You today” (I Kings 8:28). In this verse, <b>song is prayer</b> in the sense of thanks and praise, and <b>prayer is</b> one’s <b>request</b> of his personal needs. Therefore, one who is praying <b>does not speak matters of request after</b> he began to recite <b><i>emet veyatziv</i></b> prior to the <i>Amida</i> prayer, which is the essence of prayer. Rather, he begins with praise in the first three blessings of the <i>Amida</i> prayer, and only thereafter does he include requests for his needs. <b>But after the</b> <i>Amida</i> <b>prayer</b> there is no limit. If he desires to recite <b>even the equivalent of the order of the confession of Yom Kippur, </b> he may <b>recite</b> it."
        },
        {
          "verseLocation": "1 Kings 8:28",
          "verseText": "to listen to the song and the prayer",
          "talmudLocation": "Berakhot 6a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/6a#section-7",
          "talmudFullText": "<b>It was taught</b> in a <i>baraita</i> that <b>Abba Binyamin said: One’s prayer is only</b> fully <b>heard in a synagogue, as it is stated</b> with regard to King Solomon’s prayer in the Temple: “Yet have You turned toward the prayer of Your servant and to his supplication, Lord my God, <b>to listen to the song and the prayer</b> which Your servant prays before You on this day” (I Kings 8:28). The following verse concludes: “To hear the prayer Your servant directs toward this place” (I Kings 8:29). We see that one’s prayer is heard specifically in the Temple, of which the synagogue is a microcosm (Rav Yoshiyahu Pinto). It may be inferred that <b>in a place of song, </b> a synagogue where God’s praises are sung, <b>there prayer should be. </b>"
        },
        {
          "verseLocation": "1 Kings 8:35",
          "verseText": "One who was standing in the Temple should focus his heart toward the Holy of Holies, as it is stated: “And they shall pray toward this place”",
          "talmudLocation": "Berakhot 30a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/30a#section-9",
          "talmudFullText": "<b>One who was standing</b> in prayer <b>in the Diaspora should focus his heart toward Eretz Yisrael, as it is stated: “And they shall pray to You by way of their land</b> which You have given to their fathers” (I Kings 8:48). <b><b>One who was standing in Eretz Yisrael should focus his heart toward Jerusalem, as it is stated: “And they shall pray to YHWH by way of the city that You have chosen”</b> (I Kings 8:44). <b><b>One who was standing in Jerusalem should focus his heart toward the Temple, as it is stated: “And they shall pray toward this house”</b> (II Chronicles 6:32). <b><b>One who was standing in the Temple should focus his heart toward the Holy of Holies, as it is stated: “And they shall pray toward this place”</b> (I Kings 8:35). <b><b>One who was standing in the Holy of Holies should focus his heart toward the seat of the ark-cover [<i>kapporet</i>], </b> atop the ark, the dwelling place of God’s glory. <br><b>One who was standing behind the seat of the ark-cover should visualize himself as if standing before the ark-cover</b> and turn toward it. <b><b>Consequently, </b> one <b>standing</b> in prayer <b>in the East turns to face west, </b> and one standing <b>in the West turns to face east. </b> One standing <b>in the South turns to face north, </b> and one standing <b>in the North turns to face south; Consequently, all of</b> the people of <b>Israel focus</b> themselves <b>focusing their hearts toward one place, </b> the Holy of Holies in the Temple."
        },
        {
          "verseLocation": "1 Kings 8:37",
          "verseText": "“If there be famine in the land, if there be pestilence”",
          "talmudLocation": "Taanit 15a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/15a#section-8",
          "talmudFullText": "<b>R' Yehuda says: </b> The prayer leader <b>did not need to recite</b> the <b>Remembrances and <i>Shofarot</i></b> passages. <b>Rather, he recites instead of them</b> the passage beginning with: <b>“If there be famine in the land, if there be pestilence”</b> (I Kings 8:37), followed by the verse <b>“The word of YHWH that came to Jeremiah concerning the droughts”</b> (Jeremiah 14:1)."
        },
        {
          "verseLocation": "1 Kings 8:39",
          "verseText": "heaven, the Makhon of Your dwelling”",
          "talmudLocation": "Chagigah 12b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12b#section-11",
          "talmudFullText": "The Talmud asks a question: With regard to <b>these</b> things listed above, are they <b>located in heaven? </b> It is obvious that <b>they</b> are <b>located on the earth. As it is written: “Praise YHWH from the earth, sea monsters and all depths, fire and hail, snow and mist, stormy wind, fulfilling His word”</b> (Psalms 148:7–8). The verse seems to indicate that all these things are found on the earth. <b>Rav Yehuda said</b> that <b>Rav said: David requested mercy with regard to them, </b> that they should not remain in heaven, <b>and He brought them down to earth. He said before Him: God!, “You are not a God that has pleasure in wickedness, evil shall not sojourn with You”</b> (Psalms 5:5). In other words, <b>You are righteous, O Lord. </b> Nothing <b>evil should sojourn in Your vicinity. </b> Rather, it is better that they remain close to us. <b>And from where do we</b> derive <b>that</b> this place <b>is called “heaven”? As it is written: “And You shall hear</b> in <b>heaven, the <i>Makhon</i> of Your dwelling”</b> (I Kings 8:39)."
        },
        {
          "verseLocation": "1 Kings 8:44",
          "verseText": "may focus his heart towards his Father in Heaven, as it is stated: “And they shall pray to the Lord”",
          "talmudLocation": "Berakhot 30a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/30a#section-8",
          "talmudFullText": "<b>A baraita states</b> in a <i>Tosefta</i>: <b>A blind person and one who is unable to approximate the directions</b> and, therefore, is unable to face Jerusalem in order to pray, <b>may focus his heart towards his Father in Heaven, as it is stated: “And they shall pray to YHWH”</b> (I Kings 8:44)."
        },
        {
          "verseLocation": "1 Kings 8:44",
          "verseText": "One who was standing in Eretz Yisrael should focus his heart toward Jerusalem, as it is stated: “And they shall pray to the Lord by way of the city that You have chosen”",
          "talmudLocation": "Berakhot 30a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/30a#section-9",
          "talmudFullText": "<b>One who was standing</b> in prayer <b>in the Diaspora should focus his heart toward Eretz Yisrael, as it is stated: “And they shall pray to You by way of their land</b> which You have given to their fathers” (I Kings 8:48). <b><b>One who was standing in Eretz Yisrael should focus his heart toward Jerusalem, as it is stated: “And they shall pray to YHWH by way of the city that You have chosen”</b> (I Kings 8:44). <b><b>One who was standing in Jerusalem should focus his heart toward the Temple, as it is stated: “And they shall pray toward this house”</b> (II Chronicles 6:32). <b><b>One who was standing in the Temple should focus his heart toward the Holy of Holies, as it is stated: “And they shall pray toward this place”</b> (I Kings 8:35). <b><b>One who was standing in the Holy of Holies should focus his heart toward the seat of the ark-cover [<i>kapporet</i>], </b> atop the ark, the dwelling place of God’s glory. <br><b>One who was standing behind the seat of the ark-cover should visualize himself as if standing before the ark-cover</b> and turn toward it. <b><b>Consequently, </b> one <b>standing</b> in prayer <b>in the East turns to face west, </b> and one standing <b>in the West turns to face east. </b> One standing <b>in the South turns to face north, </b> and one standing <b>in the North turns to face south; Consequently, all of</b> the people of <b>Israel focus</b> themselves <b>focusing their hearts toward one place, </b> the Holy of Holies in the Temple."
        },
        {
          "verseLocation": "1 Kings 8:47",
          "verseText": "And likewise, with regard to Solomon it says: “We have sinned, and we have done wrong, we have done evil”",
          "talmudLocation": "Yoma 36b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/36b#section-7",
          "talmudFullText": "<b>Rather, this is</b> the manner in which <b>he confesses: I have sinned, I have done wrong, and I have rebelled before You, I and my household. And likewise, with regard to David it says</b> in this sequence: <b>“We have sinned along with our forefathers, we have done wrong, we have performed evil”</b> (Psalms 106:6). <b>And likewise, with regard to Solomon it says: “We have sinned, and we have done wrong, we have done evil”</b> (I Kings 8:47). <b>And likewise, with regard to Daniel it says: “We have sinned, and we have done wrong, and we have done evil, and we have rebelled”</b> (Daniel 9:5). <b>However, </b> according to this interpretation, <b>what is</b> the rationale for the sequence of that <b>which Moses said: Forgiving wrongdoing and rebellion and sin, </b> where sin appears last? <b>Moses said before God: God!, when the Jewish people sin before you and repent, render their intentional sins like unwitting ones, </b> forgive wrongdoing and rebellion as if they were sin."
        },
        {
          "verseLocation": "1 Kings 8:48",
          "verseText": "in the Diaspora should focus his heart toward Eretz Yisrael, as it is stated: “And they shall pray to You by way of their land",
          "talmudLocation": "Berakhot 30a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/30a#section-9",
          "talmudFullText": "<b>One who was standing</b> in prayer <b>in the Diaspora should focus his heart toward Eretz Yisrael, as it is stated: “And they shall pray to You by way of their land</b> which You have given to their fathers” (I Kings 8:48). <b><b>One who was standing in Eretz Yisrael should focus his heart toward Jerusalem, as it is stated: “And they shall pray to YHWH by way of the city that You have chosen”</b> (I Kings 8:44). <b><b>One who was standing in Jerusalem should focus his heart toward the Temple, as it is stated: “And they shall pray toward this house”</b> (II Chronicles 6:32). <b><b>One who was standing in the Temple should focus his heart toward the Holy of Holies, as it is stated: “And they shall pray toward this place”</b> (I Kings 8:35). <b><b>One who was standing in the Holy of Holies should focus his heart toward the seat of the ark-cover [<i>kapporet</i>], </b> atop the ark, the dwelling place of God’s glory. <br><b>One who was standing behind the seat of the ark-cover should visualize himself as if standing before the ark-cover</b> and turn toward it. <b><b>Consequently, </b> one <b>standing</b> in prayer <b>in the East turns to face west, </b> and one standing <b>in the West turns to face east. </b> One standing <b>in the South turns to face north, </b> and one standing <b>in the North turns to face south; Consequently, all of</b> the people of <b>Israel focus</b> themselves <b>focusing their hearts toward one place, </b> the Holy of Holies in the Temple."
        },
        {
          "verseLocation": "1 Kings 8:54",
          "verseText": "he rose from before the altar of the Lord, from kneeling upon his knees",
          "talmudLocation": "Berakhot 34b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/34b#section-2",
          "talmudFullText": "<b>R' Yitzḥak bar Naḥmani said: It was explained to me</b> directly <b>from R' Yehoshua ben Levi</b> himself differently: <b>An ordinary</b> person, conducts himself <b>as we said; a High Priest</b> bows at <b>the beginning of each and every blessing; the king, once he has bowed</b> at the beginning of the first blessing, <b>does not rise</b> until he concludes the entire prayer, <b>as it is stated: “And it was that when Solomon finished praying</b> all of his prayer to YHWH, <b>he rose from before the altar of YHWH, from kneeling upon his knees</b> with his hands spread forth toward the heavens” (I Kings 8:54)."
        },
        {
          "verseLocation": "1 Kings 8:54",
          "verseText": "from kneeling [ mikkeroa ] upon his knees”",
          "talmudLocation": "Megillah 22b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/22b#section-16",
          "talmudFullText": "Apropos Rav’s practice of prostrating himself, the Talmud continues with a discussion of different forms of bowing. <b>A baraita states</b> in a <i>baraita</i>: The term <b><i>kidda</i></b> indicates falling <b>upon</b> one’s <b>face, </b> with one’s face toward the ground, <b>as it is stated: “Then Bathsheba bowed [<i>vatikod</i>] with her face to the ground”</b> (I Kings 1:31). <b><i>Keria</i></b> means bowing <b>upon one’s knees, as it is stated</b> with regard to Solomon: He finished praying and “he rose from before the altar of YHWH, <b>from kneeling [<i>mikkeroa</i>] upon his knees”</b> (I Kings 8:54). Finally, <b><i>hishtaḥava’a</i>, that is</b> bowing with one’s <b>arms and legs spread</b> in total submission, <b>as it is stated</b> that Jacob asked, in response to Joseph’s dream: <b>“Shall I and your mother and your brothers indeed come to bow down [<i>lehishtaḥavot</i>] to you to the ground? ”</b> (Genesis 37:10)."
        },
        {
          "verseLocation": "1 Kings 8:54",
          "verseText": "from kneeling [ mikero’a ] upon his knees”",
          "talmudLocation": "Shevuot 16b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/16b#section-9",
          "talmudFullText": "The Talmud discusses the different forms of bowing in greater detail. <b>A baraita states: </b> The term <b><i>kidda</i></b> indicates falling <b>upon</b> one’s <b>face, and so</b> the verse <b>states: “Then Bathsheba bowed [<i>vatikkod</i>] with her face to the ground”</b> (I Kings 1:31). <b><i>Keria</i></b> means descending <b>upon</b> one’s <b>knees, and so</b> the verse <b>states</b> with regard to Solomon: “He rose from before the altar of YHWH, <b>from kneeling [<i>mikero’a</i>] upon his knees”</b> (I Kings 8:54). <b><i>Hishtaḥava’a</i>, this</b> is prostrating oneself while <b>spreading </b>one’s <b>arms and legs</b> in total submission, <b>and so</b> the verse <b>states</b> that Jacob asked, in response to Joseph’s relating of his dream: <b>“Shall I and your mother and your brothers indeed come to bow down [<i>lehishtaḥavot</i>] to you to the ground”</b> (Genesis 37:10), i.e., spread out completely on the ground."
        },
        {
          "verseLocation": "1 Kings 8:59",
          "verseText": "king enters for judgment first, as it is stated: “That He make the judgment of His servant and the judgment of His people Israel,",
          "talmudLocation": "Avodah Zarah 2b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/2b#section-3",
          "talmudFullText": "The Talmud asks: <b>And from where do we</b> derive <b>that whoever is</b> more <b>important enters first? </b> This is <b>in accordance with</b> a statement <b>of Rav Ḥisda, as Rav Ḥisda says: </b> When <b>a king and a community</b> are brought before God for judgment, the <b>king enters for judgment first, as it is stated: “That He make the judgment of His servant and the judgment of His people Israel, </b> as every day shall require” (I Kings 8:59). <b>And what is the reason</b> that it is important for the king to enter first? <b>If you wish, say</b> that it is <b>not proper conduct for the king to stand outside</b> and wait for the trial of his subjects to end. <b>And if you wish, say</b> instead that the king is brought in first so that he may be judged <b>before</b> God’s <b>anger intensifies</b> due to the sins of the community."
        },
        {
          "verseLocation": "1 Kings 8:59",
          "verseText": "“To make the judgment of His servant and the judgment of His people Israel at all times, as each day may require”",
          "talmudLocation": "Rosh Hashanah 16a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/16a#section-11",
          "talmudFullText": "<b>Rather, Rav Ḥisda said: R' Yosei’s reason is from here, </b> another verse, which states: <b>“To make the judgment of His servant and the judgment of His people Israel at all times, as each day may require”</b> (I Kings 8:59), which indicates that the entire world is judged every day."
        },
        {
          "verseLocation": "1 Kings 8:59",
          "verseText": "the judgment of His servant and the judgment of His people",
          "talmudLocation": "Rosh Hashanah 8b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/8b#section-4",
          "talmudFullText": "The Talmud notes: This is <b>in accordance with</b> the opinion <b>of Rav Ḥisda, as Rav Ḥisda said: </b> When <b>a king and a community</b> are brought before God for judgment, the <b>king is brought in for judgment first, as it is stated: </b> “And let these my words, with which I have made supplication before YHWH, be near to YHWH our God day and night, that He make <b>the judgment of His servant and the judgment of His people</b> Israel at all times” (I Kings 8:59). This verse is from King Solomon’s prayer at the dedication of the Temple, and he is referring to himself a servant of God."
        },
        {
          "verseLocation": "1 Kings 8:63",
          "verseText": "it states: “And Solomon offered for the sacrifice of peace offerings, which he offered to the Lord, two and twenty thousand cattle",
          "talmudLocation": "Zevachim 59b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/59b#section-1",
          "talmudFullText": "<b>But isn’t it already stated</b> with regard to the altar that Moses built: <b>“A thousand burnt offerings did Solomon offer upon that altar”</b> (I Kings 3:4), <b>while with regard to the Eternal House, </b> i.e., the Temple, <b>it states: “And Solomon offered for the sacrifice of peace offerings, which he offered to YHWH, two and twenty thousand cattle</b> and one hundred and twenty thousand sheep” (I Kings 8:63)?"
        },
        {
          "verseLocation": "1 Kings 8:64",
          "verseText": "because the copper altar that was before the Lord was too small to receive",
          "talmudLocation": "Zevachim 59a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/59a#section-18",
          "talmudFullText": "Having briefly mentioned R' Yehuda’s opinion, the Talmud asks: <b>What</b> is the context of the statement of <b>R' Yehuda? </b> The Talmud answers: <b>As it is taught</b> in a <i>baraita</i>: The verse states with regard to the inauguration of the Temple in the time of King Solomon: <b>“On that day the king sanctified the middle of the court</b> that was before the House of YHWH; as there he offered the burnt offering, and the meal offering, and the fat of the peace offerings; <b>because the copper altar that was before YHWH was too small to receive</b> the burnt offering, and the meal offering, and the fat of the peace offerings” (I Kings 8:64). <b>The matters</b> in the verse <b>are</b> to be understood <b>as they</b> are <b>written, </b> i.e., that the altar in the Temple was too small to receive all of the offerings that Solomon sacrificed, and Solomon therefore sanctified the Temple courtyard so that it, too, could function as an altar; this is <b>the statement of R' Yehuda. </b>"
        },
        {
          "verseLocation": "1 Kings 8:64",
          "verseText": "sanctified",
          "talmudLocation": "Zevachim 60a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/60a#section-5",
          "talmudFullText": "The Talmud returns to the original dispute between R' Yehuda and R' Yosei with regard to whether or not Solomon consecrated the floor of the Temple courtyard. <b>Granted, according to R' Yehuda, </b> who maintains that the floor of the Temple courtyard was consecrated so that it could serve as an altar, <b>this is</b> the meaning of that <b>which is written: </b> “The king <b>sanctified</b> the middle of the court” (I Kings 8:64). <b>But according to R' Yosei, what</b> is the meaning of the phrase “the king <b>sanctified”? </b> The Talmud answers: It means that Solomon sanctified the courtyard in order <b>to stand the altar in it. </b>"
        },
        {
          "verseLocation": "1 Kings 8:65",
          "verseText": "follow the majority of the residents of Eretz Yisrael, as it is stated: “And Solomon held the feast at that time, and all Israel with him, a great congregation, from the entrance of Hamath until the Brook of Egypt, before the Lord our God, seven days and seven days, fourteen days”",
          "talmudLocation": "Horayot 3a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/3a#section-12",
          "talmudFullText": "§ <b>Rav Asi says: And with regard to</b> the definition of the majority that establishes liability for performance of a transgression on the basis of the <b>ruling</b> of a court, <b>follow the majority of the residents of Eretz Yisrael, as it is stated: “And Solomon held the feast at that time, and all Israel with him, a great congregation, from the entrance of Hamath until the Brook of Egypt, before YHWH our God, seven days and seven days, fourteen days”</b> (I Kings 8:65). The Talmud clarifies the words of this verse: <b>Since it is written: “And all Israel with him, ” why do I</b> need to add: <b>“A great congregation, from the entrance of Hamath until the Brook of Egypt”? Conclude from it: </b> It is <b>these</b> residents of Eretz Yisrael <b>who are characterized</b> as <b>a congregation; but those</b> who reside outside Eretz Yisrael <b>are not characterized</b> as <b>a congregation. </b>"
        },
        {
          "verseLocation": "1 Kings 8:65",
          "verseText": "“So Solomon held the feast at that time, and all Israel with him, a great congregation, from the entrance of Hamath to the Brook of Egypt, before the Lord our God, seven days and seven days, fourteen days”",
          "talmudLocation": "Moed Katan 9a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/9a#section-4",
          "talmudFullText": "§ The Talmud asks: With regard to the principle that <b>one may not mix</b> one <b>joy with</b> another <b>joy, from where do we</b> derive it? The Talmud explains that the source is <b>as it is written</b> with regard to the dedication of the Temple: <b>“So Solomon held the feast at that time, and all Israel with him, a great congregation, from the entrance of Hamath to the Brook of Egypt, before YHWH our God, seven days and seven days, fourteen days”</b> (I Kings 8:65). <b>And if it is so</b> that <b>one may</b> in fact <b>mix</b> one <b>joy with</b> another <b>joy, he should have waited until the festival</b> of <i>Sukkot</i>, which was the second set of seven days, <b>and made</b> a feast of <b>seven</b> days <b>for this and for that, </b> i.e., for the dedication of the Temple and for the festival of <i>Sukkot</i> together. The fact that he did not do so indicates that one must not mix one joy with another."
        },
        {
          "verseLocation": "1 Kings 8:66",
          "verseText": "“On the eighth day he sent the people away, and they blessed the king, and went to their tents joyful and glad of heart for all the goodness that the Lord had done for David His servant and for Israel His people”",
          "talmudLocation": "Moed Katan 9a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/9a#section-15",
          "talmudFullText": "It was stated above that <b>a bat kol issued forth and said to them: All of you are designated for life in the World-to-Come. </b> The Talmud asks: <b>And from where do we</b> derive <b>that</b> God <b>pardoned them</b> for this sin? The Talmud answers: The Sage <b>Taḥlifa taught</b> in a <i>baraita</i> that the verse states: <b>“On the 8th day he sent the people away, and they blessed the king, and went to their tents joyful and glad of heart for all the goodness that YHWH had done for David His servant and for Israel His people”</b> (I Kings 8:66)."
        },
        {
          "verseLocation": "1 Kings 8:66",
          "verseText": "“On the eighth day he sent the people away, and they blessed the king”",
          "talmudLocation": "Moed Katan 9a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/9a#section-21",
          "talmudFullText": "<b>They said to him: You have taught us, our teacher, </b> that <b>a disciple who takes leave of his teacher and</b> then <b>stays overnight in the same city must take leave of him an additional time, as it is stated</b> at the conclusion of the dedication of the Temple: <b>“On the 8th day he sent the people away, and they blessed the king”</b> (I Kings 8:66), <b>and</b> elsewhere <b>it is written: “And on the twenty-3rd day of the 7th month he sent the people away”</b> (II Chronicles 7:10). The 8th day in the verse is referring to the 8th Day of Assembly, the 22nd of the month of Tishrei, yet it says that he sent the people away on the next day, the twenty-3rd of the month."
        },
        {
          "verseLocation": "1 Kings 8:66",
          "verseText": "And that is what is written: “On the eighth day he sent the people away, and they blessed the king, and went unto their tents joyful and glad of heart for all the goodness that the Lord had shown unto David His servant and to Israel His people”",
          "talmudLocation": "Shabbat 30a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/30a#section-8",
          "talmudFullText": "<b>And that is what is written: “On the 8th day he sent the people away, and they blessed the king, and went unto their tents joyful and glad of heart for all the goodness that YHWH had shown unto David His servant and to Israel His people”</b> (I Kings 8:66). The Talmud explains: <b>And went unto their tents, </b> in accordance with the common expression: One’s house is his wife. It is explained <b>that</b> when they returned home <b>they found their wives ritually pure</b> from the ritual impurity of menstruation. <b>Joyful</b> means <b>that they enjoyed the aura of the Shekhina</b> at the dedication of the Temple. <b>And glad of heart</b> means <b>that the wife of each and every one of them was impregnated and gave birth to a male. </b> The verse continues: <b>For all the goodness that YHWH had shown unto David His servant and to Israel His people. Unto David His servant</b> means that at that opportunity they all saw <b>that</b> God <b>forgave him for that sin. And to Israel His people</b> means <b>that He forgave them</b> for the <b>sin</b> of <b>Yom Kippur, </b> as they did not fast that year (see I Kings 8:65)."
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "1 Kings 9:3",
          "verseText": "eye, as it is stated: “And My eyes and My heart shall be there perpetually”",
          "talmudLocation": "Berakhot 62b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-20",
          "talmudFullText": "We learned in the Mishnah that <b>spitting</b> on the Temple Mount is prohibited <b>through an <i>a fortiori</i> inference. Rav Beivai said</b> that <b>R' Yehoshua ben Levi said: Anyone who spits on the Temple Mount, </b> even <b>today, it is as if he spit in the pupil of</b> God’s <b>eye, as it is stated: “And My eyes and My heart shall be there perpetually”</b> (I Kings 9:3)."
        },
        {
          "verseLocation": "1 Kings 9:3",
          "verseText": "“And My eyes and My heart shall be there perpetually”",
          "talmudLocation": "Yevamot 105b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/105b#section-4",
          "talmudFullText": "The Talmud asks: <b>Who are these Rabbis</b> who disagree with R' Meir? The Talmud answers: <b>It is R' Yosei, </b> as it seems from this incident: <b>As, R' Ḥiyya and R' Shimon bar R'</b> Yehuda HaNasi <b>were sitting</b> outside the house of study, immersed in Torah learning. <b>One of them began and said: One who prays must direct his gaze downward</b> while praying, <b>as it is stated</b> by God with regard to the Holy Temple: <b>“And My eyes and My heart shall be there perpetually”</b> (I Kings 9:3), meaning: The Shekhina rests in the Eretz Yisrael, and one must direct his gaze to the sacred land when praying."
        },
        {
          "verseLocation": "1 Kings 9:12",
          "verseText": "and they pleased him not”",
          "talmudLocation": "Shabbat 54a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/54a#section-3",
          "talmudFullText": "<b>What is</b> the meaning of <b>the land of Kavul? Rav Huna said: That the people</b> living <b>there were bound [<i>mekhubalin</i>]</b> and surrounded by <b>silver and gold. Rava said to him: If so, is that what is written: </b> “And Hiram came out of Tyre to see the cities which Solomon had given him, <b>and they pleased him not”</b> (I Kings 9:12)? Because the people there <b>were bound in silver and gold</b>, the cities <b>were not pleasing in his eyes? </b> Rav Huna <b>said to him: Yes</b>, indeed, it was precisely the abundant wealth that displeased Hiram. <b>Since</b> the people <b>were wealthy and delicate, they did not perform labor. </b> Hiram was seeking people whom he could enlist in the service of the king."
        },
        {
          "verseLocation": "1 Kings 9:13",
          "verseText": "“What cities are these which you have given me, my brother? And he called them the land of Kavul to this day”",
          "talmudLocation": "Shabbat 54a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/54a#section-2",
          "talmudFullText": "We learned in the Mishnah: <b>Ewes may go out <i>kevulot</i>. </b> The Talmud asks: <b>What is</b> the meaning of <b><i>kevulot</i>? </b> It means <b>that they bind their tails down</b> with animal hide <b>so that the males will not mount them. </b> The Talmud explains: <b>From where</b> may it <b>be inferred that this</b> word <b><i>kavul</i> is a term</b> meaning <b>does not produce fruit? As it is written, </b> when Solomon gave a portion of land to Hiram, he complained: <b>“What cities are these which you have given me, my brother? And he called them the land of Kavul to this day”</b> (I Kings 9:13)."
        },
        {
          "verseLocation": "1 Kings 9:22",
          "verseText": "This cannot enter your mind, as it is written: “But of the children of Israel Solomon made no slaves”",
          "talmudLocation": "Yevamot 79a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/79a#section-10",
          "talmudFullText": "<b>Immediately, one hundred and fifty thousand</b> converts <b>joined the Jewish people, as it is stated: “And Solomon had seventy thousand that bore burdens and eighty thousand that were hewers in the mountains”</b> (I Kings 5:29), all of whom were converts. The Talmud asks: <b>But perhaps</b> these carriers and hewers <b>were Jews? </b> The Talmud answers: <b>This cannot enter your mind, as it is written: “But of the children of Israel Solomon made no slaves”</b> (I Kings 9:22)."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "1 Kings 10:11",
          "verseText": "Gold, and good gold, and gold of Ophir",
          "talmudLocation": "Yoma 44b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/44b#section-17",
          "talmudFullText": "§ The Mishnah states: <b>On every</b> other <b>day, it was</b> of <b>greenish gold</b> but on this day it was of a red gold. <b>Rav Ḥisda said: There are seven</b> types <b>of gold</b> mentioned in the Bible: <b>Gold, and good gold, and gold of Ophir</b> (I Kings 10:11), <b>and glistering gold</b> (I Kings 10:18), <b>and <i>shaḥut</i> gold</b> (I Kings 10:17), <b>and closed gold</b> (I Kings 10:21), <b>and <i>parvayim</i> gold</b> (II Chronicles 3:6). The Talmud explains the reason for these names: There is a distinction between <b>gold and good gold, as it is written</b> in the verse: <b>“And the gold of that land is good”</b> (Genesis 2:12), which indicates the existence of gold of a higher quality. <b>Gold of Ophir</b> is gold <b>that comes from Ophir. Glistering [<i>mufaz</i>] gold</b> is so named"
        },
        {
          "verseLocation": "1 Kings 10:16",
          "verseText": "of drawn [ shaḥut ] gold”",
          "talmudLocation": "Chullin 30b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/30b#section-14",
          "talmudFullText": "Likewise, <b>the school of R' Yishmael taught: </b> The verse states: <b>“And he shall slaughter [<i>veshaḥat</i>]</b> the young bull before YHWH” (Leviticus 1:5). The term <b>“<i>veshaḥat</i>”</b> means <b>nothing other than: And he shall draw</b> the knife across the neck of the animal. <b>And similarly, </b> the verse <b>states: </b> “And King Solomon made two hundred targets <b>of drawn [<i>shaḥut</i>] gold”</b> (I Kings 10:16), meaning gold that is smoothed in the manner of goldsmiths. <b>And</b> the verse <b>states: “Their tongue is a sharpened arrow, it speaks deceit”</b> (Jeremiah 9:7)."
        },
        {
          "verseLocation": "1 Kings 10:17",
          "verseText": "called: Forest, as it is written: “The house of the forest of Lebanon”",
          "talmudLocation": "Yoma 39b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/39b#section-8",
          "talmudFullText": "<b>Rav Zutra bar Toviya said: Why is</b> the Temple <b>called: Forest, as it is written: “The house of the forest of Lebanon”</b> (I Kings 10:17)? <b>To tell you: Just as a forest blooms, so too the Temple blooms. As Rav Hoshaya said: When Solomon built the Temple, he planted in it all kinds of sweet fruit</b> trees made <b>of gold, and</b> miraculously these <b>brought forth fruit in their season. And when the wind blew upon them, their fruit would fall off, as it is stated: “May his fruits rustle like Lebanon”</b> (Psalms 72:16). <b>And through</b> selling these golden fruits to the public, <b>there was a source of income for the priesthood. </b>"
        },
        {
          "verseLocation": "1 Kings 10:17",
          "verseText": "and shaḥut gold",
          "talmudLocation": "Yoma 44b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/44b#section-17",
          "talmudFullText": "§ The Mishnah states: <b>On every</b> other <b>day, it was</b> of <b>greenish gold</b> but on this day it was of a red gold. <b>Rav Ḥisda said: There are seven</b> types <b>of gold</b> mentioned in the Bible: <b>Gold, and good gold, and gold of Ophir</b> (I Kings 10:11), <b>and glistering gold</b> (I Kings 10:18), <b>and <i>shaḥut</i> gold</b> (I Kings 10:17), <b>and closed gold</b> (I Kings 10:21), <b>and <i>parvayim</i> gold</b> (II Chronicles 3:6). The Talmud explains the reason for these names: There is a distinction between <b>gold and good gold, as it is written</b> in the verse: <b>“And the gold of that land is good”</b> (Genesis 2:12), which indicates the existence of gold of a higher quality. <b>Gold of Ophir</b> is gold <b>that comes from Ophir. Glistering [<i>mufaz</i>] gold</b> is so named"
        },
        {
          "verseLocation": "1 Kings 10:18",
          "verseText": "and glistering gold",
          "talmudLocation": "Yoma 44b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/44b#section-17",
          "talmudFullText": "§ The Mishnah states: <b>On every</b> other <b>day, it was</b> of <b>greenish gold</b> but on this day it was of a red gold. <b>Rav Ḥisda said: There are seven</b> types <b>of gold</b> mentioned in the Bible: <b>Gold, and good gold, and gold of Ophir</b> (I Kings 10:11), <b>and glistering gold</b> (I Kings 10:18), <b>and <i>shaḥut</i> gold</b> (I Kings 10:17), <b>and closed gold</b> (I Kings 10:21), <b>and <i>parvayim</i> gold</b> (II Chronicles 3:6). The Talmud explains the reason for these names: There is a distinction between <b>gold and good gold, as it is written</b> in the verse: <b>“And the gold of that land is good”</b> (Genesis 2:12), which indicates the existence of gold of a higher quality. <b>Gold of Ophir</b> is gold <b>that comes from Ophir. Glistering [<i>mufaz</i>] gold</b> is so named"
        },
        {
          "verseLocation": "1 Kings 10:21",
          "verseText": "and closed gold",
          "talmudLocation": "Yoma 44b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/44b#section-17",
          "talmudFullText": "§ The Mishnah states: <b>On every</b> other <b>day, it was</b> of <b>greenish gold</b> but on this day it was of a red gold. <b>Rav Ḥisda said: There are seven</b> types <b>of gold</b> mentioned in the Bible: <b>Gold, and good gold, and gold of Ophir</b> (I Kings 10:11), <b>and glistering gold</b> (I Kings 10:18), <b>and <i>shaḥut</i> gold</b> (I Kings 10:17), <b>and closed gold</b> (I Kings 10:21), <b>and <i>parvayim</i> gold</b> (II Chronicles 3:6). The Talmud explains the reason for these names: There is a distinction between <b>gold and good gold, as it is written</b> in the verse: <b>“And the gold of that land is good”</b> (Genesis 2:12), which indicates the existence of gold of a higher quality. <b>Gold of Ophir</b> is gold <b>that comes from Ophir. Glistering [<i>mufaz</i>] gold</b> is so named"
        },
        {
          "verseLocation": "1 Kings 10:27",
          "verseText": "as it is stated: “And the king made silver to be in Jerusalem like stones, and he made cedars to be as the sycamore trees in the plain”",
          "talmudLocation": "Pesachim 53a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/53a#section-8",
          "talmudFullText": "The Talmud continues: <b>It was taught</b> in a <i>baraita</i> that <b>Rabban Shimon ben Gamliel says: </b> A good <b>sign for mountains is</b> that <b>gallnut</b> oaks, used in the preparation of ink, grow there. A good <b>sign for valleys is palm</b> trees. <b>A</b> good <b>sign for streams is reeds. </b> A good <b>sign for the plain is a sycamore</b> tree. <b>And although there is no proof</b> for these indicators, there is <b>an allusion to the matter</b> in the verse, <b>as it is stated: “And the king made silver to be in Jerusalem like stones, and he made cedars to be as the sycamore trees in the plain”</b> (I Kings 10:27)."
        },
        {
          "verseLocation": "1 Kings 10:27",
          "verseText": "“And the king made silver in Jerusalem as stones”",
          "talmudLocation": "Sanhedrin 21b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21b#section-14",
          "talmudFullText": "<b>R' Yitzḥak raises a contradiction: It is written</b> in one verse: <b>“Silver was not worth anything in the days of Solomon”</b> (II Chronicles 9:20), <b>and it is written</b> in another verse: <b>“And the king made silver in Jerusalem as stones”</b> (I Kings 10:27), i.e., gems. The Talmud responds: It is <b>not difficult: Here, </b> where silver was worthless, this was <b>before Solomon</b> sinfully <b>married Pharaoh’s daughter. There, </b> where the silver was valuable, this was <b>after Solomon married Pharaoh’s daughter. </b>"
        },
        {
          "verseLocation": "1 Kings 10:29",
          "verseText": "and went out of Egypt for six",
          "talmudLocation": "Sanhedrin 21b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21b#section-17",
          "talmudFullText": "<b>And it is</b> also <b>written: </b> “Only <b>he shall not accumulate many horses for himself</b> nor return the people to Egypt for the sake of accumulating horses” (Deuteronomy 17:16), <b>and Solomon said: I will accumulate many, but I will not return. And it is written: “And a chariot</b> came up <b>and went out of Egypt for six</b> hundred shekels of silver” (I Kings 10:29), teaching that not only did Solomon violate the Torah, but he also failed in applying the rationale given for its commandments. This demonstrates the wisdom in the Torah’s usual silence as to the rationale for its mitzvot, as individuals will not mistakenly rely on their own wisdom to reason that the mitzvot are inapplicable in some circumstances."
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "1 Kings 11:2",
          "verseText": "Rav Pappa said: Shall we stand up and raise an objection from Solomon? Solomon did not marry anyone, as it is written in his regard: “Of the nations concerning which the Lord said to the children of Israel, You shall not go among them, neither shall they come among you; for surely they will turn away your heart after their gods; Solomon cleaved to these in love”",
          "talmudLocation": "Yevamot 76b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/76b#section-4",
          "talmudFullText": "<b>Rav Pappa said: Shall we stand up and raise an objection from Solomon? Solomon did not marry anyone, as it is written in his regard: “Of the nations concerning which YHWH said to the children of Israel, You shall not go among them, neither shall they come among you; for surely they will turn away your heart after their gods; Solomon cleaved to these in love”</b> (I Kings 11:2). Solomon cleaved to these women in love, but was not legally married to them. As Solomon had other forbidden wives, the case of Pharaoh’s daughter presents no special difficulty. In fact, none of these marriages were valid at all. <b>But</b> the phrase <b>“and</b> Solomon <b>married”</b> (I Kings 3:1) that appears in connection with Pharaoh’s daughter is <b>difficult, </b> as it indicates that this marriage was in fact valid."
        },
        {
          "verseLocation": "1 Kings 11:4",
          "verseText": "it is written: “For it came to pass, when Solomon was old, that his wives turned away his heart",
          "talmudLocation": "Sanhedrin 21b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21b#section-16",
          "talmudFullText": "<b>And R' Yitzḥak says: For what</b> reason <b>were the rationales of Torah</b> commandments <b>not revealed? </b> It was <b>because the rationales of two verses were revealed, </b> and <b>the greatest in the world, </b> King Solomon, <b>failed in</b> those matters. <b>It is written</b> with regard to a king: <b>“He shall not add many wives for himself, </b> that his heart should not turn away” (Deuteronomy 17:17). <b>Solomon said: I will add many, but I will not turn away, </b> as he thought that it is permitted to have many wives if one is otherwise meticulous not to stray. <b>And</b> later, <b>it is written: “For it came to pass, when Solomon was old, that his wives turned away his heart</b> after other gods” (I Kings 11:4)."
        },
        {
          "verseLocation": "1 Kings 11:4",
          "verseText": "Solomon sinned is nothing other than mistaken, as it is stated: “And his heart was not perfect with the Lord his God, as was the heart of David, his father”",
          "talmudLocation": "Shabbat 56b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56b#section-5",
          "talmudFullText": "<b>R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: Anyone who says that</b> King <b>Solomon sinned is nothing other than mistaken, as it is stated: “And his heart was not perfect with YHWH his God, as was the heart of David, his father”</b> (I Kings 11:4). By inference: Solomon’s heart <b>was not equal to the heart of David, his father; </b> however, <b>he also did not sin. </b>"
        },
        {
          "verseLocation": "1 Kings 11:4",
          "verseText": "“For it came to pass, when Solomon was old, that his wives turned away his heart after other gods”",
          "talmudLocation": "Shabbat 56b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56b#section-6",
          "talmudFullText": "<b>However, how</b> then <b>do I establish</b> the meaning of the verse: <b>“For it came to pass, when Solomon was old, that his wives turned away his heart after other gods”</b> (I Kings 11:4)? <b>That</b> verse is <b>in accordance with</b> the statement of <b>R' Natan; as R' Natan raised a contradiction</b> between the two parts of the verse. On the one hand, <b>it is written: “For it came to pass, when Solomon was old, that his wives turned away his heart</b> after other gods. ” On the other hand, <b>isn’t it written: </b> “And his heart was not perfect with YHWH his God, <b>as was the heart of David his father, ”</b> indicating that Solomon’s heart <b>was not equal to the heart of David his father; </b> however, <b>he also did not sin? </b> Rather, the verse <b>says as follows: For it came to pass, when Solomon was old, that his wives turned away his heart, </b> in an attempt to spur him to go <b>after other gods; however, he did not go</b> after them."
        },
        {
          "verseLocation": "1 Kings 11:6",
          "verseText": "Isn’t it written: “And Solomon did evil in the sight of the Lord”",
          "talmudLocation": "Shabbat 56b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56b#section-11",
          "talmudFullText": "The Talmud raises another question. <b>Isn’t it written: “And Solomon did evil in the sight of YHWH”</b> (I Kings 11:6), clearly indicating that Solomon sinned? <b>Rather, since he should have protested against</b> the conduct of <b>his wives, </b> i.e., their involvement in idolatry, <b>but he did not protest, the verse ascribes to him</b> liability <b>as if he had sinned. </b>"
        },
        {
          "verseLocation": "1 Kings 11:7",
          "verseText": "“Then Solomon will build an altar for Chemosh the abomination of Moab”",
          "talmudLocation": "Sanhedrin 91b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/91b#section-15",
          "talmudFullText": "The Talmud challenges: <b>If that is so, </b> then in the verse: <b>“Then Solomon will build an altar for Chemosh the abomination of Moab”</b> (I Kings 11:7), does this <b>also</b> mean that Solomon <b>will build</b> in the future? Rather, the use of the future tense here should be understood differently. Solomon did not build an altar to the idol; <b>rather, </b> the use of the future tense teaches that <b>the verse ascribes him</b> blame <b>as though he built it, </b> since he did not prevent his wives from doing so. Therefore, no proof for the resurrection of the dead may be cited from this verse."
        },
        {
          "verseLocation": "1 Kings 11:7",
          "verseText": "Isn’t it written: “Then did Solomon build [ yivne ] an altar for Kemosh, the abomination of Moab,",
          "talmudLocation": "Shabbat 56b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56b#section-7",
          "talmudFullText": "The Talmud asks: <b>Isn’t it written: “Then did Solomon build [<i>yivne</i>] an altar for Kemosh, the abomination of Moab, </b> in the hill that is before Jerusalem, and for Molech, the abomination of the children of Ammon” (I Kings 11:7), indicating that Solomon did in fact stray after idols? The Talmud answers: This can be understood to mean <b>that</b> Solomon <b>sought to build</b> an altar for idols <b>but did not build</b> it."
        },
        {
          "verseLocation": "1 Kings 11:14",
          "verseText": "“And the Lord raised up an adversary to Solomon, Hadad the Edomite; he was of the king’s seed in Edom”",
          "talmudLocation": "Sanhedrin 106a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106a#section-15",
          "talmudFullText": "<b>R' Yoḥanan says: Everywhere that it is stated: And he dwelt, it is nothing other than an expression of pain, </b> of an impending calamity, <b>as it is stated: “And Israel dwelt in Shittim, and the people began to commit harlotry with the daughters of Moab”</b> (Numbers 25:1). It is stated: <b>“And Jacob dwelt in the land where his father had sojourned in the land of Canaan”</b> (Genesis 37:1), and it is stated thereafter: <b>“And Joseph brought evil report of them to his father”</b> (Genesis 37:2), which led to the sale of Joseph. <b>And it is stated: “And Israel dwelt</b> in the land of Egypt <b>in the land of Goshen”</b> (Genesis 47:27), and it is stated thereafter: <b>“And the time drew near that Israel was to die”</b> (Genesis 47:29). It is stated: <b>“And Judah and Israel dwelt safely, every man under his vine and under his fig tree”</b> (I Kings 5:5), and it is stated thereafter: <b>“And YHWH raised up an adversary to Solomon, Hadad the Edomite; he was of the king’s seed in Edom”</b> (I Kings 11:14)."
        },
        {
          "verseLocation": "1 Kings 11:16",
          "verseText": "as it is written: “For Joab and all Israel remained there six months until he had cut off every male in Edom”",
          "talmudLocation": "Bava Batra 21a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/21a#section-13",
          "talmudFullText": "The Talmud cites a proof for the opinion of Rav Dimi of Neharde’a: This is <b>as it is written: “For Joab and all Israel remained there six months until he had cut off every male in Edom”</b> (I Kings 11:16). <b>When</b> Joab <b>came before</b> King <b>David</b> after this episode, David <b>said to him: </b>"
        },
        {
          "verseLocation": "1 Kings 11:16",
          "verseText": "remained there six months",
          "talmudLocation": "Pesachim 87b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-18",
          "talmudFullText": "<b>R' Oshaya said: What is</b> the meaning of that <b>which is written: “The righteous acts of His rulers [<i>pirzono</i>] in Israel”</b> (Judges 5:11)? <b>God performed a charitable deed toward Israel</b> in <b>that He scattered them [<i>pizran</i>] among the nations; </b> had He exiled them to one place, they could have all been destroyed at once. <b>And this</b> concept <b>is that which a certain apostate said to R' Ḥanina: We</b> non-Jews <b>are superior to you</b> Jews in that we have patience. <b>It is written of you: “For</b> Joab and all Israel <b>remained there six months</b> until he had cut off every male in Edom” (I Kings 11:16), <b>whereas we, </b> although <b>you have been with us for several years, are not doing anything to you. He said to him: </b> With <b>your consent, let one student deal with your</b> assertion and answer you."
        },
        {
          "verseLocation": "1 Kings 11:21",
          "verseText": "which is written: “And when Hadad heard in Egypt that David slept with his fathers, and that Joab the captain of the host was dead”",
          "talmudLocation": "Bava Batra 116a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/116a#section-12",
          "talmudFullText": "The Talmud presents the first homiletic interpretation: <b>R' Pineḥas ben Ḥama interpreted</b> a verse <b>homiletically: What</b> is the meaning of that <b>which is written: “And when Hadad heard in Egypt that David slept with his fathers, and that Joab the captain of the host was dead”</b> (I Kings 11:21)? <b>For what</b> reason is it that <b>in</b> the case of King <b>David, sleeping was stated with regard to his</b> demise, <b>and in</b> the case of <b>Joab, death was stated with regard to his</b> demise? He answers: Concerning King <b>David, who left a son</b> behind, <b>sleeping was stated with regard to his</b> demise, as it was not a complete death, while concerning <b>Joab, who did not leave a son</b> behind, <b>death was stated with regard to his</b> demise, as he left no son to succeed him."
        },
        {
          "verseLocation": "1 Kings 11:27",
          "verseText": "in public, as it is stated: “And this was the cause that he lifted his hand against the king: Solomon built the Millo, and repaired the breaches of the city of David his father”",
          "talmudLocation": "Sanhedrin 101b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/101b#section-12",
          "talmudFullText": "<b>R' Yoḥanan says: For what</b> virtue <b>was Jeroboam privileged</b> to ascend <b>to monarchy? </b> It is <b>due to</b> the fact <b>that he rebuked Solomon</b> for his sins. <b>And for what</b> misdeed <b>was he punished</b> and lost everything? It is <b>due to</b> the fact <b>that he rebuked</b> Solomon and humiliated him <b>in public, as it is stated: “And this was the cause that he lifted his hand against the king: Solomon built the Millo, and repaired the breaches of the city of David his father”</b> (I Kings 11:27). Jeroboam <b>said to</b> Solomon: <b>David, your father, created breaches in the wall so that the Jewish people could ascend for the pilgrimage Festival, and you sealed them in order to marshal forced labor [<i>angarya</i>] for the daughter of Pharaoh, </b> your wife."
        },
        {
          "verseLocation": "1 Kings 11:29",
          "verseText": "“And it came to pass at that time, and Jeroboam left Jerusalem, and the prophet Ahijah the Shilonite found him on the way, and he was clad in a new garment,",
          "talmudLocation": "Sanhedrin 102a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102a#section-4",
          "talmudFullText": "The verse states: <b>“And it came to pass at that time, and Jeroboam left Jerusalem, and the prophet Ahijah the Shilonite found him on the way, and he was clad in a new garment, </b> and the two were alone in the field” (I Kings 11:29). It was <b>taught in the name of R' Yosei: </b> The phrase “at that time” indicates that <b>it is a time ordained for calamity. </b>"
        },
        {
          "verseLocation": "1 Kings 11:29",
          "verseText": "“And Jeroboam left Jerusalem”",
          "talmudLocation": "Sanhedrin 102a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102a#section-7",
          "talmudFullText": "With regard to the verse which states: <b>“And Jeroboam left Jerusalem”</b> (I Kings 11:29), <b>R' Ḥanina bar Pappa says: </b> It means <b>that he left the destiny of Jerusalem, </b> meaning he removed himself from the category of the residents of Jerusalem, never to return."
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "1 Kings 12:1",
          "verseText": "“And Rehoboam went to Shechem; for all Israel came to Shechem, to make him king”",
          "talmudLocation": "Sanhedrin 102a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102a#section-6",
          "talmudFullText": "The verse states: <b>“And Rehoboam went to Shechem; for all Israel came to Shechem, to make him king”</b> (I Kings 12:1). It was <b>taught in the name of R' Yosei: </b> Shechem is <b>a place ordained for calamity. In Shechem, they tormented</b> and raped <b>Dinah, in</b> the outskirts of <b>Shechem the brothers sold Joseph, in Shechem the kingdom of the house of David was divided. </b>"
        },
        {
          "verseLocation": "1 Kings 12:7",
          "verseText": "I am granting you servitude, as it is stated: “And they spoke to him saying: If you will be a servant to this people today”",
          "talmudLocation": "Horayot 10b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/10b#section-1",
          "talmudFullText": "<b>I am granting you servitude, as it is stated: “And they spoke to him saying: If you will be a servant to this people today”</b> (I Kings 12:7). This explains the phrase “in an independent house. ”"
        },
        {
          "verseLocation": "1 Kings 12:18",
          "verseText": "in Rehoboam, as it is written: “And King Rehoboam made speed to get him up to his chariot [ bamerkava ] to flee to Jerusalem”",
          "talmudLocation": "Sanhedrin 48b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-15",
          "talmudFullText": "The Talmud clarifies: The curse of being afflicted <b>“with a discharge, ”</b> i.e., a <i>zav</i>, was fulfilled among Solomon’s descendants <b>in Rehoboam, as it is written: “And King Rehoboam made speed to get him up to his chariot [<i>bamerkava</i>] to flee to Jerusalem”</b> (I Kings 12:18), <b>and it is written: “And whatever saddle [<i>hamerkav</i>] he that has a discharge rides upon shall be unclean”</b> (Leviticus 15:9). The similarity between the words <i>merkava</i> and <i>merkav</i> indicates that Rehoboam was a <i>zav</i>."
        },
        {
          "verseLocation": "1 Kings 12:21",
          "verseText": "“Rehoboam, son of Solomon”",
          "talmudLocation": "Nedarim 40a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/40a#section-7",
          "talmudFullText": "On a similar note, <b>it is taught</b> in a <i>baraita</i> that <b>R' Shimon ben Elazar says: If youths would say to you: Construct, and Elders would say to you: Demolish, heed the Elders and do not heed the youths, as the construction of youths is demolition, and the demolition of Elders is construction. And a mnemonic</b> device <b>for this matter</b> is <b>“Rehoboam, son of Solomon”</b> (I Kings 12:21). Had he heeded the advice of the Elders and yielded at that time, there would have been no schism."
        },
        {
          "verseLocation": "1 Kings 12:33",
          "verseText": "“In the month that he had devised [ bada ] in his own heart”",
          "talmudLocation": "Nedarim 10a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/10a#section-12",
          "talmudFullText": "<strong>Talmud: </strong> <b>It was stated</b> that <i>amora’im</i> disagreed about <b>substitutes</b> for the language of vows. <b>R' Yoḥanan said: They are</b> terms from <b>a language of</b> other <b>nations</b> that mean offering, dedication, naziriteship, or oath. <b>R' Shimon ben Lakish said: </b> These terms employ <b>language that the rabbis devised [<i>badu</i>] with which</b> one can <b>take a vow. </b> In order to explain the word <i>badu</i>, he adds: <b>And so it states</b> with regard to Jeroboam: <b>“In the month that he had devised [<i>bada</i>] in his own heart”</b> (I Kings 12:33)."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "1 Kings 13:2",
          "verseText": "which is written: “Behold, a son shall be born [ nolad ] to the house of David, Josiah by name”",
          "talmudLocation": "Nedarim 30b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/30b#section-12",
          "talmudFullText": "The Talmud responds: <b>But rather, what</b> should one say; <b>that</b> the expression <b>means those already born? However, if that is so, </b> that <b>which is written: “Behold, a son shall be born [<i>nolad</i>] to the house of David, Josiah by name”</b> (I Kings 13:2), is the meaning <b>also that he is already</b> born? <b>But Manasseh had not yet come</b> into this world, and certainly not his grandson Josiah. <b>Rather, </b> sometimes the word <b>means this, </b> those already born, <b>and</b> sometimes <b>means that, </b> those who are not yet born, <b>and with regard to vows, follow the colloquial language, </b> in which the word <i>noladim</i> is used to mean those who are not yet born, so the vow is interpreted in this manner."
        },
        {
          "verseLocation": "1 Kings 13:2",
          "verseText": "stood and prophesied: “Behold, a son shall be born unto the House of David, Josiah is his name”",
          "talmudLocation": "Yevamot 50a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/50a#section-2",
          "talmudFullText": "The Rabbis <b>said to R' Akiva: </b> How can you claim that one cannot outlive one’s allotted lifespan when <b>there is</b> a verse that <b>states</b> that Isaiah prophesied to Hezekiah as Hezekiah lay on his deathbed: <b>“And I will add unto your days fifteen years”? </b> R' Akiva <b>said to them: </b> Those additional years that God <b>added to his</b> lifespan are <b>from his own</b> allotted lifespan. When Hezekiah sinned God decreed that his lifespan be shortened, but when he repented God allowed him to live out those years. <b>Know</b> that this is so, <b>as a prophet</b> during the reign of King Jeroboam <b>stood and prophesied: “Behold, a son shall be born unto the House of David, Josiah is his name”</b> (I Kings 13:2). Josiah was the grandson of Manasseh, Hezekiah’s son, and at the time Hezekiah lay on his deathbed, <b>Manasseh had not yet been born. </b> Evidently, Hezekiah’s preordained allotted lifespan had still not been completed."
        },
        {
          "verseLocation": "1 Kings 13:18",
          "verseText": "And it is written: “And he said to him: I too am a prophet like you;",
          "talmudLocation": "Sanhedrin 89b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89b#section-2",
          "talmudFullText": "The Mishnah lists among those liable to receive death at the hand of Heaven: <b>And a prophet who violated his own statement. </b> The Talmud comments: <b>For example, Iddo the prophet, </b> who, according to tradition, prophesied the punishment of Jeroboam in Bethel, <b>as it is written: </b> “I will neither eat bread nor drink water in this place, <b>for it so was commanded me</b> by the word of YHWH” (I Kings 13:8–9). <b>And it is written: “And he said to him: I too am a prophet like you; </b> and an angel spoke unto me by the word of YHWH, saying: Bring him back with you into your house, that he may eat bread and drink water” (I Kings 13:18). <b>And it is written: “And he went back with him, </b> and ate bread in his house, and drank water” (I Kings 13:19). <b>And it is written</b> that he died at the hand of Heaven: <b>“And he went, and a lion met him</b> by the way, and killed him” (I Kings 13:24)."
        },
        {
          "verseLocation": "1 Kings 13:19",
          "verseText": "And it is written: “And he went back with him,",
          "talmudLocation": "Sanhedrin 89b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89b#section-2",
          "talmudFullText": "The Mishnah lists among those liable to receive death at the hand of Heaven: <b>And a prophet who violated his own statement. </b> The Talmud comments: <b>For example, Iddo the prophet, </b> who, according to tradition, prophesied the punishment of Jeroboam in Bethel, <b>as it is written: </b> “I will neither eat bread nor drink water in this place, <b>for it so was commanded me</b> by the word of YHWH” (I Kings 13:8–9). <b>And it is written: “And he said to him: I too am a prophet like you; </b> and an angel spoke unto me by the word of YHWH, saying: Bring him back with you into your house, that he may eat bread and drink water” (I Kings 13:18). <b>And it is written: “And he went back with him, </b> and ate bread in his house, and drank water” (I Kings 13:19). <b>And it is written</b> that he died at the hand of Heaven: <b>“And he went, and a lion met him</b> by the way, and killed him” (I Kings 13:24)."
        },
        {
          "verseLocation": "1 Kings 13:20",
          "verseText": "as it is written: “And it happened as they sat at the table, that the word of the Lord came to the prophet that brought him back”",
          "talmudLocation": "Sanhedrin 104a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104a#section-4",
          "talmudFullText": "<b>And</b> the fact that it <b>causes the Shekhina to rest on the prophets of the Baal</b> is derived <b>from the colleague of Iddo the prophet, </b> the elderly prophet who convinced Iddo to eat with him contrary to the directive of God, when Iddo went to Bethel to prophesy to Jeroboam, <b>as it is written: “And it happened as they sat at the table, that the word of YHWH came to the prophet that brought him back”</b> (I Kings 13:20). Although the elderly prophet was a false prophet, he was rewarded with true prophecy as a reward for hosting Iddo."
        },
        {
          "verseLocation": "1 Kings 13:24",
          "verseText": "“And he went, and a lion met him",
          "talmudLocation": "Sanhedrin 89b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89b#section-2",
          "talmudFullText": "The Mishnah lists among those liable to receive death at the hand of Heaven: <b>And a prophet who violated his own statement. </b> The Talmud comments: <b>For example, Iddo the prophet, </b> who, according to tradition, prophesied the punishment of Jeroboam in Bethel, <b>as it is written: </b> “I will neither eat bread nor drink water in this place, <b>for it so was commanded me</b> by the word of YHWH” (I Kings 13:8–9). <b>And it is written: “And he said to him: I too am a prophet like you; </b> and an angel spoke unto me by the word of YHWH, saying: Bring him back with you into your house, that he may eat bread and drink water” (I Kings 13:18). <b>And it is written: “And he went back with him, </b> and ate bread in his house, and drank water” (I Kings 13:19). <b>And it is written</b> that he died at the hand of Heaven: <b>“And he went, and a lion met him</b> by the way, and killed him” (I Kings 13:24)."
        },
        {
          "verseLocation": "1 Kings 13:33",
          "verseText": "“And after this matter, Jeroboam returned not from his evil way”",
          "talmudLocation": "Sanhedrin 102a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102a#section-17",
          "talmudFullText": "The verse states: <b>“And after this matter, Jeroboam returned not from his evil way”</b> (I Kings 13:33). To <b>what</b> event is the verse alluding, when it states: <b>“After</b> this matter”? <b>R' Abba says: </b> It is <b>after God grabbed Jeroboam by his garment, </b> i.e., he sent prophets and implored him, <b>and said to him: Repent, and you and I and</b> the <b>son of Yishai will stroll</b> together <b>in the Garden of Eden. </b> Jeroboam <b>said to Him: Who</b> will walk <b>in the lead? </b> God <b>said to</b> Jeroboam: The <b>son of Yishai</b> will walk <b>in the lead. </b> Jeroboam said: <b>If so, I do not wish</b> to repent."
        },
        {
          "verseLocation": "1 Kings 13:34",
          "verseText": "as it is written: “And by this matter there was a sin to the house of Jeroboam, and to eradicate it and to destroy it from off the face of the earth”",
          "talmudLocation": "Sanhedrin 101b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/101b#section-11",
          "talmudFullText": "The Talmud resumes its discussion of Jeroboam. <b>And from where do we</b> derive <b>that</b> Jeroboam <b>does not enter into the World-to-Come? </b> It is derived from a verse, <b>as it is written: “And by this matter there was a sin to the house of Jeroboam, and to eradicate it and to destroy it from off the face of the earth”</b> (I Kings 13:34). It can be interpreted to mean: <b>To eradicate it in this world, and to destroy it for the World-to-Come. </b>"
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "1 Kings 14:9",
          "verseText": "“And Me you have cast behind your back”",
          "talmudLocation": "Berakhot 10b:30",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10b#section-30",
          "talmudFullText": "<b>Others say</b> that <b>R' Yitzḥak said</b> that <b>R' Yoḥanan said</b> that <b>R' Yosei ben Ḥanina, said in the name of R' Eliezer ben Ya’akov: One who eats and drinks and later prays, about him the verse states</b> the rebuke of the prophet in the name of God: <b>“And Me you have cast behind your back”</b> (I Kings 14:9). One who sees to his own bodily needs by eating and drinking before prayer casts God aside, according his arrogance and ego priority over God (Maharsha). Indeed, <b>do not read your back [<i>gavekha</i>]; rather, your pride [<i>ge’ekha</i>]. God said: After this</b> one <b>has become arrogant</b> and engaged in satisfying his own needs, <b>he</b> only then <b>accepted upon himself the kingdom of Heaven. </b>"
        },
        {
          "verseLocation": "1 Kings 14:10",
          "verseText": "“As consumes the tooth until it be all gone”",
          "talmudLocation": "Bava Kamma 23b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/23b#section-5",
          "talmudFullText": "<b>Mar Zutra objects to</b> these examples of Eating: <b>But</b> in order to create liability under the <i>halakhot</i> of Eating, <b>I require</b> fulfillment of the verse: <b>“As consumes the tooth until it be all gone”</b> (I Kings 14:10), meaning that the damaged item must be completely destroyed or consumed, <b>and</b> here that is <b>not</b> the case, as the stones of the broken wall and the soiled produce have not been destroyed. To answer Mar Zutra’s question, <b>Ravina said: </b> It is possible for a cow to cause complete destruction by rubbing against a wall, e.g., a cow <b>that</b> completely <b>erases</b> any decorative <b>images</b> that were adorning the wall. <b>Rav Ashi said: </b> It is possible for cow to cause complete destruction by soiling produce, e.g., a cow <b>that trods on</b> the produce and crushes it, thereby totally eradicating it. Consequently, the initial question about the status of the cow’s mouth remains."
        },
        {
          "verseLocation": "1 Kings 14:10",
          "verseText": "the tooth until it be all gone”",
          "talmudLocation": "Bava Kamma 3a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/3a#section-1",
          "talmudFullText": "<b>the tooth until it be all gone”</b> (I Kings 14:10)."
        },
        {
          "verseLocation": "1 Kings 14:10",
          "verseText": "as one consumes with the tooth until it be all gone”",
          "talmudLocation": "Bava Kamma 3a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/3a#section-7",
          "talmudFullText": "<b>The Master said</b> in that <i>baraita</i>: When the verse states: <b>“And it consumed”</b> (Exodus 22:4), <b>this is</b> a reference to <b>the</b> category of <b>Eating. And likewise it states: </b> “And I will utterly sweep away the house of Jeroboam, <b>as one consumes with the tooth until it be all gone”</b> (I Kings 14:10). The Talmud infers: <b>The reason</b> that the phrase “and it consumed” is interpreted as a reference to the category of Eating is <b>that God writes: “As one consumes with the tooth until it be all gone. ”</b> The Talmud asks: Were <b>it not for this</b> verse, <b>with regard to what</b> case <b>would you have interpreted</b> that phrase?"
        },
        {
          "verseLocation": "1 Kings 14:10",
          "verseText": "states: “As one consumes with the tooth, until it be all gone”",
          "talmudLocation": "Bava Kamma 55b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/55b#section-15",
          "talmudFullText": "<b>And it is taught</b> in a <i>baraita</i>: With regard to the term <b><i>veshilaḥ</i>: This</b> is referring to damage by <b>Trampling, and similarly, </b> the verse <b>states: “That send forth [<i>meshaleḥei</i>] the feet of the ox and the donkey”</b> (Isaiah 32:20). With regard to the term <b><i>uvi’er</i>: This</b> is referring to damage by <b>Eating, and similarly, </b> the verse <b>states: “As one consumes with the tooth, until it be all gone”</b> (I Kings 14:10)."
        },
        {
          "verseLocation": "1 Kings 14:13",
          "verseText": "“And all Israel shall mourn for him, and bury him”",
          "talmudLocation": "Moed Katan 28b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/28b#section-14",
          "talmudFullText": "<b>R' Yosei HaGelili answered and said: </b> With regard to Abijah, son of King Jeroboam, the verse states: <b>“And all Israel shall mourn for him, and bury him”</b> (I Kings 14:13). <b>Are</b> these <b>matters not</b> inferred <b><i>a fortiori</i>: If, with regard to Abijah, son of Jeroboam, who did only one good thing, as it is written: “Because in him there is found some good thing</b> toward YHWH God of Israel” (I Kings 14:13), i.e., he did only one good thing, and <b>this</b> was his reward, then with regard to <b>the sons of R' Yishmael all the more so</b> should they be rewarded by having the entire Jewish people mourn for them and bury them."
        },
        {
          "verseLocation": "1 Kings 14:13",
          "verseText": "“And all Israel shall eulogize him and bury him”",
          "talmudLocation": "Sanhedrin 46b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/46b#section-13",
          "talmudFullText": "The Talmud suggests: <b>Come</b> and <b>hear</b> a proof that burying the dead is a mitzva, as the prophet Ahijah the Shilonite said about Abijah, son of Jeroboam: <b>“And all Israel shall eulogize him and bury him”</b> (I Kings 14:13). The Talmud answers: From here, too, there is no proof, as they may have buried Abijah <b>in order not to deviate from the</b> general <b>custom</b> of the world, and not because they were required to do so."
        },
        {
          "verseLocation": "1 Kings 14:13",
          "verseText": "“And all Israel shall eulogize him and bury him,",
          "talmudLocation": "Sanhedrin 46b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/46b#section-18",
          "talmudFullText": "The Talmud suggests: <b>Come</b> and <b>hear</b> a proof from the verse referring to Abijah, son of Jeroboam: <b>“And all Israel shall eulogize him and bury him, </b> for he alone of Jeroboam shall come to the grave” (I Kings 14:13). <b>And if you say</b> that burial is required <b>so that</b> the deceased <b>should achieve atonement, these too, </b> i.e., Jeroboam’s other sons, <b>should also be buried so that they should achieve atonement. </b> The Talmud rejects this argument: <b>This</b> son, Abijah, <b>who was righteous, should achieve atonement</b> through his death and burial, but <b>these</b> other sons, who were wicked, <b>should not achieve atonement</b> even in death."
        },
        {
          "verseLocation": "1 Kings 14:13",
          "verseText": "“And all Israel shall eulogize him and bury him”",
          "talmudLocation": "Sanhedrin 46b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/46b#section-22",
          "talmudFullText": "The Talmud suggests: <b>Come</b> and <b>hear</b> a different resolution of this dilemma from the verse referring to Abijah, son of Jeroboam: <b>“And all Israel shall eulogize him and bury him”</b> (I Kings 14:13). <b>And if you say</b> that a eulogy <b>is</b> delivered <b>due to the honor of the living, are these</b> people, Jeroboam’s surviving family, <b>worthy of</b> this <b>honor? </b> The Talmud answers: <b>It is satisfactory to the righteous when</b> other <b>people are honored through them. </b> Since that is their wish, they are eulogized even if their wicked relatives are honored as a result."
        },
        {
          "verseLocation": "1 Kings 14:15",
          "verseText": "Better is the curse that Ahijah the Shilonite cursed the Jewish people than the blessing that Balaam the wicked blessed them. Ahijah the Shilonite cursed Israel with a reed, as it is stated: “For the Lord shall smite Israel as a reed is shaken in water”",
          "talmudLocation": "Sanhedrin 105b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105b#section-20",
          "talmudFullText": "<b>R' Shmuel bar Naḥmani says</b> that <b>R' Yonatan says: What</b> is the meaning of that <b>which is written: “Faithful are the wounds of a friend; but the kisses of an enemy are importunate”</b> (Proverbs 27:6)? <b>Better is the curse that Ahijah the Shilonite cursed the Jewish people than the blessing that Balaam the wicked blessed them. Ahijah the Shilonite cursed Israel with a reed, as it is stated: “For YHWH shall smite Israel as a reed is shaken in water”</b> (I Kings 14:15). There is an aspect of blessing in that curse, as he was saying they will be <b>just like a reed</b> that <b>stands in a place</b> near <b>water, </b> as the water sustains it, <b>and its stalk</b>"
        },
        {
          "verseLocation": "1 Kings 14:15",
          "verseText": "“For the Lord will smite Israel as a reed is shaken in the water”",
          "talmudLocation": "Taanit 20a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/20a#section-13",
          "talmudFullText": "The prophet Ahijah the Shilonite cursed Israel in the following terms: <b>“For YHWH will smite Israel as a reed is shaken in the water”</b> (I Kings 14:15). <b>Rav Yehuda said</b> that <b>Rav said: </b> This too is <b>for a blessing, as R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: What is</b> the meaning of that <b>which is written: “Faithful are the wounds of a friend, but the kisses of an enemy are deceitful”</b> (Proverbs 27:6)? <b>The curse with which Ahijah the Shilonite cursed the Jewish people is more</b> effective <b>than the blessing with which Balaam the wicked blessed them. </b>"
        },
        {
          "verseLocation": "1 Kings 14:16",
          "verseText": "and with regard to Jeroboam, son of Nevat, about whom it is written: “Who [ asher ] sinned and caused others to sin”",
          "talmudLocation": "Horayot 10b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/10b#section-3",
          "talmudFullText": "<b>Rava, son of Rabba, objects to this: If that is so, </b> and the term <i>asher</i> is interpreted in that manner, then concerning that <b>which is written: “And he shall pay for that which [<i>asher</i>] he has sinned from the sacred item”</b> (Leviticus 5:16), <b>and with regard to Jeroboam, son of Nevat, about whom it is written: “Who [<i>asher</i>] sinned and caused others to sin”</b> (I Kings 14:16), <b>so too</b> is the interpretation <b>that this generation is happy? </b> The Talmud answers: <b>Here, </b> in the case of a king who brings an offering, it <b>is different, as the verse altered its formulation; </b> in parallel verses, the term “if” is utilized, e.g., in the verse: “If the anointed priest shall sin” (Leviticus 4:3). In the other instances, <i>asher</i> is the standard formulation."
        },
        {
          "verseLocation": "1 Kings 14:24",
          "verseText": "states: “And there were also sodomites [ kadesh ] in the land, they did according to all the abominations of the nations which the Lord drove out",
          "talmudLocation": "Sanhedrin 54b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/54b#section-2",
          "talmudFullText": "<b>We have learned</b> from here the <b>prohibition for the one who engages in</b> homosexual <b>sex</b> actively. <b>From where</b> do we derive <b>the prohibition for one who engages in</b> homosexual <b>sex</b> passively? <b>The verse states: “There shall not be a sodomite [<i>kadesh</i>] among the children of Israel”</b> (Deuteronomy 23:18). <b>And</b> another verse, cited to clarify the meaning of the term <i>kadesh</i>, <b>states: “And there were also sodomites [<i>kadesh</i>] in the land, they did according to all the abominations of the nations which YHWH drove out</b> before the children of Israel” (I Kings 14:24). This is <b>the statement of R' Yishmael. </b>"
        },
        {
          "verseLocation": "1 Kings 14:31",
          "verseText": "as it is written: “And his mother’s name was Naamah the Ammonite”",
          "talmudLocation": "Bava Kamma 38b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/38b#section-7",
          "talmudFullText": "<b>And</b> with regard to the daughters of Lot, <b>R' Ḥiyya bar Abba says</b> that <b>R' Yehoshua ben Korḥa says: A person should always hasten to perform a mitzva, as due to</b> the <b>one night by which the elder</b> daughter of Lot <b>preceded the younger</b> daughter, with the intention of performing a mitzva by bringing children into the world, <b>she preceded her by four generations</b> in having her descendants enter <b>into the Jewish people. </b> They are: <b>Obed, </b> son of Ruth the Moabite, <b>Yishai, David, and Solomon. Whereas, </b> the descendants of <b>the younger</b> daughter did not join the Jewish people <b>until Rehoboam, </b> Solomon’s son, was born, <b>as it is written: “And his mother’s name was Naamah the Ammonite”</b> (I Kings 14:31)."
        }
      ]
    },
    {
      "chapterNumber": 15,
      "citations": [
        {
          "verseLocation": "1 Kings 15:5",
          "verseText": "save only the matter of Uriah the Hittite”",
          "talmudLocation": "Moed Katan 16b:28",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16b#section-28",
          "talmudFullText": "<b>A bat kol issued forth and said</b> by way of explanation as to why the promise was not entirely fulfilled: “Because David did that which was right in the eyes of YHWH, and turned not aside from anything that He commanded him all the days of his life, <b>save only the matter of Uriah the Hittite”</b> (I Kings 15:5). Had David not committed this sin, then all of the promises mentioned in the Torah would have been fulfilled in their entirety through him."
        },
        {
          "verseLocation": "1 Kings 15:5",
          "verseText": "save only in the matter of Uriah the Hittite”",
          "talmudLocation": "Shabbat 56a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-12",
          "talmudFullText": "<b>Rav said: When you analyze</b> the matter of <b>David, no</b> sin that he committed <b>is found in his</b> lifetime, <b>except for that</b> involving <b>Uriah. As it is written</b>: “Because David did that which was right in the eyes of YHWH, and turned not aside from any thing that He commanded him all the days of his life, <b>save only in the matter of Uriah the Hittite”</b> (I Kings 15:5)."
        },
        {
          "verseLocation": "1 Kings 15:18",
          "verseText": "elsewhere by their father and their father’s father, as it is written: “And King Asa sent them to Ben-hadad, son of Tabrimmon, son of Hezion, king of Aram, who dwelled in Damascus, saying”",
          "talmudLocation": "Yevamot 62a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/62a#section-15",
          "talmudFullText": "The Talmud asks: <b>If so, here too, </b> with regard to non-Jews, there is no proof from the verse about Berodach-baladan that they have family lineage. The Talmud answers: <b>There it is different, as</b> the Bible <b>identified him by his name and by his father’s name, </b> thereby emphasizing the family connection. <b>But here, </b> it does <b>not specify</b> the names of Ziba’s children. <b>And if you wish, say</b> instead that the Bible <b>identified</b> non-Jews <b>elsewhere by their father and their father’s father, as it is written: “And King Asa sent them to Ben-hadad, son of Tabrimmon, son of Hezion, king of Aram, who dwelled in Damascus, saying”</b> (I Kings 15:18). This indicates that there is lineage for non-Jews."
        },
        {
          "verseLocation": "1 Kings 15:22",
          "verseText": "Because he made Torah scholars perform forced labor [ angarya ], as it is stated: “Then King Asa made a proclamation unto all Judah; none was exempted;",
          "talmudLocation": "Sotah 10a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-15",
          "talmudFullText": "<b>Rava taught: For what</b> reason was <b>Asa punished</b> in his feet? <b>Because he made Torah scholars perform forced labor [<i>angarya</i>], as it is stated: “Then King Asa made a proclamation unto all Judah; none was exempted; </b> and they carried away the stones of Ramah and the timber thereof, with which Baasa had built, and King Asa built with them Geba of Benjamin and Mizpah” (I Kings 15:22). The superfluous expression “unto all” indicates that the proclamation was issued to <b>everyone, including</b> Torah scholars. The Talmud asks: <b>What</b> is the meaning of the next phrase in the verse: <b>“None was exempted [<i>ein naki</i>]”? Rav Yehuda says</b> that <b>Rav says: </b> This includes <b>even a bridegroom from his chamber and a bride from her canopy, </b> as the verse states with regard to a bridegroom: “He shall be free [<i>naki</i>] for his house one year” (Deuteronomy 24:5)."
        },
        {
          "verseLocation": "1 Kings 15:23",
          "verseText": "“But in the time of his old age, he was diseased in his feet”",
          "talmudLocation": "Sanhedrin 48b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-17",
          "talmudFullText": "The curse of those who <b>“hold onto a staff”</b> was fulfilled among Solomon’s descendants <b>in Asa, as it is written</b> concerning him: <b>“But in the time of his old age, he was diseased in his feet”</b> (I Kings 15:23). <b>And Rav Yehuda says</b> that <b>Rav says: </b> This means <b>that he was seized with gout [<i>podagra</i>]. Mar Zutra, son of Rav Naḥman, said to Rav Naḥman: What are the circumstances</b> and symptoms of this disease? Rav Naḥman <b>said to him: </b> The pain is <b>similar to</b> the pain of <b>a needle</b> piercing <b>live flesh. </b> The Talmud asks: <b>How did</b> Rav Naḥman <b>know</b> what gout is like? The Talmud answers: <b>If you wish, say</b> that he himself <b>suffered from</b> the disease. <b>And if you wish, say</b> that <b>he learned it</b> as a tradition <b>from his teacher. And if you wish, say</b> that he knew this through Holy Spirit, as the verse states: <b>“The secret of YHWH is with them that fear Him; and He will show to them His covenant”</b> (Psalms 25:14)."
        },
        {
          "verseLocation": "1 Kings 15:23",
          "verseText": "But in the time of his old age he was diseased in his feet”",
          "talmudLocation": "Sotah 10a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-14",
          "talmudFullText": "<b>Asa</b> was stricken <b>in his feet, as it is written: </b> “Now the rest of all the acts of Asa, and all his might, and all that he did, and the cities that he built, are they not written in the book of the chronicles of the kings of Judah? <b>But in the time of his old age he was diseased in his feet”</b> (I Kings 15:23). <b>And Rav Yehuda says</b> that <b>Rav says: </b> This indicates <b>that gout [<i>padagra</i>] grabbed hold of him. Mar Zutra, son of Rav Naḥman, said to Rav Naḥman: What are the circumstances</b> of <b>gout? </b> What pain does it involve? <b>He said to him: </b> It feels <b>like a needle</b> inserted <b>into living flesh. </b> The Talmud asks: <b>From where did he know this? </b> The Talmud answers: <b>Some say</b> that he himself <b>suffered from this</b> condition, <b>and some say</b> that <b>he heard it from his teacher, and some say</b> that he knew it through Holy Spirit, as it stated: <b>“The secret of YHWH is with them that fear Him; and His covenant, to make them know it”</b> (Psalms 25:14)."
        }
      ]
    },
    {
      "chapterNumber": 16,
      "citations": [
        {
          "verseLocation": "1 Kings 16:24",
          "verseText": "that he added one city in Eretz Yisrael, as it is stated: “And he bought the hill of Samaria from Shemer for two talents of silver, and built on the hill, and called the name of the city that he built after Shemer, the owner of the hill, Samaria”",
          "talmudLocation": "Sanhedrin 102b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-8",
          "talmudFullText": "<b>R' Yoḥanan says: For what</b> virtue <b>was Omri, </b> king of Israel, who was Ahab’s father, <b>privileged</b> to ascend <b>to</b> the <b>monarchy? </b> It is <b>due to</b> the fact <b>that he added one city in Eretz Yisrael, as it is stated: “And he bought the hill of Samaria from Shemer for two talents of silver, and built on the hill, and called the name of the city that he built after Shemer, the owner of the hill, Samaria”</b> (I Kings 16:24)."
        },
        {
          "verseLocation": "1 Kings 16:31",
          "verseText": "“And it came to pass, the most minor of his transgressions was his walking in the sins of Jeroboam, son of Nebat”",
          "talmudLocation": "Sanhedrin 102b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-6",
          "talmudFullText": "With regard to Ahab, it is written: <b>“And it came to pass, the most minor of his transgressions was his walking in the sins of Jeroboam, son of Nebat”</b> (I Kings 16:31). <b>R' Yoḥanan says: The minor</b> sins <b>that Ahab performed</b> were <b>on par with the major</b> sins <b>that Jeroboam performed, </b> as the transgressions committed by Ahab were much more serious than those committed by Jeroboam. <b>And for what</b> reason <b>did the verse attribute</b> the sins of all the kings of Israel <b>to Jeroboam, </b> even though the sins of Ahab were more substantial? It is <b>due to</b> the fact <b>that he was first to</b> engage in <b>iniquity. </b> With regard to the verse: <b>“Their altars shall also be like droppings in the furrows of the field”</b> (Hosea 12:12), <b>R' Yoḥanan says: You do not have even one furrow in Eretz Yisrael upon which Ahab did not place</b> an object of <b>idol worship and bow to it. </b>"
        },
        {
          "verseLocation": "1 Kings 16:33",
          "verseText": "“And Ahab made the ashera ; and Ahab did more to provoke the Lord, God of Israel, to anger than all the kings of Israel that were before him”",
          "talmudLocation": "Sanhedrin 102b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-17",
          "talmudFullText": "With regard to the verse: <b>“And Ahab made the <i>ashera</i>; and Ahab did more to provoke YHWH, God of Israel, to anger than all the kings of Israel that were before him”</b> (I Kings 16:33), <b>R' Yoḥanan says: </b> It means <b>that he wrote on the doors of Samaria: Ahab denies the</b> existence of the <b>God of Israel, therefore he has no share in the God of Israel. </b>"
        },
        {
          "verseLocation": "1 Kings 16:34",
          "verseText": "Jericho, as it is written: “Hiel the Bethelite built Jericho; with Abiram, his firstborn, he laid its foundation, and with his young son Segub set up its gates”",
          "talmudLocation": "Sanhedrin 113a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/113a#section-8",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> that this includes a prohibition <b>not</b> to build <b>Jericho</b> even after changing its name <b>to the name of another city, and not</b> to build <b>another city</b> after giving it the <b>name</b> of <b>Jericho, as it is written: “Hiel the Bethelite built Jericho; with Abiram, his firstborn, he laid its foundation, and with his young son Segub set up its gates”</b> (I Kings 16:34)."
        }
      ]
    },
    {
      "chapterNumber": 17,
      "citations": [
        {
          "verseLocation": "1 Kings 17:1",
          "verseText": "Elijah, as it is stated: “And Elijah the Tishbite, who was of the inhabitants of Gilad, said”",
          "talmudLocation": "Pesachim 68a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/68a#section-13",
          "talmudFullText": "<b>“Bashan” is</b> an allusion to the prophet <b>Elisha, who came from the Bashan. </b> How do we know that Elisha came from Bashan? <b>As it is stated: </b> “Joel the chief, and Shafam the next, <b>and Yanai and Shafat in the Bashan”</b> (I Chronicles 5:12), <b>and it is written: “Here is Elisha ben Shafat who poured water on the hands of Elijah”</b> (II Kings 3:11). <b>“Gilad” is</b> an allusion to <b>Elijah, as it is stated: “And Elijah the Tishbite, who was of the inhabitants of Gilad, said”</b> (I Kings 17:1). Based on the similarity of the verses and the verbal analogy between the two instances of the word “feed,” we learn that in the future the righteous will be like Elijah and Elisha, who resurrected the dead."
        },
        {
          "verseLocation": "1 Kings 17:1",
          "verseText": "there shall not be dew or rain",
          "talmudLocation": "Sanhedrin 113a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/113a#section-12",
          "talmudFullText": "The verse relates Elijah’s reaction: <b>Immediately: “And Elijah the Tishbite, who was of the inhabitants of Gilead, said</b> to Ahab: <b>As YHWH God of Israel lives, </b> before whom I stand, <b>there shall not be dew or rain</b> these years, but according to my word” (I Kings 17:1). Elijah <b>prayed for mercy and they gave him the key to rainfall</b> enabling him to dictate when it would rain, <b>and he arose and went. </b>"
        },
        {
          "verseLocation": "1 Kings 17:1",
          "verseText": "that it is not withheld? As it is written: “And Elijah the Tishbite, who was of the settlers of Gilead, said to Ahab: As the Lord, the God of Israel, lives, before whom I stand, there shall be no dew or rain in these years but according to my word”",
          "talmudLocation": "Taanit 3a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/3a#section-14",
          "talmudFullText": "The Talmud explains: <b>And dew, from where do we</b> derive <b>that it is not withheld? As it is written: “And Elijah the Tishbite, who was of the settlers of Gilead, said to Ahab: As YHWH, the God of Israel, lives, before whom I stand, there shall be no dew or rain in these years but according to my word”</b> (I Kings 17:1), <b>and it is written: “Go, show yourself before Ahab, and I will send rain upon the land”</b> (I Kings 18:1). God stated that He will resume rainfall, <b>whereas He did not say to</b> Elijah that He will restore <b>dew. What is the reason? Because</b> dew"
        },
        {
          "verseLocation": "1 Kings 17:6",
          "verseText": "“And the ravens [ orevim ] brought him bread and meat in the morning, and bread and meat in the evening”",
          "talmudLocation": "Chullin 5a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/5a#section-3",
          "talmudFullText": "The Talmud suggests: <b>Let us say</b> that the verse written with regard to Elijah <b>supports</b> the opinion of Rav Anan. The verse states: <b>“And the ravens [<i>orevim</i>] brought him bread and meat in the morning, and bread and meat in the evening”</b> (I Kings 17:6); <b>and Rav Yehuda said</b> that <b>Rav said: </b> They would bring the meat <b>from the slaughterhouse of Ahab. </b> Clearly, Elijah would not have eaten the meat if Ahab’s slaughter was not valid. The Talmud responds: Since he ate the meat <b>according to the word</b> of God, the case of Elijah <b>is different, </b> and no proof may be cited from there."
        },
        {
          "verseLocation": "1 Kings 17:7",
          "verseText": "“And it came to pass after some days, that the wadi dried up, because there was no rain in the land”",
          "talmudLocation": "Sanhedrin 113a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/113a#section-13",
          "talmudFullText": "It is written about Elijah: <b>“And the word of YHWH came to him, saying: Go from here, and turn eastward, and hide yourself by Wadi Cherith…And the ravens brought him bread and meat in the morning”</b> (I Kings 17:2–3, 6). The Talmud asks: <b>From where</b> did they bring him bread and meat? <b>R' Yehuda says</b> that <b>Rav says: </b> They brought it <b>from the slaughterhouse of Ahab. </b> And it is written: <b>“And it came to pass after some days, that the wadi dried up, because there was no rain in the land”</b> (I Kings 17:7). <b>Since</b> God <b>saw that there is suffering in the world</b> and Elijah was insensitive to it, <b>it is written: “And the word of YHWH came to him, saying: Arise, go to Zarephath”</b> (I Kings 17:8–9), to initiate a chain of events that would lead Elijah to return the key to rainfall to God."
        },
        {
          "verseLocation": "1 Kings 17:17",
          "verseText": "And it is written: “And it came to pass after these matters, that the son of the woman, the mistress of the house, became sick”",
          "talmudLocation": "Sanhedrin 113a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/113a#section-14",
          "talmudFullText": "<b>And it is written: “And it came to pass after these matters, that the son of the woman, the mistress of the house, became sick”</b> (I Kings 17:17). Elijah <b>prayed for mercy, </b> for God <b>to give him the key to the resurrection of the dead. They said to him</b> from Heaven: <b>Three keys were not</b> typically <b>passed to an agent: </b> The key <b>to a woman in childbirth, </b> the key <b>to rainfall, and</b> the key <b>to the resurrection of the dead. </b> You already have the key to rainfall; do you also request the key to the resurrection of the dead? People <b>will say: Two</b> keys <b>are in the possession of the student and one</b> key <b>is in the possession of the Master. Bring</b> Me <b>this</b> key to rainfall, <b>and take this</b> key to the resurrection of the dead. Due to Elijah’s request, he was forced to revoke his oath, <b>as it is written: “Go, appear before Ahab; and I will give rain”</b> (I Kings 18:1)."
        }
      ]
    },
    {
      "chapterNumber": 18,
      "citations": [
        {
          "verseLocation": "1 Kings 18:1",
          "verseText": "as it is written: “Go, appear before Ahab; and I will give rain”",
          "talmudLocation": "Sanhedrin 113a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/113a#section-14",
          "talmudFullText": "<b>And it is written: “And it came to pass after these matters, that the son of the woman, the mistress of the house, became sick”</b> (I Kings 17:17). Elijah <b>prayed for mercy, </b> for God <b>to give him the key to the resurrection of the dead. They said to him</b> from Heaven: <b>Three keys were not</b> typically <b>passed to an agent: </b> The key <b>to a woman in childbirth, </b> the key <b>to rainfall, and</b> the key <b>to the resurrection of the dead. </b> You already have the key to rainfall; do you also request the key to the resurrection of the dead? People <b>will say: Two</b> keys <b>are in the possession of the student and one</b> key <b>is in the possession of the Master. Bring</b> Me <b>this</b> key to rainfall, <b>and take this</b> key to the resurrection of the dead. Due to Elijah’s request, he was forced to revoke his oath, <b>as it is written: “Go, appear before Ahab; and I will give rain”</b> (I Kings 18:1)."
        },
        {
          "verseLocation": "1 Kings 18:1",
          "verseText": "and it is written: “Go, show yourself before Ahab, and I will send rain upon the land”",
          "talmudLocation": "Taanit 3a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/3a#section-14",
          "talmudFullText": "The Talmud explains: <b>And dew, from where do we</b> derive <b>that it is not withheld? As it is written: “And Elijah the Tishbite, who was of the settlers of Gilead, said to Ahab: As YHWH, the God of Israel, lives, before whom I stand, there shall be no dew or rain in these years but according to my word”</b> (I Kings 17:1), <b>and it is written: “Go, show yourself before Ahab, and I will send rain upon the land”</b> (I Kings 18:1). God stated that He will resume rainfall, <b>whereas He did not say to</b> Elijah that He will restore <b>dew. What is the reason? Because</b> dew"
        },
        {
          "verseLocation": "1 Kings 18:2",
          "verseText": "as it is stated: “And Elijah went to appear to Ahab”",
          "talmudLocation": "Berakhot 10a:26",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10a#section-26",
          "talmudFullText": "With regard to redemption and prayer, the Talmud tells the story of Hezekiah’s illness, his prayer to God, and subsequent recuperation. <b>Rav Hamnuna said: What is</b> the meaning of <b>that which is written</b> praising God: <b>“Who is like the wise man, and who knows the interpretation [<i>pesher</i>] of the matter”</b> (Ecclesiastes 8:1)? This verse means: <b>Who is like God Who knows how to effect compromise [<i>peshara</i>] between two righteous individuals, between Hezekiah, </b> the king of Judea, <b>and Isaiah</b> the prophet. They disagreed over which of them should visit the other. <b>Hezekiah said: Let Isaiah come to me, as that is what we find with regard to Elijah</b> the prophet, <b>who went to Ahab, </b> the king of Israel, <b>as it is stated: “And Elijah went to appear to Ahab”</b> (I Kings 18:2). This proves that it is the prophet who must seek out the king. <b>And Isaiah said: Let Hezekiah come to me, as that is what we find with regard to Yehoram ben Ahab, </b> king of Israel, <b>who went to Elisha</b> the prophet, as it is stated: “So the king of Israel, Jehosaphat and the king of Edom went down to him” (II Kings 3:12)."
        },
        {
          "verseLocation": "1 Kings 18:3",
          "verseText": "is written: “And Ahab called Obadiah, who was over the household; now Obadiah feared the Lord greatly”",
          "talmudLocation": "Sanhedrin 39b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-10",
          "talmudFullText": "§ Before continuing its discussion of Ahab, the Talmud records <b>a mnemonic</b> for the forthcoming statements: <b>Called; and merited; of Edom. </b> It <b>is written: “And Ahab called Obadiah, who was over the household; now Obadiah feared YHWH greatly”</b> (I Kings 18:3). The Talmud asks: <b>What is the verse saying? </b> What is the connection between Obadiah’s fear of YHWH and the call of Ahab?"
        },
        {
          "verseLocation": "1 Kings 18:4",
          "verseText": "because he concealed one hundred prophets in a cave, as it is stated: “It was so, when Jezebel cut off the prophets of the Lord, that Obadiah took one hundred prophets, and hid them, fifty men in a cave,",
          "talmudLocation": "Sanhedrin 39b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-13",
          "talmudFullText": "<b>R' Yitzḥak says: For what</b> reason <b>did Obadiah merit prophecy? </b> It is <b>because he concealed one hundred prophets in a cave, as it is stated: “It was so, when Jezebel cut off the prophets of YHWH, that Obadiah took one hundred prophets, and hid them, fifty men in a cave, </b> and fed them with bread and water” (I Kings 18:4). The Talmud asks: <b>What is different, </b> i.e., why did he decide, to conceal <b>fifty men</b> in each of two caves and not conceal them all together in one cave? <b>R' Elazar says: He learned from</b> the behavior of <b>Jacob</b> to do so, <b>as it is stated: </b> “And he said: If Esau comes to the one camp and smites it, <b>then the camp that is left shall escape”</b> (Genesis 32:9). Obadiah learned from this to divide the prophets and thereby lessen the danger. <b>R' Abbahu says: </b> It is <b>because there is no cave</b> big enough <b>to contain more than fifty</b> people."
        },
        {
          "verseLocation": "1 Kings 18:10",
          "verseText": "“As the Lord your God lives, there is no nation or kingdom where my master has not sent to seek you,",
          "talmudLocation": "Megillah 11a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-23",
          "talmudFullText": "§ Apropos the discussion of the kingdoms of Ahasuerus and Solomon, the Talmud cites a <i>baraita</i> in which <b>A baraita states: Three</b> men <b>ruled over the</b> entire <b>world, and they were Ahab, and Ahasuerus, and Nebuchadnezzar. </b> The Talmud explains: <b>Ahab, as it is written</b> in the words of Obadiah, servant of Ahab, to Elijah: <b>“As YHWH your God lives, there is no nation or kingdom where my master has not sent to seek you, </b> and they said: He is not there; and he made the kingdom and nation swear, that they had not found you” (I Kings 18:10). <b>And if he did not reign over them, how could he have made them swear? </b> Apparently, then, he reigned over the entire world."
        },
        {
          "verseLocation": "1 Kings 18:12",
          "verseText": "as it is written: “But I, your servant, have feared the Lord from my youth”",
          "talmudLocation": "Nedarim 62a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/62a#section-10",
          "talmudFullText": "<b>Rava said: </b> In a time of need, <b>it is permitted for a person to make himself known in a place where</b> people <b>do not know him. </b> The proof is from what Obadiah said to Elijah in order to identify himself, <b>as it is written: “But I, your servant, have feared YHWH from my youth”</b> (I Kings 18:12). The Talmud asks: <b>But</b> this is <b>difficult</b> with regard to the story about <b>R' Tarfon, </b> who was distraught because he revealed his identity to the man who placed him in the sack. The Talmud answers: The case of R' Tarfon is different, <b>as he was very wealthy, and</b> therefore <b>he should have</b> sought <b>to appease him with money. </b>"
        },
        {
          "verseLocation": "1 Kings 18:28",
          "verseText": "“And they lacerated themselves in accordance with their custom, with swords and lances”",
          "talmudLocation": "Makkot 21a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/21a#section-3",
          "talmudFullText": "The Talmud relates: <b>A <i>tanna</i> taught</b> a <i>baraita</i> <b>before R' Yoḥanan: </b> One who cuts an incision <b>over a dead</b> person, <b>whether</b> he did so <b>by hand or with a utensil, </b> is <b>liable. </b> Concerning one who cuts an incision <b>for idolatry, </b> if he does so <b>by hand, </b> he is <b>liable, </b> but if he does so <b>with a utensil, </b> he is <b>exempt. </b> R' Yoḥanan was puzzled by this <i>baraita</i>: <b>But isn’t the reverse written</b> with regard to the priests of Baal: <b>“And they lacerated themselves in accordance with their custom, with swords and lances”</b> (I Kings 18:28), indicating that customarily laceration is with a utensil? R' Yoḥanan instructed the <i>tanna</i>: <b>Rather, </b> emend the <i>baraita</i> and <b>say: </b> Concerning one who cuts an incision for idolatry, if he does so <b>by hand, </b> he is <b>exempt; </b> but if he does so <b>with a utensil, </b> he is <b>liable. </b>"
        },
        {
          "verseLocation": "1 Kings 18:32",
          "verseText": "two se’a of seed”",
          "talmudLocation": "Bava Batra 16a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-19",
          "talmudFullText": "God further said to Job: <b>“Who has divided a channel [<i>te’ala</i>] for the torrent</b> of rain, or a path for the lightning of thunder”? (Job 38:25). <b>I have created many drops</b> of water <b>in the clouds, and for each drop I created its own channel, so that two drops should not emerge from the same channel. As were two drops to emerge from the same channel they would destroy the earth and it would not yield produce. </b> Now, if <b>I do not confuse one drop with another, would I confuse <i>Iyov</i> with <i>oyev</i>? </b> Incidentally, the Talmud asks: <b>From where may</b> it <b>be inferred that this</b> term <b><i>te’ala</i></b> means <b>a channel? Rabba bar Sheila said: As it is written</b> with regard to Elijah the prophet: <b>“And he fashioned a channel [<i>te’ala</i>]</b> about the altar, <b>as</b> great as would contain <b>two <i>se’a</i> of seed”</b> (I Kings 18:32)."
        },
        {
          "verseLocation": "1 Kings 18:36",
          "verseText": ", as it is stated: “And it came to pass at the time of the evening sacrifice, that Elijah the Prophet came near and said, Lord, God of Abraham, Isaac, and Israel, let it be known this day that you are God in Israel, and that I am Your servant, and that I have done all these things at Your word”",
          "talmudLocation": "Shabbat 55a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55a#section-15",
          "talmudFullText": "<b>R' Yehoshua ben Levi said: </b> The merit of the Patriarchs ceased <b>since the days of Elijah</b> the Prophet<b>, as it is stated: “And it came to pass at the time of the evening sacrifice, that Elijah the Prophet came near and said, Lord, God of Abraham, Isaac, and Israel, let it be known this day that you are God in Israel, and that I am Your servant, and that I have done all these things at Your word”</b> (I Kings 18:36). By inference: Let it be known this day and not afterward because the merit of the Patriarchs will cease today."
        },
        {
          "verseLocation": "1 Kings 18:36",
          "verseText": "prayer is written,",
          "talmudLocation": "Taanit 17a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/17a#section-3",
          "talmudFullText": "<b>However, with regard to Elijah, </b> although <b>prayer is written, </b> as it says: “Elijah the prophet came near and said: Lord, the God of Abraham, of Isaac, and of Israel” (I Kings 18:36), which is referring to a prayer, <b>crying is not written. </b> How, then, can one conclude a blessing that deals with Elijah by mentioning crying? The Talmud answers that Elijah’s statement: <b>“Answer me, Lord, answer me”</b> (I Kings 18:37), <b>is an expression</b> of <b>crying, </b> even if the term crying does not itself actually appear."
        },
        {
          "verseLocation": "1 Kings 18:37",
          "verseText": "and You have turned their hearts backward”",
          "talmudLocation": "Berakhot 31b:27",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31b#section-27",
          "talmudFullText": "<b>And</b> on a similar note, <b>R' Elazar said</b> that <b>Elijah spoke impertinently toward</b> God <b>on High</b> as well in his prayer at Mount Carmel, <b>as it is stated: </b> “Answer me, Lord, answer me, that this people will know that You are YHWH, God, <b>and You have turned their hearts backward”</b> (I Kings 18:37), claiming that God caused Israel to sin. On this topic, <b>R' Shmuel bar R' Yitzḥak said: From where do we know that God ultimately conceded to Elijah</b> that he was correct?"
        },
        {
          "verseLocation": "1 Kings 18:37",
          "verseText": "“Answer me, Lord, answer me,",
          "talmudLocation": "Berakhot 9b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/9b#section-8",
          "talmudFullText": "Having explained the use of the double language of “I will be that I will be,” the Talmud proceeds to explain the double language employed by Elijah on Mount Carmel: <b>“Answer me, Lord, answer me, </b> that this people will know that You are YHWH, God, and You have turned their hearts backward” (I Kings 18:37). <b>R' Abbahu said: Why did Elijah say answer me twice? </b> This repetition <b>teaches that Elijah said before God: God!, answer me that fire will descend from heaven and consume everything that is on the altar, and answer me that You will divert their mind</b> from devising alternative explanations for what they witnessed so <b>that they will not say that they were acts of sorcery. As it is stated</b> that Elijah said: <b>“And You have turned their hearts backward, ”</b> God can restore them to the proper path as well."
        },
        {
          "verseLocation": "1 Kings 18:37",
          "verseText": "“Answer me, Lord, answer me”",
          "talmudLocation": "Taanit 17a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/17a#section-3",
          "talmudFullText": "<b>However, with regard to Elijah, </b> although <b>prayer is written, </b> as it says: “Elijah the prophet came near and said: Lord, the God of Abraham, of Isaac, and of Israel” (I Kings 18:36), which is referring to a prayer, <b>crying is not written. </b> How, then, can one conclude a blessing that deals with Elijah by mentioning crying? The Talmud answers that Elijah’s statement: <b>“Answer me, Lord, answer me”</b> (I Kings 18:37), <b>is an expression</b> of <b>crying, </b> even if the term crying does not itself actually appear."
        },
        {
          "verseLocation": "1 Kings 18:38",
          "verseText": "and it licked up the water that was in the trench”",
          "talmudLocation": "Yoma 21b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/21b#section-9",
          "talmudFullText": "The Talmud elaborates: <b>There is fire that consumes solids and does not consume liquids; that is our</b> standard fire that consumes dry items but does not dry liquids. <br>Fire that <b>consumes liquids and does not consume solids</b> is the fever <b>of the sick</b> that dehydrates the body but does not consume the flesh. <br>Fire that <b>consumes solids and consumes liquids</b> is the fire <b>of Elijah</b> the Prophet, <b>as it is written: </b> “And fire fell from the sky and consumed the offering and the wood and the stones and the earth, <b>and it licked up the water that was in the trench”</b> (I Kings 18:38). <br>Fire that <b>consumes wet</b> objects <b>like dry</b> objects is the fire <b>of the arrangement of wood. </b> <br><b>There is fire that repels</b> other <b>fire; </b> that is the fire <b>of</b> the angel <b>Gabriel. </b> The book of Daniel relates that Gabriel was an angel of fire who descended to the fiery furnace, repelled the fire, and rescued Hananiah, Mishael, and Azariah, who had been cast inside. <br><b>And there is fire that consumes</b> other <b>fire; </b> that is the fire <b>of the Shekhina, as the Master said</b> in another context: God, <b>extended His finger</b> between the angels, who are also made of fire, <b>and burned them. </b> The fire of the Shekhina consumed the fire of the angels."
        },
        {
          "verseLocation": "1 Kings 18:46",
          "verseText": "from here, as it is stated: “And the hand of the Lord was on Elijah, and he girded up his loins, and ran before Ahab to the entrance of Jezreel”",
          "talmudLocation": "Menachot 98a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/98a#section-12",
          "talmudFullText": "<b>R' Yoḥanan said</b> this principle may be derived <b>from here, as it is stated: “And the hand of YHWH was on Elijah, and he girded up his loins, and ran before Ahab to the entrance of Jezreel”</b> (I Kings 18:46). Despite Ahab’s wickedness, Elijah acted in this manner out of respect for the king."
        },
        {
          "verseLocation": "1 Kings 18:46",
          "verseText": "from here: “And the hand of the Lord was on Elijah, and he girded up his loins and ran before Ahab",
          "talmudLocation": "Zevachim 102a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/102a#section-13",
          "talmudFullText": "<b>R' Yoḥanan says: </b> Derive the principle <b>from here: “And the hand of YHWH was on Elijah, and he girded up his loins and ran before Ahab</b> to the entrance of Jezreel” (I Kings 18:46). Elijah the prophet ran before the evil king Ahab out of respect."
        }
      ]
    },
    {
      "chapterNumber": 19,
      "citations": [
        {
          "verseLocation": "1 Kings 19:18",
          "verseText": "as it is written: “And I will leave seven thousand in Israel, all the knees that have not bowed to Baal,",
          "talmudLocation": "Chullin 4b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/4b#section-15",
          "talmudFullText": "The Talmud suggests: <b>And perhaps</b> the <b>seven thousand</b> righteous people <b>slaughtered</b> the animals, <b>as it is written: “And I will leave seven thousand in Israel, all the knees that have not bowed to Baal, </b> and every mouth that has not kissed it” (I Kings 19:18). The Talmud rejects that suggestion: <b>They were hiding from Jezebel, </b> Ahab’s wife, and would not have gone to the palace to slaughter animals for the feast."
        },
        {
          "verseLocation": "1 Kings 19:18",
          "verseText": "And it is written: “And I will leave seven thousand in Israel; all the knees that have not bent to the Baal, and every mouth that has not kissed it”",
          "talmudLocation": "Sanhedrin 102b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-13",
          "talmudFullText": "The Talmud rejects this: <b>There, </b> with regard to Absalom <b>it is not written: “And all the people, ”</b> whereas <b>here, </b> with regard to Ahab, <b>it is written: “And all the people. ” As it is impossible that there were not among them righteous</b> people, if the righteous people agreed, apparently, “the delight of your eyes” was sacred. <b>And it is written: “And I will leave seven thousand in Israel; all the knees that have not bent to the Baal, and every mouth that has not kissed it”</b> (I Kings 19:18), indicating that there were righteous people among them."
        }
      ]
    },
    {
      "chapterNumber": 20,
      "citations": [
        {
          "verseLocation": "1 Kings 20:8",
          "verseText": "“And all the elders and all the people said to him: Do not consent and heed not”",
          "talmudLocation": "Sanhedrin 102b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-12",
          "talmudFullText": "The Talmud suggests: <b>Perhaps</b> the delight of his eyes was an object of <b>idol worship. </b> The Talmud answers: That could <b>not enter your mind, as it is written</b> that Ahab consulted the rabbis with regard to this matter: <b>“And all the elders and all the people said to him: Do not consent and heed not”</b> (I Kings 20:8). The elders in this verse are presumably the rabbis. The Talmud continues: <b>But perhaps they were wicked elders, </b> who worshipped idols. <b>Isn’t it written: “And the saying pleased Absalom well and all the elders of Israel”</b> (II Samuel 17:4), <b>and Rav Yosef says: </b> The elders of Israel mentioned in that verse were <b>wicked elders. </b> Perhaps the elders of Israel with whom Ahab consulted were also wicked."
        },
        {
          "verseLocation": "1 Kings 20:35",
          "verseText": "as it is written: “And a certain man of the sons of the prophets said unto his colleague by the word of the Lord: Strike me, please. And the man refused to strike him”",
          "talmudLocation": "Sanhedrin 89b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89b#section-1",
          "talmudFullText": "<b>the colleague of</b> the prophet <b>Micah, </b> son of Imla (see II Chronicles 18:7–8), <b>as it is written: “And a certain man of the sons of the prophets said unto his colleague by the word of YHWH: Strike me, please. And the man refused to strike him”</b> (I Kings 20:35). <b>And it is written: “Then he said to him: Because you have not listened</b> to the voice of YHWH, behold, as soon as you leave me, a lion shall slay you. And as soon as he left from him, a lion found him; and slew him” (I Kings 20:36)."
        },
        {
          "verseLocation": "1 Kings 20:36",
          "verseText": "And it is written: “Then he said to him: Because you have not listened",
          "talmudLocation": "Sanhedrin 89b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89b#section-1",
          "talmudFullText": "<b>the colleague of</b> the prophet <b>Micah, </b> son of Imla (see II Chronicles 18:7–8), <b>as it is written: “And a certain man of the sons of the prophets said unto his colleague by the word of YHWH: Strike me, please. And the man refused to strike him”</b> (I Kings 20:35). <b>And it is written: “Then he said to him: Because you have not listened</b> to the voice of YHWH, behold, as soon as you leave me, a lion shall slay you. And as soon as he left from him, a lion found him; and slew him” (I Kings 20:36)."
        }
      ]
    },
    {
      "chapterNumber": 21,
      "citations": [
        {
          "verseLocation": "1 Kings 21:10",
          "verseText": "“And set two men, base fellows, before him, and let them bear witness against him, saying: You cursed God and the king”",
          "talmudLocation": "Sanhedrin 29a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/29a#section-23",
          "talmudFullText": "The Talmud presents another suggestion: <b>Rather, Rav Ashi said: Natan bar Mar Zutra said to me</b> that <b>we say to them</b> that <b>false witnesses are belittled</b> even <b>by those who hire them, </b> and all the more so by others; <b>as it is written</b> that Jezebel said when she ordered witnesses to be hired to testify against Naboth: <b>“And set two men, base fellows, before him, and let them bear witness against him, saying: You cursed God and the king”</b> (I Kings 21:10). Even Jezebel, who gave the orders to hire them, called them “base fellows. ”"
        },
        {
          "verseLocation": "1 Kings 21:13",
          "verseText": "“Naboth cursed God and the king”",
          "talmudLocation": "Sanhedrin 48b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-10",
          "talmudFullText": "The Talmud raises a difficulty: <b>Granted, according to the one who says</b> that <b>the property of</b> those executed by the king belongs <b>to the king, that is</b> the reason <b>that it is written</b> that Jezebel arranged for witnesses to falsely testify that <b>“Naboth cursed God and the king”</b> (I Kings 21:13). Since Naboth cursed the king, Ahab could execute him and seize his property. <b>But according to the one who says</b> that <b>the property of</b> those executed by the king belongs <b>to</b> their <b>heirs, why do I</b> need the testimony that Naboth cursed the <b>king? </b> It would have sufficed for the witnesses to testify that he cursed God, in which case he would have been executed by the court, and Ahab would have taken possession of the vineyard as his heir."
        },
        {
          "verseLocation": "1 Kings 21:13",
          "verseText": "sacred,",
          "talmudLocation": "Shevuot 35b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/35b#section-12",
          "talmudFullText": "<b>All names that are stated with regard to Naboth</b> are <b>sacred, </b> e.g., in the verse: “Naboth blasphemed <i>Elohim</i> and the king” (I Kings 21:13), and those stated <b>with regard to Micah</b> are <b>non-sacred</b> and are referring to the graven image that he fashioned (see Judges, chapters 17–18). <b>R' Eliezer says: </b> Indeed, all names that are stated <b>with regard to Naboth</b> are <b>sacred; </b> but those stated <b>with regard to Micah, some of them are non-sacred and some of them are sacred. </b> The names beginning with the letters <b><i>alef lamed</i>, </b> i.e., <i>Elohim</i>, are <b>non-sacred, </b> as the reference is to the idol that he crafted, and all the names beginning with the letters <b><i>yod heh</i>, </b> i.e., the Tetragrammaton, are <b>sacred, except for this</b> name that begins with the letters <b><i>alef lamed</i> and it is sacred: “All the time that the house of <i>Elohim</i> was in Shiloh”</b> (Judges 18:31)."
        },
        {
          "verseLocation": "1 Kings 21:18",
          "verseText": "behold he is in the vineyard of Naboth, where he is gone down there to inherit it”",
          "talmudLocation": "Sanhedrin 48b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-8",
          "talmudFullText": "§ <b>A baraita states</b> in a <i>baraita</i>: With regard to <b>those executed by</b> a Jewish <b>king</b> for crimes that they committed against him, <b>their property</b> belongs <b>to the king. </b> As for <b>those executed by the court</b> for a capital transgression, <b>their property</b> belongs <b>to</b> their <b>heirs. R' Yehuda says: Even</b> with regard to <b>those executed by</b> a Jewish <b>king, their property</b> belongs <b>to</b> their <b>heirs. </b> The Rabbis <b>said to R' Yehuda: But isn’t</b> it <b>already stated: </b> “Arise, go down to meet Ahab, king of Israel, who is in Samaria; <b>behold he is in the vineyard of Naboth, where he is gone down there to inherit it”</b> (I Kings 21:18)? The wording of the verse indicates that Ahab went down there by right, proving that the property of those executed by the king legally belongs to the king."
        },
        {
          "verseLocation": "1 Kings 21:19",
          "verseText": "is written: “In the place where the dogs licked the blood of Naboth",
          "talmudLocation": "Sanhedrin 39b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-7",
          "talmudFullText": "Apropos the death of Ahab, the Talmud cites another verse from that passage. The verse states: “And they washed the chariot by the pool of Samaria, and the dogs licked up his blood; <b>and the harlots also washed</b> themselves there, according to the word of YHWH that He spoke” (I Kings 22:38). <b>R' Elazar says: </b> “The harlots [<i>hazzonot</i>]” can be read as visions [<i>ḥezyonot</i>], and the verse means: <b>To cleanse, </b> i.e., to fulfill, <b>two visions, one of Micaiah and one of Elijah. </b> This fulfills a vision <b>of Micaiah, </b> as it <b>is written: “If you return at all in peace, YHWH has not spoken by me”</b> (I Kings 22:28). Once Ahab died, Micaiah’s vision was fulfilled. This also fulfills a vision <b>of Elijah, </b> as it <b>is written: “In the place where the dogs licked the blood of Naboth</b> shall the dogs lick your blood, even yours” (I Kings 21:19)."
        },
        {
          "verseLocation": "1 Kings 21:21",
          "verseText": "a person to urinate alongside the wall of another, as it is written: “And I will cut off from Ahab those who urinate against the wall, and him that is shut up and him that is left at large in Israel”",
          "talmudLocation": "Bava Batra 19b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/19b#section-3",
          "talmudFullText": "§ The Mishnah teaches: <b>And urine</b> must be kept at a distance of <b>three handbreadths from the wall</b> of one’s neighbor. <b>Rabba bar bar Ḥana says: </b> It <b>is permitted</b> for <b>a person to urinate alongside the wall of another, as it is written: “And I will cut off from Ahab those who urinate against the wall, and him that is shut up and him that is left at large in Israel”</b> (I Kings 21:21). As the verse employs the term “those who urinate against the wall” to mean males, it seems that urinating against a wall was a common practice. The Talmud asks: <b>But didn’t we learn</b> in the Mishnah that <b>urine</b> must be kept a distance of <b>three handbreadths from the wall? </b> The Talmud answers: <b>There, </b> the Mishnah is referring to urine <b>that is poured</b> from a chamber pot, as opposed to urine that is passed from the body."
        },
        {
          "verseLocation": "1 Kings 21:21",
          "verseText": "as it is written: “And I will excise from Ahab every man, and him that is shut up and him that is abandoned in Israel”",
          "talmudLocation": "Sanhedrin 102b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-7",
          "talmudFullText": "The Talmud asks: <b>And from where do we</b> derive <b>that</b> Ahab <b>does not enter into the World-to-Come? </b> The Talmud answers: It is derived <b>as it is written: “And I will excise from Ahab every man, and him that is shut up and him that is abandoned in Israel”</b> (I Kings 21:21). <b>“Him that is shut up”</b> indicates he will be excised <b>in this world, </b> while <b>“and him that is abandoned”</b> indicates he will be excised <b>in the World-to-Come. </b>"
        },
        {
          "verseLocation": "1 Kings 21:25",
          "verseText": "anyone who follows the counsel of his wife descends into Gehenna, as it is stated: “But there was none like Ahab,",
          "talmudLocation": "Bava Metzia 59a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/59a#section-6",
          "talmudFullText": "<b>And Rav says: </b> Nevertheless, <b>anyone who follows the counsel of his wife descends into Gehenna, as it is stated: “But there was none like Ahab, </b> who did give himself over to do that which was evil in the sight of YHWH, whom Jezebel his wife incited” (I Kings 21:25). <b>Rav Pappa said to Abaye: But don’t people say</b> a popular proverb: If <b>your wife is short, stoop and whisper to her</b> and consult with her? The Talmud answers: This is <b>not difficult, </b> as <b>this</b> statement of Rav instructs that one not follow her counsel <b>in general matters; and that</b> proverb instructs that one follow her counsel <b>in household matters. </b> The Talmud presents <b>another version</b> of this distinction: <b>This</b> statement of Rav maintains that one should not follow her counsel <b>in divine matters; and that</b> proverb maintains that one should follow her counsel <b>in general matters. </b>"
        },
        {
          "verseLocation": "1 Kings 21:25",
          "verseText": "wrote: “But there was none like Ahab who devoted himself to do evil in the eyes of the Lord, whom Jezebel his wife had incited”",
          "talmudLocation": "Sanhedrin 102b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-14",
          "talmudFullText": "<b>Rav Naḥman says: Ahab was balanced</b> in terms of the mitzvot and transgressions that he performed, <b>as it is stated: “And YHWH said, who shall entice Ahab that he may ascend and fall at Ramoth Gilead? And this one said in this manner, and that one said in that manner”</b> (I Kings 22:20), indicating that it is unclear whether or not he was a full-fledged transgressor. <b>Rav Yosef objects to this</b> statement: This is the person <b>about whom</b> the prophet <b>wrote: “But there was none like Ahab who devoted himself to do evil in the eyes of YHWH, whom Jezebel his wife had incited”</b> (I Kings 21:25). <b>And we learn</b> in a <i>baraita</i>: <b>Every day she would weigh gold shekels</b> equal to Ahab’s weight <b>for idol worship. And you say he was balanced? Rather, Ahab was generous with his money</b> and did not scrimp, <b>and since he</b> also <b>benefited Torah scholars with his property, </b> the heavenly court <b>expiated half</b> his sins <b>for him. </b> The result was a balance between mitzvot and transgressions."
        },
        {
          "verseLocation": "1 Kings 21:29",
          "verseText": "not good for Ahab to be respected in this world, as it is stated: “Because he humbled himself before Me, I will not bring the evil in his days”",
          "talmudLocation": "Yoma 87a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/87a#section-2",
          "talmudFullText": "§ It was further taught: <b>“It is not good to respect the person of the wicked”</b> (Proverbs 18:5), meaning, <b>it is not good for wicked people when they are respected in this world</b> and are not punished for their sins. For example, <b>it</b> was <b>not good for Ahab to be respected in this world, as it is stated: “Because he humbled himself before Me, I will not bring the evil in his days”</b> (I Kings 21:29), and Ahab thereby lost his share in the World-to-Come."
        }
      ]
    },
    {
      "chapterNumber": 22,
      "citations": [
        {
          "verseLocation": "1 Kings 22:4",
          "verseText": "“I am as you are, my people as your people”",
          "talmudLocation": "Chullin 5a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/5a#section-1",
          "talmudFullText": "The Talmud rejects that suggestion: Jehoshaphat <b>would not have separated himself from</b> Ahab to eat and drink by himself, as he relied on him completely. <b>From where do we</b> derive this? <b>If we say</b> that it is derived <b>from</b> that <b>which is written</b> that Jehoshaphat said to Ahab: <b>“I am as you are, my people as your people”</b> (I Kings 22:4), i.e., I am equally reliable, this is difficult, as, <b>if that is so, </b> then when Jehoshaphat said at the conclusion of that verse: <b>“My horses as your horses, ”</b> can this <b>also</b> be referring to reliability? <b>Rather, </b> Jehoshaphat’s intention was: <b>That which will befall your horses will befall my horses; so too, that which will befall you and your people will befall me and my people. </b>"
        },
        {
          "verseLocation": "1 Kings 22:7",
          "verseText": "as it is written: “But Jehoshaphat said: Is there not here besides a prophet of the Lord,",
          "talmudLocation": "Sanhedrin 89a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89a#section-19",
          "talmudFullText": "The Talmud asks: <b>Perhaps</b> Zedekiah, son of Chenaanah, <b>did not know this</b> statement <b>of R' Yitzḥak, </b> and therefore should not have been held responsible? The Talmud answers: <b>Jehoshaphat, </b> king of Judea, <b>was there, and he said to them</b> that they were false prophets, <b>as it is written: “But Jehoshaphat said: Is there not here besides a prophet of YHWH, </b> that we might inquire of him? ” (I Kings 22:7). Ahab <b>said to him: But aren’t there all these</b> prophets here? Why seek others? Jehoshaphat <b>said to</b> Ahab: <b>This is</b> the tradition that <b>I received from the house of the father of my father, </b> the house of David: A prophetic vision relating to <b>one</b> and the same <b>subject matter may appear to several prophets, but two prophets do not prophesy</b> employing <b>one</b> and the same <b>style</b> of expression. They are false prophets, as they employed the same language when stating their prophecy."
        },
        {
          "verseLocation": "1 Kings 22:10",
          "verseText": "from here: “And the king of Israel and Jehoshaphat, king of Judea, sat each on his throne, arrayed in their robes, in a threshing floor, at the entrance of the gate of Samaria”",
          "talmudLocation": "Chullin 5a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/5a#section-2",
          "talmudFullText": "<b>Rather, </b> it is derived that Jehoshaphat relied upon Ahab <b>from here: “And the king of Israel and Jehoshaphat, king of Judea, sat each on his throne, arrayed in their robes, in a threshing floor, at the entrance of the gate of Samaria”</b> (I Kings 22:10). The Talmud asks: <b>What</b> is the meaning of the term <b>threshing floor</b> in this context? <b>If we say</b> that it was <b>an actual threshing floor; is that to say</b> that <b>the gate of Samaria was a threshing floor? </b> Typically, the gate of a city was the place of assembly for the city’s judges and elders, not a threshing floor. <b>Rather, </b> they were sitting in a configuration <b>like</b> that of a circular <b>threshing floor, </b> i.e., facing each other in a display of amity, <b>as we learned</b> in a Mishnah (<i>Sanhedrin</i> 36b): <b>A Sanhedrin was</b> arranged in the same layout <b>as half of a circular threshing floor, so that</b> the judges <b>would see each other. </b> This verse demonstrates that Jehoshaphat deliberated with Ahab and relied on his judgment."
        },
        {
          "verseLocation": "1 Kings 22:11",
          "verseText": "a horn, as it is stated: “And Zedekiah, son of Chenaanah, made himself horns of iron, and said: So says the Lord: With these shall you gore the Arameans,",
          "talmudLocation": "Bava Kamma 2b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/2b#section-4",
          "talmudFullText": "The Talmud elaborates: <b>From where do we</b> derive the primary category of <b>Goring? </b> The source is <b>as A baraita states</b> in a <i>baraita</i>: The verse states: “And <b>if</b> an ox <b>gores</b> a man or a woman” (Exodus 21:28); and <b>goring is</b> performed <b>only</b> with <b>a horn, as it is stated: “And Zedekiah, son of Chenaanah, made himself horns of iron, and said: So says YHWH: With these shall you gore the Arameans, </b> until they are consumed” (I Kings 22:11). <b>And</b> the verse also <b>states: “His firstborn bull, majesty is his, and his horns are the horns of the wild ox; with them he shall gore the nations”</b> (Deuteronomy 33:17)."
        },
        {
          "verseLocation": "1 Kings 22:20",
          "verseText": "as it is stated: “And the Lord said, who shall entice Ahab that he may ascend and fall at Ramoth Gilead? And this one said in this manner, and that one said in that manner”",
          "talmudLocation": "Sanhedrin 102b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-14",
          "talmudFullText": "<b>Rav Naḥman says: Ahab was balanced</b> in terms of the mitzvot and transgressions that he performed, <b>as it is stated: “And YHWH said, who shall entice Ahab that he may ascend and fall at Ramoth Gilead? And this one said in this manner, and that one said in that manner”</b> (I Kings 22:20), indicating that it is unclear whether or not he was a full-fledged transgressor. <b>Rav Yosef objects to this</b> statement: This is the person <b>about whom</b> the prophet <b>wrote: “But there was none like Ahab who devoted himself to do evil in the eyes of YHWH, whom Jezebel his wife had incited”</b> (I Kings 21:25). <b>And we learn</b> in a <i>baraita</i>: <b>Every day she would weigh gold shekels</b> equal to Ahab’s weight <b>for idol worship. And you say he was balanced? Rather, Ahab was generous with his money</b> and did not scrimp, <b>and since he</b> also <b>benefited Torah scholars with his property, </b> the heavenly court <b>expiated half</b> his sins <b>for him. </b> The result was a balance between mitzvot and transgressions."
        },
        {
          "verseLocation": "1 Kings 22:28",
          "verseText": "is written: “If you return at all in peace, the Lord has not spoken by me”",
          "talmudLocation": "Sanhedrin 39b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-7",
          "talmudFullText": "Apropos the death of Ahab, the Talmud cites another verse from that passage. The verse states: “And they washed the chariot by the pool of Samaria, and the dogs licked up his blood; <b>and the harlots also washed</b> themselves there, according to the word of YHWH that He spoke” (I Kings 22:38). <b>R' Elazar says: </b> “The harlots [<i>hazzonot</i>]” can be read as visions [<i>ḥezyonot</i>], and the verse means: <b>To cleanse, </b> i.e., to fulfill, <b>two visions, one of Micaiah and one of Elijah. </b> This fulfills a vision <b>of Micaiah, </b> as it <b>is written: “If you return at all in peace, YHWH has not spoken by me”</b> (I Kings 22:28). Once Ahab died, Micaiah’s vision was fulfilled. This also fulfills a vision <b>of Elijah, </b> as it <b>is written: “In the place where the dogs licked the blood of Naboth</b> shall the dogs lick your blood, even yours” (I Kings 21:19)."
        },
        {
          "verseLocation": "1 Kings 22:34",
          "verseText": "“And a certain man drew a bow offhandedly [ letummo ] and smote",
          "talmudLocation": "Sanhedrin 39b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-9",
          "talmudFullText": "The verse describing the death of Ahab states: <b>“And a certain man drew a bow offhandedly [<i>letummo</i>] and smote</b> the king of Israel” (I Kings 22:34). <b>R' Elazar says: </b> “<i>Letummo</i>” should be understood as <b>offhandedly [<i>lefi tummo</i>], </b> without aiming for Ahab. <b>Rava says: </b> This alludes to the fact that the killing of Ahab served <b>to make whole</b> [<b><i>letammem</i>] two visions, one of Micaiah and one of Elijah. </b>"
        },
        {
          "verseLocation": "1 Kings 22:35",
          "verseText": "as it is written: “And the king was propped up in his chariot facing Aram”",
          "talmudLocation": "Moed Katan 28b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/28b#section-19",
          "talmudFullText": "The <i>baraita</i> continues: <b>Are</b> these <b>matters not</b> inferred <b><i>a fortiori</i>: If, with regard to Ahab, king of Israel, who did</b> only <b>one good thing</b> that is explicitly mentioned in the Bible, <b>as it is written: “And the king was propped up in his chariot facing Aram”</b> (I Kings 22:35), as he did not want the Jewish people to see that he was mortally wounded and flee, and <b>this, </b> that he was greatly mourned, was nevertheless stated about him, then <b>all the more so</b> will <b>the sons of R' Yishmael</b> be greatly mourned."
        },
        {
          "verseLocation": "1 Kings 22:36",
          "verseText": "“And the song went throughout the camp”",
          "talmudLocation": "Sanhedrin 39b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-3",
          "talmudFullText": "§ The Mishnah teaches: <b>Therefore, </b> since all humanity descends from one person, <b>each and every</b> person is obligated to say: The world was created for me. The Mishnah then teaches that the court says to the witnesses: And perhaps you will say: Why would we want to be responsible for the blood of this person? But be aware, as is it not already stated: “When the wicked perish, there is song” (Proverbs 11:10)? The Talmud teaches: A separate verse relates that after the evil king Ahab was killed: <b>“And the song went throughout the camp”</b> (I Kings 22:36). <b>R' Aḥa bar Ḥanina says: </b> The fact that the verse states “the song,” and not a song, indicates that it is referring to a song mentioned elsewhere. Accordingly, the verse: <b>“When the wicked perish, there is song, ”</b> alludes to this episode: <b>When Ahab ben Omri perished, </b> there was <b>song. </b>"
        },
        {
          "verseLocation": "1 Kings 22:38",
          "verseText": "and the harlots also washed",
          "talmudLocation": "Sanhedrin 39b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-7",
          "talmudFullText": "Apropos the death of Ahab, the Talmud cites another verse from that passage. The verse states: “And they washed the chariot by the pool of Samaria, and the dogs licked up his blood; <b>and the harlots also washed</b> themselves there, according to the word of YHWH that He spoke” (I Kings 22:38). <b>R' Elazar says: </b> “The harlots [<i>hazzonot</i>]” can be read as visions [<i>ḥezyonot</i>], and the verse means: <b>To cleanse, </b> i.e., to fulfill, <b>two visions, one of Micaiah and one of Elijah. </b> This fulfills a vision <b>of Micaiah, </b> as it <b>is written: “If you return at all in peace, YHWH has not spoken by me”</b> (I Kings 22:28). Once Ahab died, Micaiah’s vision was fulfilled. This also fulfills a vision <b>of Elijah, </b> as it <b>is written: “In the place where the dogs licked the blood of Naboth</b> shall the dogs lick your blood, even yours” (I Kings 21:19)."
        }
      ]
    }
  ]
}