{
  "bookName": "1 Samuel",
  "totalEntries": 243,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "1 Samuel 1:1",
          "verseText": "“And it came to pass that there was a certain man of Ramathaim”",
          "talmudLocation": "Megillah 10b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-6",
          "talmudFullText": "<b>“And it came to pass [<i>vayhi</i>] as they journeyed from the east”</b> (Genesis 11:2) is followed by: <b>“Come, let us build us a city”</b> (Genesis 11:4), which led to the sin of the Tower of Babel. The Talmud cites further examples: <b>“And it came to pass in the days of Amraphel”</b> (Genesis 14:1), about whom it is stated: <b>“These made war”</b> (Genesis 14:2). Another verse states: <b>“And it came to pass, when Joshua was by Jericho”</b> (Joshua 5:13), it was there that he saw an angel <b>“with his sword drawn in his hand”</b> as a warning. It is written: <b>“And YHWH was [<i>vayhi</i>] with Joshua”</b> (Joshua 6:27), and immediately afterward: <b>“But the children of Israel committed a trespass”</b> (Joshua 7:1). It states: <b>“And it came to pass that there was a certain man of Ramathaim”</b> (I Samuel 1:1), and it mentions shortly afterward Hannah’s inability to conceive: <b>“For he loved Hannah, but YHWH had closed up her womb”</b> (I Samuel 1:5)."
        },
        {
          "verseLocation": "1 Samuel 1:1",
          "verseText": "“And there was a certain [ eḥad ] man from Ramathaim-zophim”",
          "talmudLocation": "Megillah 14a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14a#section-10",
          "talmudFullText": "With regard to the statement that forty-eight prophets and seven prophetesses prophesied on behalf of the Jewish people, the Talmud asks: <b>Is there no one else? Isn’t it written</b> with regard to Samuel’s father, Elkanah: <b>“And there was a certain [<i>eḥad</i>] man from Ramathaim-zophim”</b> (I Samuel 1:1), which is expounded as follows to indicate that Elkanah was a prophet: He was <b>one [<i>eḥad</i>] of two hundred [<i>mata’im</i>] prophets [<i>tzofim</i>] who prophesied on behalf of the Jewish people. </b> If so, why was it stated here that there were only forty-eight prophets?"
        },
        {
          "verseLocation": "1 Samuel 1:3",
          "verseText": "Rabbi Yonatan said: Anyone who says that the sons of Eli sinned is nothing other than mistaken, as it is written: “And the two sons of Eli, Hophni and Pinehas, were there priests of the Lord”",
          "talmudLocation": "Shabbat 55b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55b#section-12",
          "talmudFullText": "<b>R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: Anyone who says that the sons of Eli sinned is nothing other than mistaken, as it is written: “And the two sons of Eli, Hophni and Pinehas, were there priests of YHWH”</b> (I Samuel 1:3)."
        },
        {
          "verseLocation": "1 Samuel 1:5",
          "verseText": "“For he loved Hannah, but the Lord had closed up her womb”",
          "talmudLocation": "Megillah 10b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-6",
          "talmudFullText": "<b>“And it came to pass [<i>vayhi</i>] as they journeyed from the east”</b> (Genesis 11:2) is followed by: <b>“Come, let us build us a city”</b> (Genesis 11:4), which led to the sin of the Tower of Babel. The Talmud cites further examples: <b>“And it came to pass in the days of Amraphel”</b> (Genesis 14:1), about whom it is stated: <b>“These made war”</b> (Genesis 14:2). Another verse states: <b>“And it came to pass, when Joshua was by Jericho”</b> (Joshua 5:13), it was there that he saw an angel <b>“with his sword drawn in his hand”</b> as a warning. It is written: <b>“And YHWH was [<i>vayhi</i>] with Joshua”</b> (Joshua 6:27), and immediately afterward: <b>“But the children of Israel committed a trespass”</b> (Joshua 7:1). It states: <b>“And it came to pass that there was a certain man of Ramathaim”</b> (I Samuel 1:1), and it mentions shortly afterward Hannah’s inability to conceive: <b>“For he loved Hannah, but YHWH had closed up her womb”</b> (I Samuel 1:5)."
        },
        {
          "verseLocation": "1 Samuel 1:6",
          "verseText": "Peninnah, as it is written: “And her rival wife also provoked her sore, to make her fret”",
          "talmudLocation": "Bava Batra 16a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-9",
          "talmudFullText": "<b>R' Levi says: </b> Both <b>Satan, </b> who brought accusations against Job, <b>and Peninnah, </b> who tormented Hannah, mother of Samuel the prophet, acted with <b>intent</b> that was <b>for the sake of Heaven. </b> As for <b>Satan, when he saw that God inclined to</b> favor <b>Job</b> and praised him, <b>he said: Heaven forbid that He should forget the love of Abraham. </b> With regard to <b>Peninnah, as it is written: “And her rival wife also provoked her sore, to make her fret”</b> (I Samuel 1:6), i.e., Peninnah upset Hannah in order to motivate her to pray. <b>Rav Aḥa bar Ya’akov taught</b> this <b>in Paphunya, </b> and <b>Satan came and kissed his feet</b> in gratitude for speaking positively about him."
        },
        {
          "verseLocation": "1 Samuel 1:9",
          "verseText": "that one does not allot wines for a woman? As it is stated: “So Hannah rose up after she had eaten in Shiloh and after he had drunk”",
          "talmudLocation": "Ketubot 65a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/65a#section-2",
          "talmudFullText": "<b>R' Yehuda of the village of Neviraya, and some say of the village of Nefor Ḥayil, interpreted</b> a verse: <b>From where</b> is it derived <b>that one does not allot wines for a woman? As it is stated: “So Hannah rose up after she had eaten in Shiloh and after he had drunk”</b> (I Samuel 1:9). It states: <b>“He had drunk, ” and not: She had drunk. </b> This teaches that although she ate, she did not drink wine."
        },
        {
          "verseLocation": "1 Samuel 1:10",
          "verseText": "as the verse states: “And she felt bitterness of soul,",
          "talmudLocation": "Berakhot 30b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/30b#section-15",
          "talmudFullText": "<strong>Talmud: </strong> We learned in the Mishnah that prayer should be undertaken in an atmosphere of gravity. The Talmud asks: <b>From where are these matters</b> derived? R' Elazar said: They are derived from the verses describing the prayer of Hannah, mother of Samuel, <b>as the verse states: “And she felt bitterness of soul, </b> and she prayed to YHWH and she wept and wept” (I Samuel 1:10)."
        },
        {
          "verseLocation": "1 Samuel 1:11",
          "verseText": "not forget Your maidservant and will give Your maidservant”",
          "talmudLocation": "Berakhot 31b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31b#section-14",
          "talmudFullText": "In the oath/prayer uttered by Hannah, she refers to herself as “Your servant” [<i>amatekha</i>] three times: <b>“The affliction of Your female slave…</b>and <b>not forget Your female slave and will give Your female slave”</b> (I Samuel 1:11)."
        },
        {
          "verseLocation": "1 Samuel 1:11",
          "verseText": "“And she swore an oath and said, Lord of Hosts [ Tzeva’ot ]",
          "talmudLocation": "Berakhot 31b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31b#section-6",
          "talmudFullText": "Incidental to this discussion of Hannah’s prayer, the Talmud explores related topics. In her prayer, Hannah said: <b>“And she swore an oath and said, Lord of Hosts [<i>Tzeva’ot</i>]</b> if You will indeed look upon the affliction of Your female slave and remember me, and not forget Your female slave and will give Your female slave a male child, I will give him to YHWH all the days of his life, and there shall be no razor come upon his head” (I Samuel 1:11). <b>R' Elazar said: From the day that God created His world, there was no person who called God Lord of Hosts until Hannah came and called Him Lord of Hosts. </b> This is the first time in the Bible that God is referred to by this name."
        },
        {
          "verseLocation": "1 Samuel 1:11",
          "verseText": "“And no mora shall come upon his head”",
          "talmudLocation": "Nazir 66a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/66a#section-10",
          "talmudFullText": "<strong>Mishnah: </strong> The tractate concludes with an aggadic statement about nazirites. <b>Samuel</b> the prophet <b>was a nazirite, in accordance with the statement of R' Nehorai, as it was stated</b> that when Hannah, his mother, prayed for a son, she vowed: <b>“And no <i>mora</i> shall come upon his head”</b> (I Samuel 1:11). How is it derived that <i>mora</i> is an expression of naziriteship? <b>It is stated with regard to Samson: “And</b> no <b>razor [<i>mora</i>]</b> shall come upon his head, for the child shall be a nazirite to God” (Judges 13:5), <b>and it is stated: “And</b> no <b><i>mora</i>, ” with regard to Samuel. Just as</b> the term <b>“<i>mora</i>” that is stated with regard to Samson</b> means that he was <b>a nazirite, so too</b> the term <b>“<i>mora</i>” that is stated with regard to Samuel</b> indicates that he was <b>a nazirite. </b>"
        },
        {
          "verseLocation": "1 Samuel 1:13",
          "verseText": "and her voice could not be heard”",
          "talmudLocation": "Berakhot 31a:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31a#section-24",
          "talmudFullText": "Furthermore, <b>I might have</b> thought <b>that one may make his voice heard in his</b> <i>Amida</i> <b>prayer; it has already been articulated by Hannah</b> in her prayer, <b>as it is stated: </b> “And Hannah spoke in her heart, only her lips moved <b>and her voice could not be heard”</b> (I Samuel 1:13)."
        },
        {
          "verseLocation": "1 Samuel 1:13",
          "verseText": "of Hannah?",
          "talmudLocation": "Berakhot 31a:27",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31a#section-27",
          "talmudFullText": "<b>Rav Hamnuna said: How many significant</b> <i>halakhot</i> <b>can be derived from these verses</b> of the prayer <b>of Hannah? </b> As it says: “And Hannah spoke in her heart, only her lips moved and her voice could not be heard, so Eli thought her to be drunk” (I Samuel 1:13). The Talmud elaborates: <b>From</b> that which is stated <b>here: “And Hannah spoke in her heart, ”</b> the <i>halakha</i> that <b>one who prays must focus his heart</b> on his prayer is derived. And <b>from</b> that which is stated <b>here: “Only her lips moved, ”</b> the <i>halakha</i> that <b>one who prays must enunciate</b> the words <b>with his lips, </b> not only contemplate them in his heart, is derived. <b>From</b> that which is written <b>here: “And her voice could not be heard, ”</b> the <i>halakha</i> that <b>one is forbidden to raise his voice in his</b> <i>Amida</i> <b>prayer</b> as it must be recited silently. <b>From</b> the continuation of the verse <b>here: “So Eli thought her to be drunk, ”</b> the <i>halakha</i> that <b>a drunk person is forbidden to pray. </b> That is why he rebuked her."
        },
        {
          "verseLocation": "1 Samuel 1:13",
          "verseText": "akin to the way that Hannah spoke in her prayer, as it is stated: “Now Hannah spoke in her heart;",
          "talmudLocation": "Yoma 73a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/73a#section-18",
          "talmudFullText": "<b>One does not ask in a</b> loud <b>voice, as it is stated: “And</b> he shall stand before Elazar the priest, <b>who shall inquire for him</b> by the judgment of the <i>Urim</i>” (Numbers 27:21), which implies that the inquiry is to be audible only to the person asking. <b>And he should not think</b> his question <b>in his heart</b> but should enunciate it, <b>as it is stated: “And…who shall inquire for him</b> by the judgment of the <i>Urim</i> <b>before God”</b> (Numbers 27:21), and immediately afterward it states: “By his mouth” (Numbers 27:21). <b>Rather, </b> how shall he inquire? He should do so <b>akin to the way that Hannah spoke in her prayer, as it is stated: “Now Hannah spoke in her heart; </b> only her lips moved, but her voice could not be heard” (I Samuel 1:13), which indicates she did enunciate the words but spoke so quietly that no one else could hear."
        },
        {
          "verseLocation": "1 Samuel 1:14",
          "verseText": "“And Eli said to her: How long will you remain drunk?",
          "talmudLocation": "Berakhot 31a:28",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31a#section-28",
          "talmudFullText": "On the subject of Eli’s rebuke of Hannah, as it is stated: <b>“And Eli said to her: How long will you remain drunk? </b> Remove your wine from yourself” (I Samuel 1:14); <b>R' Elazar said: From here</b> the <i>halakha</i> that <b>one who sees in another</b>"
        },
        {
          "verseLocation": "1 Samuel 1:15",
          "verseText": "“And Hannah answered and she said no, my master,",
          "talmudLocation": "Berakhot 31b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31b#section-1",
          "talmudFullText": "<b>an unseemly matter, he must reprimand him, </b> is derived. <b>“And Hannah answered and she said no, my master, </b> I am a woman of sorrowful spirit, and I have drunk neither wine nor liquor, but I pour out my soul before YHWH” (I Samuel 1:15). Regarding the words: “No, my master,” <b>Ulla, and some say R' Yosei ben Ḥanina, said</b> that <b>she said to him, </b> in an allusion: <b>With regard to this matter, you are not a master, and the Holy Spirit does not rest upon you, as you</b> falsely <b>suspect me of this. </b>"
        },
        {
          "verseLocation": "1 Samuel 1:16",
          "verseText": "“Do not take your maidservant as a wicked woman [ bat beliya’al ]",
          "talmudLocation": "Berakhot 31b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31b#section-4",
          "talmudFullText": "<b>“Do not take your female slave as a wicked woman [<i>bat beliya’al</i>]</b> for out of the abundance of my complaint and anger have I spoken until now” (I Samuel 1:16). <b>R' Elazar said: From here</b> the <i>halakha</i> <b>that when a drunk person prays it is as if he engaged in idol worship</b> is derived as <b>it is written here</b> that Hannah, suspected of praying while drunk, defends herself and says: “Do not take your female slave <b>as a <i>bat beliya’al</i>”; </b> and <b>it is written there, </b> with regard to a city that has been instigated to engage in idol worship: <b>“<i>Benei beliya’al</i> have gone out from your midst</b> and have lured the inhabitants of their city, saying let us go and serve other gods which we have not known” (Deuteronomy 13:14). By means of this verbal analogy it is derived: <b>Just as there, </b> in the case of the idolatrous city, the term <i>beliya’al</i> indicates <b>idol worship, so too here, </b> in the case of one who prays drunk, <i>beliya’al</i> indicates <b>idol worship. </b>"
        },
        {
          "verseLocation": "1 Samuel 1:17",
          "verseText": "“And Eli answered and said: May you go in peace”",
          "talmudLocation": "Berakhot 31b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31b#section-5",
          "talmudFullText": "The verse continues: <b>“And Eli answered and said: May you go in peace”</b> (I Samuel 1:17). <b>R' Elazar said: From here</b> the <i>halakha</i> is derived <b>that one who suspects another of something that he has not</b> done, <b>he must appease him. Moreover, </b> the one who suspected him <b>must bless him, </b> as Eli continued and offered Hannah a blessing, <b>as it is stated: “And may the God of Israel grant your request</b> that you have asked of Him” (I Samuel 1:17)."
        },
        {
          "verseLocation": "1 Samuel 1:19",
          "verseText": "conjugal relations? As it is stated: “And they rose up in the morning early, and worshipped before the Lord, and returned, and came to their house to Ramah; and Elkanah knew Hannah his wife; and the Lord remembered her”",
          "talmudLocation": "Ketubot 65a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/65a#section-8",
          "talmudFullText": "The Talmud raises a difficulty: <b>But</b> the case of <b>Hannah was</b> one <b>in which her husband was with her, </b> and yet this episode is cited as a source for the <i>halakha</i> that a woman should not drink wine. The Talmud answers: The case of <b>a guest is different, as Rav Huna said: From where</b> is it derived <b>that a guest is prohibited from</b> engaging in <b>sex? As it is stated: “And they rose up in the morning early, and worshipped before YHWH, and returned, and came to their house to Ramah; and Elkanah knew Hannah his wife; and YHWH remembered her”</b> (I Samuel 1:19). This verse indicates that <b>now, </b> after they returned home, <b>yes, </b> they engaged in sex; <b>at the outset, </b> when they were still in Shiloh, <b>no, </b> they did not. Therefore, Hannah did not drink wine in Shiloh."
        },
        {
          "verseLocation": "1 Samuel 1:19",
          "verseText": "and it is written about Hannah: “And the Lord remembered her”",
          "talmudLocation": "Rosh Hashanah 11a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/11a#section-16",
          "talmudFullText": "It was taught in the <i>baraita</i>: <b>On Rosh HaShana, Sarah, Rachel, and Hannah were revisited</b> by God and conceived children. The Talmud asks: <b>From where do we</b> derive this? <b>R' Elazar said: </b> This <b>is derived</b> by means of a verbal analogy between one instance of the term <b>revisiting [<i>pekida</i>]</b> and another instance of the term <b>revisiting, </b> and by means of a verbal analogy between one instance of the term <b>remembering [<i>zekhira</i>]</b> and another instance of the word <b>remembering. It is written about Rachel: “And God remembered Rachel”</b> (Genesis 30:22), <b>and it is written about Hannah: “And YHWH remembered her”</b> (I Samuel 1:19). <b>And</b> the meaning of these instances of the term <b>remembering</b> is <b>derived</b> from another instance of the term <b>remembering, with regard to Rosh HaShana, as it is written: “A solemn rest, memorial proclaimed with the blast</b> of a <i>shofar</i>” (Leviticus 23:24). From here it is derived that Rachel and Hannah were remembered by God on Rosh HaShana."
        },
        {
          "verseLocation": "1 Samuel 1:20",
          "verseText": "“And it came to pass, when the seasons of the days had come, that Hannah conceived, and bore a son”",
          "talmudLocation": "Niddah 38b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/38b#section-3",
          "talmudFullText": "<b>Mar Zutra says: Even according to the one who said, </b> e.g., Shmuel and the early generations of pious men, that a woman <b>who gives birth at nine</b> months <b>does not give birth after an incomplete</b> number of months, i.e., she carries for a full nine months, nevertheless, a woman <b>who gives birth at seven months can give birth after an incomplete</b> number of months. <b>As it is stated</b> with regard to the birth of Samuel: <b>“And it came to pass, when the seasons of the days had come, that Hannah conceived, and bore a son”</b> (I Samuel 1:20). <b>The minimal</b> number of <b>“seasons”</b> is <b>two, </b> and as each season of the year is three months, this amounts to six months. And <b>the minimal</b> number of <b>“days” is two. </b> If so, Samuel was born in the 7th month of Hannah’s pregnancy."
        },
        {
          "verseLocation": "1 Samuel 1:20",
          "verseText": "“And it came to pass after cycles of days",
          "talmudLocation": "Rosh Hashanah 11a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/11a#section-15",
          "talmudFullText": "<b>Mar Zutra said: Even according to the one who said</b> that if a woman <b>gives birth</b> to a viable baby <b>in</b> her <b>9th</b> month, <b>she cannot give birth prematurely, </b> and if she does not complete nine full months’ gestation the baby will not survive, nevertheless, <b>if</b> a woman <b>gives birth in</b> her <b>7th</b> month, <b>she may give birth early, </b> before the 7th month is complete. <b>As it is stated</b> about the birth of Samuel: <b>“And it came to pass after cycles of days</b> that Hannah conceived and bore a son” (I Samuel 1:20), which is understood as follows: <b>The minimum of “cycles, ”</b> seasons of three months, <b>is two, and the minimum of “days” is two. </b> Consequently, it is possible for a woman to give birth after a pregnancy of six months and two days."
        },
        {
          "verseLocation": "1 Samuel 1:20",
          "verseText": "as it is stated: “And it came to pass, when the seasons of the days had come,",
          "talmudLocation": "Yevamot 42a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/42a#section-18",
          "talmudFullText": "This fact is derived from the verse concerning the birth of Samuel the prophet, <b>as it is stated: “And it came to pass, when the seasons of the days had come, </b> that Hannah conceived, and bore a son” (I Samuel 1:20). How much time is indicated by the phrase “the seasons of the days”? <b>The minimal sense of</b> the word <b>“seasons” is two, </b> and since each season of the year is three months, that indicates six months. <b>The minimal sense of</b> the word <b>“days” is two. </b> Accordingly, one may conclude that Samuel the prophet was born after six months and two days."
        },
        {
          "verseLocation": "1 Samuel 1:22",
          "verseText": "“But Hanna did not ascend, for she said to her husband: Until the child is weaned, when I will bring him”",
          "talmudLocation": "Chagigah 6a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/6a#section-3",
          "talmudFullText": "It is taught in a <i>baraita</i> that <b>R'</b> Yehuda HaNasi <b>responded in place of Beit Hillel, </b> that <b>according to the statement of Beit Shammai</b> that a child who is unable to ride on his father’s shoulders is not obligated in the mitzva of appearance, they must explain a verse that deals with Hanna, Samuel’s mother: <b>“But Hanna did not ascend, for she said to her husband: Until the child is weaned, when I will bring him”</b> (I Samuel 1:22). <b>But Samuel was able to ride on his father’s shoulders. </b> The age of weaning is twenty-four months, before which Samuel was already old enough to ride on his father’s shoulders, and yet he was not ready to ascend to the Tabernacle. This shows that only a child who is able to walk on his own is obligated in the mitzva of appearance."
        },
        {
          "verseLocation": "1 Samuel 1:24",
          "verseText": "“And she brought him to the house of the Lord in Shiloh”",
          "talmudLocation": "Zevachim 118a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/118a#section-13",
          "talmudFullText": "§ The Mishnah teaches that when <b>they arrived at Shiloh, </b> private altars were prohibited. There was no roof of wood or stone in the Tabernacle in Shiloh; there was only a building of stone below, and the curtains of the roof of the Tabernacle were spread above it. The Talmud asks: <b>From where are these matters</b> derived? <b>R' Ḥiyya bar Abba says</b> that <b>R' Yoḥanan says: One verse states, </b> with regard to Hannah bringing Samuel to the Tabernacle: <b>“And she brought him to the house of YHWH in Shiloh”</b> (I Samuel 1:24), <b>and one verse states: “And He forsook the Tabernacle of Shiloh, the tent that He had made to dwell among men”</b> (Psalms 78:60). <b>And</b> in addition, <b>it is written: “Moreover he abhorred the tent of Joseph and chose not the tribe of Ephraim”</b> (Psalms 78:67)."
        },
        {
          "verseLocation": "1 Samuel 1:25",
          "verseText": "as it is stated: “And they slaughtered the cow and they brought the youth to Eli”",
          "talmudLocation": "Berakhot 31b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31b#section-20",
          "talmudFullText": "Additionally, Hannah’s emphasis in speaking to Eli, <b>“for this youth I prayed”</b> (I Samuel 1:27), indicates that she came to protect him from danger. As <b>R' Elazar said: Samuel was</b> one who <b>taught <i>halakha</i> in the presence of his teacher. </b> Hannah wanted to pray that he not be punished by death at the hand of Heaven for his transgression, <b>as it is stated: “And they slaughtered the cow and they brought the youth to Eli”</b> (I Samuel 1:25). This verse is puzzling. <b>Because they slaughtered the cow, </b> therefore, <b>they brought the youth to Eli? </b> What does one have to do with the next?"
        },
        {
          "verseLocation": "1 Samuel 1:26",
          "verseText": "I am the woman who stood here with you",
          "talmudLocation": "Berakhot 31b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31b#section-19",
          "talmudFullText": "When Hannah came to the Temple with her son Samuel, she told Eli: “My lord, as your soul lives, my lord, <b>I am the woman who stood here with you</b> to pray to YHWH” (I Samuel 1:26). <b>R' Yehoshua ben Levi said: From here</b> the <i>halakha</i> <b>that it is forbidden to sit within four cubits of</b> one who is <b>praying</b> is derived. As the verse says: “Who stood here with you,” indicating that Eli stood alongside Hannah because she was praying."
        },
        {
          "verseLocation": "1 Samuel 1:27",
          "verseText": "“for this youth I prayed”",
          "talmudLocation": "Berakhot 31b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31b#section-20",
          "talmudFullText": "Additionally, Hannah’s emphasis in speaking to Eli, <b>“for this youth I prayed”</b> (I Samuel 1:27), indicates that she came to protect him from danger. As <b>R' Elazar said: Samuel was</b> one who <b>taught <i>halakha</i> in the presence of his teacher. </b> Hannah wanted to pray that he not be punished by death at the hand of Heaven for his transgression, <b>as it is stated: “And they slaughtered the cow and they brought the youth to Eli”</b> (I Samuel 1:25). This verse is puzzling. <b>Because they slaughtered the cow, </b> therefore, <b>they brought the youth to Eli? </b> What does one have to do with the next?"
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "1 Samuel 2:1",
          "verseText": "“My horn is exalted in my God”",
          "talmudLocation": "Horayot 12a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/12a#section-14",
          "talmudFullText": "Apropos good omens for anointing, it is stated in the prayer of Hannah, Samuel’s mother: <b>“My horn is exalted in my God”</b> (I Samuel 2:1). The Talmud infers: <b>My horn is exalted, and my jug is not exalted. David and Solomon were anointed with</b> oil from <b>a horn. </b> This was a good omen for them and <b>their reign endured. Saul and Jehu were anointed with</b> oil from <b>a jug and their reign did not endure. </b>"
        },
        {
          "verseLocation": "1 Samuel 2:1",
          "verseText": "“And Hannah prayed and said: My heart exults in the Lord, my horn is exalted",
          "talmudLocation": "Keritot 6a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/6a#section-5",
          "talmudFullText": "The Talmud further discusses the issue of anointing and good omens. Hannah said in her prayer after her son Samuel was born: <b>“And Hannah prayed and said: My heart exults in YHWH, my horn is exalted</b> in YHWH” (I Samuel 2:1). The Talmud notes that Hannah said: <b>“My horn is exalted, ” and</b> she did <b>not</b> say: <b>My jug is exalted. </b> With regard to <b>David and Solomon, who were anointed with</b> oil from <b>a horn, </b> this was a good omen for them, and <b>their kingships lasted. </b> But with regard to <b>Saul and Jehu, who were anointed</b> with oil <b>from a jug, their kingships did not last. </b>"
        },
        {
          "verseLocation": "1 Samuel 2:1",
          "verseText": "as it is written: “And Hannah prayed and said, My heart rejoices in the Lord, my horn is exalted in the Lord”",
          "talmudLocation": "Megillah 14a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14a#section-18",
          "talmudFullText": "<b>Hannah</b> was a prophetess, <b>as it is written: “And Hannah prayed and said, My heart rejoices in YHWH, my horn is exalted in YHWH”</b> (I Samuel 2:1), and her words were prophecy, in that she said: <b>“My horn is exalted, ” and not: My pitcher is exalted. </b> As, with regard to <b>David and Solomon, who were anointed</b> with oil <b>from a horn, their kingship continued, </b> whereas with regard to <b>Saul and Jehu, who were anointed</b> with oil <b>from a pitcher, their kingship did not continue. </b> This demonstrates that Hannah was a prophetess, as she prophesied that only those anointed with oil from a horn will merit that their kingships continue."
        },
        {
          "verseLocation": "1 Samuel 2:1",
          "verseText": "“Neither is there any rock [ tzur ] like our God”",
          "talmudLocation": "Megillah 14a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14a#section-20",
          "talmudFullText": "Hannah further said: <b>“Neither is there any rock [<i>tzur</i>] like our God”</b> (I Samuel 2:1). This can be understood as saying that <b>there is no artist [<i>tzayyar</i>] like our God. </b> How is He better than all other artists? <b>Man fashions a form upon a wall, but is unable to endow it with breath and a soul, </b> or fill it with <b>innards and intestines, whereas God fashions a form</b> of a fetus <b>inside the form</b> of its mother, rather than on a flat surface, <b>and endows it with breath and a soul</b> and fills it with <b>innards and intestines. </b>"
        },
        {
          "verseLocation": "1 Samuel 2:2",
          "verseText": "“There is none holy like the Lord, for there is none like You, and there is no Rock like our God”",
          "talmudLocation": "Berakhot 10a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10a#section-21",
          "talmudFullText": "Other interpretations of this verse exist. The Talmud relates how <b>Rav Shimi bar Ukva, and some say Mar Ukva, would regularly</b> study <b>before R' Shimon ben Pazi, </b> who was well versed in <i>aggada</i> and <b>would arrange the <i>aggada</i> before R' Yehoshua ben Levi. </b> <b>Once, R' Shimon ben Pazi <b>said to him: What is</b> the meaning of <b>that which is written: “Bless YHWH, my soul, and all that is within me bless His Holy name”? </b> <br>Rav Shimi bar Ukva <b>said to</b> R' Shimon ben Pazi: <b>Come and see that the attribute of God is not like the attribute of flesh and blood, </b> as this verse praises the formation of man in his mother’s womb. <b>The attribute of flesh and blood is</b> such that he <b>shapes a form on the wall</b> for all to see, yet <b>he cannot instill it with a spirit and soul, bowels and intestines. </b> While <b>God is not so, </b> as God <b>shapes one form within another form, </b> a child in its mother’s womb, <b>and instills it with spirit and soul, bowels and intestines. And this is</b> the explanation of <b>what Hannah said</b> with regard to the birth of Samuel: <b>“There is none holy like YHWH, for there is none like You, and there is no Rock like our God”</b> (I Samuel 2:2)."
        },
        {
          "verseLocation": "1 Samuel 2:2",
          "verseText": "“There is none sacred as the Lord; for there is none beside You [ biltekha ]”",
          "talmudLocation": "Megillah 14a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14a#section-19",
          "talmudFullText": "Apropos the song of Hannah, the Talmud further explains her words: <b>“There is none sacred as YHWH; for there is none beside You [<i>biltekha</i>]”</b> (I Samuel 2:2). <b>Rav Yehuda bar Menashya said: Do not read</b> it as <b><i>biltekha</i>, </b> “beside You,” <b>but rather</b> read it as <b><i>levalotekha</i>, </b> to outlast You. <b>As the attribute of God is unlike the attribute of flesh and blood. </b> It is an attribute of man that <b>his handiwork outlasts him</b> and continues to exist even after he dies, <b>but God outlasts His handiwork, </b> as He exists eternally."
        },
        {
          "verseLocation": "1 Samuel 2:3",
          "verseText": "as it is stated: “For God of knowledge is the Lord”",
          "talmudLocation": "Berakhot 33a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/33a#section-19",
          "talmudFullText": "<b>And Rav Ami said</b> in praise of knowledge: <b>Great is knowledge that was placed between two letters, </b> two names of God, <b>as it is stated: “For God of knowledge is YHWH”</b> (I Samuel 2:3). <b>And</b> since knowledge is regarded so highly, <b>anyone without knowledge, it is forbidden to have compassion upon him, as it is stated: “For they are a people of no wisdom, so their Creator will have no compassion upon them</b> and their Creator will not be gracious unto them” (Isaiah 27:11). If God shows no mercy for those who lack wisdom, all the more so should people refrain from doing so."
        },
        {
          "verseLocation": "1 Samuel 2:3",
          "verseText": "as it is stated: “For a God of knowledge is the Lord”",
          "talmudLocation": "Sanhedrin 92a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92a#section-7",
          "talmudFullText": "The Talmud proceeds to cite additional statements of R' Elazar relating to recommended conduct. <b>And R' Elazar says: Great is knowledge, as it was placed between two letters, </b> two names of God, <b>as it is stated: “For a God of knowledge is YHWH”</b> (I Samuel 2:3)."
        },
        {
          "verseLocation": "1 Samuel 2:3",
          "verseText": "“To know”; as it is written: “For the Lord is a God of knowledge”",
          "talmudLocation": "Sotah 11a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11a#section-5",
          "talmudFullText": "With regard to Miriam’s deed the verse states: <b>“And his sister stood afar off, </b> to know what would be done to him” (Exodus 2:4). <b>R' Yitzḥak says: This entire verse is stated in reference to the Shekhina, </b> i.e., each phrase alludes to the Shekhina watching over Moses. <b>“And</b> his sister <b>stood”; as it is written: “And YHWH came, and stood”</b> (I Samuel 3:10). <b>“His sister”; as it is written: “Say to wisdom: You are my sister”</b> (Proverbs 7:4). <b>“Afar off”; as it is written: “From afar YHWH appeared to me”</b> (Jeremiah 31:2). <b>“To know”; as it is written: “For YHWH is a God of knowledge”</b> (I Samuel 2:3). <b>“What”; as it is written: “What does YHWH God require of you”</b> (Deuteronomy 10:12). <b>“Would be done”; as it is written: “For YHWH God will do nothing”</b> (Amos 3:7). <b>“To him”; as it is written: “And YHWH said to him: Peace</b> be with you” (Judges 6:23)."
        },
        {
          "verseLocation": "1 Samuel 2:5",
          "verseText": "seventy, as it is written: “Those that were full, have hired themselves out for bread”",
          "talmudLocation": "Megillah 15b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-18",
          "talmudFullText": "<b>And the Rabbis say: Those that begged at</b> other people’s <b>doors</b> numbered <b>seventy, as it is written: “Those that were full, have hired themselves out for bread”</b> (I Samuel 2:5). <b>Do not read it as: “Those that were full” [<i>seve’im</i></b>]; <b>rather, </b> read it as <b>seventy [<i>shivim</i>], </b> indicating that there were seventy who “hired themselves out for bread. ”"
        },
        {
          "verseLocation": "1 Samuel 2:6",
          "verseText": "And about them, Hannah said: “The Lord kills, and gives life; he brings down to the grave, and brings up”",
          "talmudLocation": "Rosh Hashanah 17a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-1",
          "talmudFullText": "<b>and they will cry out</b> in their pain <b>and</b> eventually <b>ascend</b> from there, <b>as it is stated: “And I will bring the 3rd part through the fire, and will refine them as silver is refined, and will try them as gold is tried; they shall call on My name, and I will answer them”</b> (Zechariah 13:9). This is referring to the members of the 3rd group, who require refinement and cleansing. <b>And about them, Hannah said: “YHWH kills, and gives life; he brings down to the grave, and brings up”</b> (I Samuel 2:6)."
        },
        {
          "verseLocation": "1 Samuel 2:6",
          "verseText": "says: “The Lord kills and makes alive; He lowers to the grave, and raises”",
          "talmudLocation": "Sanhedrin 108a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108a#section-4",
          "talmudFullText": "<b>The assembly of Korah is not destined to arise</b> for resurrection, <b>as it is stated: “And the earth closed upon them”</b> (Numbers 16:33), meaning <b>in this world, </b> and also: <b>“And they perished from among the assembly”</b> (Numbers 16:33), meaning <b>in the World-to-Come; </b> this is <b>the statement of R' Akiva. R' Eliezer says: About them</b> the verse <b>says: “YHWH kills and makes alive; He lowers to the grave, and raises”</b> (I Samuel 2:6), indicating that the assembly of Korah has a share in the World-to-Come."
        },
        {
          "verseLocation": "1 Samuel 2:6",
          "verseText": "the verse states: “The Lord kills and makes alive; He lowers to the grave, and raises”",
          "talmudLocation": "Sanhedrin 109b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/109b#section-11",
          "talmudFullText": "The members of <b>the assembly of Korah have no share in the World-to-Come, as it is stated: “And the earth closed upon them”</b> (Numbers 16:33), meaning <b>in this world, </b> and also: <b>“And they perished from among the assembly”</b> (Numbers 16:33), meaning <b>in the World-to-Come; </b> this is <b>the statement of R' Akiva. R' Eliezer says: About</b> the assembly of Korah, <b>the verse states: “YHWH kills and makes alive; He lowers to the grave, and raises”</b> (I Samuel 2:6), indicating that the assembly of Korah has a share in the World-to-Come."
        },
        {
          "verseLocation": "1 Samuel 2:6",
          "verseText": "they recited: “The Lord kills, and gives life; He lowers to the grave and elevates”",
          "talmudLocation": "Sanhedrin 92b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92b#section-3",
          "talmudFullText": "This is <b>as it is taught</b> in a <i>baraita</i>, that <b>R' Eliezer says: The dead that Ezekiel revived stood on their feet and recited song</b> to God <b>and died. And what song did they recite? YHWH kills with justice and gives life with mercy. R' Yehoshua says</b> that it was <b>this song</b> that <b>they recited: “YHWH kills, and gives life; He lowers to the grave and elevates”</b> (I Samuel 2:6). <b>R' Yehuda says: </b> Ezekiel’s depiction of the dry bones that came to life was <b>truth</b> and it <b>was a parable. </b>"
        },
        {
          "verseLocation": "1 Samuel 2:8",
          "verseText": "for the pillars of the earth are the Lord’s, and He has set [ vayyashet ] the world upon them”",
          "talmudLocation": "Sanhedrin 26b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/26b#section-7",
          "talmudFullText": "The Talmud answers: <b>As it is written: </b> “He raises up the poor out of the dust, He lifts up the needy from the dung hill, to make them sit with princes and inherit the throne of glory; <b>for the pillars of the earth are YHWH’s, and He has set [<i>vayyashet</i>] the world upon them”</b> (I Samuel 2:8). Since the righteous are considered the foundations of the world, this verse is interpreted in reference to them. <b>And if you wish, say</b> instead that it is derived <b>from here: “Wonderful is His counsel, and great His wisdom [<i>tushiyya</i>]”</b> (Isaiah 28:29). Accordingly, the wise, righteous people are called <i>shatot</i>."
        },
        {
          "verseLocation": "1 Samuel 2:8",
          "verseText": "As it is stated: “For the pillars of the earth are the Lord’s, and He has set the world upon them”",
          "talmudLocation": "Yoma 38b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/38b#section-13",
          "talmudFullText": "Apropos the righteous, <b>R' Ḥiyya bar Abba said</b> that <b>R' Yoḥanan said: No righteous person departs from this world until another comparable righteous person is created, as it is stated: “And the sun rises and the sun sets”</b> (Ecclesiastes 1:5); before the sun sets the new sun has already risen. <b>Before the sun of Eli was extinguished, the sun of Samuel of Ramah</b> had already <b>shone</b> (see I Samuel, chapter 3), and so on throughout the generations. And <b>R' Ḥiyya bar Abba said</b> that <b>R' Yoḥanan said: God saw that righteous people were few, </b> so <b>He arose and planted</b> some of <b>them in each and every generation</b> to ensure the presence of at least one righteous person in each generation. <b>As it is stated: “For the pillars of the earth are YHWH’s, and He has set the world upon them”</b> (I Samuel 2:8). Since the world rests upon the righteous, each generation requires the presence of a righteous person to provide that support."
        },
        {
          "verseLocation": "1 Samuel 2:9",
          "verseText": "“He will keep the feet of His pious ones”",
          "talmudLocation": "Yoma 38b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/38b#section-14",
          "talmudFullText": "<b>R' Ḥiyya bar Abba said</b> that <b>R' Yoḥanan said: Even for one righteous person the world exists, as it is stated: “But the righteous is the foundation of the world”</b> (Proverbs 10:25). <b>R' Ḥiyya himself said: </b> The proof is <b>from here, </b> as it is stated: <b>“He will keep the feet of His pious ones”</b> (I Samuel 2:9), meaning that God maintains the world due to the pious people. The Talmud questions this proof; <b>“pious ones” indicates many</b> rather than a single righteous person. <b>Rav Naḥman bar Yitzḥak said: </b> Although the text is vocalized in the plural, it <b>is written</b> in the singular: “<b>His pious one”; </b> God maintains the world even for a single pious individual."
        },
        {
          "verseLocation": "1 Samuel 2:9",
          "verseText": "Rabbi Yoḥanan said: Once most of a person’s years have passed and he did not sin, he will never sin, as it is stated: “He will keep the feet of His pious ones”",
          "talmudLocation": "Yoma 38b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/38b#section-15",
          "talmudFullText": "<b>R' Ḥiyya bar Abba said</b> that <b>R' Yoḥanan said: Once most of a person’s years have passed and he did not sin, he will never sin, as it is stated: “He will keep the feet of His pious ones”</b> (I Samuel 2:9). Once a person has established himself as righteous, God will keep him from failing thereafter. In <b>the school of R' Sheila they say: Once</b> the opportunity to perform <b>a sinful act presents itself</b> to a person <b>a first time and a second, and he does not sin, he will never sin, as it is stated: “He will keep the feet of His pious ones”</b> (I Samuel 2:9). Once he has refrained from sin several times, he has established himself as pious and God will protect him thereafter."
        },
        {
          "verseLocation": "1 Samuel 2:10",
          "verseText": "correspond to the nine mentions of God’s name that Hannah said in her prayer",
          "talmudLocation": "Berakhot 29a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/29a#section-11",
          "talmudFullText": "The Talmud asks further: <b>Corresponding to what</b> were <b>these nine</b> blessings <b>of</b> the <b>Rosh HaShana</b> additional prayer instituted? <b>R' Yitzḥak of Kartignin said: </b> They <b>correspond to the nine mentions of God’s name that Hannah said in her prayer</b> (I Samuel 2:10). The connection between Hannah’s prayer and Rosh HaShana is based on what <b>the Master said: On Rosh HaShana, Sarah, Rachel, and Hannah were remembered</b> and the divine decree that they would conceive their sons was issued."
        },
        {
          "verseLocation": "1 Samuel 2:10",
          "verseText": "And about them Hannah said: “The adversaries of the Lord shall be broken in pieces”",
          "talmudLocation": "Rosh Hashanah 17a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-5",
          "talmudFullText": "<b>Gehenna will terminate, but they</b> still <b>will not terminate, as it is stated: “And their form shall wear away the netherworld, so that there be no dwelling for Him”</b> (Psalms 49:15); that is to say, Gehenna itself will be worn away before their punishment has come to an end. <b>And why</b> are they punished <b>so severely? Because they stretched out their hands against</b> God’s <b>dwelling, </b> the Temple, and everything else that is sanctified, <b>as it is stated: “So that there be no dwelling [<i>zevul</i>] for Him. ” Dwelling [<i>zevul</i>] is referring</b> here <b>only to the Temple, as it is stated: “I have built You a house for dwelling [<i>zevul</i>] in”</b> (I Kings 8:13). <b>And about them Hannah said: “The adversaries of YHWH shall be broken in pieces”</b> (I Samuel 2:10)."
        },
        {
          "verseLocation": "1 Samuel 2:12",
          "verseText": "scoundrels;",
          "talmudLocation": "Shabbat 55b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55b#section-19",
          "talmudFullText": "The Talmud raises one last challenge: <b>Isn’t it written: </b> “Now the sons of Eli were <b>scoundrels; </b> they knew not YHWH” (I Samuel 2:12), indicating that they were both sinners. The Talmud answers: <b>Since Pinehas should have protested Hophni’s</b> conduct, <b>but he did not protest, the verse ascribes to him</b> liability <b>as if he</b> too <b>had sinned. </b>"
        },
        {
          "verseLocation": "1 Samuel 2:17",
          "verseText": "“And the sin of the youths was very great”",
          "talmudLocation": "Sanhedrin 58b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/58b#section-20",
          "talmudFullText": "<b>Ze’eiri says</b> that <b>R' Ḥanina says: </b> One who raises his hand to strike another <b>is called a sinner; as it is stated: </b> “And the priest’s lad would come…and would say to him, but you shall give now, <b>and if not, I will take by force”</b> (I Samuel 2:15–16), <b>and it is written</b> with regard to this behavior: <b>“And the sin of the youths was very great”</b> (I Samuel 2:17)."
        },
        {
          "verseLocation": "1 Samuel 2:21",
          "verseText": "revisiting.",
          "talmudLocation": "Rosh Hashanah 11a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/11a#section-17",
          "talmudFullText": "And the meaning of one instance of the term <b>revisiting</b> is derived from another instance of the term <b>revisiting. </b> It is written about Hannah: “And YHWH revisited Hannah” (I Samuel 2:21), and it is written about Sarah: “And YHWH revisited Sarah” (Genesis 21:1). From here it is derived that just as Hannah was revisited on Rosh HaShana, so too, Sarah was revisited on Rosh HaShana."
        },
        {
          "verseLocation": "1 Samuel 2:22",
          "verseText": "how they lay with the women",
          "talmudLocation": "Shabbat 55b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55b#section-13",
          "talmudFullText": "The Talmud explains: R' Yonatan <b>holds in accordance with</b> the opinion of <b>Rav, as Rav said: Pinehas did not sin. </b> And the verse <b>juxtaposes Hophni to Pinehas; just as Pinehas did not sin, so too Hophni did not sin. </b> The Talmud asks: <b>How, </b> then, <b>do I establish</b> the meaning of the verse: “Now Eli was very old, and heard all that his sons did to all Israel; and <b>how they lay with the women</b> that assembled at the door of the Tent of Meeting” (I Samuel 2:22), which indicates otherwise? The Talmud answers: <b>Since</b> the sons of Eli <b>delayed</b> sacrificing <b>the bird-offerings</b> of women who had given birth, a pair of doves brought as part of the purification process, and this delay caused the women <b>not to go to their husbands</b> in timely fashion, <b>the verse ascribes to</b> Hophni and Pinehas liability <b>as if they had lain with them. </b> They were guilty of nothing more than negligence and carelessness."
        },
        {
          "verseLocation": "1 Samuel 2:22",
          "verseText": "forbidden sexual relations, as it is written: “Now Eli was very old and he heard what his sons were doing to all of Israel, how they lay with the women who did service at the opening of the Tent of Meeting”",
          "talmudLocation": "Yoma 9a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/9a#section-6",
          "talmudFullText": "§ Apropos the sins of the High Priests in the Second Temple, the Talmud cites that <b>R' Yoḥanan ben Torta said: Due to what</b> reason <b>was</b> the Tabernacle in <b>Shiloh destroyed</b> in the time of the prophet Samuel? It was destroyed <b>due to</b> the fact <b>that there were two matters</b> that existed <b>in</b> the Tabernacle: <b>Forbidden sexual sex and degradation</b> of <b>consecrated items. </b> There were <b>forbidden sexual sex, as it is written: “Now Eli was very old and he heard what his sons were doing to all of Israel, how they lay with the women who did service at the opening of the Tent of Meeting”</b> (I Samuel 2:22). <b>And although R' Shmuel bar Naḥmani said</b> that <b>R' Yoḥanan said: Anyone who says that the sons of Eli sinned</b> by engaging in forbidden sexual sex <b>is nothing other than mistaken, </b> even according to the alternative interpretation of the verse that it was <b>due to</b> the fact"
        },
        {
          "verseLocation": "1 Samuel 2:24",
          "verseText": "As it is stated: “No, my sons, for it is no good report”",
          "talmudLocation": "Kiddushin 81a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/81a#section-6",
          "talmudFullText": "<b>Rav says: </b> The court <b>flogs</b> one <b>due to</b> his being the subject of <b>a bad rumor, </b> meaning that not only is a person flogged when the facts have been ascertained, but even when he has only reportedly committed transgressions he may be flogged. <b>As it is stated: “No, my sons, for it is no good report”</b> (I Samuel 2:24). When <b>Mar Zutra</b> would flog a person for being the subject of a bad rumor, <b>he would place</b> the <b>bridle</b> of a donkey <b>on</b> the person’s <b>shoulders and recite before him</b> when administering lashes: <b>“No, my sons, </b> for it is no good report,” so that people would know why he was being flogged."
        },
        {
          "verseLocation": "1 Samuel 2:24",
          "verseText": "“No, my sons [ banai ]; for it is not a good report",
          "talmudLocation": "Shabbat 55b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55b#section-17",
          "talmudFullText": "The Talmud asks further: <b>Isn’t it written</b> that Eli said: <b>“No, my sons [<i>banai</i>]; for it is not a good report</b> that I hear; you make YHWH’s people to transgress” (I Samuel 2:24). The fact that Eli referred to his sons in the plural indicates that they both sinned. <b>Rav Naḥman bar Yitzḥak said: It is written</b> in a manner that can be read as <b>my son [<i>beni</i>]</b> in the singular."
        },
        {
          "verseLocation": "1 Samuel 2:25",
          "verseText": "because the Lord desired to kill them”",
          "talmudLocation": "Niddah 70b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/70b#section-4",
          "talmudFullText": "The Talmud details the <b>three matters of <i>aggada</i></b> that the rabbis of Alexandria asked R' Yehoshua. <b>One verse states: “For I have no pleasure in the death of him that dies, </b> says YHWH God; but turn yourselves, and live” (Ezekiel 18:32). <b>And one verse states, </b> with regard to the sons of Eli the High Priest, who did not pay attention to the reproof of their father: “If one man sins against another, God shall judge him; but if a man sins against YHWH, who shall pray for him? But they did not listen to the voice of their father, <b>because YHWH desired to kill them”</b> (I Samuel 2:25). R' Yehoshua replied to them: <b>Here, </b> the verse in Ezekiel is referring to a case <b>where</b> the sinners <b>repent, </b> whereas <b>there, </b> the verse in Samuel is speaking of a case <b>where</b> the sinners <b>do not repent. </b>"
        },
        {
          "verseLocation": "1 Samuel 2:25",
          "verseText": "“But if a man sin against the Lord, who shall entreat [ yitpallel ] for him?”",
          "talmudLocation": "Yoma 87a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/87a#section-10",
          "talmudFullText": "Rav Yosef bar Ḥavu said to him: <b>If so, say</b> the following with regard to <b>the latter clause</b> of the verse: <b>“But if a man sin against YHWH, who shall entreat [<i>yitpallel</i>] for him? ”</b> (I Samuel 2:25). This is difficult, since it has been established that the root <i>pll</i> is interpreted in this verse as indicating judgment, and therefore the latter clause of the verse implies that if one sins toward God there is no one to judge him. R' Abbahu answered him: <b>This is</b> what the verse <b>is saying: If one man sins against another, God [<i>Elohim</i>] shall forgive him [<i>ufilelo</i>]; </b> if the sinner appeases the person against whom he has sinned, he will be forgiven. <b>But if a man sin against YHWH, who shall entreat [<i>yitpallel</i>] for him? Repentance and good deeds. </b> The root <i>pll</i> is to be interpreted as indicating forgiveness rather than judgment."
        },
        {
          "verseLocation": "1 Samuel 2:25",
          "verseText": "Yom Kippur does not atone for sins committed against a fellow person, but isn’t it written: “If one man sin against another, God [ Elohim ] shall judge him [ ufilelo ]”",
          "talmudLocation": "Yoma 87a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/87a#section-9",
          "talmudFullText": "§ It was taught in the Mishnah: Yom Kippur atones for <b>sins committed against God</b> but does not atone for sins committed against another person. <b>Rav Yosef bar Ḥavu raised a contradiction before R' Abbahu: </b> The Mishnah states that <b>Yom Kippur does not atone for sins committed against a fellow person, but isn’t it written: “If one man sin against another, God [<i>Elohim</i>] shall judge him [<i>ufilelo</i>]”</b> (I Samuel 2:25). The word <i>ufilelo</i>, which may also refer to prayer, implies that if he prays, God will grant the sinner forgiveness. He answered him: <b>Who is <i>Elohim</i></b> mentioned in the verse? It is referring to <b>a judge [<i>elohim</i>]</b> and not to God, and the word <i>ufilelo</i> in the verse indicates judgment. Atonement occurs only after justice has been done toward the injured party by means of a court ruling."
        },
        {
          "verseLocation": "1 Samuel 2:27",
          "verseText": "with them, as it is stated: “Did I reveal myself to the house of your father when they were in Egypt?”",
          "talmudLocation": "Megillah 29a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/29a#section-4",
          "talmudFullText": "§ <b>It is taught</b> in a <i>baraita</i>: <b>R' Shimon ben Yoḥai says: Come and see how beloved the Jewish people are before God. As every place they were exiled, the Shekhina</b> went <b>with them. They were exiled to Egypt, </b> and <b>the Shekhina</b> went <b>with them, as it is stated: “Did I reveal myself to the house of your father when they were in Egypt? ”</b> (I Samuel 2:27). <b>They were exiled to Babylonia, </b> and <b>the Shekhina</b> went <b>with them, as it is stated: “For your sake I have sent to Babylonia”</b> (Isaiah 43:14). <b>So too, when, in the future, they will be redeemed, the Shekhina will be with them, as it is stated: “Then YHWH your God will return with your captivity”</b> (Deuteronomy 30:3). <b>It does not state: He will bring back, </b> i.e., He will cause the Jewish people to return, <b>but rather</b> it says: <b>“He will return, ”</b> which <b>teaches that God will return</b> together <b>with them from among the</b> various <b>exiles. </b>"
        },
        {
          "verseLocation": "1 Samuel 2:32",
          "verseText": "“And there shall not be an elder in your house forever”",
          "talmudLocation": "Sanhedrin 14a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/14a#section-9",
          "talmudFullText": "<b>As R' Shmuel bar Naḥman says</b> that <b>R' Yonatan says: From where</b> is it known <b>that there</b> are <b>not</b> to be <b>ordained</b> rabbis <b>from the house of Eli? As it is stated</b> with regard to the house of Eli: <b>“And there shall not be an elder in your house forever”</b> (I Samuel 2:32). The Talmud explains: <b>What</b> is the meaning of <b>“elder”</b> in this verse? <b>If we say</b> it means <b>an actual elder, </b> meaning an old person, <b>but isn’t it</b> already <b>written: “And all those raised in your house shall die young men”</b> (I Samuel 2:33)? <b>Rather, </b> the term “elder” is an honorary term for a Sage, and it means that <b>ordination</b> will not be granted to descendants of the House of Eli."
        },
        {
          "verseLocation": "1 Samuel 2:33",
          "verseText": "from the family of Eli, as it is written about them: “And all the increase of your house shall die young men”",
          "talmudLocation": "Rosh Hashanah 18a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/18a#section-9",
          "talmudFullText": "<b>A baraita states</b> in a <i>baraita</i>: <b>There was a certain family in Jerusalem whose members used to die at the age of eighteen, </b> and they did not know why. <b>They came and told Rabban Yoḥanan ben Zakkai</b> about their situation. <b>He said to them: Perhaps you</b> are descended <b>from the family of Eli, as it is written about them: “And all the increase of your house shall die young men”</b> (I Samuel 2:33). If indeed this is so, the remedy is as follows: <b>Go and engage in Torah</b> study, in the merit of which <b>you will live. They went and engaged in Torah</b> study <b>and lived. And</b> people <b>would call that family</b> afterward <b>by the name of R' Yoḥanan</b> in his honor."
        },
        {
          "verseLocation": "1 Samuel 2:33",
          "verseText": "written: “And all those raised in your house shall die young men”",
          "talmudLocation": "Sanhedrin 14a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/14a#section-9",
          "talmudFullText": "<b>As R' Shmuel bar Naḥman says</b> that <b>R' Yonatan says: From where</b> is it known <b>that there</b> are <b>not</b> to be <b>ordained</b> rabbis <b>from the house of Eli? As it is stated</b> with regard to the house of Eli: <b>“And there shall not be an elder in your house forever”</b> (I Samuel 2:32). The Talmud explains: <b>What</b> is the meaning of <b>“elder”</b> in this verse? <b>If we say</b> it means <b>an actual elder, </b> meaning an old person, <b>but isn’t it</b> already <b>written: “And all those raised in your house shall die young men”</b> (I Samuel 2:33)? <b>Rather, </b> the term “elder” is an honorary term for a Sage, and it means that <b>ordination</b> will not be granted to descendants of the House of Eli."
        },
        {
          "verseLocation": "1 Samuel 2:33",
          "verseText": "He said to them: Perhaps you are from the house of Eli, as it is stated: “All the increase of your house shall die young men”",
          "talmudLocation": "Yevamot 105a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/105a#section-15",
          "talmudFullText": "The Talmud relates a similar story from a <i>baraita</i>: <b>A baraita states: There was a certain family in Jerusalem whose children were dying at around age eighteen. </b> The members of the family <b>came and told Rabban Yoḥanan ben Zakkai</b> about these tragic deaths. <b>He said to them: Perhaps you are from the house of Eli, as it is stated: “All the increase of your house shall die young men”</b> (I Samuel 2:33), which teaches that as soon as they reach full maturity, old enough to be called “men,” they die. Therefore, you must <b>go out and immerse yourselves in Torah, and</b> you will <b>live. They went and immersed themselves in Torah and lived</b> longer lives, <b>and</b> people <b>would call them: The family of Yoḥanan, after his name, </b> as the advice he gave them enabled them to live."
        },
        {
          "verseLocation": "1 Samuel 2:36",
          "verseText": "states: “And he will say: Append me [ sefaḥeni ] please",
          "talmudLocation": "Shevuot 6b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/6b#section-4",
          "talmudFullText": "<b>A baraita states</b> in a <i>baraita</i>: The bright shade of <b>a <i>baheret</i></b> makes it appear <b>deeper</b> than the surrounding skin, <b>and so</b> the verse <b>states: “And its appearance is deeper than the skin”</b> (Leviticus 13:25). This is <b>like the appearance of</b> an area illuminated by the <b>sun, which</b> appears <b>deeper than</b> the area in <b>the shade. </b> The darker shade of <b>a <i>se’et</i></b> makes it appear as though it is raised above the surrounding skin; this is indicated by the fact that the word <b><i>se’et</i></b> means <b>nothing other than raised, and so</b> the verse <b>states: “Upon all the high mountains and upon all the raised up [<i>hanissaot</i>] hills”</b> (Isaiah 2:14). The words <i>hanissaot</i> and <i>se’et</i> share the same Hebrew root and both refer to something raised up. In the verse: “For a <i>se’et</i> and for a <i>sappaḥat</i>” (Leviticus 14:56), the word <b><i>sappaḥat</i></b> means <b>nothing other than secondary, and so</b> the verse <b>states: “And he will say: Append me [<i>sefaḥeni</i>] please</b> to one of the priestly classes to eat a piece of bread” (I Samuel 2:36). This teaches that there is a leprous mark that is secondary and appended to a <i>se’et</i>. This is a mark that is the color of an egg membrane."
        },
        {
          "verseLocation": "1 Samuel 2:36",
          "verseText": "“Put me [ sefaḥeni ], I pray of you, into one of the priests’ offices, that I may eat a morsel of bread”",
          "talmudLocation": "Sotah 5b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/5b#section-1",
          "talmudFullText": "<b>“And for a sore [<i>se’et</i>] and for a scab [<i>sappaḥat</i>]”</b> (Leviticus 14:56), <b>and <i>se’et</i></b> means <b>nothing other</b> than <b>elevated, as it is stated: “And upon all the high mountains, and upon all the hills that are lifted up [<i>nissaot</i>]”</b> (Isaiah 2:14). <b>And <i>sappaḥat</i></b> means <b>nothing other</b> than <b>an appendage, as it is stated</b> in the context of the curse given to the descendants of Eli: <b>“Put me [<i>sefaḥeni</i>], I pray of you, into one of the priests’ offices, that I may eat a morsel of bread”</b> (I Samuel 2:36). They will have to be joined with another priestly family to receive their priestly gifts. One can therefore interpret the verses discussing tzara'at as teaching that one who initially is arrogant, <i>se’et</i>, will eventually become a <i>sappaḥat</i>, diminished in stature."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "1 Samuel 3:3",
          "verseText": "rising, as it is stated: “And the lamp of God was not yet gone out, and Samuel was lying",
          "talmudLocation": "Kiddushin 72b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/72b#section-2",
          "talmudFullText": "The Talmud comments: <b>As the Master said: While R' Akiva was dying, R'</b> Yehuda HaNasi <b>was born; while R'</b> Yehuda HaNasi <b>was dying, Rav Yehuda was born; while Rav Yehuda was dying, Rava was born; while Rava was dying, Rav Ashi was born. </b> This <b>teaches you that a righteous person does not leave the world before an equally righteous person is created, as it is stated: “The sun also rises and the sun also sets”</b> (Ecclesiastes 1:5). The same applies to earlier generations: <b>Before Eli’s sun had gone out, Samuel the Ramathite’s sun was</b> already <b>rising, as it is stated: “And the lamp of God was not yet gone out, and Samuel was lying</b> in the Temple of YHWH” (I Samuel 3:3), which teaches that Samuel was already prophesying in the days of Eli."
        },
        {
          "verseLocation": "1 Samuel 3:3",
          "verseText": "as it is written: “And the lamp of God was not yet gone out, and Samuel was laid down to sleep in the Temple of the Lord”",
          "talmudLocation": "Kiddushin 78b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/78b#section-2",
          "talmudFullText": "Rav Naḥman proceeded to ask: <b>But</b> can <b>a verse be written</b> in <b>this way, </b> addressing two different subjects without any demarcation? Rava <b>said to him: Yes, </b> and there is a similar case, <b>as it is written: “And the lamp of God was not yet gone out, and Samuel was laid down to sleep in the Temple of YHWH”</b> (I Samuel 3:3). If read literally, this verse is puzzling. It apparently states that Samuel was lying in the Sanctuary, <b>but there is</b> a right to <b>sit in the courtyard</b> of the Temple <b>only for the kings of the house of David alone. </b> How then could Samuel be laid down to sleep in the Temple? <b>Rather, </b> the verse should be understood as follows: <b>“And the lamp of God was not yet gone out” in the Temple of YHWH, “and Samuel was laid down” in his place</b> outside the Temple."
        },
        {
          "verseLocation": "1 Samuel 3:9",
          "verseText": "lie down and if He calls you, you say: Speak, Lord, for Your servant is listening”",
          "talmudLocation": "Shabbat 113b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/113b#section-6",
          "talmudFullText": "The Talmud elaborates. <b>Whereas Naomi said to Ruth: “And you shall bathe, and anoint yourself, and put on your robes, and go down to the threshing floor, ” but with regard to</b> Ruth <b>herself it is written, “And she went down to the threshing floor”</b> (Ruth 3:6), <b>and</b> only <b>afterward does it say, “And she did according to all that her mother-in-law commanded her. ”</b> Ruth decided to anoint herself at the threshing floor and not on the road so that people would not meet her on the way there and suspect her of immorality. <b>Whereas Eli said to Samuel: </b> “Go and <b>lie down and if He calls you, you say: Speak, Lord, for Your servant is listening”</b> (I Samuel 3:9), <b>but with regard to</b> Samuel <b>himself it is written: “And YHWH came and stood, and He called like He did the other times: Samuel, Samuel. And Samuel said: Speak, for Your servant is listening”</b> (I Samuel 3:10), <b>and he did not say: Speak, Lord, </b> since he would not assume it was God speaking to him until he was sure of it."
        },
        {
          "verseLocation": "1 Samuel 3:10",
          "verseText": "himself it is written: “And the Lord came and stood, and He called like He did the other times: Samuel, Samuel. And Samuel said: Speak, for Your servant is listening”",
          "talmudLocation": "Shabbat 113b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/113b#section-6",
          "talmudFullText": "The Talmud elaborates. <b>Whereas Naomi said to Ruth: “And you shall bathe, and anoint yourself, and put on your robes, and go down to the threshing floor, ” but with regard to</b> Ruth <b>herself it is written, “And she went down to the threshing floor”</b> (Ruth 3:6), <b>and</b> only <b>afterward does it say, “And she did according to all that her mother-in-law commanded her. ”</b> Ruth decided to anoint herself at the threshing floor and not on the road so that people would not meet her on the way there and suspect her of immorality. <b>Whereas Eli said to Samuel: </b> “Go and <b>lie down and if He calls you, you say: Speak, Lord, for Your servant is listening”</b> (I Samuel 3:9), <b>but with regard to</b> Samuel <b>himself it is written: “And YHWH came and stood, and He called like He did the other times: Samuel, Samuel. And Samuel said: Speak, for Your servant is listening”</b> (I Samuel 3:10), <b>and he did not say: Speak, Lord, </b> since he would not assume it was God speaking to him until he was sure of it."
        },
        {
          "verseLocation": "1 Samuel 3:10",
          "verseText": "stood”; as it is written: “And the Lord came, and stood”",
          "talmudLocation": "Sotah 11a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11a#section-5",
          "talmudFullText": "With regard to Miriam’s deed the verse states: <b>“And his sister stood afar off, </b> to know what would be done to him” (Exodus 2:4). <b>R' Yitzḥak says: This entire verse is stated in reference to the Shekhina, </b> i.e., each phrase alludes to the Shekhina watching over Moses. <b>“And</b> his sister <b>stood”; as it is written: “And YHWH came, and stood”</b> (I Samuel 3:10). <b>“His sister”; as it is written: “Say to wisdom: You are my sister”</b> (Proverbs 7:4). <b>“Afar off”; as it is written: “From afar YHWH appeared to me”</b> (Jeremiah 31:2). <b>“To know”; as it is written: “For YHWH is a God of knowledge”</b> (I Samuel 2:3). <b>“What”; as it is written: “What does YHWH God require of you”</b> (Deuteronomy 10:12). <b>“Would be done”; as it is written: “For YHWH God will do nothing”</b> (Amos 3:7). <b>“To him”; as it is written: “And YHWH said to him: Peace</b> be with you” (Judges 6:23)."
        },
        {
          "verseLocation": "1 Samuel 3:14",
          "verseText": "As it is stated: “And therefore I have sworn to the house of Eli, that the iniquity of Eli’s house will not be purged with sacrifice nor offering forever”",
          "talmudLocation": "Rosh Hashanah 18a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/18a#section-7",
          "talmudFullText": "This is <b>like</b> what <b>Rav Shmuel bar Ami</b> said, <b>as Rav Shmuel bar Ami</b> said, <b>and some say</b> that it was <b>Rav Shmuel bar Naḥmani</b> who <b>said</b> that <b>R' Yonatan said: From where</b> is it derived <b>that a sentence accompanied by</b> God’s <b>oath</b> not to cancel it <b>cannot be torn up</b> or canceled? <b>As it is stated: “And therefore I have sworn to the house of Eli, that the iniquity of Eli’s house will not be purged with sacrifice nor offering forever”</b> (I Samuel 3:14)."
        },
        {
          "verseLocation": "1 Samuel 3:14",
          "verseText": "as it is stated: “Therefore I have sworn unto the house of Eli, that the iniquity of Eli’s house shall not be atoned for with sacrifice nor offering forever”",
          "talmudLocation": "Yevamot 105a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/105a#section-13",
          "talmudFullText": "This is <b>in accordance with the words of Rav Shmuel bar Ami, as Rav Shmuel bar Ami said</b> that <b>R' Yonatan said: From where</b> is it derived <b>that a sentence of judgment accompanied by an oath cannot be torn up? </b> It is <b>as it is stated: “Therefore I have sworn unto the house of Eli, that the iniquity of Eli’s house shall not be atoned for with sacrifice nor offering forever”</b> (I Samuel 3:14), which indicates that due to the accompanying oath, the sentence of judgment cannot ever be rescinded, even if offerings of atonement are brought."
        },
        {
          "verseLocation": "1 Samuel 3:17",
          "verseText": "“Therefore may God do to you, and more also, if you hide any matter from me",
          "talmudLocation": "Makkot 11a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/11a#section-21",
          "talmudFullText": "The Talmud cites a similar statement: <b>R' Abbahu says: </b> With regard to <b>the curse of a Sage, even</b> if it is stated <b>conditionally, it comes</b> to realization. <b>From where do we</b> derive this? It is derived <b>from</b> an incident involving <b>Eli</b> the High Priest, <b>as Eli said to Samuel, </b> after the latter had received a prophetic vision with regard to Eli, that his sons do not follow his path: <b>“Therefore may God do to you, and more also, if you hide any matter from me</b> of all the matters that He spoke unto you” (I Samuel 3:17). <b>And even though it is written</b> immediately thereafter: <b>“And Samuel told him all the matters, and did not hide from him”</b> (I Samuel 3:18), <b>it is written</b> at the time of Samuel’s death: <b>“And his sons did not follow in his ways”</b> (I Samuel 8:3), indicating that God did to Samuel as he prophesied with regard to Eli, and his own sons did not follow his path. Despite the fact that Eli stated the curse conditionally, Samuel was affected by the curse."
        },
        {
          "verseLocation": "1 Samuel 3:18",
          "verseText": "“And Samuel told him all the matters, and did not hide from him”",
          "talmudLocation": "Makkot 11a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/11a#section-21",
          "talmudFullText": "The Talmud cites a similar statement: <b>R' Abbahu says: </b> With regard to <b>the curse of a Sage, even</b> if it is stated <b>conditionally, it comes</b> to realization. <b>From where do we</b> derive this? It is derived <b>from</b> an incident involving <b>Eli</b> the High Priest, <b>as Eli said to Samuel, </b> after the latter had received a prophetic vision with regard to Eli, that his sons do not follow his path: <b>“Therefore may God do to you, and more also, if you hide any matter from me</b> of all the matters that He spoke unto you” (I Samuel 3:17). <b>And even though it is written</b> immediately thereafter: <b>“And Samuel told him all the matters, and did not hide from him”</b> (I Samuel 3:18), <b>it is written</b> at the time of Samuel’s death: <b>“And his sons did not follow in his ways”</b> (I Samuel 8:3), indicating that God did to Samuel as he prophesied with regard to Eli, and his own sons did not follow his path. Despite the fact that Eli stated the curse conditionally, Samuel was affected by the curse."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "1 Samuel 4:17",
          "verseText": "as it is stated: “Israel has fled before the Philistines, and there has been also a great slaughter among the people”",
          "talmudLocation": "Sotah 44b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/44b#section-1",
          "talmudFullText": "<b>because the beginning of fleeing</b> is <b>a downfall</b> on the battlefield, <b>as it is stated: “Israel has fled before the Philistines, and there has been also a great slaughter among the people”</b> (I Samuel 4:17), <b>and</b> likewise <b>it says further on: “And the men of Israel fled from before the Philistines, and fell down slain</b> in Mount Gilboa” (I Samuel 31:1)."
        },
        {
          "verseLocation": "1 Samuel 4:18",
          "verseText": "of Eli,",
          "talmudLocation": "Chullin 21a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/21a#section-7",
          "talmudFullText": "<b>And if you say that</b> the <b>incident</b> of the death <b>of Eli, </b> the High Priest, whose death is described: “And his neck bone broke, and he died” (I Samuel 4:18), <b>was</b> one where the <b>neck bone</b> broke <b>without the majority of</b> the surrounding <b>flesh</b> being cut, and nevertheless he died immediately, the Talmud responds: <b>Old age is different, as it is written: “And it came to pass, when he made mention of the Ark of God, that he fell from off his seat backward by the side of the gate, and his neck broke, and he died; for he was an old man, and heavy; </b> and he had judged Israel forty years” (I Samuel 4:18)."
        },
        {
          "verseLocation": "1 Samuel 4:18",
          "verseText": "“And it came to pass, when he made mention of the Ark of God,",
          "talmudLocation": "Zevachim 118b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/118b#section-19",
          "talmudFullText": "§ The <i>baraita</i> stated that the period of <b>the Tent of Meeting that</b> was <b>in Nov and Gibeon</b> was <b>fifty-seven</b> years. The Talmud asks: <b>From where do we</b> derive this? <b>As it is written</b> in the description of the death of Eli the High Priest, upon being informed that the Ark was captured by the Philistines: <b>“And it came to pass, when he made mention of the Ark of God, </b> that he fell from off his seat backward by the side of the gate, and his neck broke, and he died” (I Samuel 4:18)."
        },
        {
          "verseLocation": "1 Samuel 4:19",
          "verseText": "Rabbi Elazar says: Just as a house has hinges [ tzirim ], so too, a woman has hinges, as it is stated: “And she bowed herself and brought forth, for her pains [ tzireha ] came suddenly upon her”",
          "talmudLocation": "Bekhorot 45a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/45a#section-18",
          "talmudFullText": "It <b>is taught</b> in a <i>baraita</i> that <b>R' Elazar says: Just as a house has hinges [<i>tzirim</i>], so too, a woman has hinges, as it is stated: “And she bowed herself and brought forth, for her pains [<i>tzireha</i>] came suddenly upon her”</b> (I Samuel 4:19). <b>R' Yehoshua says: Just as a house has doors, so too, a woman has doors, as it is stated: “Because it did not shut the doors of my womb”</b> (Job 3:10)."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "1 Samuel 5:4",
          "verseText": "and the head of Dagon and both the palms of his hands lay cut off",
          "talmudLocation": "Avodah Zarah 41b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/41b#section-4",
          "talmudFullText": "<b>R' Yoḥanan raised an objection to R' Shimon ben Lakish</b> from the passage in the book of Samuel recounting the downfall of the Philistine god Dagon: “And when they arose early the next morning, behold, Dagon was fallen on his face to the ground before the Ark of YHWH; <b>and the head of Dagon and both the palms of his hands lay cut off</b> upon the threshold; only the trunk of Dagon was left to him” (I Samuel 5:4). <b>And</b> from the next verse it seems that Dagon’s worshippers accorded it honor despite its destruction, as <b>it is written: “Therefore, the priests of Dagon, </b> and anyone who comes into Dagon’s house, <b>do not tread</b> on the threshold of Dagon in Ashdod until this day” (I Samuel 5:5). Evidently, when an idol breaks, its worshippers do not stop worshipping it."
        },
        {
          "verseLocation": "1 Samuel 5:5",
          "verseText": "do not tread",
          "talmudLocation": "Avodah Zarah 41b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/41b#section-4",
          "talmudFullText": "<b>R' Yoḥanan raised an objection to R' Shimon ben Lakish</b> from the passage in the book of Samuel recounting the downfall of the Philistine god Dagon: “And when they arose early the next morning, behold, Dagon was fallen on his face to the ground before the Ark of YHWH; <b>and the head of Dagon and both the palms of his hands lay cut off</b> upon the threshold; only the trunk of Dagon was left to him” (I Samuel 5:4). <b>And</b> from the next verse it seems that Dagon’s worshippers accorded it honor despite its destruction, as <b>it is written: “Therefore, the priests of Dagon, </b> and anyone who comes into Dagon’s house, <b>do not tread</b> on the threshold of Dagon in Ashdod until this day” (I Samuel 5:5). Evidently, when an idol breaks, its worshippers do not stop worshipping it."
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "1 Samuel 6:8",
          "verseText": "as it is stated: “And put the golden devices which you are restoring to Him for a guilt-offering in a chest by the side of it, and send it away that it may go”",
          "talmudLocation": "Bava Batra 14a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/14a#section-14",
          "talmudFullText": "<b>And the chest in which the Philistines sent the gift to the God of Israel was placed alongside</b> the Ark, <b>as it is stated: “And put the golden devices which you are restoring to Him for a guilt-offering in a chest by the side of it, and send it away that it may go”</b> (I Samuel 6:8). <b>And upon</b> this chest <b>lay the Torah scroll, as it is stated: “Take this Torah scroll and put it at the side of the Ark of the Covenant of YHWH”</b> (Deuteronomy 31:26). This means that <b>it was placed at the side</b> of the Ark, <b>and not inside</b> it."
        },
        {
          "verseLocation": "1 Samuel 6:8",
          "verseText": "and put the vessels of gold that you return Him as a guilt-offering in a chest by its side and send it away that it may go”",
          "talmudLocation": "Horayot 12a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/12a#section-1",
          "talmudFullText": "The Talmud asks with regard to the fact that Jehoahaz was anointed: <b>And was there anointing oil</b> during the days of Jehoahaz? <b>But isn’t it taught</b> in a <i>baraita</i>: <b>When the Ark of the Covenant was sequestered, the anointing oil, and the jar of <i>manna</i></b> (see Exodus 16:33), <b>and Aaron’s staff</b> with <b>its almonds and blossoms</b> (see Numbers 17:23), <b>and the chest that the Philistines sent</b> as <b>a gift to Israel, </b> were all <b>sequestered</b> with it, <b>as it is stated: </b> “And you shall take the Ark of YHWH, and lay it upon the cart, <b>and put the vessels of gold that you return Him as a guilt-offering in a chest by its side and send it away that it may go”</b> (I Samuel 6:8)."
        },
        {
          "verseLocation": "1 Samuel 6:8",
          "verseText": "as it is stated: “And put the jewels of gold that you return to Him for a guilt offering, in a coffer by its side,",
          "talmudLocation": "Keritot 5b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/5b#section-17",
          "talmudFullText": "The <i>baraita</i> continues: <b>And</b> also sequestered with the Ark was the <b>chest that the Philistines sent as a gift to the God of Israel</b> after they captured the Ark and were stricken by several plagues, <b>as it is stated: “And put the jewels of gold that you return to Him for a guilt offering, in a coffer by its side, </b> and send it away that it may go” (I Samuel 6:8). <b>And who sequestered</b> the Ark? <b>Josiah, king of Judah, sequestered it, as it is stated: And the king said to the priests: Put the sacred Ark</b> in the house that Solomon, the son of David, king of Israel, built (see II Chronicles 35:3)."
        },
        {
          "verseLocation": "1 Samuel 6:8",
          "verseText": "as it is stated: “And put the jewels of gold that you return to Him for a guilt-offering, in a coffer by its side, and send it away that it may go”",
          "talmudLocation": "Yoma 52b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/52b#section-11",
          "talmudFullText": "The Talmud elaborates: <b>But wasn’t it taught</b> in a <i>baraita</i> that <b>when</b> the <b>Ark was buried, along with it was buried the jar of manna</b> that was next to it, <b>and the flask of oil used for anointing, and Aaron’s staff with its almonds and blossoms, and the chest that the Philistines sent as a gift [<i>doron</i>] to the God of Israel</b> after they captured the Ark and were stricken by several plagues, <b>as it is stated: “And put the jewels of gold that you return to Him for a guilt-offering, in a coffer by its side, and send it away that it may go”</b> (I Samuel 6:8)?"
        },
        {
          "verseLocation": "1 Samuel 6:10",
          "verseText": "and shut up their calves at home”",
          "talmudLocation": "Avodah Zarah 24b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/24b#section-12",
          "talmudFullText": "The Talmud cites a refutation of R' Yoḥanan’s answer: <b>Rav Huna ben Natan, objects to this: If so, </b> then <b>this is</b> also true with regard to the verse: “And they took two nursing cows and tied them to the cart <b>and shut up their calves at home”</b> (I Samuel 6:10). According to R' Yoḥanan, the verse is necessarily referring to cows that are <b>less than three years</b> old."
        },
        {
          "verseLocation": "1 Samuel 6:12",
          "verseText": "“And the cattle took the straight [ vayyisharna ] way, on the way to Beit Shemesh;",
          "talmudLocation": "Avodah Zarah 24b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/24b#section-14",
          "talmudFullText": "§ The Talmud further analyzes the episode involving the cows sent by the Philistines. The verse states: <b>“And the cattle took the straight [<i>vayyisharna</i>] way, on the way to Beit Shemesh; </b> they went along the highway, lowing as they went” (I Samuel 6:12). The Talmud asks: <b>What</b> is the meaning of the word <b><i>vayyisharna</i>? R' Yoḥanan says in the name of R' Meir: </b> It means <b>that they recited a song [<i>shira</i>]. And Rav Zutra bar Toviyya</b> says that <b>Rav says: </b> It means <b>that they straightened [<i>yishru</i>] their faces</b> so that they were <b>opposite the Ark and recited a song. </b>"
        },
        {
          "verseLocation": "1 Samuel 6:14",
          "verseText": "“And they sacrificed the cattle as a burnt-offering unto the Lord”",
          "talmudLocation": "Avodah Zarah 24b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/24b#section-11",
          "talmudFullText": "<b>They raised all of those refutations</b> from the aforementioned verses which indicate that animals purchased from non-Jews may be brought as offerings, and <b>he answered them</b> by claiming that the animals being offered were <b>less than three years</b> old. The Talmud reexamines one of the objections. <b>Come</b> and <b>hear, </b> as the verse states: <b>“And they sacrificed the cattle as a burnt-offering unto YHWH”</b> (I Samuel 6:14). R' Yoḥanan explained that although <b>in</b> that incident the cattle had been owned by Philistines, they were <b>less than three years</b> old, and it was therefore presumed that the Philistines had not engaged in bestiality with them."
        },
        {
          "verseLocation": "1 Samuel 6:14",
          "verseText": "“And they sacrificed the cattle as a burnt-offering unto the Lord”",
          "talmudLocation": "Avodah Zarah 24b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/24b#section-6",
          "talmudFullText": "The Talmud <b>raises an objection</b> to the opinion of R' Eliezer. After the Philistines returned the Ark of the Covenant to the Israelites upon a cart drawn by cattle, the verse states: <b>“And they sacrificed the cattle as a burnt-offering unto YHWH”</b> (I Samuel 6:14). Evidently, the Jews did not hesitate to sacrifice the Philistines’ animals. The Talmud explains: There, <b>it was a provisional edict</b> issued in extraordinary circumstances, and their actions are not representative of the general <i>halakha</i>."
        },
        {
          "verseLocation": "1 Samuel 6:19",
          "verseText": "“And He smote of the men of Beit Shemesh because they had gazed upon the Ark of the Lord”",
          "talmudLocation": "Sotah 35a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35a#section-23",
          "talmudFullText": "§ When the Philistines returned the Ark during the period of Samuel, it is stated: <b>“And He smote of the men of Beit Shemesh because they had gazed upon the Ark of YHWH”</b> (I Samuel 6:19). The Talmud asks: <b>Because they gazed</b> upon it, <b>God smote</b> them? Why did their action warrant this punishment? <b>R' Abbahu and R' Elazar</b> disagreed with regard to the interpretation of the verse. <b>One says</b> that they were punished because <b>they were reaping</b> their crops <b>and prostrating themselves</b> at the same time; they did not stop working in reverence for the Ark. <b>And one says</b> that <b>they also spoke</b> denigrating <b>words: </b>"
        },
        {
          "verseLocation": "1 Samuel 6:19",
          "verseText": "“And He smote of the people seventy men, fifty thousand men”",
          "talmudLocation": "Sotah 35b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35b#section-2",
          "talmudFullText": "The verse states: <b>“And He smote of the people seventy men, fifty thousand men”</b> (I Samuel 6:19). <b>R' Abbahu and R' Elazar</b> disagree over the interpretation of the verse. <b>One says</b> that <b>there were seventy men, and each and every one</b> of them <b>was equivalent to fifty thousand</b> men. <b>And one says</b> that <b>there were fifty thousand men, and each and every one was equivalent to</b> the <b>seventy</b> men in the <b>Sanhedrin. </b>"
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "1 Samuel 7:2",
          "verseText": "And it is written: “And it came to pass, from the day that the Ark abode in Kiriath Jearim that the time was long; for it was twenty years; and all the house of Israel yearned after the Lord”",
          "talmudLocation": "Zevachim 118b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/118b#section-21",
          "talmudFullText": "The Talmud determines the number of years from when the Ark was captured by the Philistines and Shiloh was destroyed: <b>And it is written: “And it came to pass, from the day that the Ark abode in Kiriath Jearim that the time was long; for it was twenty years; and all the house of Israel yearned after YHWH”</b> (I Samuel 7:2). The Ark was returned by the Philistines to Kiriath Jearim seven months after it was captured, and it remained there for twenty years, until David brought it to Jerusalem."
        },
        {
          "verseLocation": "1 Samuel 7:5",
          "verseText": "written concerning him: Crying.",
          "talmudLocation": "Taanit 17a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/17a#section-2",
          "talmudFullText": "§ The Mishnah teaches: <b>For the first</b> blessing <b>he recites: He Who answered Abraham. </b> It was <b>taught</b> in a <i>baraita</i>: <b>Some reverse</b> the order of the conclusion of two blessings, by reciting: Who hears <b>cries, </b> in the 5th blessing, which deals <b>with Elijah, </b> and the conclusion: Who hears <b>prayer, </b> in the blessing <b>of Samuel. </b> The Talmud asks: <b>Granted, with regard to Samuel</b> both options are appropriate, as <b>it is written concerning him: Prayer, and it is</b> likewise <b>written concerning him: Crying. </b> One verse states: “And Samuel said: Gather all of Israel to Mizpah, and I will pray for you to YHWH” (I Samuel 7:5), while another verse states: “And Samuel cried to YHWH for Israel” (I Samuel 7:9)."
        },
        {
          "verseLocation": "1 Samuel 7:9",
          "verseText": "upon a private altar? As it is stated: “And Samuel took a milking lamb, and sacrificed it [ vaya’alehu ] for a burnt-offering",
          "talmudLocation": "Avodah Zarah 24b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/24b#section-8",
          "talmudFullText": "The Talmud rejects this proof: <b>And what is the difficulty? </b> In other words, the additional problem with the incident, that the animals were female, which is cited as proof that there were extenuating circumstances, is not in fact difficult at all. The Talmud elaborates: <b>Perhaps</b> the cows were offered <b>upon a private altar, and</b> this is <b>in accordance with</b> the opinion <b>of Rav Adda bar Ahava, as Rav Adda bar Ahava says: From where</b> is it derived <b>that a female burnt-offering is fit</b> to be sacrificed <b>upon a private altar? As it is stated: “And Samuel took a milking lamb, and sacrificed it [<i>vaya’alehu</i>] for a burnt-offering</b> unto YHWH” (I Samuel 7:9). The phrase “milking lamb” indicates that it was a female, and yet Samuel sacrificed it upon a private altar."
        },
        {
          "verseLocation": "1 Samuel 7:16",
          "verseText": "judgment in their towns, as it is stated: “And he went from year to year in circuit from Beth-El, and Gilgal, and Mitzpa, and judged Israel",
          "talmudLocation": "Shabbat 56a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-2",
          "talmudFullText": "<b>However, how</b> then <b>do I establish</b> the meaning of the verse: <b>“And they sought after unjust gain, ”</b> indicating that they were sinners? It means <b>that they did not conduct</b> themselves <b>in accordance with the actions of their father. As Samuel the righteous would travel to all places</b> where the people of <b>Israel</b> were located <b>and</b> sit in <b>judgment in their towns, as it is stated: “And he went from year to year in circuit from Beth-El, and Gilgal, and Mitzpa, and judged Israel</b> in all those places” (I Samuel 7:16). <b>And, </b> however, <b>they did not do so</b> and travel from place to place. <b>Rather, they sat in their</b> own <b>cities in order to enhance the fees</b> collected <b>by their attendants and scribes. </b> Therefore, the verse ascribes to them liability as if they sinned by seeking ill-gotten gains and bribes."
        },
        {
          "verseLocation": "1 Samuel 7:17",
          "verseText": "As it is stated: “And he returned to Rama, for there was his house,",
          "talmudLocation": "Berakhot 10b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10b#section-21",
          "talmudFullText": "<b>Abaye, and some say R' Yitzḥak, said: </b> A great man <b>who seeks to enjoy</b> the contributions of those who seek to honor him <b>may enjoy</b> those gifts, <b>as Elisha</b> enjoyed gifts given him by the woman from Shunem, among others. <b>And one who does not seek to enjoy</b> these gifts <b>should not enjoy them, as</b> was the practice of the prophet <b>Samuel from Rama, </b> who would not accept gifts from anyone at all. From where do we know that this was Samuel’s custom? <b>As it is stated: “And he returned to Rama, for there was his house, </b> and there he judged Israel, and he built an altar to YHWH” (I Samuel 7:17). <b>And</b> similarly, <b>R' Yoḥanan said: Every place where</b> Samuel <b>went, his house was with him, </b> so he would have everything that he needed and not be forced to benefit from public contributions. One may opt to conduct himself in accordance with either of these paths."
        },
        {
          "verseLocation": "1 Samuel 7:17",
          "verseText": "“And his return was to Ramah, for there was his house”",
          "talmudLocation": "Nedarim 38a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/38a#section-12",
          "talmudFullText": "<b>Samuel</b> was wealthy, <b>as it is written: “Here I am; witness against me before YHWH, and before His anointed: Whose ox have I taken, or whose donkey have I taken? ”</b> (I Samuel 12:3). <b>If</b> he is saying that he did not take an ox or a donkey <b>for free, </b> was his intent <b>to exclude</b> himself from the category of <b>one who takes</b> items that belong to others <b>for free? Rather, </b> he is saying <b>that even with payment</b> he did not take a donkey or an ox. Apparently, he was wealthy. The Talmud rejects this proof. <b>Perhaps, </b> on the contrary, the reason he did not purchase the donkeys is due to the fact <b>that he was poor. Rather, </b> the fact that Samuel was wealthy is derived <b>from here, </b> as it is written: <b>“And his return was to Ramah, for there was his house”</b> (I Samuel 7:17). <b>And Rava said: Everywhere he went, his home was with him. </b> He was so wealthy that he could afford to hire servants and pack animals to take all his belongings from place to place."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "1 Samuel 8:1",
          "verseText": "“And it came to pass, when Samuel was old”",
          "talmudLocation": "Megillah 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-7",
          "talmudFullText": "Similarly, the verse states: <b>“And it came to pass, when Samuel was old”</b> (I Samuel 8:1), and then it is written: <b>“And his sons did not walk in his ways”</b> (I Samuel 8:3). Also, it states: <b>“And it came to pass that David was successful in all his ways, and YHWH was with him”</b> (I Samuel 18:14), and only a few verses prior it is written: <b>“And Saul viewed David with suspicion”</b> (I Samuel 18:9). In another instance, the verse states: <b>“And it came to pass, when the king dwelt in his house”</b> (II Samuel 7:1). Here King David mentioned his desire to build a temple for God, but it is written elsewhere that he was told: <b>“Yet you shall not build the house”</b> (II Chronicles 6:9)."
        },
        {
          "verseLocation": "1 Samuel 8:1",
          "verseText": "which is written: “And it came to pass when Samuel was old”",
          "talmudLocation": "Taanit 5b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/5b#section-3",
          "talmudFullText": "<b>And Rav Naḥman said to R' Yitzḥak: What is</b> the meaning of that <b>which is written: “And it came to pass when Samuel was old”</b> (I Samuel 8:1)? <b>And did Samuel really grow so old? But he was</b> only <b>fifty-two years old</b> when he died, <b>as the Master said</b> in a <i>baraita</i> <b>that deals with</b> the Divine punishment of <i>karet</i>: <b>One who dies at</b> the age of <b>fifty-two years</b> is not considered to have suffered the premature death of <i>karet</i>, as <b>this is the</b> age of the <b>death of Samuel of Rama. </b> This shows that Samuel died at the relatively young age of fifty-two."
        },
        {
          "verseLocation": "1 Samuel 8:3",
          "verseText": "“But turned aside after wealth”",
          "talmudLocation": "Chullin 133a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/133a#section-6",
          "talmudFullText": "<b>Abaye, </b> who was a priest, <b>said: At first, I would seize gifts</b> of the priesthood, as <b>I said</b> to myself that <b>I am demonstrating fondness</b> for the <b>mitzva</b> in this manner. <b>Once I heard this</b> interpretation: <b>“That they shall give, ” and not that he should take by himself, I did not seize</b> them anymore. Instead, <b>I would say</b> to the owners of the gifts: <b>Give me. And once I heard that which is taught</b> in a <i>baraita</i>: The verse states with regard to the sons of Samuel, who were Levites: <b>“But turned aside after wealth”</b> (I Samuel 8:3), and <b>R' Meir says: The sons of Samuel</b> sinned when they <b>asked for their portion, </b> the first tithe given to the Levite, <b>with their mouths, </b> i.e., they demanded that the owners give them the first tithe. Abaye continued: After I heard that, <b>I also did not say</b> anything to the owners, <b>but if they would give me</b> gifts <b>I would take</b> them."
        },
        {
          "verseLocation": "1 Samuel 8:3",
          "verseText": "“And his sons did not follow in his ways”",
          "talmudLocation": "Makkot 11a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/11a#section-21",
          "talmudFullText": "The Talmud cites a similar statement: <b>R' Abbahu says: </b> With regard to <b>the curse of a Sage, even</b> if it is stated <b>conditionally, it comes</b> to realization. <b>From where do we</b> derive this? It is derived <b>from</b> an incident involving <b>Eli</b> the High Priest, <b>as Eli said to Samuel, </b> after the latter had received a prophetic vision with regard to Eli, that his sons do not follow his path: <b>“Therefore may God do to you, and more also, if you hide any matter from me</b> of all the matters that He spoke unto you” (I Samuel 3:17). <b>And even though it is written</b> immediately thereafter: <b>“And Samuel told him all the matters, and did not hide from him”</b> (I Samuel 3:18), <b>it is written</b> at the time of Samuel’s death: <b>“And his sons did not follow in his ways”</b> (I Samuel 8:3), indicating that God did to Samuel as he prophesied with regard to Eli, and his own sons did not follow his path. Despite the fact that Eli stated the curse conditionally, Samuel was affected by the curse."
        },
        {
          "verseLocation": "1 Samuel 8:3",
          "verseText": "“And his sons did not walk in his ways”",
          "talmudLocation": "Megillah 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-7",
          "talmudFullText": "Similarly, the verse states: <b>“And it came to pass, when Samuel was old”</b> (I Samuel 8:1), and then it is written: <b>“And his sons did not walk in his ways”</b> (I Samuel 8:3). Also, it states: <b>“And it came to pass that David was successful in all his ways, and YHWH was with him”</b> (I Samuel 18:14), and only a few verses prior it is written: <b>“And Saul viewed David with suspicion”</b> (I Samuel 18:9). In another instance, the verse states: <b>“And it came to pass, when the king dwelt in his house”</b> (II Samuel 7:1). Here King David mentioned his desire to build a temple for God, but it is written elsewhere that he was told: <b>“Yet you shall not build the house”</b> (II Chronicles 6:9)."
        },
        {
          "verseLocation": "1 Samuel 8:6",
          "verseText": "generation asked appropriately, as it is stated: “Give us a king to judge us”",
          "talmudLocation": "Sanhedrin 20b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/20b#section-10",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i>: <b>R' Eliezer says: The elders of</b> Samuel’s <b>generation asked appropriately, as it is stated: “Give us a king to judge us”</b> (I Samuel 8:6), since they wanted a steady leader in place of Samuel. <b>But the ignoramuses among them ruined</b> it, <b>as it is stated: </b> “But the people refused to heed the voice of Samuel; and they said: No, but there shall be a king over us, <b>that we also may be like all the nations, and that our king may judge us, and emerge before us, </b> and fight our battles” (I Samuel 8:19–20)."
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "1 Samuel 9:2",
          "verseText": "he was taller than the people from the shoulders up”",
          "talmudLocation": "Berakhot 48b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/48b#section-9",
          "talmudFullText": "Tangentially, the Talmud asks: <b>Why</b> did these maidens go on <b>so expansively</b> while speaking to Saul? <b>It is because women are chatterers. And Shmuel said</b> a different reason: They spoke expansively <b>in order to gaze upon Saul’s beauty</b> longer, <b>as it is written</b> about him: “An excellent young man; no one among the Israelites was better than he; <b>he was taller than the people from the shoulders up”</b> (I Samuel 9:2). <b>R' Yoḥanan said</b> that their expansiveness was initiated by God, because <b>one sovereignty does not overlap with its counterpart, even</b> one <b>hairbreadth. </b> Saul’s coronation was delayed so that Samuel’s leadership would not be curtailed."
        },
        {
          "verseLocation": "1 Samuel 9:2",
          "verseText": "size [ kemiddato ]. And it is written with regard to Saul: “From his shoulders and upward he was higher than any of the people”",
          "talmudLocation": "Yevamot 76b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/76b#section-14",
          "talmudFullText": "The Talmud continues with its explanation: <b>For what reason did</b> Saul <b>say to</b> Abner that he should <b>inquire about</b> David? <b>As it is written: “And Saul clad David with his apparel [<i>maddav</i>]”</b> (I Samuel 17:38), which indicates that the clothes were <b>of</b> David’s <b>size [<i>kemiddato</i>]. And it is written with regard to Saul: “From his shoulders and upward he was higher than any of the people”</b> (I Samuel 9:2). Upon seeing that his clothes fit David, Saul began to fear that it might be David who was destined for the throne, and he therefore inquired into his background. At that point, <b>Doeg the Edomite said to</b> Saul: <b>Before you inquire as to whether or not he is fit for kingship, inquire as to whether or not he is</b> even <b>fit to enter into the congregation. What is the reason</b> for such doubts? It is <b>that</b> he <b>descends from Ruth the Moabite, </b> and Moabites are permanently barred from entering the congregation."
        },
        {
          "verseLocation": "1 Samuel 9:13",
          "verseText": "“As soon you come into the city, find him right away, before he goes up to the high place to eat; for the people will not eat until he comes, because he will bless the sacrifice; and afterwards all those who are invited will eat;",
          "talmudLocation": "Berakhot 48b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/48b#section-8",
          "talmudFullText": "<b>R' Natan says: </b> That source for the obligation to recite a blessing beforehand <b>is not necessary, as it says</b> when the maidens told Saul: <b>“As soon you come into the city, find him right away, before he goes up to the high place to eat; for the people will not eat until he comes, because he will bless the sacrifice; and afterwards all those who are invited will eat; </b> now go, for you shall find him at this time of day” (I Samuel 9:13). A blessing recited prior to eating is explicitly mentioned in that verse."
        },
        {
          "verseLocation": "1 Samuel 9:24",
          "verseText": "“And the cook took up the thigh, and that which was upon it [ vehe’aleha ], and set it before Saul”",
          "talmudLocation": "Avodah Zarah 25a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/25a#section-16",
          "talmudFullText": "§ The Talmud cites another dispute between the same <i>amora’im</i>. The verse states: <b>“And the cook took up the thigh, and that which was upon it [<i>vehe’aleha</i>], and set it before Saul”</b> (I Samuel 9:24). To <b>what</b> does the term <b>“and that which was upon it”</b> refer? <b>R' Yoḥanan says: </b> It refers to <b>the thigh and the tail. </b> The Talmud asks: <b>What</b> is the reason that the tail is referred to as: <b>“And that which was upon it”? </b> The reason is <b>that the thigh supports the tail, </b> as it rests upon it."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "1 Samuel 10:16",
          "verseText": "And what was the modesty shown by Saul? As it is written: “But of the matter of the kingdom, of which Samuel spoke, he did not tell him”",
          "talmudLocation": "Megillah 13b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-6",
          "talmudFullText": "<b>And what was the modesty shown by Saul? As it is written: “But of the matter of the kingdom, of which Samuel spoke, he did not tell him”</b> (I Samuel 10:16). Saul expressed his modesty by not revealing Samuel’s promise that he would be king, and thereby <b>merited that Esther would descend from him. </b> Similarly, <b>R' Elazar said: When God assigns greatness to a person, He assigns it to his sons and to his son’s sons for all generations, as it is stated: </b> “He withdraws not his eyes from the righteous; but with kings upon the throne <b>He establishes them forever, and they are exalted”</b> (Job 36:7). <b>And if he becomes arrogant</b> due to this, <b>God lowers him</b> in order to humble him, <b>as it is stated</b> in the next verse: <b>“And if they are bound in chains, </b> and are held in cords of affliction, then He declares unto them their work, and their transgressions, that they have behaved proudly” (Job 36:8–9)."
        },
        {
          "verseLocation": "1 Samuel 10:22",
          "verseText": "Is there yet a man who comes hither”",
          "talmudLocation": "Zevachim 102a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/102a#section-16",
          "talmudFullText": "The Talmud counters: <b>And</b> is it so that <b>anywhere that it is written “hither”</b> the verse <b>is</b> referring to kingship <b>for</b> future <b>generations</b> as well? <b>But isn’t it written about</b> the kingship of <b>Saul: </b> “They asked of YHWH further: <b>Is there yet a man who comes hither”</b> (I Samuel 10:22), and Saul was <b>indeed</b> a king, but <b>his descendants</b> were <b>not. </b>"
        },
        {
          "verseLocation": "1 Samuel 10:27",
          "verseText": "“And some base fellows said: How can this man save us? So they disparaged him and brought him no present. But he made himself as if he did not hear”",
          "talmudLocation": "Yoma 22b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-20",
          "talmudFullText": "<b>Rav Yehuda said</b> that <b>Rav said: Why was Saul punished</b> in that he was ultimately led to commit the sins described above? <b>Because</b> at the very outset of his reign he inappropriately <b>forwent his</b> royal <b>honor, as it is stated</b> with regard to Saul’s inauguration: <b>“And some base fellows said: How can this man save us? So they disparaged him and brought him no present. But he made himself as if he did not hear”</b> (I Samuel 10:27). And it is stated immediately afterward: <b>“And Nahash the Ammonite marched up and encamped against Jabesh-gilead”</b> (I Samuel 11:1). The implication is that if Saul had forcefully assumed his throne, Nahash would not have dared to attack the people of Jabesh-gilead. In this way, his humility led to the crisis."
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "1 Samuel 11:1",
          "verseText": "“And Nahash the Ammonite marched up and encamped against Jabesh-gilead”",
          "talmudLocation": "Yoma 22b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-20",
          "talmudFullText": "<b>Rav Yehuda said</b> that <b>Rav said: Why was Saul punished</b> in that he was ultimately led to commit the sins described above? <b>Because</b> at the very outset of his reign he inappropriately <b>forwent his</b> royal <b>honor, as it is stated</b> with regard to Saul’s inauguration: <b>“And some base fellows said: How can this man save us? So they disparaged him and brought him no present. But he made himself as if he did not hear”</b> (I Samuel 10:27). And it is stated immediately afterward: <b>“And Nahash the Ammonite marched up and encamped against Jabesh-gilead”</b> (I Samuel 11:1). The implication is that if Saul had forcefully assumed his throne, Nahash would not have dared to attack the people of Jabesh-gilead. In this way, his humility led to the crisis."
        },
        {
          "verseLocation": "1 Samuel 11:8",
          "verseText": "“And he numbered them with bezek ”",
          "talmudLocation": "Yoma 22b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-2",
          "talmudFullText": "§ It was taught in the Mishnah that <b>if both of them were equal</b> and neither preceded the other, <b>the appointed</b> priest <b>says</b> to all the priests: <b>Extend</b> your <b>fingers</b> [<b><i>hatzbiu</i></b>], and a lottery was performed. A <i>tanna</i> <b>taught</b> the meaning of the unusual term <i>hatzbiu</i>: <b>Put out your fingers for a count. </b> The Talmud asks: <b>Let him count</b> the priests <b>themselves</b> directly, rather than counting their fingers. The Talmud answers: This is <b>a support for</b> a teaching of <b>R' Yitzḥak, as R' Yitzḥak said: It is prohibited to count Jews</b> directly, <b>even for the purposes of a mitzva, as it is written</b> concerning King Saul and his count of his soldiers: <b>“And he numbered them with <i>bezek</i>”</b> (I Samuel 11:8), meaning that he counted them through shards, one shard representing each man, rather than counting them directly."
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "1 Samuel 12:3",
          "verseText": "as it is written: “Here I am; witness against me before the Lord, and before His anointed: Whose ox have I taken, or whose donkey have I taken?”",
          "talmudLocation": "Nedarim 38a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/38a#section-12",
          "talmudFullText": "<b>Samuel</b> was wealthy, <b>as it is written: “Here I am; witness against me before YHWH, and before His anointed: Whose ox have I taken, or whose donkey have I taken? ”</b> (I Samuel 12:3). <b>If</b> he is saying that he did not take an ox or a donkey <b>for free, </b> was his intent <b>to exclude</b> himself from the category of <b>one who takes</b> items that belong to others <b>for free? Rather, </b> he is saying <b>that even with payment</b> he did not take a donkey or an ox. Apparently, he was wealthy. The Talmud rejects this proof. <b>Perhaps, </b> on the contrary, the reason he did not purchase the donkeys is due to the fact <b>that he was poor. Rather, </b> the fact that Samuel was wealthy is derived <b>from here, </b> as it is written: <b>“And his return was to Ramah, for there was his house”</b> (I Samuel 7:17). <b>And Rava said: Everywhere he went, his home was with him. </b> He was so wealthy that he could afford to hire servants and pack animals to take all his belongings from place to place."
        },
        {
          "verseLocation": "1 Samuel 12:4",
          "verseText": "as it is written: “And they said: You have not defrauded us, nor oppressed us [ ratzotanu ],",
          "talmudLocation": "Nedarim 38a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/38a#section-13",
          "talmudFullText": "<b>Rava said: That which is stated with regard to Samuel is greater than that which is stated with regard to Moses, as with regard to Moses our teacher it is written: “I have not taken one donkey from them”</b> (Numbers 16:15), meaning that he did not take an item from another against his will <b>even with payment. Whereas with regard to Samuel, even with</b> the <b>consent</b> of the owner, <b>he would not rent</b> an item from him, <b>as it is written: “And they said: You have not defrauded us, nor oppressed us [<i>ratzotanu</i>], </b> neither have you taken anything from any man’s hand” (I Samuel 12:4), even with his consent [<i>ratzon</i>]."
        },
        {
          "verseLocation": "1 Samuel 12:6",
          "verseText": "it says: “And Samuel said to the people: It is the Lord Who made Moses and Aaron”",
          "talmudLocation": "Rosh Hashanah 25a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/25a#section-16",
          "talmudFullText": "<b>And</b> similarly <b>it says: “And Samuel said to the people: It is YHWH Who made Moses and Aaron”</b> (I Samuel 12:6). <b>And it says</b> further: <b>“And YHWH sent Jerubaal and Bedan and Jephthah and Samuel”</b> (I Samuel 12:11). The Talmud explains: <b>Jerubaal, this is Gideon. And why is he called Jerubaal? </b> The reason is <b>that he waged a quarrel against Baal. Bedan, this is Samson. And why is he called Bedan? As he came from</b> the tribe of <b>Dan. Jephthah, in accordance with its</b> regular <b>meaning, </b> i.e., this is referring to Jephthah himself and is not a nickname."
        },
        {
          "verseLocation": "1 Samuel 12:7",
          "verseText": "rebuke. As it is stated: “Now therefore stand still, that I may plead with you before the Lord concerning all the righteous acts of the Lord, which He did to you and to your fathers”",
          "talmudLocation": "Arakhin 17a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/17a#section-2",
          "talmudFullText": "§ The Talmud returns to the topic of rebuke. <b>It is taught</b> in a <i>baraita</i> that <b>R' Eliezer the Great says: Were God, </b> to have <b>entered into judgment with Abraham, Isaac and Jacob, they would not have been able to stand before</b> the <b>rebuke. As it is stated: “Now therefore stand still, that I may plead with you before YHWH concerning all the righteous acts of YHWH, which He did to you and to your fathers”</b> (I Samuel 12:7). This indicates that God acted towards the patriarchs with righteousness, i.e., mercy, not as they deserved according to the strict letter of the law."
        },
        {
          "verseLocation": "1 Samuel 12:11",
          "verseText": "“And the Lord sent Jerubaal and Bedan and Jephthah and Samuel”",
          "talmudLocation": "Rosh Hashanah 25a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/25a#section-16",
          "talmudFullText": "<b>And</b> similarly <b>it says: “And Samuel said to the people: It is YHWH Who made Moses and Aaron”</b> (I Samuel 12:6). <b>And it says</b> further: <b>“And YHWH sent Jerubaal and Bedan and Jephthah and Samuel”</b> (I Samuel 12:11). The Talmud explains: <b>Jerubaal, this is Gideon. And why is he called Jerubaal? </b> The reason is <b>that he waged a quarrel against Baal. Bedan, this is Samson. And why is he called Bedan? As he came from</b> the tribe of <b>Dan. Jephthah, in accordance with its</b> regular <b>meaning, </b> i.e., this is referring to Jephthah himself and is not a nickname."
        },
        {
          "verseLocation": "1 Samuel 12:15",
          "verseText": "as it is stated: “Then shall the hand of the Lord be against you and against your fathers”",
          "talmudLocation": "Yevamot 63b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/63b#section-11",
          "talmudFullText": "3rd, <b>they exhumed the dead</b> from their graves <b>because</b> the Jews <b>rejoice on</b> the <b>holidays</b> of the non-Jews, <b>as it is stated: “Then shall the hand of YHWH be against you and against your fathers”</b> (I Samuel 12:15). <b>Rabba bar Shmuel said: This</b> verse is referring to <b>exhuming the dead, </b> which upsets both the living and the dead, <b>as the Master said: </b> Due <b>to the iniquity of the living, the dead are exhumed. </b>"
        },
        {
          "verseLocation": "1 Samuel 12:17",
          "verseText": "fall, they are a sign of a curse, as it is stated: “Is not the wheat harvest today?",
          "talmudLocation": "Taanit 12b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/12b#section-11",
          "talmudFullText": "<b>If these</b> fasts have <b>passed and they have not been answered</b> the court does not decree additional fasts, but the entire community observes the customs of mourning. <b>They decrease</b> their engagement <b>in business</b> transactions, <b>in building and planting, in betrothals and marriages, and in greetings between</b> each <b>person and his fellow, like people who have been rebuked by God. The individuals, </b> i.e., Torah scholars, <b>resume fasting</b> every Monday and Thursday <b>until</b> the month of <b>Nisan ends. </b> After this date they no longer pray for rain, since if <b>Nisan has ended and rains</b> subsequently <b>fall, they are a sign of a curse, as it is stated: “Is not the wheat harvest today? </b> I will call to YHWH that He may send thunder and rain, and you will know and see that your wickedness is great” (I Samuel 12:17). The wheat harvest is around the time of <i>Shavuot</i>, well after Nisan."
        },
        {
          "verseLocation": "1 Samuel 12:17",
          "verseText": "fall, they are a sign of a curse, as it is stated: “Is not the wheat harvest today?",
          "talmudLocation": "Taanit 2b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/2b#section-11",
          "talmudFullText": "<b>However, </b> in the case of <b>rain, </b> are <b>all</b> times <b>when it falls its proper time? But didn’t we learn</b> in a Mishnah (12b): <b>If</b> the month of <b>Nisan has ended and rains</b> subsequently <b>fall, they are a sign of a curse, as it is stated: “Is not the wheat harvest today? </b> I will call to YHWH that He may send thunder and rain, and you will know and see that your wickedness is great, which you have done in the sight of YHWH, in asking you a king” (I Samuel 12:17)."
        },
        {
          "verseLocation": "1 Samuel 12:23",
          "verseText": "“As for me, far be it from me that I should transgress against the Lord in ceasing to pray for you,",
          "talmudLocation": "Berakhot 12b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/12b#section-6",
          "talmudFullText": "<b>And Rabba bar Ḥinnana Sava said in the name of Rav: Anyone who can ask for mercy on behalf of another, and does not ask is called a sinner, as it is stated</b> following Samuel’s rebuke of the people: <b>“As for me, far be it from me that I should transgress against YHWH in ceasing to pray for you, </b> but I will teach you the good and the right way” (I Samuel 12:23). Had Samuel refrained from prayer, he would have committed a sin."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "1 Samuel 13:1",
          "verseText": "“Saul was one year old when he began to reign”",
          "talmudLocation": "Yoma 22b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-17",
          "talmudFullText": "§ The Talmud continues its discussion of Saul and David. It is written: <b>“Saul was one year old when he began to reign”</b> (I Samuel 13:1), which cannot be understood literally, as Saul was appointed king when he was a young man. <b>Rav Huna said: </b> The verse means that when he began to reign he was <b>like a one-year–old, in that he had never tasted the taste of sin</b> but was wholly innocent and upright."
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "1 Samuel 14:3",
          "verseText": "Rav said: Pinehas did not sin, as it is stated: “And Ahijah, the son of Ahitub, Ichabod’s brother, the son of Pinehas, the son of Eli, was the Lord’s priest",
          "talmudLocation": "Shabbat 55b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55b#section-14",
          "talmudFullText": "The Talmud now examines <b>the matter itself</b> of Rav’s statement cited in the course of the previous discussion. <b>Rav said: Pinehas did not sin, as it is stated: “And Ahijah, the son of Ahitub, Ichabod’s brother, the son of Pinehas, the son of Eli, was YHWH’s priest</b> in Shiloh, wearing an ephod” (I Samuel 14:3). <b>Is it possible that sin came to</b> Pinehas’ <b>hand and, </b> nevertheless, <b>the verse traces the lineage</b> of his grandson, Ahijah, back <b>to him? </b>"
        },
        {
          "verseLocation": "1 Samuel 14:24",
          "verseText": "from here: “And the men of Israel were distressed on that day, and Saul administered an oath [ vayyoel ] to the people, saying: Arur is the man who eats",
          "talmudLocation": "Shevuot 36a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/36a#section-7",
          "talmudFullText": "<b>Rather, </b> the fact that there is an element of oath in the term <i>arur</i> is derived <b>from here: “And the men of Israel were distressed on that day, and Saul administered an oath [<i>vayyoel</i>] to the people, saying: <i>Arur</i> is the man who eats</b> bread until the evening and I will be avenged on my enemies” (I Samuel 14:24). <b>And it is written: “But Jonathan did not hear when his father administered the oath to the people”</b> (I Samuel 14:27). The Talmud challenges: <b>But perhaps, here too, </b> Saul <b>performed two</b> actions <b>to</b> the people; <b>he administered an oath to them and he cursed them. </b>"
        },
        {
          "verseLocation": "1 Samuel 14:27",
          "verseText": "and dipped it in the honeycomb [ ya’arat hadevash ]”",
          "talmudLocation": "Bava Batra 66a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/66a#section-3",
          "talmudFullText": "The Talmud rejects this opinion, stating that <b>there, </b> in the Mishnah, R' Eliezer treats the beehive like land for <b>the reason that R' Elazar stated, </b> and not because he holds that all vessels that are affixed to the ground are considered like land. <b>As R' Elazar stated: What is the reasoning for</b> the statement <b>of R' Eliezer</b> with regard to one who removes honey from a beehive? His rationale is <b>as it is written: </b> “And he put forth the end of the rod that was in his hand <b>and dipped it in the honeycomb [<i>ya’arat hadevash</i>]”</b> (I Samuel 14:27)."
        },
        {
          "verseLocation": "1 Samuel 14:27",
          "verseText": "and dipped it in the honeycomb [ ya’arat hadevash ]”",
          "talmudLocation": "Bava Batra 80b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/80b#section-4",
          "talmudFullText": "<b>R' Elazar said: What is the reasoning of R' Eliezer? As it is written</b> with regard to Jonathan: “He put forth the end of the rod that was in his hand, <b>and dipped it in the honeycomb [<i>ya’arat hadevash</i>]”</b> (I Samuel 14:27). <b>Now, what does a forest [<i>ya’ar</i>] have to do with honey [<i>devash</i>]? </b> Why is the honeycomb called a forest of honey [<i>ya’arat hadevash</i>]? <b>Rather, </b> this serves <b>to tell you: Just as</b> with regard to <b>a forest, one who picks</b> fruit <b>from</b> a tree <b>on Shabbat is liable</b> to bring <b>a sin-offering, so too, </b> with regard to <b>honey, one who removes</b> honey <b>from</b> a beehive <b>on Shabbat is liable</b> to bring <b>a sin-offering. </b>"
        },
        {
          "verseLocation": "1 Samuel 14:27",
          "verseText": "And it is written: “But Jonathan did not hear when his father administered the oath to the people”",
          "talmudLocation": "Shevuot 36a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/36a#section-7",
          "talmudFullText": "<b>Rather, </b> the fact that there is an element of oath in the term <i>arur</i> is derived <b>from here: “And the men of Israel were distressed on that day, and Saul administered an oath [<i>vayyoel</i>] to the people, saying: <i>Arur</i> is the man who eats</b> bread until the evening and I will be avenged on my enemies” (I Samuel 14:24). <b>And it is written: “But Jonathan did not hear when his father administered the oath to the people”</b> (I Samuel 14:27). The Talmud challenges: <b>But perhaps, here too, </b> Saul <b>performed two</b> actions <b>to</b> the people; <b>he administered an oath to them and he cursed them. </b>"
        },
        {
          "verseLocation": "1 Samuel 14:29",
          "verseText": "“See, I pray you, how my eyes are brightened because I tasted a little of this honey”",
          "talmudLocation": "Yoma 83b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/83b#section-7",
          "talmudFullText": "<b>A baraita states</b> in a <i>baraita</i>: In the case of <b>one who is seized with <i>bulmos</i>, one feeds him honey and all types of sweet</b> foods, <b>as the honey and all types of sweet</b> foods <b>restore the sight of his eyes. And although there is no</b> clear <b>proof for the matter, there is an allusion to the matter. </b> Jonathan said: <b>“See, I pray you, how my eyes are brightened because I tasted a little of this honey”</b> (I Samuel 14:29)."
        },
        {
          "verseLocation": "1 Samuel 14:34",
          "verseText": "“And slaughter with this and eat”",
          "talmudLocation": "Chullin 17b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/17b#section-6",
          "talmudFullText": "§ <b>Rav Ḥisda says: From where</b> is it derived <b>that examination of a knife</b> is an obligation <b>by Torah law? </b> It is derived from a verse, <b>as it is stated</b> with regard to Saul’s instructions to the people: <b>“And slaughter with this and eat”</b> (I Samuel 14:34), indicating that Saul gave them the knife only after ensuring that it was fit to slaughter their animals."
        },
        {
          "verseLocation": "1 Samuel 14:34",
          "verseText": "it is written: “And Saul said: Disperse yourselves among the people and say to them: Bring me here every man his ox and every man his sheep, and slay them here and eat and sin not against the Lord in eating with the blood. And all the people brought every man his ox with him that night, and slew them there”",
          "talmudLocation": "Zevachim 120a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/120a#section-9",
          "talmudFullText": "<b>And</b> immediately thereafter <b>it is written: “And Saul said: Disperse yourselves among the people and say to them: Bring me here every man his ox and every man his sheep, and slay them here and eat and sin not against YHWH in eating with the blood. And all the people brought every man his ox with him that night, and slew them there”</b> (I Samuel 14:34). This verse states explicitly that the slaughter took place at night and not during the day."
        },
        {
          "verseLocation": "1 Samuel 14:45",
          "verseText": "“The people said to Saul: Shall Jonathan die, who has wrought this great salvation",
          "talmudLocation": "Berakhot 55b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/55b#section-9",
          "talmudFullText": "<b>And three redemptions, as it is written: </b><br><b>“He has redeemed my soul in peace so that none came near me; </b> for they were many that strove with me” (Psalms 55:19); <b><b>“The redeemed of YHWH shall return, </b> and come with singing unto Zion, and everlasting joy shall be upon their heads; <b>they shall obtain gladness and joy, and sorrow and sighing shall flee away” (Isaiah 35: 10); <br>and: <b>“The people said to Saul: Shall Jonathan die, who has wrought this great salvation</b> in Israel? <br>So the people rescued Jonathan, that he died not” (I Samuel 14:45)."
        },
        {
          "verseLocation": "1 Samuel 14:47",
          "verseText": "As with regard to Saul it is written: “And wherever he turned he put them to the worse”",
          "talmudLocation": "Sanhedrin 93b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93b#section-4",
          "talmudFullText": "The Talmud relates: <b>In</b> response to <b>all of</b> these virtues listed in praise of David, Saul <b>said to</b> his servants: <b>My son Jonathan is his equal. Once</b> Doeg <b>said to</b> Saul: <b>“And YHWH is with him, ”</b> meaning that the <i>halakha</i> is ruled in accordance with his opinion in every area of <i>halakha</i>, <b>a matter that did not</b> apply <b>even to</b> Saul <b>himself, he was offended and grew jealous</b> of David. <b>As with regard to Saul it is written: “And wherever he turned he put them to the worse”</b> (I Samuel 14:47), <b>and with regard to David it is written: And wherever he turns he does prosper. </b> Although the verse about Saul is referring to his victories and his prominence in Torah, he was not privileged to have all of his conclusions accepted as <i>halakha</i>."
        }
      ]
    },
    {
      "chapterNumber": 15,
      "citations": [
        {
          "verseLocation": "1 Samuel 15:3",
          "verseText": "go and attack Amalek",
          "talmudLocation": "Yoma 22b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-8",
          "talmudFullText": "§ Having mentioned the verse about Saul, the Talmud proceeds to interpret more of that passage: “And Saul came to the city of Amalek <b>and he strove in the valley”</b> (I Samuel 15:5). <b>R' Mani said: </b> This means that Saul strove with God, as it were, <b>concerning the matter of the valley. At the time when God said to</b> Saul: “Now <b>go and attack Amalek</b> and proscribe all that belongs to him; do not pity him, but kill men and women alike, infants and sucklings alike, oxen and sheep alike, camel and donkey alike” (I Samuel 15:3), Saul countered and <b>said: Now, if</b> on account of <b>one life</b> that is taken, in a case where a slain person’s body is found and the murderer is unknown, <b>the Torah said to bring a heifer whose neck is broken</b> to a barren valley, in the atonement ritual described in Deuteronomy 21:1–9, <b>all the more so</b> must I have pity and not take <b>all these</b> Amalekite <b>lives. </b>"
        },
        {
          "verseLocation": "1 Samuel 15:4",
          "verseText": "“And Saul summoned the people and numbered them by sheep”",
          "talmudLocation": "Yoma 22b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-3",
          "talmudFullText": "<b>Rav Ashi strongly objects to this</b> interpretation of the verse: <b>From where</b> do you derive <b>that this</b> word <b><i>bezek</i> is a term</b> related to the verb meaning <b>to break apart, </b> so that it means shards? <b>Perhaps it is the name of a town, </b> and it means that Saul counted them in Bezek, <b>as it is written: “And they found Adoni-bezek</b> in Bezek” (Judges 1:5), which shows that Bezek is the name of a place. The Talmud answers: Indeed, the proof is not from that verse <b>but from here, </b> where it says: <b>“And Saul summoned the people and numbered them by sheep”</b> (I Samuel 15:4), meaning that Saul tallied his soldiers by having each one take a sheep and put it aside to represent him in the count."
        },
        {
          "verseLocation": "1 Samuel 15:5",
          "verseText": "as it is written: “And Saul came to a city of Amalek and quarreled in the valley”",
          "talmudLocation": "Shabbat 56b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56b#section-2",
          "talmudFullText": "<b>This is what is written: “And the son of Jonathan was Meriv-Baal”</b> (I Chronicles 8:34). The Talmud asks: <b>And was Meriv-Baal his name? Wasn’t his name Mephibosheth? However, since he entered into a quarrel [<i>meriva</i>] with his Master [<i>ba’al</i>], </b> i.e., God, and complained about God having saved David, <b>a bat kol emerged and said to him: Quarrelsome</b> one, <b>the son of a quarrelsome</b> one; you are just like your father, Saul. The Talmud explains: <b>Quarrelsome</b> one; <b>that which we</b> just <b>said</b> that Mephibosheth complained to God about His salvation of David. <b>The son of a quarrelsome</b> one; <b>as it is written: “And Saul came to a city of Amalek and quarreled in the valley”</b> (I Samuel 15:5). And <b>R' Mani said: </b> Saul quarreled with God <b>with regard to matters of the valley, </b> saying: For the murder of even a single person, there is a commandment to break the neck of a heifer in a valley to atone for the crime (see Deuteronomy 21:1–9); why then must all these Amalekites be killed?"
        },
        {
          "verseLocation": "1 Samuel 15:5",
          "verseText": "and he strove in the valley”",
          "talmudLocation": "Yoma 22b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-8",
          "talmudFullText": "§ Having mentioned the verse about Saul, the Talmud proceeds to interpret more of that passage: “And Saul came to the city of Amalek <b>and he strove in the valley”</b> (I Samuel 15:5). <b>R' Mani said: </b> This means that Saul strove with God, as it were, <b>concerning the matter of the valley. At the time when God said to</b> Saul: “Now <b>go and attack Amalek</b> and proscribe all that belongs to him; do not pity him, but kill men and women alike, infants and sucklings alike, oxen and sheep alike, camel and donkey alike” (I Samuel 15:3), Saul countered and <b>said: Now, if</b> on account of <b>one life</b> that is taken, in a case where a slain person’s body is found and the murderer is unknown, <b>the Torah said to bring a heifer whose neck is broken</b> to a barren valley, in the atonement ritual described in Deuteronomy 21:1–9, <b>all the more so</b> must I have pity and not take <b>all these</b> Amalekite <b>lives. </b>"
        },
        {
          "verseLocation": "1 Samuel 15:6",
          "verseText": "that which is written: “And Saul said unto the Kenites: Go, depart, get you down from among the Amalekites lest I destroy you with them, for you showed kindness to all the Children of Israel when they came up out of Egypt”",
          "talmudLocation": "Berakhot 63b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/63b#section-21",
          "talmudFullText": "The Talmud returns to the homilies offered by the rabbis in the vineyard of Yavne. <b>R' Neḥemya began</b> to speak <b>in honor of the hosts and taught: What is</b> the meaning of <b>that which is written: “And Saul said unto the Kenites: Go, depart, get you down from among the Amalekites lest I destroy you with them, for you showed kindness to all the Children of Israel when they came up out of Egypt”</b> (I Samuel 15:6)? <b>Isn’t this an <i>a fortiori</i> inference: Just as Jethro, </b> the forbearer of the Kenite tribe, who <b>only befriended Moses for his own honor, </b> is treated <b>in this way</b> and rewarded that his merit would protect his descendants; <b>all the more so</b> should <b>one who hosts a Torah scholar in his home, providing him with food and drink and availing him of his possessions, </b> be rewarded with that protection."
        },
        {
          "verseLocation": "1 Samuel 15:11",
          "verseText": "as it is written: “I regret that I made Saul king”",
          "talmudLocation": "Taanit 5b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/5b#section-4",
          "talmudFullText": "R' Yitzḥak <b>said to</b> Rav Naḥman that <b>R' Yoḥanan said as follows: Old age sprang upon</b> Samuel, which caused him to appear older than his actual age, <b>as it is written: “I regret that I made Saul king”</b> (I Samuel 15:11). Samuel <b>said before</b> God: <b>God!, You have</b> considered <b>me the equivalent of Moses and Aaron, as it is written: “Moses and Aaron among His priests, and Samuel among those who call upon His Name”</b> (Psalms 99:6). <b>Just as</b> with regard to <b>Moses and Aaron, their handiwork was not annulled in their lifetimes, so too, let my handiwork not be annulled in my lifetime. </b> I anointed Saul; please do not annul his reign."
        },
        {
          "verseLocation": "1 Samuel 15:11",
          "verseText": "“I regret that I have crowned Saul to be king”",
          "talmudLocation": "Yoma 22b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-10",
          "talmudFullText": "Apropos Saul’s contravention of God’s command to obliterate Amalek, the Talmud observes that <b>Rav Huna said: How little does a person who has the support of his Lord have to worry or be concerned. </b> The proof for this assertion is a comparison between Saul and David. <b>Saul</b> failed <b>with one</b> single sin <b>and it was counted against him, </b> costing him the throne. <b>David, </b> however, failed <b>with two</b> sins <b>and</b> they were <b>not counted against him, </b> as he retained his position. The Talmud asks: <b>What was Saul’s one</b> sin? <b>The incident</b> with <b>Agag, </b> king of Amalek, whom Saul spared in defiance of God’s command (see I Samuel 15:9). <b>But</b> was this his sole sin? <b>There is</b> also <b>the incident of Nob, the city of priests, </b> in which Saul later slew many innocent people, as cited above. The Talmud answers: It was after <b>the incident</b> with <b>Agag, </b> and even before the incident at Nob, that God said: <b>“I regret that I have crowned Saul to be king”</b> (I Samuel 15:11)."
        },
        {
          "verseLocation": "1 Samuel 15:15",
          "verseText": "“And Saul said: They have brought them from the Amalekites; for the people spared the best of the flock and of the herd, to sacrifice unto the Lord your God”",
          "talmudLocation": "Avodah Zarah 24b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/24b#section-2",
          "talmudFullText": "The Talmud further states: <b>Come</b> and <b>hear</b> another objection from a verse: <b>“And Saul said: They have brought them from the Amalekites; for the people spared the best of the flock and of the herd, to sacrifice unto YHWH your God”</b> (I Samuel 15:15). The verse states explicitly that the Israelites intended to sacrifice animals previously owned by non-Jews. The Talmud explains: <b>What</b> is the meaning of the phrase: <b>“The best”? </b> This is referring to <b>the</b> monetary <b>value of the best</b> livestock. The intention was not to sacrifice the animals themselves, but to sell them and use the proceeds of the sale to purchase other animals to sacrifice as offerings."
        }
      ]
    },
    {
      "chapterNumber": 16,
      "citations": [
        {
          "verseLocation": "1 Samuel 16:2",
          "verseText": "as it is written: “And Samuel said: How can I go? If Saul hears of it, he will kill me”",
          "talmudLocation": "Chullin 142a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/142a#section-8",
          "talmudFullText": "The Talmud asks: <b>But didn’t R' Elazar say: Those on the path to perform a mitzva are not</b> susceptible to <b>harm, neither when they</b> are <b>on their way</b> to perform the mitzva <b>nor when they are returning</b> from performing the mitzva? The Talmud answers: In that case, it <b>was a rickety ladder</b> on which the son ascended and descended, <b>and a place where danger is established is different, </b> and even those on the path to perform a mitzva are susceptible to harm. This is apparent from the incident where the prophet Samuel traveled to anoint David as king in place of Saul, <b>as it is written: “And Samuel said: How can I go? If Saul hears of it, he will kill me”</b> (I Samuel 16:2). Although Samuel was on the path to perform a mitzva, he feared that harm would befall him from established dangers."
        },
        {
          "verseLocation": "1 Samuel 16:2",
          "verseText": "“And Samuel said: How will I go, and Saul will hear and kill me;",
          "talmudLocation": "Kiddushin 39b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/39b#section-12",
          "talmudFullText": "The Talmud asks: <b>But didn’t R' Elazar say</b> that <b>those on the path to perform a mitzva are not</b> susceptible to <b>harm, neither</b> when they are <b>on their way</b> to perform the mitzva <b>nor when they are returning</b> from performing the mitzva? The Talmud answers: In that case it <b>was a rickety ladder, </b> and therefore <b>the danger was established; and anywhere that the danger is established one may not rely on a miracle, as it is written</b> with regard to God’s command to Samuel to anoint David as king in place of Saul: <b>“And Samuel said: How will I go, and Saul will hear and kill me; </b> and God said: Take in your hand a calf and say: I have come to sacrifice an offering to God” (I Samuel 16:2). Although God Himself issued the command, there was concern with regard to the established dangers."
        },
        {
          "verseLocation": "1 Samuel 16:2",
          "verseText": "Rabbi Nehorai said to him: But isn’t it already stated: “And Samuel said: How can I go; if Saul hears it he will kill me”",
          "talmudLocation": "Nazir 66a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/66a#section-11",
          "talmudFullText": "<b>R' Yosei said: But doesn’t</b> the word <b>“<i>mora</i>”</b> mean <b>nothing other</b> than the fear <b>of flesh and blood? </b> The word should be read as though it were written with an <i>alef</i>, and not a <i>heh</i>, so that it means fear. <b>R' Nehorai said to him: But isn’t it already stated: “And Samuel said: How can I go; if Saul hears it he will kill me”</b> (I Samuel 16:2). This verse indicates <b>that there was fear of flesh and blood upon</b> Samuel. Consequently, the term <i>mora</i> must be understood in accordance with its plain meaning of a razor. If so, Samuel was indeed a nazirite."
        },
        {
          "verseLocation": "1 Samuel 16:2",
          "verseText": "“And Samuel said: How will I go, and Saul will hear and kill me; and God said: Take in your hand a calf",
          "talmudLocation": "Pesachim 8b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/8b#section-4",
          "talmudFullText": "The Talmud raises a difficulty: <b>But didn’t R' Elazar say</b> that <b>those on the path to perform a mitzva are not</b> susceptible to <b>harm</b> throughout the process of performing the mitzva? The Talmud responds: In a place <b>where danger is commonplace it is different, </b> as one should not rely on a miracle, <b>as it is stated</b> with regard to God’s command to Samuel to anoint David as king in place of Saul: <b>“And Samuel said: How will I go, and Saul will hear and kill me; and God said: Take in your hand a calf</b> and say: I have come to offer a sacrifice to God” (I Samuel 16:2). Even when God Himself issued the command, there is concern with regard to commonplace dangers."
        },
        {
          "verseLocation": "1 Samuel 16:2",
          "verseText": "as it is stated: “And Samuel said: How can I go, and Saul will hear and kill me”",
          "talmudLocation": "Yevamot 65b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/65b#section-8",
          "talmudFullText": "<b>R' Natan says: </b> It is <b>a mitzva</b> to depart from the truth in order to preserve peace, <b>as it is stated: “And Samuel said: How can I go, and Saul will hear and kill me”</b> (I Samuel 16:2). God responded in the next verse that Samuel should say he went to sacrifice an offering, indicating that God commands one to lie in order to preserve peace."
        },
        {
          "verseLocation": "1 Samuel 16:2",
          "verseText": "“And Samuel said: How will I go, and Saul will hear and kill me; and God said: Take in your hand a calf and say: I have come to offer a sacrifice to God”",
          "talmudLocation": "Yoma 11a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/11a#section-6",
          "talmudFullText": "<b>And R' Yehuda said: </b> There was <b>an incident</b> involving <b>an examiner [<i>artavin</i>], who was examining <i>mezuzot</i> in the upper marketplace of Tzippori</b> during a period when decrees were issued against the Jewish people, <b>and a</b> Roman <b>official [<i>kasdor</i>] found him and collected</b> a fine of <b>one thousand <i>zuz</i> from him. </b> The Talmud raises a difficulty: <b>But didn’t R' Elazar say</b> that <b>those on the path to perform a mitzva are not</b> susceptible to <b>harm</b> throughout the process of performing the mitzva? The Talmud responds: In a place <b>where danger is permanent it is different, </b> as one should not rely on a miracle, <b>as it is written</b> with regard to God’s command to Samuel to anoint David as king in place of Saul: <b>“And Samuel said: How will I go, and Saul will hear and kill me; and God said: Take in your hand a calf and say: I have come to offer a sacrifice to God”</b> (I Samuel 16:2). Even when God Himself issues the command, there is concern with regard to a clear and present danger."
        },
        {
          "verseLocation": "1 Samuel 16:7",
          "verseText": "whereas with regard to Eliab it is written: “And the Lord said to Samuel: Look not at his appearance, nor at the height of his stature, for I have rejected him”",
          "talmudLocation": "Pesachim 66b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/66b#section-9",
          "talmudFullText": "<b>R' Mani bar Patish said: Whoever becomes angry, even if greatness has been apportioned to him from heaven, he is lowered</b> from his greatness. <b>From where do we</b> derive this? <b>From Eliab, </b> David’s older brother, <b>as it is stated: “And Eliab’s anger burned against David and he said: Why did you come down, and with whom have you left those few sheep in the wilderness? I know your insolence and the evil of your heart, for you have come down to see the battle”</b> (I Samuel 17:28); we see that Eliab became angry. <b>And when Samuel went to anoint him</b> after God had told him that one of Yishai’s sons was to be the king, <b>concerning all of</b> the other brothers <b>it is written: “YHWH has not chosen this one”</b> (I Samuel 16:8), <b>whereas with regard to Eliab it is written: “And YHWH said to Samuel: Look not at his appearance, nor at the height of his stature, for I have rejected him”</b> (I Samuel 16:7). This proves <b>by inference that until now He had loved him, </b> and it was only at this point that Eliab was rejected. Had it not been for his anger, Eliab would have been fit for greatness; but owing to this shortcoming, God rejected him."
        },
        {
          "verseLocation": "1 Samuel 16:7",
          "verseText": "as it is written: “But the Lord looks on the heart”",
          "talmudLocation": "Sanhedrin 106b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106b#section-14",
          "talmudFullText": "<b>But</b> nevertheless, <b>when Rav Yehuda would remove one of his shoes the rain would</b> immediately <b>fall, </b> whereas <b>we cry out and no one notices us. Rather, God seeks the heart, </b> and the barometer of greatness is devotion of the heart and not the amount of Torah that one studies, <b>as it is written: “But YHWH looks on the heart”</b> (I Samuel 16:7)."
        },
        {
          "verseLocation": "1 Samuel 16:8",
          "verseText": "it is written: “The Lord has not chosen this one”",
          "talmudLocation": "Pesachim 66b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/66b#section-9",
          "talmudFullText": "<b>R' Mani bar Patish said: Whoever becomes angry, even if greatness has been apportioned to him from heaven, he is lowered</b> from his greatness. <b>From where do we</b> derive this? <b>From Eliab, </b> David’s older brother, <b>as it is stated: “And Eliab’s anger burned against David and he said: Why did you come down, and with whom have you left those few sheep in the wilderness? I know your insolence and the evil of your heart, for you have come down to see the battle”</b> (I Samuel 17:28); we see that Eliab became angry. <b>And when Samuel went to anoint him</b> after God had told him that one of Yishai’s sons was to be the king, <b>concerning all of</b> the other brothers <b>it is written: “YHWH has not chosen this one”</b> (I Samuel 16:8), <b>whereas with regard to Eliab it is written: “And YHWH said to Samuel: Look not at his appearance, nor at the height of his stature, for I have rejected him”</b> (I Samuel 16:7). This proves <b>by inference that until now He had loved him, </b> and it was only at this point that Eliab was rejected. Had it not been for his anger, Eliab would have been fit for greatness; but owing to this shortcoming, God rejected him."
        },
        {
          "verseLocation": "1 Samuel 16:12",
          "verseText": "the verse states: “Arise, anoint him, for this",
          "talmudLocation": "Horayot 11b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/11b#section-13",
          "talmudFullText": "It is <b>taught: Even Jehu, son of Nimshi, </b> king of Israel, <b>was anointed only due to the challenge of Joram</b> (see II Kings 9:1–14). The rabbis challenge: <b>And let him derive</b> that Jehu was anointed <b>due to</b> the fact <b>that he</b> was the <b>first</b> of his dynasty and was not the son of a king. The Talmud answers: The <i>baraita</i> <b>is incomplete and this</b> is what <b>it is teaching: Kings of the house of David are anointed; kings of Israel are not anointed. </b> The Talmud asks: <b>From where do we</b> derive this? <b>Rava said</b> that <b>the verse states: “Arise, anoint him, for this</b> is he” (I Samuel 16:12), from which it is derived: <b>This</b> king, David, <b>requires anointing, but another</b> king <b>does not require anointing. </b>"
        },
        {
          "verseLocation": "1 Samuel 16:12",
          "verseText": "“Arise, anoint him; for this is he”",
          "talmudLocation": "Keritot 5b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/5b#section-9",
          "talmudFullText": "<b>The Master said</b> earlier: <b>One anoints the kings of the house of David</b> with the anointing oil, but <b>one does not anoint the kings of Israel. </b> The Talmud asks: <b>From where do we</b> derive this <i>halakha</i>? It is derived from a verse, <b>as it is written</b> with regard to the anointing of David: <b>“Arise, anoint him; for this is he”</b> (I Samuel 16:12). <b>This</b> king, i.e., any king from the house of David, <b>requires anointing, but another</b> king, i.e., from the kingdom of Israel, whose kings were not descendants of the house of David, <b>does not require anointing. </b>"
        },
        {
          "verseLocation": "1 Samuel 16:18",
          "verseText": "as it is written: “And one of the servants answered and said: Behold, I have seen a son of Yishai of the house of Bethlehem who knows to play, and is a fine warrior, and a man of war, and prudent in speech, and a comely man, and the Lord is with him”",
          "talmudLocation": "Sanhedrin 93b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93b#section-2",
          "talmudFullText": "The Talmud asks: <b>And is</b> it <b>the</b> typical <b>manner of a woman to take</b> a heavy burden of <b>six <i>se’a</i></b> of barley? <b>Rather, </b> Boaz <b>alluded to</b> Ruth <b>that six descendants are destined to emerge from her who would each be blessed with six blessings, and these are they: David, and</b> the <b>Messiah, Daniel, Hananiah, Mishael, and Azariah. </b> The Talmud elaborates: <b>David</b> was blessed with six virtues, <b>as it is written: “And one of the servants answered and said: Behold, I have seen a son of Yishai of the house of Bethlehem who knows to play, and is a fine warrior, and a man of war, and prudent in speech, and a comely man, and YHWH is with him”</b> (I Samuel 16:18)."
        },
        {
          "verseLocation": "1 Samuel 16:21",
          "verseText": "and he loved him greatly; and he became his armor-bearer”",
          "talmudLocation": "Yevamot 76b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/76b#section-11",
          "talmudFullText": "<strong>Talmud: </strong> The Talmud asks: <b>From where are these matters</b> derived that female Ammonites and Moabites are permitted immediately? <b>R' Yoḥanan said: As the verse states: “And when Saul saw David go forth against the Philistine, he said to Abner, the captain of the host: Abner, whose son is this youth? And Abner said: As your soul lives, O king, I cannot tell”</b> (I Samuel 17:55). This verse is puzzling: <b>Did</b> Saul really <b>not recognize him? But isn’t it</b> previously <b>written: </b> “And David came to Saul, and stood before him; <b>and he loved him greatly; and he became his armor-bearer”</b> (I Samuel 16:21)? <b>Rather, </b> it must be that <b>he was asking about</b> David’s <b>father. </b>"
        }
      ]
    },
    {
      "chapterNumber": 17,
      "citations": [
        {
          "verseLocation": "1 Samuel 17:4",
          "verseText": "“And a champion [ ish habeinayim ] went out from the camp of the Philistines,",
          "talmudLocation": "Sotah 42b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-5",
          "talmudFullText": "The verse introduces Goliath: <b>“And a champion [<i>ish habeinayim</i>] went out from the camp of the Philistines, </b> named Goliath” (I Samuel 17:4). The Talmud asks: <b>What</b> is indicated by the term <b><i>beinayim</i>? Rav said: </b> The word is related to the root <i>beit</i>, <i>nun</i>, <i>heh</i>, meaning build, and means <b>that he is built [<i>muvneh</i>]</b> perfectly and free <b>of any blemish. And Shmuel said: </b> The word is related to the word <i>bein</i>, meaning between, and means that he was <b>the middle [<i>beinoni</i>] among his brothers. </b> A Sage <b>from the school of R' Sheila said: </b> The word is related to the root <i>beit</i>, <i>nun</i>, <i>heh</i>, meaning build, and means <b>that he</b> was <b>made</b> strong <b>as a building [<i>binyan</i>]. R' Yoḥanan said: </b> The word is related to the word <i>bein</i>, meaning between, and means that he was born from among many, as follows: He was <b>the son of one hundred fathers [<i>pappi</i>] and one dog [<i>nanai</i>], </b> as his mother had sex with one hundred men and a dog, and he was fathered from among them."
        },
        {
          "verseLocation": "1 Samuel 17:4",
          "verseText": "“named Goliath, of Gath”",
          "talmudLocation": "Sotah 42b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-6",
          "talmudFullText": "The verse recounts that he was <b>“named Goliath, of Gath”</b> (I Samuel 17:4). <b>Rav Yosef taught: </b> This is <b>because everyone</b> would <b>thresh his mother</b> by cohabiting with her <b>like</b> people do in <b>a winepress [<i>gat</i>], </b> where everyone tramples. <b>It is written</b> that Goliath came from <b>“the caves [<i>me’arot</i>]</b> of the Philistines” (I Samuel 17:23), <b>but we read, </b> according to the Masoretic text: He came from among “the <b>ranks [<i>ma’arkhot</i>]</b> of the Philistines. ” What is meant by the written term <i>me’arot</i>? <b>Rav Yosef taught: </b> The word is related to the word <i>he’era</i>, meaning penetrated, and implies <b>that everyone penetrated [<i>he’eru</i>], </b> i.e., had sex <b>with, his mother. </b>"
        },
        {
          "verseLocation": "1 Samuel 17:5",
          "verseText": "As it is written: “And he was clad with a coat of scale armor [ kaskasim ]”",
          "talmudLocation": "Chullin 66b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/66b#section-4",
          "talmudFullText": "The Talmud asks: <b>But now that God has written: “<i>Senappir</i> and <i>kaskeset</i>, ” from where</b> is it derived that <b><i>kaskeset</i></b> denotes <b>clothing, </b> i.e., scales, rather than fins? <b>As it is written: “And he was clad with a coat of scale armor [<i>kaskasim</i>]”</b> (I Samuel 17:5). And if it is certain that <i>kaskeset</i> refers to scales, the question resurfaces: <b>Let God write</b> only <b>“<i>kaskeset</i>, ” and let</b> Him <b>not write “<i>senappir</i>. ”</b>"
        },
        {
          "verseLocation": "1 Samuel 17:5",
          "verseText": "“And he was clad with a coat of mail [ kaskasim ]”",
          "talmudLocation": "Niddah 51b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/51b#section-16",
          "talmudFullText": "The Talmud further asks: <b>But now that God wrote</b> in the Torah <b>fins and <i>kaskeset</i>, from where do we</b> derive that <b><i>kaskeset</i></b> denotes <b>clothing, </b> i.e., scales, rather than fins? The Talmud answers: We derive it from a verse, <b>as it is written</b> about Goliath the Philistine: <b>“And he was clad with a coat of mail [<i>kaskasim</i>]”</b> (I Samuel 17:5)."
        },
        {
          "verseLocation": "1 Samuel 17:7",
          "verseText": "the half [ ḥetz ] of his spear",
          "talmudLocation": "Sotah 42b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-10",
          "talmudFullText": "<b>It is written</b> about Goliath: “And <b>the half [<i>ḥetz</i>] of his spear</b> was like a weaver’s beam” (I Samuel 17:7), <b>and we read, </b> according to the Masoretic tradition: “And <b>the shaft [<i>etz</i>] of his spear. ” R' Elazar says: </b> The written version of the text demonstrates that <b>we have not yet reached half [<i>ḥetzi</i>] of the praise of that wicked</b> man. Only half of his spear was as long as a weaver’s beam, but the Masoretic reading offers a less impressive description. It is learned <b>from here that it is prohibited to relate the praise of wicked people. </b> The Talmud asks: If so, <b>then</b> the verse <b>should not begin</b> by praising <b>him at all. </b> The Talmud answers: It was necessary in this case in order <b>to relate the praise of David, </b> who defeated Goliath."
        },
        {
          "verseLocation": "1 Samuel 17:8",
          "verseText": "that he stood before the Holy One, Blessed be He, with brazenness [ gilui panim ], as it is stated: “Choose yourselves a man [ ish ], and let him come down to me”",
          "talmudLocation": "Sotah 42b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-2",
          "talmudFullText": "The Mishnah recorded the particulars of the priest’s address: <b>The Philistines came championed by Goliath. </b> The Talmud describes the battle between David and Goliath. What is implied by the name <b>Goliath? R' Yoḥanan says: </b> The verse indicates <b>that he stood before God with brazenness [<i>gilui panim</i>], as it is stated: “Choose yourselves a man [<i>ish</i>], and let him come down to me”</b> (I Samuel 17:8), and <b>man [<i>ish</i>]</b> is referring to <b>none other</b> than <b>God as it is stated: “YHWH is a man [<i>ish</i>] of war”</b> (Exodus 15:3). <b>God said: I will hereby fell him by the son of a man [<i>ben ish</i>], as it is stated: “Now David was the son of that man [<i>ben ish</i>] of Ephrath”</b> (I Samuel 17:12)."
        },
        {
          "verseLocation": "1 Samuel 17:9",
          "verseText": "“If he is able to fight with me and kill me",
          "talmudLocation": "Sotah 42b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-3",
          "talmudFullText": "<b>R' Yoḥanan said in the name of R' Meir: In three instances, his</b> own <b>mouth ensnared that wicked one</b> and unwittingly foretold his own downfall. <b>One</b> time he said: <b>“Choose yourselves a man, and let him come down to me, ”</b> describing himself at the bottom. <b>And another</b> time, he said: <b>“If he is able to fight with me and kill me</b> then will we be your servants; but if I prevail against him, and kill him, then shall you be our servants, and serve us” (I Samuel 17:9). There, he supposed that his opponent would defeat him, before supposing that he, Goliath, would be victorious. Finally, <b>the other</b> time was <b>when he said to David</b> (I Samuel 17:43): <b>“Am I a dog, that you come to me with staves? ”</b> The Talmud asks: But didn’t David also speak in this manner? <b>David also said to him: “You come to me with a sword, and with a spear, and with a javelin”</b> (I Samuel 17:45). The Talmud answers: David <b>then said to him, </b> immediately afterward: <b>“But I come to you in the name of YHWH of hosts, the God of the armies of Israel, whom you have taunted”</b> (I Samuel 17:45)."
        },
        {
          "verseLocation": "1 Samuel 17:12",
          "verseText": "“And the man in the days of Saul was old, and came among men”",
          "talmudLocation": "Berakhot 58a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58a#section-7",
          "talmudFullText": "On the topic of multitudes, the Talmud cites another verse: <b>“And the man in the days of Saul was old, and came among men”</b> (I Samuel 17:12). <b>Rava, and some say Rav Zevid, and some say Rav Oshaya, said: This</b> refers to <b>Yishai, father of David, who</b> always <b>went out with multitudes, and entered with multitudes, and taught Torah with multitudes. Ulla said: We hold there is no multitude in Babylonia. </b> The Sage <b>taught: A multitude is no fewer than six hundred thousand</b> people."
        },
        {
          "verseLocation": "1 Samuel 17:12",
          "verseText": "And it is written: “David was the son of that Ephrathite",
          "talmudLocation": "Sotah 11b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11b#section-22",
          "talmudFullText": "The verse relates the midwives’ reward: <b>“And it came to pass, because the midwives feared God, that He made them houses”</b> (Exodus 1:21). <b>Rav and Shmuel</b> disagree as to the precise interpretation of these houses: <b>One says</b> that God made <b>the houses of</b> the <b>priesthood and</b> the <b>Levites</b> descend from the midwives, <b>and one says</b> that God made the <b>houses of royalty</b> descend from them. <b>The one who says</b> that it is referring to the <b>houses of</b> the <b>priesthood and</b> the <b>Levites</b> is referring to <b>Aaron and Moses, </b> who were sons of Jochebed. <b>And the one who says</b> that it is referring to <b>houses of royalty</b> is referring to <b>David, </b> who <b>also comes from Miriam, as it is written: “And Azubah, ” the wife of Caleb, “died, and Caleb took to him Ephrath, who bore him Hur”</b> (I Chronicles 2:19) and, as will be explained further, Ephrath is Miriam. <b>And it is written: “David was the son of that Ephrathite</b> of Bethlehem in Judah” (I Samuel 17:12). Therefore, he was a descendant of Miriam."
        },
        {
          "verseLocation": "1 Samuel 17:12",
          "verseText": "The Holy One, Blessed be He, said: I will hereby fell him by the son of a man [ ben ish ], as it is stated: “Now David was the son of that man [ ben ish ] of Ephrath”",
          "talmudLocation": "Sotah 42b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-2",
          "talmudFullText": "The Mishnah recorded the particulars of the priest’s address: <b>The Philistines came championed by Goliath. </b> The Talmud describes the battle between David and Goliath. What is implied by the name <b>Goliath? R' Yoḥanan says: </b> The verse indicates <b>that he stood before God with brazenness [<i>gilui panim</i>], as it is stated: “Choose yourselves a man [<i>ish</i>], and let him come down to me”</b> (I Samuel 17:8), and <b>man [<i>ish</i>]</b> is referring to <b>none other</b> than <b>God as it is stated: “YHWH is a man [<i>ish</i>] of war”</b> (Exodus 15:3). <b>God said: I will hereby fell him by the son of a man [<i>ben ish</i>], as it is stated: “Now David was the son of that man [<i>ben ish</i>] of Ephrath”</b> (I Samuel 17:12)."
        },
        {
          "verseLocation": "1 Samuel 17:12",
          "verseText": "“And the man in the days of Saul was old, and came among men”",
          "talmudLocation": "Yevamot 76b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/76b#section-12",
          "talmudFullText": "The Talmud is still puzzled by this verse: <b>And did</b> Saul <b>not recognize</b> David’s <b>father? But isn’t it written</b> with regard to Jesse, David’s father: <b>“And the man in the days of Saul was old, and came among men”</b> (I Samuel 17:12), <b>and Rav, and some say R' Abba, said: This</b> is referring to <b>Jesse, father of David, who</b> always <b>entered with multitudes [<i>ukhlusa</i>] and left with multitudes. </b> As he was clearly a man of importance, everyone must have known who he was."
        },
        {
          "verseLocation": "1 Samuel 17:14",
          "verseText": "“And David, this was [ hu ] the youngest”",
          "talmudLocation": "Megillah 11a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-18",
          "talmudFullText": "The Talmud continues: The word <i>hu</i> is also used to recognize sustained righteousness. <b>“Abram, this is [<i>hu</i>] Abraham”</b> (I Chronicles 1:27); this indicates that Abraham didn’t change, as <b>he</b> remained <b>in his righteousness from beginning to end. </b> Similarly, <b>“This is [<i>hu</i>] Aaron and Moses”</b> (Exodus 6:26); <b>they remained in their righteousness from</b> the <b>beginning</b> of their life <b>to</b> the <b>end</b> of their life. Similarly, with respect to David: <b>“And David, this was [<i>hu</i>] the youngest”</b> (I Samuel 17:14), indicates that <b>he remained in his humility from beginning to end. Just as in his youth, </b> when he was still an ordinary individual, <b>he humbled himself before anyone who was greater than him in Torah, so too, in his kingship, he humbled himself before anyone who was greater than him in wisdom. </b>"
        },
        {
          "verseLocation": "1 Samuel 17:16",
          "verseText": "“And the Philistine drew near morning and evening”",
          "talmudLocation": "Sotah 42b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-4",
          "talmudFullText": "The verse says: <b>“And the Philistine drew near morning and evening”</b> (I Samuel 17:16). <b>R' Yoḥanan says: </b> He did this specifically <b>in order to prevent them from</b> completing <b>the recitation of <i>Shema</i></b> in the required times of <b>morning and evening. “And</b> Goliath <b>presented himself forty days”</b> (I Samuel 17:16). <b>R' Yoḥanan says: </b> These days <b>correspond</b> to <b>the forty days over which the Torah was given, </b> as he wanted to do away with it."
        },
        {
          "verseLocation": "1 Samuel 17:18",
          "verseText": "“And these ten cheeses",
          "talmudLocation": "Bekhorot 6b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/6b#section-16",
          "talmudFullText": "The Talmud rejects the proof: <b>But perhaps</b> the verse is referring <b>to</b> selling the milk as <b>merchandise</b> and using the money to buy food, and not to consuming the milk itself. <b>Rather, </b> proof may be brought <b>from</b> the fact <b>that it is written</b> with regard to Jesse’s instructions to his son David upon sending him with provisions for his brothers, who were at war against the Philistines: <b>“And these ten cheeses</b> you shall bring to the captain of their thousand” (I Samuel 17:18), which indicates they ate dairy products."
        },
        {
          "verseLocation": "1 Samuel 17:18",
          "verseText": "as it is written: “And to your brothers bring greetings and take their pledge [ arubatam ]”",
          "talmudLocation": "Ketubot 9b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/9b#section-1",
          "talmudFullText": "<b>Anyone who goes to a war</b> waged by the royal <b>house of David writes a</b> conditional <b>bill of divorce to his wife. </b> This was done to prevent a situation in which the wife of the soldier would be unable to remarry because her husband did not return from battle and there were no witnesses with regard to his fate. The conditional bill of divorce accorded the wife the status of a divorcée and freed her to remarry, <b>as it is written: “And to your brothers bring greetings and take their pledge [<i>arubatam</i>]”</b> (I Samuel 17:18). <b>What is</b> the meaning of: <b>And take <i>arubatam</i>? Rav Yosef taught: </b> It is referring to <b>matters that are shared [<i>hame’oravin</i>] between</b> the husband <b>and</b> his wife, i.e., marriage. Since apparently it was customary for men at war to send their wives a conditional divorce, and since Uriah later died, Bathsheba assumed divorced status retroactively from the time that he set out to war. Therefore, she was not forbidden to David."
        },
        {
          "verseLocation": "1 Samuel 17:18",
          "verseText": "As it is stated: “And carry these ten cheeses to the captain of their thousand, and to your brothers bring greetings and take their pledge [ arubatam ]",
          "talmudLocation": "Shabbat 56a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-8",
          "talmudFullText": "<b>As R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: Anyone who goes to a war</b> waged by the royal <b>house of David writes a</b> conditional <b>bill of divorce to his wife. </b> That was done to prevent a situation in which the soldier’s wife would be unable to remarry because the soldier did not return from battle and there were no witnesses to his fate. The conditional bill of divorce accorded her the status of a divorcee and freed her to remarry. <b>As it is stated: “And carry these ten cheeses to the captain of their thousand, and to your brothers bring greetings and take their pledge [<i>arubatam</i>]</b>” (I Samuel 17:18)."
        },
        {
          "verseLocation": "1 Samuel 17:23",
          "verseText": "“the caves [ me’arot ]",
          "talmudLocation": "Sotah 42b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-6",
          "talmudFullText": "The verse recounts that he was <b>“named Goliath, of Gath”</b> (I Samuel 17:4). <b>Rav Yosef taught: </b> This is <b>because everyone</b> would <b>thresh his mother</b> by cohabiting with her <b>like</b> people do in <b>a winepress [<i>gat</i>], </b> where everyone tramples. <b>It is written</b> that Goliath came from <b>“the caves [<i>me’arot</i>]</b> of the Philistines” (I Samuel 17:23), <b>but we read, </b> according to the Masoretic text: He came from among “the <b>ranks [<i>ma’arkhot</i>]</b> of the Philistines. ” What is meant by the written term <i>me’arot</i>? <b>Rav Yosef taught: </b> The word is related to the word <i>he’era</i>, meaning penetrated, and implies <b>that everyone penetrated [<i>he’eru</i>], </b> i.e., had sex <b>with, his mother. </b>"
        },
        {
          "verseLocation": "1 Samuel 17:25",
          "verseText": "“And it shall be that the man who kills him, the king will enrich him with great riches",
          "talmudLocation": "Sanhedrin 19b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-6",
          "talmudFullText": "The Talmud asks: <b>What</b> caused the betrothal between David and Merab to be <b>a mistaken betrothal? </b> The Talmud responds: <b>As it is written</b> about Israel’s war against the Philistines and Goliath: <b>“And it shall be that the man who kills him, the king will enrich him with great riches</b> and will give him his daughter, and make his father’s house free in Israel” (I Samuel 17:25). David <b>went</b> and <b>killed</b> Goliath. King Saul <b>said to him: You have a loan</b> in <b>my</b> possession, as I owe you the great wealth that I promised, though David had not given him an actual monetary loan. <b>And</b> the <i>halakha</i> is that with regard to <b>one who betroths</b> a woman <b>by</b> forgiving <b>a loan, she is not betrothed, </b> and therefore David’s betrothal of Merab did not take effect."
        },
        {
          "verseLocation": "1 Samuel 17:25",
          "verseText": "as it is written: “And it shall be that the man who kills him, the king will enrich him with great riches, and will give him his daughter”",
          "talmudLocation": "Taanit 4a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/4a#section-6",
          "talmudFullText": "With regard to <b>Saul, son of Kish, </b> he made an offer when Goliath the Philistine challenged the Jews, <b>as it is written: “And it shall be that the man who kills him, the king will enrich him with great riches, and will give him his daughter”</b> (I Samuel 17:25). The man who killed Goliath <b>might even</b> have been <b>a slave or a <i>mamzer</i>, </b> one born from an incestuous or adulterous union, who would be unfit to marry his daughter. Nevertheless, God <b>responded</b> to him <b>reasonably and David happened</b> to come <b>to him. </b>"
        },
        {
          "verseLocation": "1 Samuel 17:28",
          "verseText": "as it is stated: “And Eliab’s anger burned against David and he said: Why did you come down, and with whom have you left those few sheep in the wilderness? I know your insolence and the evil of your heart, for you have come down to see the battle”",
          "talmudLocation": "Pesachim 66b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/66b#section-9",
          "talmudFullText": "<b>R' Mani bar Patish said: Whoever becomes angry, even if greatness has been apportioned to him from heaven, he is lowered</b> from his greatness. <b>From where do we</b> derive this? <b>From Eliab, </b> David’s older brother, <b>as it is stated: “And Eliab’s anger burned against David and he said: Why did you come down, and with whom have you left those few sheep in the wilderness? I know your insolence and the evil of your heart, for you have come down to see the battle”</b> (I Samuel 17:28); we see that Eliab became angry. <b>And when Samuel went to anoint him</b> after God had told him that one of Yishai’s sons was to be the king, <b>concerning all of</b> the other brothers <b>it is written: “YHWH has not chosen this one”</b> (I Samuel 16:8), <b>whereas with regard to Eliab it is written: “And YHWH said to Samuel: Look not at his appearance, nor at the height of his stature, for I have rejected him”</b> (I Samuel 16:7). This proves <b>by inference that until now He had loved him, </b> and it was only at this point that Eliab was rejected. Had it not been for his anger, Eliab would have been fit for greatness; but owing to this shortcoming, God rejected him."
        },
        {
          "verseLocation": "1 Samuel 17:36",
          "verseText": "would have been fulfilled for me: “Your servant smote both the lion and the bear”",
          "talmudLocation": "Bava Metzia 106a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/106a#section-14",
          "talmudFullText": "<b>Rav Sheshet raises an objection</b> from a <i>baraita</i>: In the case of <b>a shepherd who was herding</b> the animals of others, <b>and he left his flock and came to the town, and</b> in the meantime <b>a wolf came and tore</b> an animal to pieces, <b>or a lion came and trampled</b> one of the flock, <b>we do not say</b> definitively that <b>had he been there he would have rescued</b> them and therefore he is liable due to his absence. <b>Rather, </b> the court <b>estimates</b> with regard to <b>him: If he could</b> have <b>rescued</b> his animal by chasing a beast of this kind away, he is <b>liable, </b> as his departure from the scene was certainly a contributing factor to the damage. <b>If not, </b> he is <b>exempt</b> from liability. According to Shmuel’s opinion, <b>why</b> is the shepherd exempt from liability? <b>Let</b> the owner <b>say to him: Had you been there, </b> the following verse <b>would have been fulfilled for me: “Your servant smote both the lion and the bear”</b> (I Samuel 17:36)."
        },
        {
          "verseLocation": "1 Samuel 17:36",
          "verseText": "and it says: “And this uncircumcised Philistine shall be”",
          "talmudLocation": "Nedarim 31b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/31b#section-7",
          "talmudFullText": "Conversely, if he said: <b>Benefiting from those who are circumcised</b> is <i>konam</i> <b>for me, he is prohibited</b> from deriving benefit even <b>from uncircumcised Jews and</b> he is <b>permitted</b> to derive benefit <b>from the circumcised of the nations of the world, as</b> the term <b>uncircumcised is used only to name the nations of the world, as it is stated: “For all the nations are uncircumcised, but all the house of Israel are uncircumcised in the heart”</b> (Jeremiah 9:25), <b>and it says: “And this uncircumcised Philistine shall be”</b> (I Samuel 17:36), <b>and it says: “Lest the daughters of the Philistines rejoice, lest the daughters of the uncircumcised triumph”</b> (II Samuel 1:20). These verses indicate that ordinary non-Jews are referred to as uncircumcised, regardless of whether they are actually circumcised."
        },
        {
          "verseLocation": "1 Samuel 17:38",
          "verseText": "As it is written: “And Saul clad David with his apparel [ maddav ]”",
          "talmudLocation": "Yevamot 76b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/76b#section-14",
          "talmudFullText": "The Talmud continues with its explanation: <b>For what reason did</b> Saul <b>say to</b> Abner that he should <b>inquire about</b> David? <b>As it is written: “And Saul clad David with his apparel [<i>maddav</i>]”</b> (I Samuel 17:38), which indicates that the clothes were <b>of</b> David’s <b>size [<i>kemiddato</i>]. And it is written with regard to Saul: “From his shoulders and upward he was higher than any of the people”</b> (I Samuel 9:2). Upon seeing that his clothes fit David, Saul began to fear that it might be David who was destined for the throne, and he therefore inquired into his background. At that point, <b>Doeg the Edomite said to</b> Saul: <b>Before you inquire as to whether or not he is fit for kingship, inquire as to whether or not he is</b> even <b>fit to enter into the congregation. What is the reason</b> for such doubts? It is <b>that</b> he <b>descends from Ruth the Moabite, </b> and Moabites are permanently barred from entering the congregation."
        },
        {
          "verseLocation": "1 Samuel 17:43",
          "verseText": "when he said to David",
          "talmudLocation": "Sotah 42b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-3",
          "talmudFullText": "<b>R' Yoḥanan said in the name of R' Meir: In three instances, his</b> own <b>mouth ensnared that wicked one</b> and unwittingly foretold his own downfall. <b>One</b> time he said: <b>“Choose yourselves a man, and let him come down to me, ”</b> describing himself at the bottom. <b>And another</b> time, he said: <b>“If he is able to fight with me and kill me</b> then will we be your servants; but if I prevail against him, and kill him, then shall you be our servants, and serve us” (I Samuel 17:9). There, he supposed that his opponent would defeat him, before supposing that he, Goliath, would be victorious. Finally, <b>the other</b> time was <b>when he said to David</b> (I Samuel 17:43): <b>“Am I a dog, that you come to me with staves? ”</b> The Talmud asks: But didn’t David also speak in this manner? <b>David also said to him: “You come to me with a sword, and with a spear, and with a javelin”</b> (I Samuel 17:45). The Talmud answers: David <b>then said to him, </b> immediately afterward: <b>“But I come to you in the name of YHWH of hosts, the God of the armies of Israel, whom you have taunted”</b> (I Samuel 17:45)."
        },
        {
          "verseLocation": "1 Samuel 17:45",
          "verseText": "David also said to him: “You come to me with a sword, and with a spear, and with a javelin”",
          "talmudLocation": "Sotah 42b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-3",
          "talmudFullText": "<b>R' Yoḥanan said in the name of R' Meir: In three instances, his</b> own <b>mouth ensnared that wicked one</b> and unwittingly foretold his own downfall. <b>One</b> time he said: <b>“Choose yourselves a man, and let him come down to me, ”</b> describing himself at the bottom. <b>And another</b> time, he said: <b>“If he is able to fight with me and kill me</b> then will we be your servants; but if I prevail against him, and kill him, then shall you be our servants, and serve us” (I Samuel 17:9). There, he supposed that his opponent would defeat him, before supposing that he, Goliath, would be victorious. Finally, <b>the other</b> time was <b>when he said to David</b> (I Samuel 17:43): <b>“Am I a dog, that you come to me with staves? ”</b> The Talmud asks: But didn’t David also speak in this manner? <b>David also said to him: “You come to me with a sword, and with a spear, and with a javelin”</b> (I Samuel 17:45). The Talmud answers: David <b>then said to him, </b> immediately afterward: <b>“But I come to you in the name of YHWH of hosts, the God of the armies of Israel, whom you have taunted”</b> (I Samuel 17:45)."
        },
        {
          "verseLocation": "1 Samuel 17:55",
          "verseText": "Rabbi Yoḥanan said: As the verse states: “And when Saul saw David go forth against the Philistine, he said to Abner, the captain of the host: Abner, whose son is this youth? And Abner said: As your soul lives, O king, I cannot tell”",
          "talmudLocation": "Yevamot 76b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/76b#section-11",
          "talmudFullText": "<strong>Talmud: </strong> The Talmud asks: <b>From where are these matters</b> derived that female Ammonites and Moabites are permitted immediately? <b>R' Yoḥanan said: As the verse states: “And when Saul saw David go forth against the Philistine, he said to Abner, the captain of the host: Abner, whose son is this youth? And Abner said: As your soul lives, O king, I cannot tell”</b> (I Samuel 17:55). This verse is puzzling: <b>Did</b> Saul really <b>not recognize him? But isn’t it</b> previously <b>written: </b> “And David came to Saul, and stood before him; <b>and he loved him greatly; and he became his armor-bearer”</b> (I Samuel 16:21)? <b>Rather, </b> it must be that <b>he was asking about</b> David’s <b>father. </b>"
        },
        {
          "verseLocation": "1 Samuel 17:56",
          "verseText": "Immediately: “And the king said, inquire you whose son is this lad”",
          "talmudLocation": "Yevamot 76b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/76b#section-17",
          "talmudFullText": "<b>Immediately: “And the king said, inquire you whose son is this lad”</b> (I Samuel 17:56). The Talmud comments: <b>There, </b> in the previous verse, Saul <b>calls him youth [<i>na’ar</i>], </b> and <b>here he calls him lad [<i>elem</i>]. </b> This change in the wording hints at the following discussion. Saul <b>said to</b> Doeg <b>as follows: </b> The <b><i>halakha</i> is hidden [<i>nitalma</i>] from you, </b> and you are ignorant of the law. <b>Go and inquire</b> about the matter <b>in the study hall. He</b> went to the study hall and <b>asked. They said to him: </b> The <i>halakha</i> is: <b>An Ammonite</b> man is forbidden, <b>but not an Ammonite woman; a Moabite</b> man is forbidden, <b>but not a Moabite woman. </b>"
        }
      ]
    },
    {
      "chapterNumber": 18,
      "citations": [
        {
          "verseLocation": "1 Samuel 18:9",
          "verseText": "“And Saul viewed David with suspicion”",
          "talmudLocation": "Megillah 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-7",
          "talmudFullText": "Similarly, the verse states: <b>“And it came to pass, when Samuel was old”</b> (I Samuel 8:1), and then it is written: <b>“And his sons did not walk in his ways”</b> (I Samuel 8:3). Also, it states: <b>“And it came to pass that David was successful in all his ways, and YHWH was with him”</b> (I Samuel 18:14), and only a few verses prior it is written: <b>“And Saul viewed David with suspicion”</b> (I Samuel 18:9). In another instance, the verse states: <b>“And it came to pass, when the king dwelt in his house”</b> (II Samuel 7:1). Here King David mentioned his desire to build a temple for God, but it is written elsewhere that he was told: <b>“Yet you shall not build the house”</b> (II Chronicles 6:9)."
        },
        {
          "verseLocation": "1 Samuel 18:14",
          "verseText": "“And it came to pass that David was successful in all his ways, and the Lord was with him”",
          "talmudLocation": "Megillah 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-7",
          "talmudFullText": "Similarly, the verse states: <b>“And it came to pass, when Samuel was old”</b> (I Samuel 8:1), and then it is written: <b>“And his sons did not walk in his ways”</b> (I Samuel 8:3). Also, it states: <b>“And it came to pass that David was successful in all his ways, and YHWH was with him”</b> (I Samuel 18:14), and only a few verses prior it is written: <b>“And Saul viewed David with suspicion”</b> (I Samuel 18:9). In another instance, the verse states: <b>“And it came to pass, when the king dwelt in his house”</b> (II Samuel 7:1). Here King David mentioned his desire to build a temple for God, but it is written elsewhere that he was told: <b>“Yet you shall not build the house”</b> (II Chronicles 6:9)."
        },
        {
          "verseLocation": "1 Samuel 18:14",
          "verseText": "is nothing other than mistaken, as it is stated: “And David succeeded in all his ways; and the Lord was with him”",
          "talmudLocation": "Shabbat 56a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-4",
          "talmudFullText": "<b>R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: Anyone who says that David sinned</b> with Bathsheba <b>is nothing other than mistaken, as it is stated: “And David succeeded in all his ways; and YHWH was with him”</b> (I Samuel 18:14). <b>Is it possible that sin came to his hand and</b> nevertheless <b>the Shekhina was with him? </b>"
        },
        {
          "verseLocation": "1 Samuel 18:19",
          "verseText": "to Adriel, as it is written: “But it came to pass at the time when Merab, Saul’s daughter, should have been given to David,",
          "talmudLocation": "Sanhedrin 19b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-7",
          "talmudFullText": "Saul <b>went</b> and <b>gave</b> Merab <b>to Adriel, as it is written: “But it came to pass at the time when Merab, Saul’s daughter, should have been given to David, </b> that she was given to Adriel the Meholathite as a wife” (I Samuel 18:19). Saul <b>said to</b> David: <b>If you want me to give you Michal, go bring me one hundred foreskins of the Philistines</b> (see I Samuel 18:25–27). David <b>went</b> and <b>brought</b> Saul two hundred foreskins. Saul <b>said to him: </b> Even though you brought the foreskins, the betrothal is not valid, as <b>you, </b> David, <b>have a loan and</b> one <b><i>peruta</i></b> in <b>my</b> possession, i.e., the wealth Saul owed him for slaying Goliath as well as the item of lesser monetary value, the foreskins of the Philistines."
        }
      ]
    },
    {
      "chapterNumber": 20,
      "citations": [
        {
          "verseLocation": "1 Samuel 20:26",
          "verseText": "as it is stated: “For he said, something has happened to him, he is not ritually pure; surely he is not ritually pure [ bilti tahor hu ki lo tahor ]”",
          "talmudLocation": "Pesachim 3a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/3a#section-11",
          "talmudFullText": "<b>Rav Pappa said: </b> A different verse added <b>nine</b> letters, <b>as it is stated: “If there be among you any man who is not ritually pure [<i>asher lo yihye tahor</i>] by reason of that which happened to him by night”</b> (Deuteronomy 23:11). To avoid using the three-letter Hebrew word for impure, <i>tameh</i>, spelled <i>tet</i>, <i>mem</i>, <i>alef</i>, the verse employs the twelve-letter phrase “who is not ritually pure,” spelled: <i>Alef</i>, <i>shin</i>, <i>reish</i>; <i>lamed</i>, <i>alef</i>; <i>yod</i>, <i>heh</i>, <i>yod</i>, <i>heh</i>; <i>tet</i>, <i>heh</i>, <i>reish</i>. <b>Ravina said: </b> The verse actually adds <b>ten</b> letters because of the letter <b><i>vav</i> of</b> the word <b><i>tahor</i>, </b> as the word is spelled in its plene form. <b>Rav Aḥa bar Ya’akov said: </b> Yet another verse adds <b>sixteen</b> letters, <b>as it is stated: “For he said, something has happened to him, he is not ritually pure; surely he is not ritually pure [<i>bilti tahor hu ki lo tahor</i>]”</b> (I Samuel 20:26). To avoid using the three-letter word <i>tameh</i>, the verse employs the nineteen-letter phrase “he is not ritually pure; surely he is not ritually pure,” spelled: <i>Beit</i>, <i>lamed</i>, <i>tav</i>, <i>yod</i>; <i>tet</i>, <i>heh</i>, <i>vav</i>, <i>reish</i>; <i>heh</i>, <i>vav</i>, <i>alef</i>; <i>kaf</i>, <i>yod</i>; <i>lamed</i>, <i>alef</i>; <i>tet</i>, <i>heh</i>, <i>vav</i>, <i>reish</i>."
        },
        {
          "verseLocation": "1 Samuel 20:30",
          "verseText": "“Then Saul’s anger was kindled against Jonathan, and he said unto him: You son of perverse rebellion,",
          "talmudLocation": "Arakhin 16b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/16b#section-11",
          "talmudFullText": "<b>Rav Naḥman bar Yitzḥak says: And</b> all <b>three of them expounded</b> the same <b>one verse, </b> from which they derived their respective opinions. After Jonathan rebuked his father, Saul, for the way he treated David, the verse states: <b>“Then Saul’s anger was kindled against Jonathan, and he said unto him: You son of perverse rebellion, </b> do not I know that you have chosen the son of Yishai to your own shame, and to the shame of your mother’s nakedness” (I Samuel 20:30). <b>And it is written: “And Saul cast his spear at him to smite him, </b> whereby Jonathan knew that it had been determined by his father to put David to death” (I Samuel 20:33)."
        },
        {
          "verseLocation": "1 Samuel 20:33",
          "verseText": "And it is written: “And Saul cast his spear at him to smite him,",
          "talmudLocation": "Arakhin 16b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/16b#section-11",
          "talmudFullText": "<b>Rav Naḥman bar Yitzḥak says: And</b> all <b>three of them expounded</b> the same <b>one verse, </b> from which they derived their respective opinions. After Jonathan rebuked his father, Saul, for the way he treated David, the verse states: <b>“Then Saul’s anger was kindled against Jonathan, and he said unto him: You son of perverse rebellion, </b> do not I know that you have chosen the son of Yishai to your own shame, and to the shame of your mother’s nakedness” (I Samuel 20:30). <b>And it is written: “And Saul cast his spear at him to smite him, </b> whereby Jonathan knew that it had been determined by his father to put David to death” (I Samuel 20:33)."
        }
      ]
    },
    {
      "chapterNumber": 21,
      "citations": [
        {
          "verseLocation": "1 Samuel 21:5",
          "verseText": "they interpreted homiletically.",
          "talmudLocation": "Menachot 95b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/95b#section-10",
          "talmudFullText": "§ The Mishnah teaches that <b>R' Yehuda says: All the procedures</b> involved in the preparation of the two loaves and the shewbread take place <b>inside</b> the Temple courtyard, whereas R' Shimon maintains that even their baking may take place outside the courtyard. <b>R' Abbahu bar Kahana says: Both</b> R' Yehuda and R' Shimon derived their opinions from <b>the same verse, </b> which <b>they interpreted homiletically. </b> When David fled from King Saul he came to Nov, where he requested bread from Ahimelech the priest. Ahimelech replied: “There is no non-sacred bread under my hand, but there is sacred bread” (I Samuel 21:5), i.e., the shewbread. David then said to Ahimelech: <b>“But it is a non-sacred manner, and yet it shall be consecrated today in the vessel”</b> (I Samuel 21:6)."
        },
        {
          "verseLocation": "1 Samuel 21:6",
          "verseText": "“But it is a non-sacred manner, and yet it shall be consecrated today in the vessel”",
          "talmudLocation": "Menachot 95b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/95b#section-10",
          "talmudFullText": "§ The Mishnah teaches that <b>R' Yehuda says: All the procedures</b> involved in the preparation of the two loaves and the shewbread take place <b>inside</b> the Temple courtyard, whereas R' Shimon maintains that even their baking may take place outside the courtyard. <b>R' Abbahu bar Kahana says: Both</b> R' Yehuda and R' Shimon derived their opinions from <b>the same verse, </b> which <b>they interpreted homiletically. </b> When David fled from King Saul he came to Nov, where he requested bread from Ahimelech the priest. Ahimelech replied: “There is no non-sacred bread under my hand, but there is sacred bread” (I Samuel 21:5), i.e., the shewbread. David then said to Ahimelech: <b>“But it is a non-sacred manner, and yet it shall be consecrated today in the vessel”</b> (I Samuel 21:6)."
        },
        {
          "verseLocation": "1 Samuel 21:7",
          "verseText": "removal, as it is stated: “To place hot bread on the day when it was taken away”",
          "talmudLocation": "Chagigah 26b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/26b#section-7",
          "talmudFullText": "<b>And why</b> indeed is the table susceptible to ritual impurity, being that <b>it is a wooden vessel designated to rest</b> in a fixed place <b>and</b> should therefore <b>not</b> be <b>susceptible to impurity? Rather, </b> this verse <b>teaches that they</b> would <b>lift</b> the table with the shewbread on it <b>to display the shewbread to the pilgrims</b> standing in the Temple courtyard, as it was prohibited for Israelites to enter the Sanctuary, where the table stood, <b>and they</b> would <b>say to them: Behold your affection before God, </b> Who performs a perpetual miracle with the bread, for when <b>it is removed</b> from the table on Shabbat it is just as fresh <b>as</b> when <b>it was arranged</b> on the previous Shabbat. <b>As R' Yehoshua ben Levi said: A great miracle was performed with the shewbread: As its</b> condition during its <b>arrangement, so was its</b> condition during its <b>removal, as it is stated: “To place hot bread on the day when it was taken away”</b> (I Samuel 21:7), indicating that it was as hot on the day of its removal as it was on the day when it was placed."
        },
        {
          "verseLocation": "1 Samuel 21:7",
          "verseText": "as it is stated: “To place hot bread on the day when it was taken away”",
          "talmudLocation": "Menachot 29a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/29a#section-10",
          "talmudFullText": "Parenthetically, the Talmud asks: <b>What</b> is meant by: See <b>your affection</b> before God? It is <b>in accordance with</b> that <b>which R' Yehoshua ben Levi</b> says, <b>as R' Yehoshua ben Levi says: A great miracle was performed with the shewbread: </b> Its condition at the time of <b>its removal</b> from the Table, after having been left there for a week, was <b>like</b> its condition at the time of <b>its arrangement</b> on the Table, <b>as it is stated: “To place hot bread on the day when it was taken away”</b> (I Samuel 21:7), indicating that it was as hot on the day of its removal as it was on the day when it was placed on the Table."
        },
        {
          "verseLocation": "1 Samuel 21:7",
          "verseText": "written: “And the priest gave him sacred bread, for there was no bread there but the shewbread that was taken from before the Lord”",
          "talmudLocation": "Menachot 95b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/95b#section-13",
          "talmudFullText": "The Talmud asks: <b>And how can you say that</b> David <b>found</b> the priests <b>at the time of baking? But isn’t it</b> subsequently <b>written: “And the priest gave him sacred bread, for there was no bread there but the shewbread that was taken from before YHWH”</b> (I Samuel 21:7)? This indicates that David received shewbread that had already been on the Table, not loaves that had just been baked."
        },
        {
          "verseLocation": "1 Samuel 21:7",
          "verseText": "as it is stated: “To place hot bread on the day when it was taken away”",
          "talmudLocation": "Menachot 96b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/96b#section-10",
          "talmudFullText": "This is <b>in accordance with the statement of R' Yehoshua ben Levi, as R' Yehoshua ben Levi said: A great miracle was performed with the shewbread: </b> Its condition at the time of <b>its removal</b> from the Table, after having been left there for a week, was <b>like</b> its condition at the time of <b>its arrangement</b> on the Table; <b>as it is stated: “To place hot bread on the day when it was taken away”</b> (I Samuel 21:7), indicating that it was as hot on the day of its removal as it was on the day when it was placed on the Table."
        },
        {
          "verseLocation": "1 Samuel 21:7",
          "verseText": "its arrangement, as it is stated: “To put out hot bread on the day it was taken away”",
          "talmudLocation": "Yoma 21a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/21a#section-7",
          "talmudFullText": "The Talmud answers: <b>The disqualifications</b> mentioned that never occurred in the Temple, in the <i>omer</i>, the two loaves, or the shewbread, <b>were three; consider them as one</b> miracle. <b>Eliminate two</b> from the total <b>and introduce</b> these <b>two</b> to complete the list of ten miracles. The Talmud asks: <b>If</b> similar miracles are combined and considered as one, <b>the swallowing</b> of the earthenware, crops, feathers, and ashes <b>are also two</b> similar miracles that should be <b>considered as one, </b> the result being that <b>they are lacking</b> one miracle to complete the total of ten. The Talmud responds: <b>There is also another</b> miracle, <b>as R' Yehoshua ben Levi said: A great miracle was performed with regard to the shewbread</b> in the Temple, that the bread was as hot at <b>its removal</b> on Shabbat, after a week on the table, <b>as</b> it was at <b>its arrangement, as it is stated: “To put out hot bread on the day it was taken away”</b> (I Samuel 21:7)."
        },
        {
          "verseLocation": "1 Samuel 21:7",
          "verseText": "its arrangement, as it is stated: “To put out hot bread on the day it was taken away”",
          "talmudLocation": "Yoma 21b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/21b#section-1",
          "talmudFullText": "The Talmud asks: How is that possible? <b>It is a wooden vessel designated to rest</b> in a fixed place and not to be moved. And it was taught: <b>Any wooden vessel designated to rest</b> in a fixed place <b>is not susceptible to ritual impurity, and it serves as a barrier before impurity, </b> preventing its transmission. <b>Rather, </b> the fact that the table is described as pure <b>teaches</b> that the priests <b>lift it</b> in order to display the shewbread <b>to the Festival pilgrims, and they say to them: See how beloved you are before God, as</b> the bread is as hot at <b>its removal</b> on Shabbat, after a week on the table, <b>as</b> it was at <b>its arrangement, as it is stated: “To put out hot bread on the day it was taken away”</b> (I Samuel 21:7). Since the table was moved on occasion, it was not considered a wooden vessel designated to rest and was therefore susceptible to impurity. At the same time, it is clear that the miracle of the shewbread was a miracle performed outside the Sanctuary, as it was visible to all."
        },
        {
          "verseLocation": "1 Samuel 21:8",
          "verseText": "the most notable [ meyuḥad ] of the servants. And it is written there: “And a certain man of the servants of Saul was there that day, detained before the Lord, and his name was Doeg the Edomite, the chief of the herdsmen that belonged to Saul”",
          "talmudLocation": "Sanhedrin 93b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93b#section-5",
          "talmudFullText": "The Talmud asks: <b>From where do we</b> derive <b>that</b> it <b>was Doeg</b> who listed the virtues in this verse? The Talmud answers that <b>it is written here: “And one [<i>eḥad</i>] of the servants answered, ”</b> meaning <b>the most notable [<i>meyuḥad</i>] of the servants. And it is written there: “And a certain man of the servants of Saul was there that day, detained before YHWH, and his name was Doeg the Edomite, the chief of the herdsmen that belonged to Saul”</b> (I Samuel 21:8)."
        },
        {
          "verseLocation": "1 Samuel 21:13",
          "verseText": "about Rav Sheshet: “And David laid up these words in his heart”",
          "talmudLocation": "Shevuot 45b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/45b#section-12",
          "talmudFullText": "§ <b>Rami bar Ḥama would cite</b> this verse <b>about Rav Sheshet: “And David laid up these words in his heart”</b> (I Samuel 21:13), as Rav Sheshet took it upon himself to find sources that would support or contradict the statements of Rav and Shmuel. <b>As</b> it is recounted that <b>Rav Sheshet encountered Rabba bar Shmuel</b> and <b>said to him: Does the Master teach any</b> <i>halakhot</i> <b>about a hired worker? </b> Rabba bar Shmuel <b>said to him: Yes, I teach</b> this <i>baraita</i> (<i>Tosefta</i> 6:1): <b>A hired worker within his time</b> for receiving wages <b>takes an oath and receives</b> payment. <b>How so? </b> This applies in a case <b>when</b> the worker <b>said to</b> the employer: <b>You hired me but did not give me my wages, and the other, </b> the employer, <b>says: I hired you and gave you your wages. But</b> if the hired worker <b>said to him: You fixed two</b> coins <b>as my</b> payment, <b>and the other, </b> the employer, <b>says: I fixed only one</b> coin <b>as your</b> payment, <b>the burden of proof rests upon the claimant, </b> who must provide witnesses to testify that the wage was the greater sum."
        }
      ]
    },
    {
      "chapterNumber": 22,
      "citations": [
        {
          "verseLocation": "1 Samuel 22:6",
          "verseText": "which is written: “And Saul dwelled in Gibeah under the tamarisk tree in Rama”",
          "talmudLocation": "Taanit 5b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/5b#section-6",
          "talmudFullText": "Therefore, <b>God said: I will spring old age upon him</b> and everyone will think that Shmuel is elderly. <b>This is</b> the meaning of that <b>which is written: “And Saul dwelled in Gibeah under the tamarisk tree in Rama”</b> (I Samuel 22:6). <b>What does Gibeah have to do with Rama; </b> these are two separate places. <b>Rather, </b> the verse comes <b>to tell you: Who caused Saul to dwell in Gibeah for two and a half years? The prayer of Samuel of Rama. </b>"
        },
        {
          "verseLocation": "1 Samuel 22:8",
          "verseText": "as it is written: “And there is none of you that is ill over me or tells unto me”",
          "talmudLocation": "Berakhot 12b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/12b#section-8",
          "talmudFullText": "The Talmud seeks to clarify the source of this <i>halakha</i>. <b>What is the reason</b> that one must make oneself ill over a Torah scholar in need of mercy? <b>If you say</b> that it is <b>because</b> of what Saul said to his men, <b>as it is written: “And there is none of you that is ill over me or tells unto me”</b> (I Samuel 22:8), meaning that because Saul was a Torah scholar, it would have been appropriate for people to make themselves ill worrying about him; this is not an absolute proof. <b>Perhaps a king is different, </b> and excessive worry is appropriate in that case. Rather, proof that one must make oneself ill over a Torah scholar in need for mercy is <b>from here: </b> When David speaks of his enemies, Doeg and Ahitophel, who were Torah scholars, he says: <b>“But for me, when they were sick, my clothing was sackcloth, </b> I afflicted my soul with fasting” (Psalms 35:13). One must be concerned to the extent that he dresses in sackcloth and fasts for the recovery of a Torah scholar."
        },
        {
          "verseLocation": "1 Samuel 22:9",
          "verseText": "“Doeg",
          "talmudLocation": "Sanhedrin 106b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106b#section-4",
          "talmudFullText": "§ <b>It is written</b> in one verse: <b>“Doeg</b> the Edomite” (I Samuel 22:9), <b>and it is written</b> in another verse: “And the king said to <b>Doyeig”</b> (I Samuel 22:18). <b>R' Yoḥanan says</b> in explaining the discrepancy: <b>Initially, God sat and was concerned [<i>doeg</i>]</b> that <b>perhaps this</b> person <b>would emerge to</b> undertake <b>an evil path. After he emerged</b> on that path, God <b>said: Alas [<i>vai</i>], that</b> person <b>has emerged to</b> undertake an evil path."
        },
        {
          "verseLocation": "1 Samuel 22:18",
          "verseText": "Doyeig”",
          "talmudLocation": "Sanhedrin 106b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106b#section-4",
          "talmudFullText": "§ <b>It is written</b> in one verse: <b>“Doeg</b> the Edomite” (I Samuel 22:9), <b>and it is written</b> in another verse: “And the king said to <b>Doyeig”</b> (I Samuel 22:18). <b>R' Yoḥanan says</b> in explaining the discrepancy: <b>Initially, God sat and was concerned [<i>doeg</i>]</b> that <b>perhaps this</b> person <b>would emerge to</b> undertake <b>an evil path. After he emerged</b> on that path, God <b>said: Alas [<i>vai</i>], that</b> person <b>has emerged to</b> undertake an evil path."
        },
        {
          "verseLocation": "1 Samuel 22:20",
          "verseText": "as it is written: “And one of the sons of Ahimelech, son of Ahitub, named Abiathar, escaped”",
          "talmudLocation": "Sanhedrin 95b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/95b#section-4",
          "talmudFullText": "Apropos David’s prayer that his descendants cease, the Talmud asks: <b>And from where do we</b> derive <b>that David’s descendants ceased</b> to exist? It is derived from a verse, <b>as it is stated: “And Athaliah the mother of Ahaziah saw that her son was dead, and she arose and destroyed all the royal descendants”</b> (II Kings 11:1). The Talmud asks: <b>But didn’t Joash remain</b> alive, and therefore, not all of David’s descendants ceased to exist? The Talmud answers: <b>There too, </b> in the massacre in Nov, <b>Abiathar, </b> one of the priests, <b>remained</b> alive, <b>as it is written: “And one of the sons of Ahimelech, son of Ahitub, named Abiathar, escaped”</b> (I Samuel 22:20). <b>Rav Yehuda says</b> that <b>Rav says: Were it not for</b> the fact that <b>Abiathar remained</b> alive <b>for Ahimelech, son of Ahitub, there would have been no remnant or refugee remaining from the descendants of David. </b>"
        }
      ]
    },
    {
      "chapterNumber": 23,
      "citations": [
        {
          "verseLocation": "1 Samuel 23:11",
          "verseText": "“Will the men of Keilah deliver me into his hand? Will Saul come down?”",
          "talmudLocation": "Yoma 73a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/73a#section-19",
          "talmudFullText": "<b>One does not ask</b> about <b>two matters simultaneously; </b> rather, one asks one question, and after he is answered he asks a second question. <b>And</b> even <b>if he asks</b> about two matters simultaneously, <b>he is answered only</b> with regard to <b>one</b> of them, <b>and he is answered only</b> with regard to <b>the first</b> question. <b>As it is stated</b> with regard to King David that he asked two questions simultaneously: <b>“Will the men of Keilah deliver me into his hand? Will Saul come down? ”</b> (I Samuel 23:11). And he was answered with regard to only one: <b>“And God said: He will come down. ”</b> (I Samuel 23:11). The Talmud asks: <b>But didn’t you say</b> that if one asks two questions, he is <b>answered only</b> with regard to the <b>first</b> question? Yet the verse states that David received an answer for his second question, not the first. The Talmud answers: <b>David asked</b> the questions"
        },
        {
          "verseLocation": "1 Samuel 23:12",
          "verseText": "“Will the men of Keilah deliver me and my men into the hand of Saul? And God said: They will deliver you”",
          "talmudLocation": "Yoma 73b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/73b#section-1",
          "talmudFullText": "<b>out of order and he was answered in order. </b> He should have asked first whether Saul would come down, and afterward what the people of Keilah would do. <b>And once he realized that he had asked out of order he went back and asked in order, as it is stated</b> immediately afterward: <b>“Will the men of Keilah deliver me and my men into the hand of Saul? And God said: They will deliver you”</b> (I Samuel 23:12)."
        },
        {
          "verseLocation": "1 Samuel 23:17",
          "verseText": "as he said to David: “And you shall be king over Israel, and I shall be second to you”",
          "talmudLocation": "Bava Metzia 85a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/85a#section-1",
          "talmudFullText": "<b>the sons of Beteira; and Jonathan, son of Saul. </b> The Talmud discusses each case: The incident revealing the modesty of <b>Rabban Shimon ben Gamliel is that</b> which <b>we</b> just <b>said, </b> as he referred to himself modestly as a fox. <b>The sons of Beteira</b> were exceptionally modest, as they served in the position of <i>Nasi</i> and yet abdicated their positions in favor of Hillel when he emigrated from Babylonia to Eretz Yisrael. <b>As the Master said: </b> The sons of Beteira, upon recognizing that Hillel was a superior expert in <i>halakha</i>, <b>seated him at the head and appointed him <i>Nasi</i> over them</b> (see <i>Pesaḥim</i> 66a). <b>Jonathan, son of Saul, </b> was extremely modest, <b>as he said to David: “And you shall be king over Israel, and I shall be second to you”</b> (I Samuel 23:17), despite the fact that his father, Saul, was the current king."
        }
      ]
    },
    {
      "chapterNumber": 24,
      "citations": [
        {
          "verseLocation": "1 Samuel 24:3",
          "verseText": "As it is written: “And he came to the sheepcotes by the way, where there was a cave, and Saul went in to cover his feet,",
          "talmudLocation": "Berakhot 62b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-9",
          "talmudFullText": "<b>And what is this</b> modesty? <b>As it is written: “And he came to the sheepcotes by the way, where there was a cave, and Saul went in to cover his feet, </b> to defecate. Now David and his men were sitting in the innermost parts of the cave” (I Samuel 24:3). <b>It was taught</b> that the rabbis said: <b>There was a fence within a fence, and a cave within a cave, </b> and Saul entered to defecate in the interest of modesty. With regard to the use of the term, <b>to cover</b> his feet, <b>R' Elazar said: </b> This <b>teaches that, </b> even there, <b>he covered himself</b> with his garment <b>like a <i>sukka</i>. </b>"
        },
        {
          "verseLocation": "1 Samuel 24:3",
          "verseText": "“And Saul went in to cover his feet [ raglav ]”",
          "talmudLocation": "Yevamot 103a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/103a#section-15",
          "talmudFullText": "The Talmud continues its challenge. <b>Come</b> and <b>hear</b> another verse: <b>“He had neither dressed his feet [<i>raglav</i>], nor trimmed his beard”</b> (II Samuel 19:25). The phrase “dressed his feet [<i>raglav</i>]” is referring to treating his pubic hair, implying that even the area around the thigh is referred to as <i>regel</i>. The Talmud answers: This is <b>a euphemism. </b> The Talmud attempts another challenge: <b>Come</b> and <b>hear</b> from another verse: <b>“And Saul went in to cover his feet [<i>raglav</i>]”</b> (I Samuel 24:3), meaning: To urinate, implying that <i>regel</i> refers even to the thighs. The Talmud answers: This is also <b>a euphemism. </b>"
        },
        {
          "verseLocation": "1 Samuel 24:4",
          "verseText": "“Then David arose, and cut off the corner of Saul’s robe privily”",
          "talmudLocation": "Berakhot 62b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-10",
          "talmudFullText": "The Talmud continues with a homiletic interpretation of the verse: <b>“Then David arose, and cut off the corner of Saul’s robe privily”</b> (I Samuel 24:4). <b>R' Yosei ben Ḥanina, said: Anyone who treats clothing with contempt, </b> like David who tore Saul’s robe for no reason, will be punished in that <b>ultimately he will not benefit from</b> his garments, <b>as it is stated: “Now King David was old and stricken in years; and they covered him with clothes, but he could get no heat”</b> (I Kings 1:1)."
        },
        {
          "verseLocation": "1 Samuel 24:10",
          "verseText": "and he said to kill you; and you spared you”",
          "talmudLocation": "Berakhot 62b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-7",
          "talmudFullText": "With regard to modesty in a bathroom, the Talmud cites an additional biblical allusion. When David found Saul in the cave and spared him, tearing the corner of his coat, he said to him: “Behold this day, your eyes have seen how YHWH has delivered you today into my hand in the cave, <b>and he said to kill you; and you spared you”</b> (I Samuel 24:10)."
        },
        {
          "verseLocation": "1 Samuel 24:13",
          "verseText": "“As the ancient parable says: From the wicked comes forth wickedness”",
          "talmudLocation": "Makkot 10b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/10b#section-3",
          "talmudFullText": "<b>R' Shimon ben Lakish introduced this portion with an introduction from here: </b> It is stated with regard to an unintentional murderer: <b>“And one who did not lie in wait, but God caused it to come to his hand, </b> and I will appoint you a place where he may flee” (Exodus 21:13). Now this is puzzling. Why would God cause one to sin in this manner? The verse states: <b>“As the ancient parable says: From the wicked comes forth wickedness”</b> (I Samuel 24:13). Evil incidents befall those who have already sinned."
        }
      ]
    },
    {
      "chapterNumber": 25,
      "citations": [
        {
          "verseLocation": "1 Samuel 25:6",
          "verseText": "and peace be to your house,",
          "talmudLocation": "Berakhot 55b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/55b#section-10",
          "talmudFullText": "<b>And three</b> mentions of <b>peace, as it is written: </b><b><b>“Peace, peace, to him that is far off and to him that is near, says YHWH that creates the expression of the lips; and I will heal him”</b> (Isaiah 57:19); <b><b>“Then the spirit clothed Amasai, </b> who was chief of the captains: Yours are we, David, and on your side, you son of Yishai; <b><b>peace, peace be unto you, and peace be to your helpers”</b> (I Chronicles 12:19); <b>and: <b>“Thus you shall say: All hail and peace be both unto you, </b><b><b>and peace be to your house, </b> and peace be unto all that you have” (I Samuel 25:6)."
        },
        {
          "verseLocation": "1 Samuel 25:13",
          "verseText": "“And David said to his men: Every man gird his sword. And every man girded his sword, and David also girded his sword”",
          "talmudLocation": "Sanhedrin 36a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/36a#section-15",
          "talmudFullText": "<b>Rabba bar bar Ḥana</b> says that <b>R' Yoḥanan says: </b> The source of this practice is <b>from here: </b> When David decided to punish Nabal the Carmelite, the verse states: <b>“And David said to his men: Every man gird his sword. And every man girded his sword, and David also girded his sword”</b> (I Samuel 25:13). That was a case of capital law, and David, the greatest among them, was last."
        },
        {
          "verseLocation": "1 Samuel 25:18",
          "verseText": "as it is stated: “And five sheep [ tzon ] made”",
          "talmudLocation": "Chullin 135a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/135a#section-3",
          "talmudFullText": "<b>And how many are numerous? Beit Shammai say: </b> It is at least <b>two sheep, as it is stated: “That a man shall rear a young cow, and two sheep [<i>tzon</i>]”</b> (Isaiah 7:21), indicating that two sheep are characterized as <i>tzon</i>; and the mitzva of the first sheared wool is written using the term “your flock [<i>tzonekha</i>]. ” <b>And Beit Hillel say: </b> It is at least <b>five</b> sheep, <b>as it is stated: “And five sheep [<i>tzon</i>] made”</b> (I Samuel 25:18)."
        },
        {
          "verseLocation": "1 Samuel 25:18",
          "verseText": "But what is the reasoning of Beit Hillel,",
          "talmudLocation": "Chullin 137a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/137a#section-17",
          "talmudFullText": "§ The Mishnah states: <b>And how many is numerous? </b> Beit Shammai say: It is at least two sheep, and Beit Hillel say: It is at least five sheep. The Talmud objects: <b>Granted, </b> according <b>to</b> the opinion of <b>Beit Shammai, two</b> sheep are <b>also called <i>tzon</i>, </b> as in the verse cited by Beit Shammai: “That a man shall rear a young cow and two sheep [<i>tzon</i>]” (Isaiah 7:21). Since the mitzva of the first sheared wool is written with regard to <i>tzon</i>, it is logical that it applies to two sheep. <b>But what is the reasoning of Beit Hillel, </b> who hold that the mitzva applies only to five sheep, due to the verse: “And five sheep [<i>tzon</i>] made” (I Samuel 25:18)? Why do they not apply the obligation using the broader criterion of two sheep, as the verse quoted by Beit Shammai clearly indicates that two sheep are also called <i>tzon</i>?"
        },
        {
          "verseLocation": "1 Samuel 25:20",
          "verseText": "as it is written: “And it was so, as she rode on the donkey, and came down by the covert of the mountain”",
          "talmudLocation": "Megillah 14a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14a#section-21",
          "talmudFullText": "<b>Abigail</b> was a prophetess, <b>as it is written: “And it was so, as she rode on the donkey, and came down by the covert of the mountain”</b> (I Samuel 25:20). The Talmud asks: Why does it say: <b>“By the covert [<i>beseter</i>] of the mountain”? It should have said: From the mountain. </b>"
        },
        {
          "verseLocation": "1 Samuel 25:20",
          "verseText": "as she rode on her donkey",
          "talmudLocation": "Pesachim 3b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/3b#section-2",
          "talmudFullText": "The Talmud raises another difficulty. <b>But isn’t it written</b> with regard to Abigail: “And it was so, <b>as she rode on her donkey</b> and came down by the covert of the mountain” (I Samuel 25:20). This verse employs the language of riding in reference to a woman on a donkey. The Talmud answers: <b>There, due to the fear of the night, it is standard practice</b> for a woman to ride and not merely sit on the donkey. <b>And if you wish, say</b> instead: <b>There is no</b> consideration <b>due to the fear of the night</b> that would explain why she was permitted to ride in the regular manner; rather, <b>there is</b> a consideration <b>due to fear of David. And if you wish, say</b> instead: <b>There is no</b> consideration <b>due to fear of David either; </b> however, <b>there is</b> a consideration <b>due to the fear of</b> the incline when riding down <b>the mountain. </b>"
        },
        {
          "verseLocation": "1 Samuel 25:20",
          "verseText": "states: Rides",
          "talmudLocation": "Pesachim 3b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/3b#section-4",
          "talmudFullText": "The Talmud asks: <b>And anywhere that</b> the phrases <b>are equal in</b> length, does the verse always <b>speak</b> employing <b>dignified language? Aren’t</b> the Hebrew words for <b>rides [<i>rokhevet</i>], </b> spelled: <i>Reish</i>, <i>vav</i>, <i>kaf</i>, <i>beit</i>, <i>tav</i>; <b>and sits [<i>yoshevet</i>], </b> spelled: <i>Yod</i>, <i>vav</i>, <i>shin</i>, <i>beit</i>, <i>tav</i>, <b>of equal</b> length, and yet the verse <b>states: Rides</b> (I Samuel 25:20). The Talmud answers: The Hebrew word for <b>rides is written</b> without a <i>vav</i> in the defective form, rendering it shorter than the term for sits. Brevity takes precedence over dignified language."
        },
        {
          "verseLocation": "1 Samuel 25:29",
          "verseText": "as it is written: “And the soul of my master shall be bound in the bundle of life with the Lord, your God”",
          "talmudLocation": "Chagigah 12b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12b#section-13",
          "talmudFullText": "<b>The souls of the righteous</b> are found in heaven, <b>as it is written: “And the soul of my master shall be bound in the bundle of life with YHWH, your God”</b> (I Samuel 25:29). <b>Spirits and souls that are to be created</b> are found there, <b>as it is written: “For the spirit that enwraps itself is from Me, and the souls that I have made”</b> (Isaiah 57:16), which indicates that the spirit to be released into the world, wrapped around a body, is located close to God. <b>The dew that God will use to revive the dead</b> is found in heaven, <b>as it is written: “A bountiful rain You will pour down, God; when Your inheritance was weary, You confirmed it”</b> (Psalms 68:10)."
        },
        {
          "verseLocation": "1 Samuel 25:29",
          "verseText": "“Yet the soul of my lord shall be bound in the bond of life",
          "talmudLocation": "Megillah 14b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-3",
          "talmudFullText": "Apropos Abigail, the Talmud explains additional details in the story. Abigail said to David: <b>“Yet the soul of my lord shall be bound in the bond of life</b> with YHWH your God” (I Samuel 25:29), and <b>when she parted from him she said to him: “And when YHWH shall have dealt well with my lord, and you shall remember your handmaid”</b> (I Samuel 25:31)."
        },
        {
          "verseLocation": "1 Samuel 25:29",
          "verseText": "And with regard to their souls, it states: “And the soul of my lord shall be bound in the bundle of life",
          "talmudLocation": "Shabbat 152b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/152b#section-6",
          "talmudFullText": "<b>God also</b> acts in this way. <b>With regard to the bodies of the righteous, </b> which are likened to the royal garments that are well kept, <b>it states: “He enters into peace, they rest on their beds</b> each one that walks in his uprightness” (Isaiah 57:2). <b>And with regard to their souls, it states: “And the soul of my lord shall be bound in the bundle of life</b> with YHWH your God” (I Samuel 25:29). And conversely, <b>with regard to the bodies of the wicked, it states: “There is no peace, says YHWH, for the wicked”</b> (Isaiah 57:21), <b>and with regard to their souls, it states: “And the souls of your enemies He shall sling out in the hollow of a sling”</b> (I Samuel 25:29)."
        },
        {
          "verseLocation": "1 Samuel 25:29",
          "verseText": "Rabbi Eliezer says: The souls of the righteous are stored beneath the Throne of Glory, as it is stated: “And the soul of my lord shall be bound in the bundle of life”",
          "talmudLocation": "Shabbat 152b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/152b#section-7",
          "talmudFullText": "<b>It was taught</b> in a <i>baraita</i> that <b>R' Eliezer says: The souls of the righteous are stored beneath the Throne of Glory, as it is stated: “And the soul of my lord shall be bound in the bundle of life”</b> (I Samuel 25:29). <b>And</b> the souls <b>of the wicked are continuously tied up, and one angel stands at</b> one <b>end of the world and another angel stands at</b> the other <b>end of the world and they sling the souls</b> of the wicked back and forth <b>to one another, as it is stated: “And the souls of your enemies He shall sling out in the hollow of a sling”</b> (I Samuel 25:29)."
        },
        {
          "verseLocation": "1 Samuel 25:31",
          "verseText": "“And when the Lord shall have dealt well with my lord, then remember your maidservant”",
          "talmudLocation": "Bava Kamma 92b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/92b#section-7",
          "talmudFullText": "<b>Rava said to Rabba bar Mari: From where is this matter</b> derived <b>whereby people say: The goose stoops</b> its head <b>as it goes</b> along, <b>but its eyes</b> look <b>afar</b> to find food for itself? Rabba bar Mari <b>said to him</b> that the source is <b>as it is written</b> with regard to Abigail’s statement to David: <b>“And when YHWH shall have dealt well with my lord, then remember your female slave”</b> (I Samuel 25:31). Although Abigail spoke with humility in her request that David spare her husband’s life, she made reference to deriving future benefit from David."
        },
        {
          "verseLocation": "1 Samuel 25:31",
          "verseText": "said to him: “Let this not be a stumbling block for you”",
          "talmudLocation": "Megillah 14b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-2",
          "talmudFullText": "The Talmud asks: The plural term <b><i>damim</i>, </b> literally, bloods, <b>indicates two. </b> Why did David not use the singular term <i>dam</i>? <b>Rather, this teaches that</b> Abigail <b>revealed her thigh, </b> and he lusted after her, <b>and he went three parasangs by the fire</b> of his desire for her, and <b>said to her: Listen to me, </b> i.e., listen to me and allow me to be intimate with you. Abigail then <b>said to him: “Let this not be a stumbling block for you”</b> (I Samuel 25:31). <b>By inference, </b> from the word <b>“this, ”</b> it can be understood that <b>there is someone else</b> who will in fact be a stumbling block for him, <b>and what is</b> this referring to? <b>The incident involving Bathsheba. And in the end this is what was, </b> as indeed he stumbled with Bathsheba. This demonstrates that Abigail was a prophetess, as she knew that this would occur. This also explains why David blessed Abigail for keeping him from being responsible for two incidents involving blood that day: Abigail’s menstrual blood and the shedding of Nabal’s blood."
        },
        {
          "verseLocation": "1 Samuel 25:31",
          "verseText": "when she parted from him she said to him: “And when the Lord shall have dealt well with my lord, and you shall remember your handmaid”",
          "talmudLocation": "Megillah 14b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-3",
          "talmudFullText": "Apropos Abigail, the Talmud explains additional details in the story. Abigail said to David: <b>“Yet the soul of my lord shall be bound in the bond of life</b> with YHWH your God” (I Samuel 25:29), and <b>when she parted from him she said to him: “And when YHWH shall have dealt well with my lord, and you shall remember your handmaid”</b> (I Samuel 25:31)."
        },
        {
          "verseLocation": "1 Samuel 25:31",
          "verseText": "only to Gehenna, as it is stated: “That this shall not be a cause of stumbling [ puka ] to you”",
          "talmudLocation": "Megillah 15b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-6",
          "talmudFullText": "The Attribute of Justice <b>said to Him: “These also reel through wine, and stagger through strong drink; </b> the priest and the prophet reel through strong drink, they are confused because of wine, they stagger because of strong drink; they reel in vision, <b>they stumble [<i>paku</i>] in judgment [<i>peliliyya</i>]”</b> (Isaiah 28:7). The word <b><i>paku</i></b> in this context is referring <b>only to Gehenna, as it is stated: “That this shall not be a cause of stumbling [<i>puka</i>] to you”</b> (I Samuel 25:31), <b>and</b> the word <b><i>peliliyya</i></b> here is referring <b>only to judges, as it is stated: “And he shall pay as the judges determine [<i>bifelilim</i>]”</b> (Exodus 21:22). The response of the Attribute of Justice was essentially that the Jewish people have also sinned and are consequently liable to receive punishment."
        },
        {
          "verseLocation": "1 Samuel 25:31",
          "verseText": "nothing other than Gehenna, as it is stated: “That this shall not be a cause of stumbling [ puka ] for you”",
          "talmudLocation": "Sanhedrin 111b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/111b#section-5",
          "talmudFullText": "<b>The attribute of justice said before God: God!, how do these</b> people, who possess these qualities, <b>differ from those</b> who engage in Torah study but lack these qualities? God <b>said to</b> the attribute of justice that those others do not receive the crown and diadem because: <b>“These also reel through wine, and stagger through strong drink…they stumble [<i>paku</i>] in judgment [<i>peliliyya</i>]”</b> (Isaiah 28:7). <b>And <i>puka</i></b> in this context is referring to <b>nothing other than Gehenna, as it is stated: “That this shall not be a cause of stumbling [<i>puka</i>] for you”</b> (I Samuel 25:31). <b>And</b> the term of <b><i>pelila</i></b> in the verse in Isaiah is referring to <b>nothing other than judges, as it is stated: “And he shall pay as the judges [<i>biflilim</i>] determine”</b> (Exodus 21:22). Those who lack the qualities listed in the previous verses are not worthy of the aforementioned reward."
        },
        {
          "verseLocation": "1 Samuel 25:33",
          "verseText": "blessed be your discretion and blessed be you who have kept me this day from coming to bloodguiltiness [ damim ]”",
          "talmudLocation": "Megillah 14b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-1",
          "talmudFullText": "Nabal, your husband, <b>is a rebel against the throne, </b> as David had already been anointed as king by the prophet Samuel, and Nabal refused his orders. <b>And</b> therefore <b>there is no need to try him, </b> as a rebel is not accorded the ordinary prescriptions governing judicial proceedings. Abigail <b>said to him: </b> You lack the authority to act in this manner, as <b>Saul is still alive. </b> He is the king in actual practice, and <b>your seal [<i>tivakha</i>] has not</b> yet <b>spread across the world, </b> i.e., your kingship is not yet known to all. Therefore, you are not authorized to try someone for rebelling against the monarchy. David accepted her words and <b>said to her: </b> “And <b>blessed be your discretion and blessed be you who have kept me this day from coming to bloodguiltiness [<i>damim</i>]”</b> (I Samuel 25:33)."
        },
        {
          "verseLocation": "1 Samuel 25:38",
          "verseText": "“And it came to pass about ten days after that the Lord smote Nabal, and he died”",
          "talmudLocation": "Rosh Hashanah 18a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/18a#section-12",
          "talmudFullText": "§ The Talmud asks: With regard to <b>an individual, when</b> is God near to him? <b>Rabba bar Avuh said: These are the ten days between Rosh HaShana and Yom Kippur. </b> The Talmud asks further: The verse states: <b>“And it came to pass about ten days after that YHWH smote Nabal, and he died”</b> (I Samuel 25:38). These <b>ten days, what are they doing here, </b> i.e., why was there a delay of ten days before Nabal died? <b>Rav Yehuda said</b> that <b>Rav said: They correspond to the ten meals that Nabal gave the servants of David</b> who came to visit him, as out of politeness he allowed David’s ten servants to eat, and therefore his punishment was delayed for ten days. <b>Rav Naḥman said</b> that <b>Rabba bar Avuh said: These are the ten days between Rosh HaShana and Yom Kippur, </b> during which everyone is given one last opportunity to repent for the sins he committed over the course of the previous year."
        },
        {
          "verseLocation": "1 Samuel 25:44",
          "verseText": "to Adriel? But didn’t he give her to Palti, son of Laish, as it is written: “Now Saul had given Michal his daughter, David’s wife, to Palti, son of Laish”",
          "talmudLocation": "Sanhedrin 19b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-11",
          "talmudFullText": "The <i>Tosefta</i> continues. <b>It is written: “But the king took the two sons of Rizpah, daughter of Aiah, whom she bore unto Saul, Armoni and Mephibosheth, and the five sons of Michal, </b> daughter of Saul, <b>whom she bore to Adriel, </b> son of Barzillai <b>the Meholathite”</b> (II Samuel 21:8). <b>But did</b> Saul <b>give</b> Michal <b>to Adriel? But didn’t he give her to Palti, son of Laish, as it is written: “Now Saul had given Michal his daughter, David’s wife, to Palti, son of Laish”</b> (I Samuel 25:44)?"
        },
        {
          "verseLocation": "1 Samuel 25:44",
          "verseText": "“Palti”",
          "talmudLocation": "Sanhedrin 19b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-19",
          "talmudFullText": "The Talmud cites a tradition with regard to Palti, son of Laish: <b>It is written</b> in one place <b>“Palti”</b> (I Samuel 25:44), <b>and it is written</b> in another place <b>“Paltiel”</b> (II Samuel 3:15). <b>R' Yoḥanan says: Palti</b> was <b>his</b> real <b>name, and why was his name called Paltiel? </b> To teach <b>that God [<i>El</i> ] saved [<i>pelato</i>] him from the sin, </b> by giving him the insight that he may not touch Michal, understanding that she was still David’s wife and therefore forbidden to him. <b>What did he do? He embedded a sword</b> in the bed <b>between him and her, </b> and <b>said: Anyone who engages in this matter, </b> i.e., sex, <b>should be stabbed by this sword. </b>"
        }
      ]
    },
    {
      "chapterNumber": 26,
      "citations": [
        {
          "verseLocation": "1 Samuel 26:19",
          "verseText": "“If it be the Lord that has incited you against me, let Him accept an offering”",
          "talmudLocation": "Berakhot 62b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-11",
          "talmudFullText": "As for David’s statement to Saul: <b>“If it be YHWH that has incited you against me, let Him accept an offering”</b> (I Samuel 26:19), <b>R' Elazar said</b> that <b>God said to David: Do you call Me an inciter? </b> In retribution, <b>I will cause you to fail in a matter that even schoolchildren know, as it is written: “When you take the sum of the children of Israel, according to their number, then shall they give every man a ransom for his soul</b> unto YHWH, when you number them; that there be no plague among them, when you number them” (Exodus 30:12). <b>Immediately</b> after God said this to David, <b>“Satan stood up against Israel</b> and incited David to number Israel” (I Chronicles 21:1). Moreover, <b>it is written: </b> “And again the anger of YHWH was kindled against Israel, <b>and He incited David against them, saying: Go, number Israel and Judea”</b> (II Samuel 24:1). The proportional response to David’s calling God an inciter was that He incited David. <b>And when he counted them, he did not take a ransom from them, </b> and he was punished, <b>as it is written: “So YHWH sent a pestilence upon Israel from the morning even to the appointed time”</b> (II Samuel 24:15)."
        },
        {
          "verseLocation": "1 Samuel 26:19",
          "verseText": "as though he is engaged in idol worship. And so it says with regard to David: “For they have driven me out this day that I should not cleave to the inheritance of the Lord, saying: Go, serve other gods”",
          "talmudLocation": "Ketubot 110b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/110b#section-24",
          "talmudFullText": "The Talmud expresses surprise: <b>And</b> can it really be said that <b>anyone who resides outside</b> of <b>Eretz</b> Yisrael <b>has no God? Rather, </b> this comes <b>to tell you that anyone who resides outside</b> of <b>Eretz</b> Yisrael <b>is</b> considered <b>as though he is engaged in idol worship. And so it says with regard to David: “For they have driven me out this day that I should not cleave to the inheritance of YHWH, saying: Go, serve other gods”</b> (I Samuel 26:19). <b>But who said to David: Go, serve other gods? Rather, </b> this comes <b>to tell you that anyone who resides outside</b> of <b>Eretz</b> Yisrael <b>is</b> considered <b>as though he is engaged in idol worship. </b>"
        }
      ]
    },
    {
      "chapterNumber": 28,
      "citations": [
        {
          "verseLocation": "1 Samuel 28:3",
          "verseText": "But isn’t it written: “And Samuel died”",
          "talmudLocation": "Bava Batra 15a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15a#section-8",
          "talmudFullText": "It is also stated in the <i>baraita</i> that <b>Samuel wrote his own book. </b> The Talmud asks: <b>But isn’t it written: “And Samuel died”</b> (I Samuel 28:3)? The Talmud answers: <b>Gad the seer and Nathan the prophet finished it. </b>"
        },
        {
          "verseLocation": "1 Samuel 28:3",
          "verseText": "“Now Samuel was dead”",
          "talmudLocation": "Chullin 95b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/95b#section-11",
          "talmudFullText": "Shmuel then <b>wrote</b> and <b>sent to</b> R' Yoḥanan explications of <b>uncertainties</b> pertaining to <b><i>tereifot</i></b> that had to be transported on <b>thirteen camels. </b> R' Yoḥanan was impressed by this and <b>said: I have a Master in Babylonia; I will go and see him. </b> Before departing on his journey, R' Yoḥanan <b>said to a child: Recite to me your verse</b> that you studied today. The child <b>recited</b> the following verse <b>to</b> R' Yoḥanan: <b>“Now Samuel was dead”</b> (I Samuel 28:3). R' Yoḥanan <b>said</b> to himself: <b>Learn from this</b> that <b>Shmuel has died. </b> Therefore, R' Yoḥanan did not go to see Shmuel."
        },
        {
          "verseLocation": "1 Samuel 28:13",
          "verseText": "As it is written: “And the woman said to Saul, I see a godlike being coming up [ olim ]",
          "talmudLocation": "Chagigah 4b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/4b#section-9",
          "talmudFullText": "The Talmud asks: In the case of <b>Samuel, what is it</b> that he feared? <b>As it is written: “And the woman said to Saul, I see a godlike being coming up [<i>olim</i>]</b> out of the earth” (I Samuel 28:13). <b>“<i>Olim</i>, ”</b> in the plural form, <b>indicates</b> that there were <b>two</b> of them. <b>One</b> of them was <b>Samuel, but the other, </b> who was he? The Talmud explains <b>that Samuel went and brought Moses with him. He said to</b> Moses: <b>Perhaps, Heaven forbid, I was summoned for judgment</b> by God; <b>stand with me</b> and testify on my behalf <b>that there is nothing that you wrote in the Torah that I did not fulfill. </b>"
        },
        {
          "verseLocation": "1 Samuel 28:13",
          "verseText": "“And the woman said to Saul, I see a godlike being coming up out of the earth”",
          "talmudLocation": "Sanhedrin 65b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/65b#section-8",
          "talmudFullText": "The Talmud suggests: <b>Come</b> and <b>hear</b> a proof from the statement of the necromancer to King Saul: <b>“And the woman said to Saul, I see a godlike being coming up out of the earth”</b> (I Samuel 28:13). <b>What, does</b> the verse <b>not</b> mean to say <b>that</b> the dead person <b>spoke on his own? </b> The Talmud refutes this proof: <b>No, </b> this is not so, <b>as</b> the dead person <b>sits between the joints</b> of the necromancer <b>and speaks. </b>"
        },
        {
          "verseLocation": "1 Samuel 28:15",
          "verseText": "“And Samuel said to Saul, why have you angered me to bring me up? And Saul said, I am very pained, and the Philistines are waging war against me, and God has removed Himself from me and answers me no more, neither by the hands of the prophets nor by dreams. And I call to you to tell me what to do”",
          "talmudLocation": "Berakhot 12b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/12b#section-10",
          "talmudFullText": "However this proof is rejected: <b>Perhaps a community is different, </b> as a community is forgiven more easily than an individual. <b>Rather, </b> proof that an individual ashamed of his actions is forgiven for his transgressions is cited <b>from here, </b> when King Saul consulted Samuel by means of a necromancer before his final war with the Philistines: <b>“And Samuel said to Saul, why have you angered me to bring me up? And Saul said, I am very pained, and the Philistines are waging war against me, and God has removed Himself from me and answers me no more, neither by the hands of the prophets nor by dreams. And I call to you to tell me what to do”</b> (I Samuel 28:15). Saul says that he consulted prophets and dreams, but <b>he did not say</b> that he consulted <b>the <i>Urim VeTummim</i>. </b>"
        },
        {
          "verseLocation": "1 Samuel 28:15",
          "verseText": "the rebuke of the Holy One, Blessed be He, all the more so. When Rabbi Elazar reached this verse, he cried: “And Samuel said to Saul: Why have you disquieted me, to bring me up”",
          "talmudLocation": "Chagigah 4b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/4b#section-8",
          "talmudFullText": "The Talmud similarly relates: <b>When R' Elazar reached this verse, he cried: “And his brethren could not answer him, for they were affrighted at his presence”</b> (Genesis 45:3). He said, in explanation of his emotional reaction: <b>If the rebuke of</b> a man of <b>flesh and blood</b> was <b>such</b> that the brothers were unable to respond, when it comes to <b>the rebuke of God all the more so. When R' Elazar reached this verse, he cried: “And Samuel said to Saul: Why have you disquieted me, to bring me up”</b> (I Samuel 28:15). He said: <b>If Samuel the righteous was afraid of judgment</b> when he was raised by necromancy, as he thought he was being summoned for a Divine judgment, <b>all the more so</b> that <b>we</b> should be afraid."
        },
        {
          "verseLocation": "1 Samuel 28:19",
          "verseText": "As it is stated: “And Samuel said to Saul: Tomorrow you and your sons will be with me”",
          "talmudLocation": "Berakhot 12b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/12b#section-12",
          "talmudFullText": "The Talmud concludes: <b>And from where</b> is it derived <b>that Saul was pardoned by</b> God in <b>the heavens</b> for his transgressions? <b>As it is stated: “And Samuel said to Saul: Tomorrow you and your sons will be with me”</b> (I Samuel 28:19). <b>And R' Yoḥanan said: With me</b> does not only mean that they will die, but also means, in a statement that contains an aspect of consolation, that they will be <b>in my company</b> among the righteous in heaven, as Saul was pardoned for his transgressions."
        }
      ]
    },
    {
      "chapterNumber": 30,
      "citations": [
        {
          "verseLocation": "1 Samuel 30:8",
          "verseText": "“Shall I pursue after this troop?”",
          "talmudLocation": "Yoma 73a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/73a#section-17",
          "talmudFullText": "<b>The one who asks says</b> his question, e.g.: <b>“Shall I pursue after this troop? ”</b> (I Samuel 30:8). <b>And the one who is asked</b> answers him according to the response he receives and <b>says, </b> for example: <b>Thus says God: Go up and succeed. R' Yehuda says: He need not say</b> the words: <b>Thus says God; rather, </b> it is sufficient to relay the content of the response and say: <b>Go up and succeed, </b> since he is obviously only repeating what he was told."
        },
        {
          "verseLocation": "1 Samuel 30:8",
          "verseText": "as it is stated: “And David asked of God, saying: Shall I pursue after this troop? Will I overtake them? And He answered him: Pursue, for you will surely overtake them, and will surely rescue”",
          "talmudLocation": "Yoma 73b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/73b#section-2",
          "talmudFullText": "<b>But if the matter</b> is urgent and <b>requires</b> asking <b>two</b> questions simultaneously, there being no time to follow the standard protocol, one may ask both questions simultaneously and <b>he is answered</b> with regard to the <b>two</b> questions together, <b>as it is stated: “And David asked of God, saying: Shall I pursue after this troop? Will I overtake them? And He answered him: Pursue, for you will surely overtake them, and will surely rescue”</b> (I Samuel 30:8)."
        },
        {
          "verseLocation": "1 Samuel 30:17",
          "verseText": "“And David smote them from the twilight even to the evening of the next day”",
          "talmudLocation": "Bava Batra 123b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/123b#section-3",
          "talmudFullText": "R' Ḥelbo <b>raised an objection to</b> R' Shmuel bar Naḥmani: Concering a battle between the Jewish people and the nation of Amalek, who descend from Esau, the verse states: <b>“And David smote them from the twilight even to the evening of the next day”</b> (I Samuel 30:17). David was from the tribe of Judah, yet he was able to defeat the descendants of Esau. R' Shmuel bar Naḥmani <b>said to him: Whoever read</b> and taught <b>Prophets to you did not read</b> and teach <b>Writings to you, as it is written: “As he went to Ziklag, there fell to him of Manasseh, Adnah, and Jozabad, and Jediael, and Michael, and Jozabad, and Elihu, and Zillethai, captains of thousands that were of Manasseh, </b> and they helped David against the troop” (I Chronicles 12:21–2). The verse in Writings teaches that David’s campaign against Esau was led by Joseph’s descendants, from the family of Manasseh."
        },
        {
          "verseLocation": "1 Samuel 30:17",
          "verseText": "mean evening? Doesn’t neshef mean morning? As it is written: “And David slew them from the neshef until the evening of the next day”",
          "talmudLocation": "Berakhot 3b:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/3b#section-23",
          "talmudFullText": "To this point, the discussion has been based on the assumption that <i>neshef</i> means evening. The Talmud asks: <b>Does <i>neshef</i></b> really <b>mean evening? Doesn’t <i>neshef</i> mean morning? As it is written: “And David slew them from the <i>neshef</i> until the evening of the next day”</b> (I Samuel 30:17). <b>Doesn’t</b> this verse mean <b>from the morning until the night, </b> in which case <i>neshef</i> must mean morning?"
        }
      ]
    },
    {
      "chapterNumber": 31,
      "citations": [
        {
          "verseLocation": "1 Samuel 31:1",
          "verseText": "it says further on: “And the men of Israel fled from before the Philistines, and fell down slain",
          "talmudLocation": "Sotah 44b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/44b#section-1",
          "talmudFullText": "<b>because the beginning of fleeing</b> is <b>a downfall</b> on the battlefield, <b>as it is stated: “Israel has fled before the Philistines, and there has been also a great slaughter among the people”</b> (I Samuel 4:17), <b>and</b> likewise <b>it says further on: “And the men of Israel fled from before the Philistines, and fell down slain</b> in Mount Gilboa” (I Samuel 31:1)."
        },
        {
          "verseLocation": "1 Samuel 31:4",
          "verseText": "Therefore, Saul took his sword and fell upon it”",
          "talmudLocation": "Sotah 10a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-12",
          "talmudFullText": "<b>Saul</b> was smitten <b>in his neck, as it is written: </b> “Then said Saul to his armor-bearer: Draw your sword, and thrust me through with it; lest these uncircumcised come and thrust me through, and make a mock of me. But his armor-bearer would not; for he was sore afraid. <b>Therefore, Saul took his sword and fell upon it”</b> (I Samuel 31:4); he fell with his neck upon the sword."
        }
      ]
    }
  ]
}