{
  "bookName": "2 Kings",
  "totalEntries": 176,
  "chapters": [
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "2 Kings 2:9",
          "verseText": "the blessing of Elijah, as it is written: “Please, let a double portion of your spirit be upon me”",
          "talmudLocation": "Chullin 7b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/7b#section-11",
          "talmudFullText": "Rav Pappa said to Abaye:  This proof from the case of Elisha that the righteous are greater after death is not valid. And perhaps this transpired to fulfill with regard to Elisha the blessing of Elijah, as it is written: “Please, let a double portion of your spirit be upon me” (II Kings 2:9). Elijah revived one dead person and this one is the second revived by Elisha. Abaye said to Rav Pappa: If so, is this consistent with that which is taught in a baraita: The dead person arose on his feet but he did not go to his home,  indicating that he had not truly been revived?"
        },
        {
          "verseLocation": "2 Kings 2:9",
          "verseText": "“I pray you that a double portion of your spirit be upon me”",
          "talmudLocation": "Sanhedrin 105b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105b#section-15",
          "talmudFullText": "The Talmud notes: This explanation disagrees with the opinion of Rav Yosei bar Ḥoni, as Rav Yosei bar Ḥoni says: A person is jealous of everyone except for his son and his student.  Since their success reflects well upon him, he celebrates their success. The fact that one is not jealous of his son is derived from King David’s servants telling him: May Solomon be greater than he is. And the fact that one is not jealous of his student; if you wish, say that it is derived from that which Elisha said to Elijah: “I pray you that a double portion of your spirit be upon me” (II Kings 2:9). He asked of his mentor to be greater than him, indicating that it is not an objectionable matter. And if you wish, say instead that it is derived from Moses: “And he laid his hands upon him and commanded him” (Numbers 27:23). God commanded Moses to lay only one hand upon Joshua, and instead he laid both hands upon him with all his strength."
        },
        {
          "verseLocation": "2 Kings 2:9",
          "verseText": "“I pray you, let a double portion of your spirit be upon me”",
          "talmudLocation": "Sanhedrin 47a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/47a#section-9",
          "talmudFullText": "Rav Pappa said to Rav Aḥa bar Ḥanina: What proof is there from here? Perhaps the man was resurrected in order to fulfill Elisha’s request of Elijah: “I pray you, let a double portion of your spirit be upon me” (II Kings 2:9), as now Elisha resurrected two people, the son of the Shunammite woman and this man, as opposed to Elijah, who had resurrected only one person? Rav Aḥa bar Ḥanina said to Rav Pappa: If so,  there is a difficulty, as is this a reasonable explanation in light of what is taught in a baraita: The words “and stood up on his feet” indicate that he arose, but he did not go to his home.  The man did not in fact live again but for a moment, indicating that he was resurrected not in order to fulfill Elisha’s request for a double portion of Elijah’s spirit, but in order to prevent the disgrace of having a wicked man buried next to Elisha."
        },
        {
          "verseLocation": "2 Kings 2:11",
          "verseText": "“And it was as they walked along, talking, that behold, there appeared a chariot of fire",
          "talmudLocation": "Sotah 49a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/49a#section-3",
          "talmudFullText": "And R' Ile’a bar Yeverekhya says:  In the case of two Torah scholars who are walking along the way and there are no words of Torah between them,  but they are conversing about other matters, they are deserving of being burned in fire. As it is stated with regard to Elijah and his disciple Elisha: “And it was as they walked along, talking, that behold, there appeared a chariot of fire and horses of fire, which parted them both asunder” (II Kings 2:11). The reason they were not burned by the chariot of fire is that there was speech exchanged between them, which presumably was words of Torah, but if there had been no speech, they would have been deserving of being burned by the chariot."
        },
        {
          "verseLocation": "2 Kings 2:11",
          "verseText": "But isn’t it written: “And Elijah went up by a whirlwind heavenward”",
          "talmudLocation": "Sukkah 5a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/5a#section-3",
          "talmudFullText": "The Talmud asks: And did Moses and Elijah never ascend to the heavens on high? But isn’t it written: “And Moses went up to God” (Exodus 19:3)? The Talmud answers: Nevertheless, he remained below ten handbreadths adjacent to the ground. The Talmud asks: But isn’t it written: “And Elijah went up by a whirlwind heavenward” (II Kings 2:11)? The Talmud answers: Here, too, it was below ten handbreadths. The Talmud asks: But isn’t it written: “He grasps the face of the throne, and spreads His cloud upon him” (Job 26:9)? And R' Tanḥum said:  This teaches that God spread of the radiance of His Shekhina and of His cloud upon him.  Apparently, Moses was in the cloud with God. The Talmud answers: Here, too, it was below ten handbreadths."
        },
        {
          "verseLocation": "2 Kings 2:11",
          "verseText": "between them, they are worthy of being burned, as it is stated: “And it came to pass, as they still went on, and talked, that, behold, there appeared a chariot of fire, and horses of fire, which parted them both asunder”",
          "talmudLocation": "Taanit 10b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/10b#section-8",
          "talmudFullText": "The Talmud asks: Is that so? But didn’t R' Elai bar Berekhya say:  With regard to two Torah scholars who are walking along the road and there are no Torah matters discussed between them, they are worthy of being burned, as it is stated: “And it came to pass, as they still went on, and talked, that, behold, there appeared a chariot of fire, and horses of fire, which parted them both asunder” (II Kings 2:11). The reason that the chariot of fire did not harm Elisha is because there was a Torah matter between them, from which it may be inferred that had they not been discussing a Torah matter, they would have been worthy of being burned. "
        },
        {
          "verseLocation": "2 Kings 2:12",
          "verseText": "As it is written: “And he took hold of his own clothes and he rent them in two pieces”",
          "talmudLocation": "Moed Katan 22b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/22b#section-15",
          "talmudFullText": "R' Yehuda says: Any rending that does not rip apart his garment on the hem of the garment is nothing other than a frivolous rent of no significance, as it must be evident that one has rent his garment in mourning and that the rent is not merely an imperfection in the garment. R' Abbahu said: What is the reason for R' Yehuda’s opinion? As it is written: “And he took hold of his own clothes and he rent them in two pieces” (II Kings 2:12). From that which is stated: “And he rent, ” do I not know that he rent them in two? Rather,  these words teach that the rent clothes must appear as if they were torn into two pieces, i.e., the tear must be obvious and visible."
        },
        {
          "verseLocation": "2 Kings 2:12",
          "verseText": "“And Elisha saw it, and he cried, My father, my father, the chariots of Israel and their horsemen”",
          "talmudLocation": "Moed Katan 26a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26a#section-2",
          "talmudFullText": "The Talmud elaborates upon the halakhot mentioned in this baraita: From where do we derive that one must rend his clothing for his father, his mother, and his teacher who taught him Torah? As it is written with regard to the prophet Elijah, when he ascended to Heaven in a tempest: “And Elisha saw it, and he cried, My father, my father, the chariots of Israel and their horsemen” (II Kings 2:12). The Talmud interprets this verse as follows: “My father, my father”; this comes to teach that one must rend his garments for the death of his father or mother. “The chariots of Israel and their horsemen”; this comes to include also one’s teacher who taught him Torah. "
        },
        {
          "verseLocation": "2 Kings 2:12",
          "verseText": "mended? As it is written: “And he took hold of his own clothes, and rent them in two pieces”",
          "talmudLocation": "Moed Katan 26a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26a#section-4",
          "talmudFullText": "And from where do we derive that these rents are never to be properly mended? As it is written: “And he took hold of his own clothes, and rent them in two pieces” (II Kings 2:12). From the fact that it is stated: “And he rent them, ” do I not know that he rent them in two pieces? Rather,  when the verse adds that they were torn into two pieces, it teaches that they must remain torn in two pieces forever.  Accordingly, this rent must never be properly mended."
        },
        {
          "verseLocation": "2 Kings 2:12",
          "verseText": "He said to him: Since it is written: “And he saw him no more”",
          "talmudLocation": "Moed Katan 26a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26a#section-5",
          "talmudFullText": "Reish Lakish said to R' Yoḥanan:  But isn’t Elijah still alive?  Why, then, did Elisha rend his garments for him? He said to him: Since it is written: “And he saw him no more” (II Kings 2:12), Elijah was considered dead from Elisha’s perspective, and so Elisha rent his clothing for him."
        },
        {
          "verseLocation": "2 Kings 2:12",
          "verseText": "“With torn garments,” and it is written there: “And Elisha saw it, and he cried: My father, my father, the chariots of Israel and its horsemen. And he saw him no more, and he grabbed hold of his clothes and tore them into two pieces”",
          "talmudLocation": "Sanhedrin 60a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/60a#section-15",
          "talmudFullText": "R' Abbahu says:  It is derived by means of a verbal analogy between the tearing stated in this regard and the tearing stated with regard to Elijah’s ascendance to heaven. It is written here,  with regard to those who heard Rabshakeh’s blasphemy: “With torn garments, ” and it is written there: “And Elisha saw it, and he cried: My father, my father, the chariots of Israel and its horsemen. And he saw him no more, and he grabbed hold of his clothes and tore them into two pieces” (II Kings 2:12). From the meaning of that which is stated: “And tore them into two, ” do I not know that they are pieces? And why must the verse state: “Pieces”?  This teaches that they remain torn forever;  they may never be fully stitched back together, but only partially sewn."
        },
        {
          "verseLocation": "2 Kings 2:12",
          "verseText": "and said: “My father, my father, the chariot of Israel and its horsemen”",
          "talmudLocation": "Sanhedrin 68a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/68a#section-10",
          "talmudFullText": "R' Akiva was not present at the time of his death. At the conclusion of Shabbat, R' Akiva encountered the funeral procession on his way from Caesarea to Lod.  R' Akiva was striking his flesh in terrible anguish and regret until his blood flowed to the earth. He began to eulogize R' Eliezer in the row of those comforting the mourners, and said: “My father, my father, the chariot of Israel and its horsemen” (II Kings 2:12). I have many coins, but I do not have a money changer to whom to give them,  i.e., I have many questions, but after your death I have no one who can answer them."
        },
        {
          "verseLocation": "2 Kings 2:19",
          "verseText": "“And the men of the city said to Elisha: Behold, please, the situation of this city is pleasant, as my lord sees,",
          "talmudLocation": "Sotah 47a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-4",
          "talmudFullText": "The Talmud returns to discussing the incident involving Elisha: “And the men of the city said to Elisha: Behold, please, the situation of this city is pleasant, as my lord sees,  but the water is bad and the land miscarries” (II Kings 2:19). The Talmud asks: But if the water is bad and the land causes women to miscarry, what is pleasant about it? R' Ḥanin says: The grace of a place is upon its inhabitants,  i.e., people are fond of their hometown despite its shortcomings. R' Yoḥanan says: There are three graces that have a similar impact: The grace of a place upon its inhabitants; the grace of a woman upon her husband,  despite her faults; and the grace of a purchased item upon its buyer,  as one who has bought something views it in a positive light."
        },
        {
          "verseLocation": "2 Kings 2:23",
          "verseText": "the children, as it is stated: “And he went up from there to Bethel, and as he was going up by the way, there came forth young lads out of the city and mocked him, and said to him: Go up, baldhead; go up, baldhead”",
          "talmudLocation": "Sotah 46b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/46b#section-19",
          "talmudFullText": "The Talmud continues to discuss the importance of accompaniment. R' Yoḥanan says in the name of R' Meir: Whoever does not accompany another or will not allow himself to be accompanied is like a spiller of blood and is held responsible for any deaths that occur as a result of his inaction. The proof for this is that had the inhabitants of Jericho accompanied Elisha, he would not have incited the bears to attack the children, as it is stated: “And he went up from there to Bethel, and as he was going up by the way, there came forth young lads out of the city and mocked him, and said to him: Go up, baldhead; go up, baldhead” (II Kings 2:23). Had the residents of Jericho accompanied him, they would have sent away those youths and prevented what occurred next."
        },
        {
          "verseLocation": "2 Kings 2:24",
          "verseText": "“And he turned behind him and saw them, and he cursed them in the name of the Lord”",
          "talmudLocation": "Sotah 46b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/46b#section-22",
          "talmudFullText": "The verse further states with regard to the same incident: “And he turned behind him and saw them, and he cursed them in the name of YHWH” (II Kings 2:24). The Talmud asks: What did he see?  There are four explanations offered. Rav says:  He literally saw,  i.e., he stared and bored his eyes into them, as it is taught in a baraita: Rabban Shimon ben Gamliel says: Wherever it states that the rabbis placed their eyes upon a certain person, they brought upon that person either death or poverty. And Shmuel says: He saw their essential nature, that all their mothers became pregnant with them on Yom Kippur,  when sex are forbidden."
        },
        {
          "verseLocation": "2 Kings 2:24",
          "verseText": "“And two she-bears came out of the forest and tore forty-two children from them”",
          "talmudLocation": "Sotah 46b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/46b#section-24",
          "talmudFullText": "The verse states: “And two she-bears came out of the forest and tore forty-two children from them” (II Kings 2:24)."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "2 Kings 3:7",
          "verseText": "“The king of Moab rebelled [ pasha ] against me”",
          "talmudLocation": "Shevuot 12b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/12b#section-7",
          "talmudFullText": "The Talmud answers: They are derived from a verse, as A baraita states in a baraita: The verse states with regard to the High Priest sacrificing the internal goat of Yom Kippur: “And he shall effect atonement upon the Sanctuary from the impurities of the children of Israel and from their acts of rebellion, for all their sins” (Leviticus 16:16). The verse is referring to two categories of sin. The first category is acts of rebellion [pesha’im]; these are the rebellious sins, and so the verse states that King Jehoram of Israel said to King Jehoshaphat of Judah: “The king of Moab rebelled [pasha] against me” (II Kings 3:7). And the verse states with regard to a rebellion against Judah: “Then Libnah rebelled [tifsha] at that time” (II Kings 8:22). The second category is sins [ḥataot]; these are unwitting sins, and so the verse states: “If an individual person shall transgress [teḥeta] unwittingly” (Leviticus 4:2)."
        },
        {
          "verseLocation": "2 Kings 3:7",
          "verseText": "And likewise, it says: “The king of Moab rebelled [ pasha ] against me”",
          "talmudLocation": "Yoma 36b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/36b#section-6",
          "talmudFullText": "Rebellions are rebellious transgressions, when one not only intends to violate a prohibition but does so as an act of defiance against God. And likewise, it says: “The king of Moab rebelled [pasha] against me” (II Kings 3:7). And it is said: “Then Livna rebelled at that time” (II Kings 8:22). With regard to the phrase: All of their sins, these are unwitting sins. And it says: “If a soul should sin unwittingly” (Leviticus 4:2). In light of these definitions the sequence suggested by R' Meir is unlikely, as once he confessed the wrongdoings and rebellions,  does he then confess the unwitting sins?"
        },
        {
          "verseLocation": "2 Kings 3:11",
          "verseText": "as it is stated: “Here is Elisha son of Shafat, who poured water over Elijah’s hands”",
          "talmudLocation": "Berakhot 7b:26",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/7b#section-26",
          "talmudFullText": "And R' Yoḥanan said in the name of R' Shimon ben Yoḥai: Service of Torah is greater than its study,  i.e., serving a Torah scholar and spending time in his company is greater than learning Torah from him. Torah study is one component of a Torah life, but one who serves a Torah scholar learns about every aspect of life from his actions. This is derived from the verse that speaks in praise of Elisha, as it is stated: “Here is Elisha son of Shafat, who poured water over Elijah’s hands” (II Kings 3:11). The verse does not say that he learned from Elijah, rather that he poured water, which teaches that the service of Torah represented by Elisha pouring water over Elijah’s hands is greater than its study. "
        },
        {
          "verseLocation": "2 Kings 3:11",
          "verseText": "and it is written: “Here is Elisha ben Shafat who poured water on the hands of Elijah”",
          "talmudLocation": "Pesachim 68a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/68a#section-13",
          "talmudFullText": "“Bashan” is an allusion to the prophet Elisha, who came from the Bashan.  How do we know that Elisha came from Bashan? As it is stated:  “Joel the chief, and Shafam the next, and Yanai and Shafat in the Bashan” (I Chronicles 5:12), and it is written: “Here is Elisha ben Shafat who poured water on the hands of Elijah” (II Kings 3:11). “Gilad” is an allusion to Elijah, as it is stated: “And Elijah the Tishbite, who was of the inhabitants of Gilad, said” (I Kings 17:1). Based on the similarity of the verses and the verbal analogy between the two instances of the word “feed,” we learn that in the future the righteous will be like Elijah and Elisha, who resurrected the dead."
        },
        {
          "verseLocation": "2 Kings 3:12",
          "verseText": "who went to Elisha",
          "talmudLocation": "Berakhot 10a:26",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10a#section-26",
          "talmudFullText": "With regard to redemption and prayer, the Talmud tells the story of Hezekiah’s illness, his prayer to God, and subsequent recuperation. Rav Hamnuna said: What is the meaning of that which is written praising God: “Who is like the wise man, and who knows the interpretation [pesher] of the matter” (Ecclesiastes 8:1)? This verse means: Who is like God Who knows how to effect compromise [peshara] between two righteous individuals, between Hezekiah,  the king of Judea, and Isaiah the prophet. They disagreed over which of them should visit the other. Hezekiah said: Let Isaiah come to me, as that is what we find with regard to Elijah the prophet, who went to Ahab,  the king of Israel, as it is stated: “And Elijah went to appear to Ahab” (I Kings 18:2). This proves that it is the prophet who must seek out the king. And Isaiah said: Let Hezekiah come to me, as that is what we find with regard to Yehoram ben Ahab,  king of Israel, who went to Elisha the prophet, as it is stated: “So the king of Israel, Jehosaphat and the king of Edom went down to him” (II Kings 3:12)."
        },
        {
          "verseLocation": "2 Kings 3:14",
          "verseText": "“Were it not that I regard the presence of Jehoshaphat, the king of Judea, I would not look toward you, nor see you”",
          "talmudLocation": "Megillah 28a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/28a#section-15",
          "talmudFullText": "In a similar incident, R' Yehuda HaNasi once asked R' Yehoshua ben Korḥa: In the merit of which virtue were you blessed with longevity? He said to him:  Why do you ask me, are you wearied of my long life?  R' Yehuda HaNasi said to him: My teacher, it is Torah and so I must learn it. R' Yehoshua ben Korḥa said to him: In all my days I never gazed at the likeness of a wicked man, as R' Yoḥanan said: It is prohibited for a person to gaze in the image of the likeness of a wicked man, as it is stated that the prophet Elisha said to Jehoram king of Israel: “Were it not that I regard the presence of Jehoshaphat, the king of Judea, I would not look toward you, nor see you” (II Kings 3:14)."
        },
        {
          "verseLocation": "2 Kings 3:14",
          "verseText": "“Were it not that I have regard for the presence of Jehoshaphat the king of Judea, I would not look toward you, nor see you”",
          "talmudLocation": "Pesachim 66b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/66b#section-8",
          "talmudFullText": "And that if he is a prophet, his prophecy departs from him,  we learn from Elisha, as it is written that he became angry with the king of Israel and said to him: “Were it not that I have regard for the presence of Jehoshaphat the king of Judea, I would not look toward you, nor see you” (II Kings 3:14), and it is afterward written: “But now bring me a minstrel; and it came to pass when the minstrel played that the hand of YHWH came upon him” (II Kings 3:15). Because Elisha became angry with the king of Israel, his prophetic spirit departed from him and a minstrel was needed to rouse it anew."
        },
        {
          "verseLocation": "2 Kings 3:15",
          "verseText": "“But now bring me a minstrel; and it came to pass when the minstrel played, that the hand of the Lord came upon him”",
          "talmudLocation": "Pesachim 117a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/117a#section-13",
          "talmudFullText": "The Talmud adds: Incidentally, this serves to teach you that the Shekhina rests upon an individual neither from an atmosphere of laziness,  nor from an atmosphere of sadness, nor from an atmosphere of laughter, nor from an atmosphere of frivolity, nor from an atmosphere of idle chatter, but rather from an atmosphere imbued with the joy of a mitzva. As it is stated with regard to Elisha, after he became angry at the king of Israel, his prophetic spirit left him until he requested: “But now bring me a minstrel; and it came to pass when the minstrel played, that the hand of YHWH came upon him” (II Kings 3:15)."
        },
        {
          "verseLocation": "2 Kings 3:15",
          "verseText": "written: “But now bring me a minstrel; and it came to pass when the minstrel played that the hand of the Lord came upon him”",
          "talmudLocation": "Pesachim 66b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/66b#section-8",
          "talmudFullText": "And that if he is a prophet, his prophecy departs from him,  we learn from Elisha, as it is written that he became angry with the king of Israel and said to him: “Were it not that I have regard for the presence of Jehoshaphat the king of Judea, I would not look toward you, nor see you” (II Kings 3:14), and it is afterward written: “But now bring me a minstrel; and it came to pass when the minstrel played that the hand of YHWH came upon him” (II Kings 3:15). Because Elisha became angry with the king of Israel, his prophetic spirit departed from him and a minstrel was needed to rouse it anew."
        },
        {
          "verseLocation": "2 Kings 3:15",
          "verseText": "“But now bring me a minstrel; and it came to pass, when the minstrel played, that the hand of the Lord came upon him”",
          "talmudLocation": "Shabbat 30b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/30b#section-5",
          "talmudFullText": "Similarly, “So I commended mirth, ” that is the joy of a mitzva. “And of mirth: What does it accomplish? ” that is joy that is not the joy of a mitzva.  The praise of joy mentioned here is to teach you that the Shekhina rests upon an individual neither from an atmosphere of sadness, nor from an atmosphere of laziness, nor from an atmosphere of laughter, nor from an atmosphere of frivolity, nor from an atmosphere of idle conversation, nor from an atmosphere of idle chatter, but rather from an atmosphere imbued with the joy of a mitzva. As it was stated with regard to Elisha that after he became angry at the king of Israel, his prophetic spirit left him until he requested: “But now bring me a minstrel; and it came to pass, when the minstrel played, that the hand of YHWH came upon him” (II Kings 3:15). Rav Yehuda said: And, so too, one should be joyful before stating a matter of halakha. Rava said: And, so too,  one should be joyful before going to sleep in order to have a good dream. "
        },
        {
          "verseLocation": "2 Kings 3:22",
          "verseText": "as red as blood”",
          "talmudLocation": "Niddah 19a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/19a#section-18",
          "talmudFullText": "§ Once it has been established that there are types of blood that are pure and other types that are impure, the Talmud asks: And from where is it derived that those types of blood that are not listed in the Mishnah are pure, and these ones that are mentioned in the Mishnah are impure? R' Abbahu said that the verse states:  “And the sun shone upon the water, and the Moabites saw the water some way off as red as blood” (II Kings 3:22), which indicates that blood is red. The Talmud asks: Is this to say that blood is red?  If so, one can say that only blood that is red like the blood of a wound is ritually impure, and no more colors of blood are impure."
        },
        {
          "verseLocation": "2 Kings 3:22",
          "verseText": "as it is stated: “And the Moabites saw the water from afar, red like blood”",
          "talmudLocation": "Shabbat 108a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/108a#section-6",
          "talmudFullText": "It was reported: Shmuel and Karna were sitting on the bank of the Malka River. They saw that the water was rising and was murky.  Shmuel said to Karna: A great man is coming from the West,  Eretz Yisrael, and his intestines are aching, and the water is rising to greet him. Go sniff out his container,  i.e., see if he is a Torah scholar. Karna went and found Rav,  who was the Sage that came from Eretz Yisrael, and he asked him several questions to test him. He said to him: From where is it derived that one may write tefillin only on the hide of a kosher animal?  Rav said to him that this halakha is as it is written:  “And it shall be a sign for you on your arm, and a reminder between your eyes, so that God’s Torah will be in your mouth” (Exodus 13:9). Only hide from those animals that are permitted to be placed in your mouth,  i.e., may be eaten, may be used for tefillin. Karna then asked him: From where is it derived that prohibited blood is red?  Karna asked Rav this to determine which shades of menstrual blood are impure. Rav said to him that it is as it is stated: “And the Moabites saw the water from afar, red like blood” (II Kings 3:22)."
        },
        {
          "verseLocation": "2 Kings 3:27",
          "verseText": "“Then he took his eldest son, who should have reigned in his stead, and sacrificed him for a burnt offering upon the wall;",
          "talmudLocation": "Sanhedrin 39b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-17",
          "talmudFullText": "§ The Talmud cites a verse concerning the king of Moab: “Then he took his eldest son, who should have reigned in his stead, and sacrificed him for a burnt offering upon the wall;  and there was great indignation against Israel, and they departed from him and returned to their own land” (II Kings 3:27). Rav and Shmuel engage in a dispute concerning this. One says:  The king sacrificed his son for the sake of Heaven, and one says:  The king sacrificed his son for the sake of idol worship. "
        },
        {
          "verseLocation": "2 Kings 3:27",
          "verseText": "“And they departed from him and returned to their own land [ la’aretz ]”",
          "talmudLocation": "Sanhedrin 39b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-20",
          "talmudFullText": "The Talmud discusses the end of that verse: “And they departed from him and returned to their own land [la’aretz]” (II Kings 3:27). R' Ḥanina bar Pappa says: At that time the enemies of the Jewish people,  a euphemism for the Jewish people themselves, descended to the lowest level.  He interprets “la’aretz” to mean: To the earth, teaching that the Jewish people were as low as the dust of the earth."
        },
        {
          "verseLocation": "2 Kings 3:27",
          "verseText": "as it is stated: “Then he took his firstborn son, who would reign after him, and he offered him as a burnt-offering”",
          "talmudLocation": "Taanit 4a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/4a#section-10",
          "talmudFullText": "The Talmud interprets each phrase of this verse: “Which I did not command, ” this is referring to the son of Mesha, king of Moab.  King Mesha sacrificed his son, as it is stated: “Then he took his firstborn son, who would reign after him, and he offered him as a burnt-offering” (II Kings 3:27). “And I did not speak, ” this is referring to Jephthah,  who sacrificed his daughter as an offering. “Nor did it come into my heart, ” this is referring to Isaac, son of Abraham.  Although God commanded Abraham to sacrifice Isaac, there was no intent in God’s heart that he should actually do so; it was merely a test."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "2 Kings 4:9",
          "verseText": "“And she said to her husband: Behold now, I perceive that he is a holy man of God",
          "talmudLocation": "Berakhot 10b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10b#section-22",
          "talmudFullText": "Regarding the woman from Shunem: “And she said to her husband: Behold now, I perceive that he is a holy man of God who passes by us continually” (II Kings 4:9). R' Yosei ben Ḥanina, said: From here,  where the woman from Shunem perceived the prophet’s greatness before her husband did, derive that a woman recognizes the character of her guests more than a man does."
        },
        {
          "verseLocation": "2 Kings 4:10",
          "verseText": "“Let us make, I pray thee, a small chamber on the roof,",
          "talmudLocation": "Berakhot 10b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10b#section-14",
          "talmudFullText": "Having mentioned the chamber on the roof built for Elisha by the woman from Shunem, the Talmud now describes the entire event. The woman from Shunem suggested to her husband: “Let us make, I pray thee, a small chamber on the roof,  and let us place a bed, table, stool and candlestick for him there, and it will be, when he comes to us, that he will turn in there” (II Kings 4:10)."
        },
        {
          "verseLocation": "2 Kings 4:23",
          "verseText": "“Why will you go to him today; it is neither the New Moon nor Shabbat”",
          "talmudLocation": "Rosh Hashanah 16b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/16b#section-8",
          "talmudFullText": "The Talmud cites two more statements in the name of R' Yitzḥak, relating to the Festivals: And R' Yitzḥak said: A person is obligated to go out and greet his teacher on a Festival, as it is stated that the husband of the Shunamite woman asked, when she was readying herself to go to the prophet: “Why will you go to him today; it is neither the New Moon nor Shabbat” (II Kings 4:23). By inference,  we learn that on the New Moon and on Shabbat,  which in this context means a Festival that is a day of rest, she was required to go. "
        },
        {
          "verseLocation": "2 Kings 4:23",
          "verseText": "“Why are you going to him today? It is neither the New Moon nor Shabbat”",
          "talmudLocation": "Sukkah 27b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/27b#section-9",
          "talmudFullText": "The Talmud asks: Is that so? Didn’t R' Yitzḥak say: From where is it derived that one is obligated to greet his teacher on the Festival?  It is as it is stated that the husband of the Shunamite woman asked his wife: “Why are you going to him today? It is neither the New Moon nor Shabbat” (II Kings 4:23). This proves by inference that on the New Moon and Shabbat a person is obligated to greet his teacher.  The Talmud answers that this is not difficult: This statement of R' Yitzḥak that one is obligated to go and greet his teacher is referring to a case where he goes and returns on the same day and can rejoice with his wife at night; and this statement of R' Eliezer that one should stay home is referring to a case where he goes and does not return on the same day and cannot rejoice with his wife at night."
        },
        {
          "verseLocation": "2 Kings 4:27",
          "verseText": "stated: “And Geihazi approached her to push her away [ lehodfa ]”",
          "talmudLocation": "Berakhot 10b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10b#section-24",
          "talmudFullText": "With regard to the verse: “He is holy, ” R' Yosei ben Ḥanina, said:  The woman from Shunem intimated that: He is holy,  but his attendant,  Geihazi, is not holy,  as she saw no indication of holiness in him (Iyyun Ya’akov). Here too, she correctly perceived the character of her guest, as it is later stated: “And Geihazi approached her to push her away [lehodfa]” (II Kings 4:27). And R' Yosei ben Ḥanina, said: He grabbed her by the majesty of her beauty [hod yofya],  meaning that when he pushed her he grabbed her breasts in a licentious manner."
        },
        {
          "verseLocation": "2 Kings 4:29",
          "verseText": "it is written: “And you shall lay my staff on the face of the child”",
          "talmudLocation": "Pesachim 68a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/68a#section-14",
          "talmudFullText": "This idea is derived from a different source as well. R' Shmuel bar Naḥmani said that R' Yonatan said: In the future the righteous will resurrect the dead, as it is stated: “Old men and old women shall yet again dwell in the streets of Jerusalem, and every man with his staff in his hand for very age” (Zechariah 8:4). And the staff will then be used as it was used by Gehazi when Elisha sent him to bring the son of the Shunamite woman back to life, as it is written: “And you shall lay my staff on the face of the child” (II Kings 4:29)."
        },
        {
          "verseLocation": "2 Kings 4:30",
          "verseText": "Elisha, as it is written: “And he arose and followed her”",
          "talmudLocation": "Berakhot 61a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/61a#section-23",
          "talmudFullText": "Rav Naḥman bar Yitzḥak strongly objects to this: If that is so that you understand the verse literally, what do you say about the verse with regard to Elkana,  the father of the prophet Samuel, as it is written: “And Elkana walked after his wife, ” and what of the verse with regard to the prophet Elisha, as it is written: “And he arose and followed her” (II Kings 4:30)? Does this verse mean that he literally walked after her? Rather,  certainly this verse means that he followed her words and advice.  Here, too,  then the verse concerning Manoah may be similarly interpreted; he followed his wife’s words and followed her advice,  and did not literally walk behind her."
        },
        {
          "verseLocation": "2 Kings 4:39",
          "verseText": "“And one of them went out into the fields to collect orot ”",
          "talmudLocation": "Yoma 18b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/18b#section-1",
          "talmudFullText": "cress, purslane, eggs, and arugula.  Apropos the arugula plant, the Talmud cites a verse: “And one of them went out into the fields to collect orot” (II Kings 4:39). It was taught in the name of R' Meir with regard to orot in this verse: This is the plant called arugula. R' Yoḥanan said: Why are these arugula plants called orot?  It is because they enlighten [me’irot] the eyes. Rav Huna said:  With regard to one who finds arugula, if he can eat it, he eats it, and if not, he passes it over his eyes,  as that too is beneficial. Rav Pappa said: Arugula is most effective when it grows on the border of the field, where it is unadulterated by other plants."
        },
        {
          "verseLocation": "2 Kings 4:42",
          "verseText": "“And there came a man came from Ba’al Shalisha, and he brought the man of God bread of the first fruits, twenty loaves of barley and fresh ears of corn in his sack”",
          "talmudLocation": "Ketubot 105b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/105b#section-16",
          "talmudFullText": "The man said to him: I do not need the Master’s judgment.  However, let the Master accept my gift anyway, so that the Master does not prevent me from presenting first fruits.  What does the mitzva of first fruits have to with this situation? As it is taught in a baraita: “And there came a man came from Ba’al Shalisha, and he brought the man of God bread of the first fruits, twenty loaves of barley and fresh ears of corn in his sack” (II Kings 4:42). But did Elisha,  the recipient of these gifts, eat first fruits?  After all, he was not a priest. Rather,  this verse comes to tell you: Whoever brings a gift to a Torah scholar, it is as though he has presented first fruits.  This visitor to Rav Anan wished to fulfill this mitzva."
        },
        {
          "verseLocation": "2 Kings 4:42",
          "verseText": "states: “And there came a man from Baal Shalishah, and brought the man of God bread of the first fruits, twenty loaves of barley, and fresh ears of grain [ karmel ] in his sack [ betziklono ]. And he said: Give to the people, that they may eat”",
          "talmudLocation": "Menachot 66b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/66b#section-3",
          "talmudFullText": "The verse states that the omer offering should be of the fresh ear [karmel].  The baraita defines karmel as soft and malleable [rakh umal]. And likewise there are other examples of terms that are interpreted as shortened terms, as the verse states: “And there came a man from Baal Shalishah, and brought the man of God bread of the first fruits, twenty loaves of barley, and fresh ears of grain [karmel] in his sack [betziklono]. And he said: Give to the people, that they may eat” (II Kings 4:42). This verse mentions the word karmel in connection with the word betziklono, which is interpreted as an abbreviation for: He came [ba] and he poured for us [veyatzak lanu], and we ate [ve’akhalnu] and it was fine [venaveh haya]. "
        },
        {
          "verseLocation": "2 Kings 4:42",
          "verseText": "“And there came a man from Ba’al Shalisha, and he brought to the man of God bread of the first fruits, twenty loaves of barley,",
          "talmudLocation": "Sanhedrin 12a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/12a#section-2",
          "talmudFullText": "It is taught in a baraita: R' Yehuda HaNasi says that this principle can be demonstrated based on an incident related in the Bible. The verse states with regard to the prophet Elisha: “And there came a man from Ba’al Shalisha, and he brought to the man of God bread of the first fruits, twenty loaves of barley,  and fresh ears of corn in his sack. And he said: Give to the people, that they may eat” (II Kings 4:42)."
        },
        {
          "verseLocation": "2 Kings 4:43",
          "verseText": "As it is written: “And his servant said: How should I set this before a hundred men”",
          "talmudLocation": "Ketubot 106a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/106a#section-5",
          "talmudFullText": "The Talmud asks: And from where is it derived that this number of scholars would remain behind with Elisha? As it is written: “And his servant said: How should I set this before a hundred men” (II Kings 4:43). What is the meaning of “before a hundred men”? If we say that all of the gifts that he had received, i.e., the first fruits, twenty loaves of barley, and fresh ears of corn mentioned in the preceding verse, were meant to be placed before one hundred men, in years of drought and famine this was a good deal of food, which would have sufficed for them. Rather,  it must mean that each and every one of the loaves was to be placed before one hundred men.  Since he had twenty loaves plus two meals of first-fruits and ears of corn, there must have been 2,200 people present."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "2 Kings 5:2",
          "verseText": "Isn’t it written: “And the Arameans had gone out in bands, and had brought away captive out of the land of Israel a minor young woman [ na’ara ketana ]”",
          "talmudLocation": "Chullin 5a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/5a#section-5",
          "talmudFullText": "The Talmud suggests: And perhaps they are called orevim after the name of their place of origin. Isn’t it written: “And the Arameans had gone out in bands, and had brought away captive out of the land of Israel a minor young woman [na’ara ketana]” (II Kings 5:2)? And it is difficult for us to understand why the verse calls her a young woman and also calls her a minor,  which are two different stages in a girl’s development. And R' Pedat said:  She was a minor girl who was from a place called Naaran.  Perhaps in the case of Elijah they were two people from a place called Oreb. The Talmud rejects that suggestion: If so, Orebites [oreviyyim] should have been written in the verse."
        },
        {
          "verseLocation": "2 Kings 5:2",
          "verseText": "and had brought away captive from Eretz Yisrael a minor young woman [ na’ara ketana ]”",
          "talmudLocation": "Sotah 46b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/46b#section-21",
          "talmudFullText": "Rav Yosef objects to this interpretation: And perhaps they were called ne’arim after their place of origin? Isn’t it written: “And the Arameans had gone out in bands, and had brought away captive from Eretz Yisrael a minor young woman [na’ara ketana]” (II Kings 5:2), and this verse raised a difficulty to us: A minor and a young woman;  how could she be both of these? And R' Pedat says it means a minor girl from the town of Ne’oran.  This verse concerning the lads can be explained in a similar manner: They were young children from Ne’oran. The Talmud answers: These two cases are not comparable. There the verse does not specify her place of origin, so “na’ara” could mean from the town of Ne’oran; but here the verse specifies their place of origin, namely Jericho."
        },
        {
          "verseLocation": "2 Kings 5:3",
          "verseText": "a cure for his leprosy",
          "talmudLocation": "Nedarim 40a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/40a#section-6",
          "talmudFullText": "Rav continues: His reward is as it is written: “YHWH will preserve him, and keep him alive, let him be called happy in the land; and deliver not You him unto the greed of his enemies” (Psalms 41:3). He elaborates: “YHWH will preserve him” from the evil inclination; “and keep him alive” and spare him from suffering; “let him be called happy in the land” means that everyone will be honored from their association with him; “and deliver not You him unto the greed of his enemies, ” so that companions like those who counseled Naaman to seek a cure for his tzara'at from Elisha (II Kings 5:3) will happen to associate with him,  and companions like those who counseled Rehoboam with advice that resulted in the schism in his kingdom (I Kings 12:6–19) will not happen to associate with him. "
        },
        {
          "verseLocation": "2 Kings 5:18",
          "verseText": "forgive",
          "talmudLocation": "Nedarim 37b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/37b#section-10",
          "talmudFullText": "And there are words that are written but not read.  For example, the word “may” that is in the verse “may God forgive your servant” (II Kings 5:18) appears in the Bible text but is not vocalized."
        },
        {
          "verseLocation": "2 Kings 5:18",
          "verseText": "“For this matter may the Lord pardon your servant, that when my master goes into the house of Rimmon to bow down there and he leans on my hand, and I bow myself down",
          "talmudLocation": "Sanhedrin 74b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/74b#section-10",
          "talmudFullText": "The Talmud asks: What halakhic conclusion was reached about this matter? Rav Adda bar Ahava says that they say in the school of Rav: It is written that Naaman, commander of the army of the king of Aram, said to the prophet Elisha: “For this matter may YHWH pardon your servant, that when my master goes into the house of Rimmon to bow down there and he leans on my hand, and I bow myself down in the house of Rimmon” (II Kings 5:18). That is, he was forced to bow down before an idol out of fear of his master, the king of Aram. And it is written in the following verse: “And he said to him: Go in peace, ” indicating that Elisha did not criticize him for acting in this manner."
        },
        {
          "verseLocation": "2 Kings 5:23",
          "verseText": "in vain, as it is written: “And Naaman said: Be content [ ho’el ], take two talents.",
          "talmudLocation": "Arakhin 16a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/16a#section-8",
          "talmudFullText": "And for an oath taken in vain, as it is written: “And Naaman said: Be content [ho’el], take two talents.  And he urged him, and bound two talents of silver in two bags, with two changes of garment, and laid them upon two of his servants; and they bore them before him” (II Kings 5:23). The rabbis maintain that the term ho’el indicates an oath, and that Naaman requested of Gehazi, to whom this was stated, to take an oath that Elisha had sent him to accept gifts, which Elisha had not done, and Gehazi took the oath. When Elisha found out what Gehazi had done he cursed him, and so it is written: “The tzara'at of Naaman shall stick to you and to your children forever. And he went out from his presence a metzora as white as snow” (II Kings 5:27)."
        },
        {
          "verseLocation": "2 Kings 5:23",
          "verseText": "as it is written: “And Naaman said: Be content, take two talents. And he urged him, and bound two talents of silver",
          "talmudLocation": "Sanhedrin 107b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107b#section-9",
          "talmudFullText": "Elisha drove Gehazi away, as it is written: “And Naaman said: Be content, take two talents. And he urged him, and bound two talents of silver in two bags, with two changes of garments” (II Kings 5:23). Naaman offered Gehazi payment for the help Elisha had given him. The verse states: “And Elisha said to him: Where from, Gehazi? And he said: Your servant went nowhere at all. And he said to him: Went not my heart with you, when the man turned back from his chariot to meet you? Is it the time to receive silver and to receive garments, and olive groves, and vineyards, and sheep and cattle, and menservants and female slaves? ” (II Kings 5:25-26). The Talmud asks: And did Gehazi take all that? It is merely silver and garments that he took. "
        },
        {
          "verseLocation": "2 Kings 5:23",
          "verseText": "Elisha? As it is written: “And Naaman said: Pray, take talents”",
          "talmudLocation": "Sotah 47a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-7",
          "talmudFullText": "The Talmud specifies: What was that incident with Elisha? As it is written: “And Naaman said: Pray, take talents” (II Kings 5:23). Naaman offered Gehazi payment for the help Elisha had given him, and when the verse recounts Elisha’s words to Gehazi, it is written: “And he said to him: Did not my heart go, when the man turned back from his chariot to meet you? Is it a time to take money, and to take garments, and olives, and vineyards, and sheep, and oxen, and servants, and female slaves? ” (II Kings 5:26). Here Elisha criticizes Gehazi for taking the payment."
        },
        {
          "verseLocation": "2 Kings 5:26",
          "verseText": "is written: “And he said to him: Did not my heart go, when the man turned back from his chariot to meet you? Is it a time to take money, and to take garments, and olives, and vineyards, and sheep, and oxen, and servants, and maidservants?”",
          "talmudLocation": "Sotah 47a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-7",
          "talmudFullText": "The Talmud specifies: What was that incident with Elisha? As it is written: “And Naaman said: Pray, take talents” (II Kings 5:23). Naaman offered Gehazi payment for the help Elisha had given him, and when the verse recounts Elisha’s words to Gehazi, it is written: “And he said to him: Did not my heart go, when the man turned back from his chariot to meet you? Is it a time to take money, and to take garments, and olives, and vineyards, and sheep, and oxen, and servants, and female slaves? ” (II Kings 5:26). Here Elisha criticizes Gehazi for taking the payment."
        },
        {
          "verseLocation": "2 Kings 5:27",
          "verseText": "it is written: “The leprosy of Naaman shall stick to you",
          "talmudLocation": "Arakhin 16a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/16a#section-8",
          "talmudFullText": "And for an oath taken in vain, as it is written: “And Naaman said: Be content [ho’el], take two talents.  And he urged him, and bound two talents of silver in two bags, with two changes of garment, and laid them upon two of his servants; and they bore them before him” (II Kings 5:23). The rabbis maintain that the term ho’el indicates an oath, and that Naaman requested of Gehazi, to whom this was stated, to take an oath that Elisha had sent him to accept gifts, which Elisha had not done, and Gehazi took the oath. When Elisha found out what Gehazi had done he cursed him, and so it is written: “The tzara'at of Naaman shall stick to you and to your children forever. And he went out from his presence a metzora as white as snow” (II Kings 5:27)."
        },
        {
          "verseLocation": "2 Kings 5:27",
          "verseText": "“The leprosy of Naaman shall cleave to you and to your seed forever. And he went out of his presence a leper as white as snow”",
          "talmudLocation": "Sanhedrin 107b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107b#section-11",
          "talmudFullText": "When Gehazi came, Elisha saw the tzara'at that had grown on Gehazi’s head.  Elisha said to him: Wicked one! The time has arrived to take your reward for studying the matter of the eight creeping animals.  Since the silver Gehazi received was his reward for studying the matter of the eight creeping animals, Elisha enumerated eight items that Gehazi sought to purchase with the silver that he took. Then Elisha said to Gehazi: “The tzara'at of Naaman shall cleave to you and to your seed forever. And he went out of his presence a metzora as white as snow” (II Kings 5:27). With regard to the verse: “And there were four men afflicted with tzara'at at the entrance of the gate” (II Kings 7:3), R' Yoḥanan says:  These were Gehazi and his three sons,  as he and his descendants were cursed."
        },
        {
          "verseLocation": "2 Kings 5:27",
          "verseText": "“And the leprosy of Naaman shall cleave to you and to your descendants forever”",
          "talmudLocation": "Sotah 47a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-8",
          "talmudFullText": "The Talmud clarifies the criticism: And did he take all that?  But it was only money and garments that he took. R' Yitzḥak says: At that time, Elisha was engaged in the study of the topic of the eight impure creeping animals. He said to Gehazi: Wicked one, it is time for you to receive now, in this temporal world, the reward for studying the topic of the eight impure creeping animals.  This is why the verse lists eight items. The Talmud adds parenthetically that Elisha also said to Gehazi: “And the tzara'at of Naaman shall cleave to you and to your descendants forever” (II Kings 5:27), and that the verse later states: “Now there were four leprous men” (II Kings 7:3), about whom R' Yoḥanan says: This is referring to Gehazi and his three sons. "
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "2 Kings 6:1",
          "verseText": "as it is stated: “And the sons of the prophets said to Elisha, behold this place where we are staying before you is too cramped for us”",
          "talmudLocation": "Sanhedrin 107b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107b#section-7",
          "talmudFullText": "And there are those who say:  Gehazi pushed the rabbis away from coming before him,  i.e., he prevented them from learning from Elisha, as it is stated: “And the sons of the prophets said to Elisha, behold this place where we are staying before you is too cramped for us” (II Kings 6:1). It may be derived by inference that until now they were not numerous and the place was not cramped for them, as Gehazi would turn people away."
        },
        {
          "verseLocation": "2 Kings 6:1",
          "verseText": "“And the sons of the prophets said to Elisha, behold this place where we are staying before you is too cramped for us”",
          "talmudLocation": "Sotah 47a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-11",
          "talmudFullText": "And there are those who say:  Gehazi pushed the rabbis away from coming before him,  preventing them learning from Elisha, as it is written,  after the aforementioned incident: “And the sons of the prophets said to Elisha, behold this place where we are staying before you is too cramped for us” (II Kings 6:1). This proves by inference that until that time the place was not cramped,  as Gehazi would turn people away."
        },
        {
          "verseLocation": "2 Kings 6:23",
          "verseText": "nothing other than a feast, as it is stated: “And he prepared [ va’yikhreh ] for them a great feast [ kera ]; and they ate and drank”",
          "talmudLocation": "Bava Batra 75a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75a#section-4",
          "talmudFullText": "Rabba says that R' Yoḥanan says:  In the future, God will make a feast for the righteous from the flesh of the leviathan, as it is stated: “The ḥabbarim will make a feast [yikhru] of him” (Job 40:30). And kera means nothing other than a feast, as it is stated: “And he prepared [va’yikhreh] for them a great feast [kera]; and they ate and drank” (II Kings 6:23). And ḥabbarim means nothing other than Torah scholars, as it is stated: “You that dwell in the gardens, the companions [ḥaverim] hearken for your voice: Cause me to hear it” (Song of Songs 8:13). This verse is interpreted as referring to Torah scholars, who listen to God’s voice."
        },
        {
          "verseLocation": "2 Kings 6:23",
          "verseText": "as it is written: “And he prepared great provision [ kera ] for them”",
          "talmudLocation": "Niddah 31b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/31b#section-6",
          "talmudFullText": "And R' Yitzḥak from the school of R' Ami says: When a male comes into the world, his loaf of bread, i.e., his sustenance, comes into his possession.  In other words, a male can provide for himself. This is based on the aforementioned interpretation of the word male [zakhar] as an abbreviation of: This is a kar [zeh kar],  and the term kar refers to sustenance, as it is written: “And he prepared great provision [kera] for them” (II Kings 6:23)."
        },
        {
          "verseLocation": "2 Kings 6:25",
          "verseText": "“doves’ dung [ ḥiryonim ]”",
          "talmudLocation": "Megillah 25b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/25b#section-15",
          "talmudFullText": "§ A baraita states in a baraita: All of the verses that are written in the Torah in a coarse manner are read in a refined manner. For example,  the term “shall lie with her [yishgalena]” (Deuteronomy 28:30) is read as though it said yishkavena,  which is a more refined term. The term “with hemorrhoids [bafolim]” (Deuteronomy 28:27) is read bateḥorim.  The term “doves’ dung [ḥiryonim]” (II Kings 6:25) is read divyonim.  The phrase “to eat their own excrement [ḥoreihem] and drink their own urine [meimei shineihem]” (II Kings 18:27) is read with more delicate terms: To eat their own excrement [tzo’atam] and drink their own urine [meimei ragleihem]. "
        },
        {
          "verseLocation": "2 Kings 6:30",
          "verseText": "upon his flesh”",
          "talmudLocation": "Taanit 14b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/14b#section-12",
          "talmudFullText": "And R' Elazar said: An important person is permitted to gird himself in sackcloth as a sign of mourning and to pray for mercy only if he is certain that he will be answered like Jehoram, son of Ahab, as it is stated: “And it came to pass, when the king heard the words of the woman, that he rent his clothes, now he was passing by upon the wall, and the people looked, and, behold, he had sackcloth within upon his flesh” (II Kings 6:30). Although he was wicked, Jehoram was later answered and the suffering of the Jews was alleviated."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "2 Kings 7:1",
          "verseText": "Tomorrow at this time one se’a of fine flour will be sold for one shekel and two se’a of barley for one shekel in the gate of Samaria”",
          "talmudLocation": "Sanhedrin 90a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/90a#section-19",
          "talmudFullText": "This is based on that which R' Shmuel bar Naḥmani says that R' Yonatan says: From where is it derived that all measures dispensed by God,  are dispensed measure for measure?  It is derived from a verse, as it is stated concerning the siege of Jerusalem: “And Elisha said: Hear the word of YHWH;  so said YHWH: Tomorrow at this time one se’a of fine flour will be sold for one shekel and two se’a of barley for one shekel in the gate of Samaria” (II Kings 7:1). And it is written: “And the officer on whose hand the king leaned answered the man of God and said: Will YHWH make windows in heaven? Might this thing be? And he said: You shall see it with your eyes, but you shall not eat from there” (II Kings 7:2)."
        },
        {
          "verseLocation": "2 Kings 7:2",
          "verseText": "And it is written: “And the officer on whose hand the king leaned answered the man of God and said: Will the Lord make windows in heaven? Might this thing be? And he said: You shall see it with your eyes, but you shall not eat from there”",
          "talmudLocation": "Sanhedrin 90a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/90a#section-19",
          "talmudFullText": "This is based on that which R' Shmuel bar Naḥmani says that R' Yonatan says: From where is it derived that all measures dispensed by God,  are dispensed measure for measure?  It is derived from a verse, as it is stated concerning the siege of Jerusalem: “And Elisha said: Hear the word of YHWH;  so said YHWH: Tomorrow at this time one se’a of fine flour will be sold for one shekel and two se’a of barley for one shekel in the gate of Samaria” (II Kings 7:1). And it is written: “And the officer on whose hand the king leaned answered the man of God and said: Will YHWH make windows in heaven? Might this thing be? And he said: You shall see it with your eyes, but you shall not eat from there” (II Kings 7:2)."
        },
        {
          "verseLocation": "2 Kings 7:3",
          "verseText": "“And there were four men afflicted with leprosy at the entrance of the gate”",
          "talmudLocation": "Sanhedrin 107b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107b#section-11",
          "talmudFullText": "When Gehazi came, Elisha saw the tzara'at that had grown on Gehazi’s head.  Elisha said to him: Wicked one! The time has arrived to take your reward for studying the matter of the eight creeping animals.  Since the silver Gehazi received was his reward for studying the matter of the eight creeping animals, Elisha enumerated eight items that Gehazi sought to purchase with the silver that he took. Then Elisha said to Gehazi: “The tzara'at of Naaman shall cleave to you and to your seed forever. And he went out of his presence a metzora as white as snow” (II Kings 5:27). With regard to the verse: “And there were four men afflicted with tzara'at at the entrance of the gate” (II Kings 7:3), R' Yoḥanan says:  These were Gehazi and his three sons,  as he and his descendants were cursed."
        },
        {
          "verseLocation": "2 Kings 7:3",
          "verseText": "“Now there were four leprous men”",
          "talmudLocation": "Sotah 47a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-8",
          "talmudFullText": "The Talmud clarifies the criticism: And did he take all that?  But it was only money and garments that he took. R' Yitzḥak says: At that time, Elisha was engaged in the study of the topic of the eight impure creeping animals. He said to Gehazi: Wicked one, it is time for you to receive now, in this temporal world, the reward for studying the topic of the eight impure creeping animals.  This is why the verse lists eight items. The Talmud adds parenthetically that Elisha also said to Gehazi: “And the tzara'at of Naaman shall cleave to you and to your descendants forever” (II Kings 5:27), and that the verse later states: “Now there were four leprous men” (II Kings 7:3), about whom R' Yoḥanan says: This is referring to Gehazi and his three sons. "
        },
        {
          "verseLocation": "2 Kings 7:4",
          "verseText": "“If we say: We will enter into the city, then the famine is in the city, and we shall die there;",
          "talmudLocation": "Avodah Zarah 27b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/27b#section-4",
          "talmudFullText": "The Talmud asks: And from where do you say that we are not concerned with the value of temporal life? As it is written with regard to the discussion held by four lepers left outside a besieged city: “If we say: We will enter into the city, then the famine is in the city, and we shall die there;  and if we sit still here, we also die. Now therefore come, and let us fall unto the host of the Arameans; if they save us alive, we shall live; and if they kill us, we shall but die” (II Kings 7:4). The starving lepers decided to risk premature death rather than waiting to die of starvation. The Talmud asks rhetorically: But isn’t there temporal life to be lost, in which case it would be preferable for the lepers to remain in their current location? Rather, is it not apparent that we are not concerned with the value of temporal life? "
        },
        {
          "verseLocation": "2 Kings 7:4",
          "verseText": "And it says: “If we say: We will enter into the city, then the famine is in the city, and we shall die there;",
          "talmudLocation": "Bava Kamma 60b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/60b#section-6",
          "talmudFullText": "A baraita states:  If there is famine in the city, spread your feet,  i.e., leave the city, as it is stated in the verse: “And there was a famine in the land; and Abram went down into Egypt to sojourn there” (Genesis 12:10). And it says: “If we say: We will enter into the city, then the famine is in the city, and we shall die there;  and if we sit here, we die also, now come, and let us fall unto the host of the Arameans; if they save us alive, we shall live; and if they kill us, we shall but die” (II Kings 7:4)."
        },
        {
          "verseLocation": "2 Kings 7:9",
          "verseText": "sawed with saws”",
          "talmudLocation": "Sotah 48b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/48b#section-11",
          "talmudFullText": "R' Neḥemya said to him: And is it possible to say so? But isn’t it already stated: “All these were costly stones,  according to the measures of hewn stones, sawed with saws” (II Kings 7:9), which indicates that saws, which are iron implements, were used to shape the stones? If so, what is the meaning when the verse states:  “And hammer, ax, and any tool of iron were not heard in the house when it was being built” (I Kings 6:7)? It means that he would prepare the stones outside the Temple Mount using tools, and bring them inside already cut, so that no iron tools were used inside the Temple itself. R' Yehuda HaNasi said: The statement of R' Yehuda that no iron tools were used appears to be correct with regard to the Temple stones, and the statement of R' Neḥemya that tools were used appears to be correct with regard to the stones of the king’s own house. "
        },
        {
          "verseLocation": "2 Kings 7:20",
          "verseText": "And it is written: “And it was for him so, and the people trampled him in the gate, and he died”",
          "talmudLocation": "Sanhedrin 90b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/90b#section-1",
          "talmudFullText": "And it is written: “And it was for him so, and the people trampled him in the gate, and he died” (II Kings 7:20). The Talmud challenges: Perhaps it was the curse of Elisha that caused the officer to die in that manner, not the principle of punishment measure for measure for his lack of belief, as Rav Yehuda says that Rav says: The curse of a Sage, even if baseless, comes to be fulfilled? This is all the more so true concerning the curse of Elisha, which was warranted. The Talmud answers: If so, let the verse write: And they trampled him and he died. What does the term “in the gate” serve to teach? It teaches that he died over matters relating to the gate [sha’ar].  It was for the cynical dismissal of the prophecy of Elisha that the officer voiced at the city gate that he was punished measure for measure and was trampled at the city gate."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "2 Kings 8:1",
          "verseText": "Famine, as it is written: “For the Lord has called for a famine;",
          "talmudLocation": "Berakhot 55a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/55a#section-10",
          "talmudFullText": "Similarly, R' Yoḥanan said: Three matters are proclaimed by God Himself: Famine, plenty, and a good leader.  The Talmud enumerates the sources for these cases: Famine, as it is written: “For YHWH has called for a famine;  and it shall also come upon the land seven years” (II Kings 8:1). Plenty, as it is written: “And I will call for the grain, and will increase it, and lay no famine upon you” (Ezekiel 36:29). And a good leader, as it is written: “And YHWH spoke unto Moses, saying: See, I have called by name Bezalel,  son of Uri, son of Hur, of the tribe of Judah” (Exodus 31:1–2)."
        },
        {
          "verseLocation": "2 Kings 8:1",
          "verseText": "which is written: “For the Lord has called upon a famine and it shall also come upon the land seven years”",
          "talmudLocation": "Taanit 5a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/5a#section-9",
          "talmudFullText": "§ Incidental to the interpretation of these verses, the Talmud cites a series of verses, starting with the topic of hunger, that also involve questions that Rav Naḥman posed to R' Yitzḥak. Rav Naḥman said to R' Yitzḥak: What is the meaning of that which is written: “For YHWH has called upon a famine and it shall also come upon the land seven years” (II Kings 8:1)? Specifically, in those seven years, what did they eat? "
        },
        {
          "verseLocation": "2 Kings 8:4",
          "verseText": "the great things that Elisha has done”",
          "talmudLocation": "Megillah 27a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/27a#section-3",
          "talmudFullText": "The Talmud explains their respective opinions: The one who said that the reference is to where the Torah is made great bases his opinion on a verse that describes Torah study as great, as it is written: “YHWH was pleased, for His righteousness’ sake, to make Torah great and glorious” (Isaiah 42:21). And the one who said that the reference is to where prayer is made great bases his opinion on a verse that describes prayer as great, as it is written: “Tell me,  I pray you, all the great things that Elisha has done” (II Kings 8:4), and that which Elisha did,  i.e., restored a boy to life, he did through prayer. "
        },
        {
          "verseLocation": "2 Kings 8:5",
          "verseText": "that he called his teacher by his name, as it is stated: “And Gehazi said: My lord the king, this is the woman, and this is her son, whom Elisha revived”",
          "talmudLocation": "Sanhedrin 100a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/100a#section-5",
          "talmudFullText": "Rav Naḥman says:  An epikoros is one who calls his teacher by his name and does not call him R', as R' Yoḥanan said: For what reason was Gehazi punished?  It is due to the fact that he called his teacher by his name, as it is stated: “And Gehazi said: My lord the king, this is the woman, and this is her son, whom Elisha revived” (II Kings 8:5)."
        },
        {
          "verseLocation": "2 Kings 8:7",
          "verseText": "“And Elisha came to Damascus”",
          "talmudLocation": "Sotah 47a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-9",
          "talmudFullText": "The verse states: “And Elisha came to Damascus” (II Kings 8:7). The Talmud asks: For what purpose did he go there? R' Yoḥanan says: He went to help Gehazi in repentance, but Gehazi would not agree to repent from his evil ways. Elisha said to him: Return from your sins. Gehazi said to him: This is the tradition that I received from you: Whoever sins and caused the masses to sin is not given the opportunity to repent. "
        },
        {
          "verseLocation": "2 Kings 8:22",
          "verseText": "“Then Libnah rebelled [ tifsha ] at that time”",
          "talmudLocation": "Shevuot 12b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/12b#section-7",
          "talmudFullText": "The Talmud answers: They are derived from a verse, as A baraita states in a baraita: The verse states with regard to the High Priest sacrificing the internal goat of Yom Kippur: “And he shall effect atonement upon the Sanctuary from the impurities of the children of Israel and from their acts of rebellion, for all their sins” (Leviticus 16:16). The verse is referring to two categories of sin. The first category is acts of rebellion [pesha’im]; these are the rebellious sins, and so the verse states that King Jehoram of Israel said to King Jehoshaphat of Judah: “The king of Moab rebelled [pasha] against me” (II Kings 3:7). And the verse states with regard to a rebellion against Judah: “Then Libnah rebelled [tifsha] at that time” (II Kings 8:22). The second category is sins [ḥataot]; these are unwitting sins, and so the verse states: “If an individual person shall transgress [teḥeta] unwittingly” (Leviticus 4:2)."
        },
        {
          "verseLocation": "2 Kings 8:22",
          "verseText": "And it is said: “Then Livna rebelled at that time”",
          "talmudLocation": "Yoma 36b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/36b#section-6",
          "talmudFullText": "Rebellions are rebellious transgressions, when one not only intends to violate a prohibition but does so as an act of defiance against God. And likewise, it says: “The king of Moab rebelled [pasha] against me” (II Kings 3:7). And it is said: “Then Livna rebelled at that time” (II Kings 8:22). With regard to the phrase: All of their sins, these are unwitting sins. And it says: “If a soul should sin unwittingly” (Leviticus 4:2). In light of these definitions the sequence suggested by R' Meir is unlikely, as once he confessed the wrongdoings and rebellions,  does he then confess the unwitting sins?"
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "2 Kings 9:10",
          "verseText": "piggul , as it is written: “And the dogs shall eat Jezebel in the portion of Jezreel”",
          "talmudLocation": "Zevachim 31a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/31a#section-12",
          "talmudFullText": "§ R' Yannai says:  If one had intent that dogs would eat the offering the next day,  it is rendered piggul, as it is written: “And the dogs shall eat Jezebel in the portion of Jezreel” (II Kings 9:10). The verse indicates that consumption by dogs is considered eating."
        },
        {
          "verseLocation": "2 Kings 9:26",
          "verseText": "the blood of Naboth and the blood of his sons”",
          "talmudLocation": "Sanhedrin 48b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-9",
          "talmudFullText": "R' Yehuda said to them:  Ahab was Naboth’s cousin, the son of his paternal uncle, and therefore he was fit to inherit from him.  Accordingly, he took possession of the property in his capacity as an heir, and not as the king. They said to him: But Naboth had many sons.  Why, then, did they not inherit from him? R' Yehuda said to them:  Ahab executed Naboth and also his sons, as it is stated: “I have seen yesterday the blood of Naboth and the blood of his sons” (II Kings 9:26). The Talmud asks: And how do the Rabbis counter this claim? The Talmud answers: In their opinion, that verse is referring to the sons who would have issued from him had Naboth not been executed. Ahab was held accountable for the blood of Naboth and for the blood of his unborn children."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "2 Kings 10:18",
          "verseText": "“Ahab worshipped Baal a little, but Jehu shall serve him much”",
          "talmudLocation": "Sanhedrin 102a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102a#section-2",
          "talmudFullText": "What caused Jehu to do so? Abaye says: A covenant is made with the lips, as it is stated that Jehu said cunningly in an attempt to entrap the priests of the Baal: “Ahab worshipped Baal a little, but Jehu shall serve him much” (II Kings 10:18). Although it was not his intention, once the statement escaped his lips he began following the path to its fulfillment. Rava says: He saw the seal of Ahijah the Shilonite on the coronation document of Jeroboam and he erred and believed that it was permitted to act as Jeroboam did."
        },
        {
          "verseLocation": "2 Kings 10:22",
          "verseText": "“And he said to him who was over the wardrobe [ meltaḥa ]: Bring forth garments for all the worshippers of the Ba’al”",
          "talmudLocation": "Gittin 59a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/59a#section-16",
          "talmudFullText": "Having cited a tradition reported by R' Abba bar Ya’akov, the Talmud cites another such statement with regard to a different matter: The verse states: “And he said to him who was over the wardrobe [meltaḥa]: Bring forth garments for all the worshippers of the Ba’al” (II Kings 10:22). What is the meaning of the word “meltaḥa”? R' Abba bar Ya’akov says that R' Yoḥanan says:  It is something that can be compressed and then stretched [nimlal venimtaḥ] back to its former size; i.e., a certain type of garment that can be folded up so that it is very small, and afterward unfolded so that it is very large."
        },
        {
          "verseLocation": "2 Kings 10:27",
          "verseText": "“into latrines [ lemoḥra’ot ]”",
          "talmudLocation": "Megillah 25b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/25b#section-16",
          "talmudFullText": "The term “into latrines [lemoḥra’ot]” (II Kings 10:27) is read as the more refined lemotza’ot. R' Yehoshua ben Korḥa says: Lemoḥara’ot is read as it is written because it is used here as an expression of contempt for idol worship,  and it is therefore permissible to use an indelicate term."
        },
        {
          "verseLocation": "2 Kings 10:30",
          "verseText": "As Jehu was an extremely righteous person. As it is stated: “And the Lord said to Jehu: Because you have done well, to perform what is right in My eyes, and have done to the house of Ahab according to all that was in My heart, your children of the fourth generation shall sit on the throne of Israel”",
          "talmudLocation": "Sanhedrin 102a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102a#section-1",
          "talmudFullText": "And even Ahijah the Shilonite erred in this matter and signed that he would accept all of Jeroboam’s pronouncements. And generations later this caused Jehu to sin. The Talmud explains: As Jehu was an extremely righteous person. As it is stated: “And YHWH said to Jehu: Because you have done well, to perform what is right in My eyes, and have done to the house of Ahab according to all that was in My heart, your children of the 4th generation shall sit on the throne of Israel” (II Kings 10:30). And it is written: “But Jehu took no care to walk in the Torah of YHWH, God of Israel, with all his heart; he departed not from the sins of Jeroboam, who made Israel sin” (II Kings 10:31)."
        },
        {
          "verseLocation": "2 Kings 10:31",
          "verseText": "And it is written: “But Jehu took no care to walk in the Torah of the Lord, God of Israel, with all his heart; he departed not from the sins of Jeroboam, who made Israel sin”",
          "talmudLocation": "Sanhedrin 102a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102a#section-1",
          "talmudFullText": "And even Ahijah the Shilonite erred in this matter and signed that he would accept all of Jeroboam’s pronouncements. And generations later this caused Jehu to sin. The Talmud explains: As Jehu was an extremely righteous person. As it is stated: “And YHWH said to Jehu: Because you have done well, to perform what is right in My eyes, and have done to the house of Ahab according to all that was in My heart, your children of the 4th generation shall sit on the throne of Israel” (II Kings 10:30). And it is written: “But Jehu took no care to walk in the Torah of YHWH, God of Israel, with all his heart; he departed not from the sins of Jeroboam, who made Israel sin” (II Kings 10:31)."
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "2 Kings 11:1",
          "verseText": "as it is stated: “And Athaliah the mother of Ahaziah saw that her son was dead, and she arose and destroyed all the royal descendants”",
          "talmudLocation": "Sanhedrin 95b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/95b#section-4",
          "talmudFullText": "Apropos David’s prayer that his descendants cease, the Talmud asks: And from where do we derive that David’s descendants ceased to exist? It is derived from a verse, as it is stated: “And Athaliah the mother of Ahaziah saw that her son was dead, and she arose and destroyed all the royal descendants” (II Kings 11:1). The Talmud asks: But didn’t Joash remain alive, and therefore, not all of David’s descendants ceased to exist? The Talmud answers: There too,  in the massacre in Nov, Abiathar,  one of the priests, remained alive, as it is written: “And one of the sons of Ahimelech, son of Ahitub, named Abiathar, escaped” (I Samuel 22:20). Rav Yehuda says that Rav says: Were it not for the fact that Abiathar remained alive for Ahimelech, son of Ahitub, there would have been no remnant or refugee remaining from the descendants of David. "
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "2 Kings 12:5",
          "verseText": "“The money of his assessment of persons”",
          "talmudLocation": "Megillah 29b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/29b#section-16",
          "talmudFullText": "The Talmud raises an objection from the Tosefta (Megilla 3:1): When the New Moon of Adar occurs on Shabbat, they read the Torah portion of Shekalim, and they read as the haftara the story involving Jehoiada the priest (II Kings 12:1–17). Granted, according to the one who said that Shekalim is the portion of “When you take the count, ” this is the reason that they read as the haftara the story involving Jehoiada the priest: Because it is comparable in content to the Torah reading, as it is written in the story of Jehoiada: “The money of his assessment of persons” (II Kings 12:5), which is referring to his collection of the half-shekels, and the haftara should always contain a theme similar to the Torah reading."
        },
        {
          "verseLocation": "2 Kings 12:10",
          "verseText": "from here: “And Jehoiada the priest took a chest, and bored a hole in the lid of it, and set it beside the altar, on the right side as one comes into the House of the Lord; and the priests that kept the threshold put in there all the money that was brought into the House of the Lord”",
          "talmudLocation": "Menachot 34a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/34a#section-7",
          "talmudFullText": "Rav Shmuel bar Aḥa said before Rav Pappa in the name of Rava bar Ulla that the requirement that the mezuza be affixed to the right of the entrance is derived from here: “And Jehoiada the priest took a chest, and bored a hole in the lid of it, and set it beside the altar, on the right side as one comes into the House of YHWH; and the priests that kept the threshold put in there all the money that was brought into the House of YHWH” (II Kings 12:10). This indicates that an object designed for those entering a house is placed to the right of the one entering."
        },
        {
          "verseLocation": "2 Kings 12:10",
          "verseText": "making a hole, as it is written: “And made a hole [ vayyikkov ] in its lid”",
          "talmudLocation": "Sanhedrin 56a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/56a#section-7",
          "talmudFullText": "The Talmud asks: But say that perhaps the meaning of nokev is not cursing, but rather making a hole, as it is written: “And made a hole [vayyikkov] in its lid” (II Kings 12:10). According to this, the word nokev is referring to one who makes a hole and damages the written name of God. And the prohibition against doing so is derived from here: “And you shall destroy their name out of that place. You shall not do so to YHWH your God” (Deuteronomy 12:3–4)."
        },
        {
          "verseLocation": "2 Kings 12:10",
          "verseText": "and it is written there: “And he bored [ vayyikkov ] a hole in its lid of it”",
          "talmudLocation": "Sanhedrin 92a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92a#section-2",
          "talmudFullText": "Ulla bar Yishmael says: One perforates like a sieve a person who withholds halakha from a student. It is written here:  “He who withholds bar, the people yikkevuhu” (Proverbs 11:26), and it is written there: “And he bored [vayyikkov] a hole in its lid of it” (II Kings 12:10). And Abaye says:  One perforates him like a launderers’ utensil used for sprinkling water on garments."
        },
        {
          "verseLocation": "2 Kings 12:16",
          "verseText": "an allusion to the matter, as it is stated: “And they did not reckon with the men into whose hand they delivered the money to pay out to the workmen; for they dealt in good faith”",
          "talmudLocation": "Bava Batra 9a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/9a#section-4",
          "talmudFullText": "§ A baraita states: One does not calculate sums with charity collectors concerning the money they collected for charity,  to verify how much they received and how much they distributed, nor does one calculate sums with the Temple treasurers concerning the property consecrated to the Temple. And even though there is no explicit proof of the matter from the Bible, there is nevertheless an allusion to the matter, as it is stated: “And they did not reckon with the men into whose hand they delivered the money to pay out to the workmen; for they dealt in good faith” (II Kings 12:16)."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "2 Kings 13:7",
          "verseText": "as it is stated: “For the king of Aram destroyed them and made them like the dust in threshing”",
          "talmudLocation": "Pesachim 87b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-2",
          "talmudFullText": "Alternatively,  with regard to the name Gomer, Rav Yehuda said:  The name can be understood as deriving from the root gamar, to finish. It alludes to the fact that the non-Jews sought to finish the money of the Jewish people in her days. R' Yoḥanan said:  They did not just seek to do so, but were successful. They plundered and finished it, as it is stated: “For the king of Aram destroyed them and made them like the dust in threshing” (II Kings 13:7)."
        },
        {
          "verseLocation": "2 Kings 13:14",
          "verseText": "Elisha came and prayed for mercy and he was healed, as it is written: “Now Elisha fell ill with his illness from which he was to die”",
          "talmudLocation": "Bava Metzia 87a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/87a#section-15",
          "talmudFullText": "Until Jacob, there was no illness leading up to death; rather, one would die suddenly. Jacob came and prayed for mercy, and illness was brought to the world, allowing one to prepare for his death, as it is stated: “And one said to Joseph: Behold, your father is sick” (Genesis 48:1), which is the first time that sickness preceding death is mentioned in the Bible. Until Elisha, one did not fall ill and then heal,  as everyone who fell ill would die. Elisha came and prayed for mercy and he was healed, as it is written: “Now Elisha fell ill with his illness from which he was to die” (II Kings 13:14). By inference,  one can derive that he had previously fallen ill with other illnesses from which he did not die."
        },
        {
          "verseLocation": "2 Kings 13:14",
          "verseText": "from which he died, as it is stated: “Now Elisha fell ill of his illness from which he was to die”",
          "talmudLocation": "Bava Metzia 87a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/87a#section-16",
          "talmudFullText": "A baraita states: Elisha fell ill with three illnesses: One was due to the fact that he pushed Gehazi away with both hands,  i.e., he banished Gehazi without granting him a chance to repent (see II Kings, chapter 5). One was due to the fact that he incited bears against young children (see II Kings 2:23–25). And one was the illness from which he died, as it is stated: “Now Elisha fell ill of his illness from which he was to die” (II Kings 13:14)."
        },
        {
          "verseLocation": "2 Kings 13:14",
          "verseText": "from which he died, as it is stated: “And Elisha was fallen ill of his illness",
          "talmudLocation": "Sanhedrin 107b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107b#section-16",
          "talmudFullText": "A baraita states: Elisha fell ill with three illnesses: One illness was due to the fact that he incited bears to attack and eat children (see II Kings 2:24-25); and one was due to the fact that he pushed Gehazi away with two hands and caused him to despair of atonement; and one was the illness from which he died, as it is stated: “And Elisha was fallen ill of his illness from which he was to die” (II Kings 13:14), indicating that he had previously suffered other illnesses."
        },
        {
          "verseLocation": "2 Kings 13:14",
          "verseText": "Elisha, there was no ill person who recovered, and Elisha came and prayed for mercy and recovered, as it is stated: “And Elisha was fallen ill of his illness from which he was to die”",
          "talmudLocation": "Sanhedrin 107b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107b#section-17",
          "talmudFullText": "Apropos the death of Elisha, the Talmud says: Until the time of Abraham there was no aging,  and the old and the young looked the same. Anyone who saw Abraham said: That is Isaac,  and anyone who saw Isaac said: That is Abraham. Abraham prayed for mercy, that he would undergo aging, as it is stated: “And Abraham was old, well stricken in age” (Genesis 24:1). There is no mention of aging before that verse. Until the time of Jacob there was no weakness,  i.e., illness. Jacob prayed for mercy and there was weakness, as it is stated: “And one said to Joseph: Behold, your father is ill” (Genesis 48:1). Until the time of Elisha, there was no ill person who recovered, and Elisha came and prayed for mercy and recovered, as it is stated: “And Elisha was fallen ill of his illness from which he was to die” (II Kings 13:14). That is the first mention of a person who was ill and who did not die from that illness."
        },
        {
          "verseLocation": "2 Kings 13:14",
          "verseText": "“And Elisha became sick [ ḥala ] with his illness [ ḥolyo ] from which he would die”",
          "talmudLocation": "Sotah 47a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-5",
          "talmudFullText": "§ A baraita states: Elisha fell ill three times. One was a punishment for inciting the bears to attack the children; and one was a punishment for pushing Gehazi away with both hands,  without leaving him the option to return; and one was the sickness from which he died, as an expression of illness is stated three times in the verse about Elisha: “And Elisha became sick [ḥala] with his illness [ḥolyo] from which he would die” (II Kings 13:14). The root ḥet, lamed, heh, which indicates illness, is used twice in this verse, and it is stated once that Elisha will die."
        },
        {
          "verseLocation": "2 Kings 13:21",
          "verseText": "as Rabbi Ḥama bar Ḥanina says: The righteous are greater after their death, more so than during their lifetimes, as it is stated: “And it came to pass, as they were burying a man, that they spied a raiding party; and they cast the man into the tomb of Elisha; and as soon as the man touched the bones of Elisha, he revived, and stood up on his feet”",
          "talmudLocation": "Chullin 7b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/7b#section-10",
          "talmudFullText": "R' Yehuda HaNasi was greatly imploring him to enter his home until a mountain rose between them and R' Yehuda HaNasi could no longer speak with him. R' Yehuda HaNasi wept and said: If during their lifetimes it is so that the righteous are great, after their death it is all the more so true. The Talmud comments: This is as R' Ḥama bar Ḥanina says: The righteous are greater after their death, more so than during their lifetimes, as it is stated: “And it came to pass, as they were burying a man, that they spied a raiding party; and they cast the man into the tomb of Elisha; and as soon as the man touched the bones of Elisha, he revived, and stood up on his feet” (II Kings 13:21)."
        },
        {
          "verseLocation": "2 Kings 13:21",
          "verseText": "he touched the bones of Elisha, and he revived and stood up on his feet”",
          "talmudLocation": "Sanhedrin 47a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/47a#section-8",
          "talmudFullText": "§ The Mishnah teaches that they would not bury the executed transgressor in his ancestral burial plot, but rather in one of two special graveyards set aside for those executed by the court. The Talmud explains: And why is all this necessary? It is necessary because a wicked man is not buried next to a righteous man. As Rav Aḥa bar Ḥanina says: From where is it derived that a wicked man is not buried next to a righteous man? As it is stated: “And it came to pass, as they were burying a man, that behold, they spied a raiding party; and they cast the man into the tomb of Elisha; and as the man came there, he touched the bones of Elisha, and he revived and stood up on his feet” (II Kings 13:21). The man, who was not righteous, was miraculously resurrected so that he would not remain buried alongside Elisha."
        },
        {
          "verseLocation": "2 Kings 13:22",
          "verseText": "since the days of Hazael, as it is stated: “And Hazael, king of Aram, oppressed Israel all the days of Jehoahaz”",
          "talmudLocation": "Shabbat 55a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55a#section-14",
          "talmudFullText": "And Shmuel said: The merit of the Patriarchs ceased since the days of Hazael, as it is stated: “And Hazael, king of Aram, oppressed Israel all the days of Jehoahaz” (II Kings 13:22). And it is written there: “And YHWH was gracious to them, and had compassion on them, and turned toward them because of His covenant with Abraham, Isaac, and Jacob and would not destroy them; neither has He till now cast them away from His presence” (II Kings 13:23). That was the last time that the merit of the Patriarchs was mentioned."
        },
        {
          "verseLocation": "2 Kings 13:23",
          "verseText": "“And the Lord was gracious to them, and had compassion on them, and turned toward them because of His covenant with Abraham, Isaac, and Jacob and would not destroy them; neither has He till now cast them away from His presence”",
          "talmudLocation": "Shabbat 55a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55a#section-14",
          "talmudFullText": "And Shmuel said: The merit of the Patriarchs ceased since the days of Hazael, as it is stated: “And Hazael, king of Aram, oppressed Israel all the days of Jehoahaz” (II Kings 13:22). And it is written there: “And YHWH was gracious to them, and had compassion on them, and turned toward them because of His covenant with Abraham, Isaac, and Jacob and would not destroy them; neither has He till now cast them away from His presence” (II Kings 13:23). That was the last time that the merit of the Patriarchs was mentioned."
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "2 Kings 14:10",
          "verseText": "“Keep your honor and stay at home”",
          "talmudLocation": "Moed Katan 17a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/17a#section-17",
          "talmudFullText": "The Talmud continues: Rav Huna said that in Usha it was enacted:  If the president of the court sinned, he is not ostracized.  Although this would be the appropriate punishment, he is not ostracized, so as not to cause a desecration of God’s name. Rather,  they say to him the words of the verse: “Keep your honor and stay at home” (II Kings 14:10). That is to say, to preserve your dignity, it would be best if you were to stay at home, resign your position, and refrain from further public appearances. If he sins again, he is ostracized, due to the desecration of God’s name that would ensue were people to think that he was spared his rightful punishment due to his high position."
        },
        {
          "verseLocation": "2 Kings 14:25",
          "verseText": "which He spoke by the hand of His servant Jonah the son of Amittai, the prophet”",
          "talmudLocation": "Yevamot 98a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/98a#section-10",
          "talmudFullText": "The Master said that R' Akiva inferred from the verse “And the word of YHWH came to Jonah a second time, saying” that the Shekhina spoke with him only a second time. However, a 3rd time the Shekhina did not speak with him.  The Talmud asks: Isn’t it written with regard to King Jeroboam ben Joash: “He restored the border of Israel from the entrance of Hamath to the Sea of the Arabah, according to the word of YHWH,  the God of Israel, which He spoke by the hand of His servant Jonah the son of Amittai, the prophet” (II Kings 14:25)? Evidently, Jonah prophesied at least once more."
        }
      ]
    },
    {
      "chapterNumber": 15,
      "citations": [
        {
          "verseLocation": "2 Kings 15:5",
          "verseText": "“And the Lord afflicted the king, so that he was a leper until the day of his death, and dwelt in an independent house. And Jotham, son of the king, was over the household,",
          "talmudLocation": "Horayot 10a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/10a#section-18",
          "talmudFullText": "§ Apropos a king, A baraita states that when the verse states: “When a king sins” (Leviticus 4:22), this serves to exclude a king who is ill.  The Talmud asks: Due to the fact that he is ill, is he removed from his sovereignty? Rav Avdimi bar Ḥama said:  The reference is not to all illnesses; rather, it is to exclude a king who is afflicted with tzara'at, as it is stated concerning King Azariah: “And YHWH afflicted the king, so that he was a metzora until the day of his death, and dwelt in an independent house. And Jotham, son of the king, was over the household,  judging the people of the land” (II Kings 15:5). Azariah was removed from his sovereignty when he was afflicted with tzara'at. The Talmud comments: From the fact that the verse states: “In an independent house, ” by inference it may be understood that until now he was a servant,  i.e., he was in servitude to the people."
        },
        {
          "verseLocation": "2 Kings 15:19",
          "verseText": "“Pul”",
          "talmudLocation": "Sanhedrin 94a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94a#section-12",
          "talmudFullText": "The eight names of Sennacherib are as it is written in his regard among the kings of Assyria: “Tiglath-Pileser” (II Kings 15:29), “Tiglath-Pilneser” (II Chronicles 28:20), “Shalmaneser” (II Kings 17:3), “Pul” (II Kings 15:19), “Sargon” (Isaiah 20:1), and “the great and noble Asenappar” (Ezra 4:10). And the Talmud asks: But isn’t there an additional name, Sennacherib [Sanḥeriv]?  The Talmud explains: That was not a given name; rather, it is an appellation based on the fact that his speech is contentious [siḥato riv],  leading to quarrel and shame. Alternatively,  he was called Sanḥeriv due to the fact that he spoke [saḥ] and snorted out [niḥer] contemptuous statements vis-à-vis the Transcendent. "
        },
        {
          "verseLocation": "2 Kings 15:29",
          "verseText": "“Tiglath-Pileser”",
          "talmudLocation": "Sanhedrin 94a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94a#section-12",
          "talmudFullText": "The eight names of Sennacherib are as it is written in his regard among the kings of Assyria: “Tiglath-Pileser” (II Kings 15:29), “Tiglath-Pilneser” (II Chronicles 28:20), “Shalmaneser” (II Kings 17:3), “Pul” (II Kings 15:19), “Sargon” (Isaiah 20:1), and “the great and noble Asenappar” (Ezra 4:10). And the Talmud asks: But isn’t there an additional name, Sennacherib [Sanḥeriv]?  The Talmud explains: That was not a given name; rather, it is an appellation based on the fact that his speech is contentious [siḥato riv],  leading to quarrel and shame. Alternatively,  he was called Sanḥeriv due to the fact that he spoke [saḥ] and snorted out [niḥer] contemptuous statements vis-à-vis the Transcendent. "
        }
      ]
    },
    {
      "chapterNumber": 17,
      "citations": [
        {
          "verseLocation": "2 Kings 17:2",
          "verseText": "Rav Kahana and Rav Asi said to Rav: It is written with regard to Hoshea ben Elah: “And he did that which was evil in the eyes of the Lord, yet not as the kings of Israel",
          "talmudLocation": "Gittin 88a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/88a#section-18",
          "talmudFullText": "Rav Kahana and Rav Asi said to Rav: It is written with regard to Hoshea ben Elah: “And he did that which was evil in the eyes of YHWH, yet not as the kings of Israel that were before him” (II Kings 17:2). But it is written subsequently: “Against him came up Shalmaneser,  king of Assyria” (II Kings 17:3) and exiled the people of Israel. If Hoshea performed less evil than the previous kings of Israel, why was his generation the one that was punished?"
        },
        {
          "verseLocation": "2 Kings 17:3",
          "verseText": "“Against him came up Shalmaneser,",
          "talmudLocation": "Gittin 88a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/88a#section-18",
          "talmudFullText": "Rav Kahana and Rav Asi said to Rav: It is written with regard to Hoshea ben Elah: “And he did that which was evil in the eyes of YHWH, yet not as the kings of Israel that were before him” (II Kings 17:2). But it is written subsequently: “Against him came up Shalmaneser,  king of Assyria” (II Kings 17:3) and exiled the people of Israel. If Hoshea performed less evil than the previous kings of Israel, why was his generation the one that was punished?"
        },
        {
          "verseLocation": "2 Kings 17:3",
          "verseText": "“Shalmaneser”",
          "talmudLocation": "Sanhedrin 94a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94a#section-12",
          "talmudFullText": "The eight names of Sennacherib are as it is written in his regard among the kings of Assyria: “Tiglath-Pileser” (II Kings 15:29), “Tiglath-Pilneser” (II Chronicles 28:20), “Shalmaneser” (II Kings 17:3), “Pul” (II Kings 15:19), “Sargon” (Isaiah 20:1), and “the great and noble Asenappar” (Ezra 4:10). And the Talmud asks: But isn’t there an additional name, Sennacherib [Sanḥeriv]?  The Talmud explains: That was not a given name; rather, it is an appellation based on the fact that his speech is contentious [siḥato riv],  leading to quarrel and shame. Alternatively,  he was called Sanḥeriv due to the fact that he spoke [saḥ] and snorted out [niḥer] contemptuous statements vis-à-vis the Transcendent. "
        },
        {
          "verseLocation": "2 Kings 17:9",
          "verseText": "“And the children of Israel fabricated matters that were not right against the Lord their God”",
          "talmudLocation": "Moed Katan 18b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/18b#section-17",
          "talmudFullText": "R' Ya’akov raised an objection:  Does the verse not say: “And the children of Israel fabricated matters that were not right against YHWH their God” (II Kings 17:9), which indicates that it is possible to make up stories about someone else even though they are entirely baseless. The Talmud answers: There they did it in order to anger God, but they did not actually think that what they were saying was true."
        },
        {
          "verseLocation": "2 Kings 17:21",
          "verseText": "“And Jeroboam drove Israel from following the Lord, and caused them to sin a great sin”",
          "talmudLocation": "Sanhedrin 102a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102a#section-13",
          "talmudFullText": "With regard to the verse: “And Jeroboam drove Israel from following YHWH, and caused them to sin a great sin” (II Kings 17:21), R' Ḥanin says:  This is like two sticks that when they collide cause each other to carom,  as due to the strife, Jeroboam caused the subjects of the kingdom of Israel to grow distant from God."
        },
        {
          "verseLocation": "2 Kings 17:30",
          "verseText": "“And the men of Babylonia made Succoth-Benoth”",
          "talmudLocation": "Sanhedrin 63b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/63b#section-16",
          "talmudFullText": "Rav Yehuda says that Rav says with regard to the verse describing the peoples that were settled in Samaria by the Assyrians: “And the men of Babylonia made Succoth-Benoth” (II Kings 17:30); and what is this idol? It is the image of a hen. “And the men of Cuth made Nergal” (II Kings 17:30); and what is it?  It is the image of a rooster. “And the men of Hamath made Ashima” (II Kings 17:30); and what is it?  It is the image of a bald billy goat. “And the Avvites made Nibhaz and Tartak” (II Kings 17:31); and what are they?  The image of a dog and a donkey. "
        },
        {
          "verseLocation": "2 Kings 17:31",
          "verseText": "a bald billy goat. “And the Avvites made Nibhaz and Tartak”",
          "talmudLocation": "Sanhedrin 63b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/63b#section-16",
          "talmudFullText": "Rav Yehuda says that Rav says with regard to the verse describing the peoples that were settled in Samaria by the Assyrians: “And the men of Babylonia made Succoth-Benoth” (II Kings 17:30); and what is this idol? It is the image of a hen. “And the men of Cuth made Nergal” (II Kings 17:30); and what is it?  It is the image of a rooster. “And the men of Hamath made Ashima” (II Kings 17:30); and what is it?  It is the image of a bald billy goat. “And the Avvites made Nibhaz and Tartak” (II Kings 17:31); and what are they?  The image of a dog and a donkey. "
        },
        {
          "verseLocation": "2 Kings 17:31",
          "verseText": "“And the Sepharvites burned their sons and their daughters in the fire to Adrammelech and Anammelech, the gods of Sepharvaim”",
          "talmudLocation": "Sanhedrin 63b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/63b#section-17",
          "talmudFullText": "“And the Sepharvites burned their sons and their daughters in the fire to Adrammelech and Anammelech, the gods of Sepharvaim” (II Kings 17:31); and what are they? The mule and the horse.  And why are they called that? A mule is called Adrammelech because it honors [addar] its master with its load,  i.e., because it carries the master’s load, and a horse is called Anammelech because it responds [anei] to its master,  assisting him in battle. "
        },
        {
          "verseLocation": "2 Kings 17:32",
          "verseText": "Samaritans are lion converts, and the priests who assimilated among them were unfit priests, as it is stated: “And made unto them from among themselves priests of the high places”",
          "talmudLocation": "Kiddushin 75b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/75b#section-8",
          "talmudFullText": "R' Yishmael holds that Samaritans are lion converts, and the priests who assimilated among them were unfit priests, as it is stated: “And made unto them from among themselves priests of the high places” (II Kings 17:32). And Rabba bar bar Ḥana says that R' Yoḥanan says:  What is the meaning of “from among themselves”? From the thorns that are among the Jewish people,  meaning those of flawed lineage. And it was due to that reason that the rabbis disqualified them,  not due to the Samaritans themselves, who are non-Jews, but due to the Jews of flawed lineage who are assimilated among them. When a Samaritan seeks to marry another Samaritan, it is possible that one of them is a Jew of flawed lineage."
        },
        {
          "verseLocation": "2 Kings 17:32",
          "verseText": "And Rabbi Akiva holds: Samaritans are true converts, and the priests who assimilated among them were fit priests, as it is stated: “And made unto them from among themselves priests of the high places”",
          "talmudLocation": "Kiddushin 75b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/75b#section-9",
          "talmudFullText": "And R' Akiva holds: Samaritans are true converts, and the priests who assimilated among them were fit priests, as it is stated: “And made unto them from among themselves priests of the high places” (II Kings 17:32). And Rabba bar bar Ḥana says that R' Yoḥanan says:  “From among themselves” means from the chosen ones,  the upper echelon of the Jewish people. And for what reason did the rabbis prohibit them from entering into the congregation if there is no problem with regard to their conversion or with regard to the Jews who assimilated among them? It is because they did not act in accordance with the halakha, as they would perform levirate marriage with betrothed women.  They would perform the mitzva of levirate marriage only with one who was widowed from a betrothal,"
        }
      ]
    },
    {
      "chapterNumber": 18,
      "citations": [
        {
          "verseLocation": "2 Kings 18:4",
          "verseText": "Rabbi Yosei said to them: But isn’t it already stated: “And he broke into pieces the brazen serpent that Moses had made;",
          "talmudLocation": "Avodah Zarah 44a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/44a#section-6",
          "talmudFullText": "The baraita continues: R' Yosei attempts to cite another proof that grinding an object of idol worship is sufficient, from Hezekiah’s destruction of Moses’ serpent, which was worshipped by the Jewish people in Hezekiah’s time. R' Yosei said to them: But isn’t it already stated: “And he broke into pieces the brazen serpent that Moses had made;  as until those days the children of Israel sacrificed to it” (II Kings 18:4)? This indicates that breaking an object of idol worship into pieces suffices."
        },
        {
          "verseLocation": "2 Kings 18:4",
          "verseText": "interpreted this verse to them: “And he broke in pieces the copper serpent that Moses had made; for until those days the children of Israel burned incense to it; and it was called Nehushtan”",
          "talmudLocation": "Chullin 6b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/6b#section-7",
          "talmudFullText": "R' Yehuda HaNasi interpreted this verse to them: “And he broke in pieces the copper serpent that Moses had made; for until those days the children of Israel burned incense to it; and it was called Nehushtan” (II Kings 18:4). Is it possible that they burned incense to it and Asa,  a righteous king, came and did not eradicate it,  and Jehoshaphat,  a righteous king, came and did not eradicate it,  and it remained until the time of Hezekiah? But didn’t Asa and Jehoshaphat eradicate all objects of idol worship in the world? "
        },
        {
          "verseLocation": "2 Kings 18:11",
          "verseText": "“And he put them in Halah, and in Habor, on the river of Gozan, and in the cities of the Medes”",
          "talmudLocation": "Kiddushin 72a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/72a#section-6",
          "talmudFullText": "The Talmud comments: And this disagrees with the statement of R' Abba bar Kahana, as R' Abba bar Kahana says: What is the meaning of that which is written with regard to the exile of the ten tribes of the kingdom of Israel: “And he put them in Halah, and in Habor, on the river of Gozan, and in the cities of the Medes” (II Kings 18:11)? Halah is Ḥillazon; Habor is Hadyav; the river of Gozan is Ginzak; the cities of the Medes are Ḥamadan and its neighboring towns, and some say: This is Nihavnad and its neighboring towns.  Since the ten tribes assimilated with the non-Jews, the lineage of Jews from those places is flawed, unlike that which was taught before."
        },
        {
          "verseLocation": "2 Kings 18:11",
          "verseText": "“And he put them in Halah, and in Habor, on the river of Gozan, and in the cities of the Medes”",
          "talmudLocation": "Yevamot 16b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/16b#section-10",
          "talmudFullText": "The Talmud responds: Rav Yehuda means that there is a concern only with regard to those who came from the permanent dwelling places of the ten tribes. As R' Abba bar Kahana said that the verse states about those exiled from Samaria: “And he put them in Halah, and in Habor, on the river of Gozan, and in the cities of the Medes” (II Kings 18:11). R' Abba bar Kahana proceeded to identify these places. Halah; this is the place called Ḥalzon. And Habor; "
        },
        {
          "verseLocation": "2 Kings 18:16",
          "verseText": "He cut off the doors of the Sanctuary and sent them to the king of Assyria",
          "talmudLocation": "Berakhot 10b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10b#section-8",
          "talmudFullText": "Yet, with regard to three other innovations, the rabbis of his generation did not agree with him:  He stopped up the waters of the Gihon,  the Pool of Siloam, diverting its water into the city by means of a tunnel (II Chronicles 32:30), and they did not agree with him.  He cut off the doors of the Sanctuary and sent them to the king of Assyria (II Kings 18:16), and they did not agree with him.  He intercalated Nisan in Nisan,  creating a leap year by adding an extra month during the month of Nisan. That intercalation must be performed before the end of Adar (II Chronicles 30:2)."
        },
        {
          "verseLocation": "2 Kings 18:21",
          "verseText": "“Now, behold, you trust upon the staff of this bruised reed”",
          "talmudLocation": "Berakhot 56b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/56b#section-13",
          "talmudFullText": "One who sees a shave in a dream should rise early and recite: “And he shaved himself, and changed his raiment” (Genesis 41:14), which was said with regard to Joseph when he left prison and rose to greatness, before a different verse,  with a negative connotation, can precede it in becoming reality: “If I be shaven, then my strength will go from me, and I shall become weak” (Judges 16:17). One who sees a well in a dream should rise early and recite: “A well of living waters” (Song of Songs 4:15), before a different verse,  with a negative connotation, can precede it in becoming reality: “As a cistern wells with her waters,  so it wells in its wickedness” (Jeremiah 6:7). One who sees a reed in a dream should rise early and recite: “A bruised reed shall he not break” (Isaiah 42:3), in praise of the Messiah, before a different verse,  with a negative connotation, can precede it in becoming reality: “Now, behold, you trust upon the staff of this bruised reed” (II Kings 18:21), which is a disparaging depiction of Egypt."
        },
        {
          "verseLocation": "2 Kings 18:21",
          "verseText": "they said to me as follows: “Behold you trust upon the staff of this bruised reed”",
          "talmudLocation": "Yevamot 93b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/93b#section-1",
          "talmudFullText": "Rather, is it not referring to a case like this,  of one who tithed an entity that was not yet in the world, in honor of Shabbat? R' Yannai said to R' Ḥiyya: But they read before me in a dream these two words: Bruised reed. What, is it not the case that they said to me as follows: “Behold you trust upon the staff of this bruised reed” (II Kings 18:21)? In other words, you rely on an unsubstantiated idea."
        },
        {
          "verseLocation": "2 Kings 18:25",
          "verseText": "“Have I now come up without the Lord against this place to destroy it? The Lord said to me: Go up against this land and destroy it”",
          "talmudLocation": "Sanhedrin 94b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94b#section-4",
          "talmudFullText": "§ R' Yehoshua ben Levi says: What is the meaning of that which is written in the statement of Rab-shakeh, emissary of Sennacherib: “Have I now come up without YHWH against this place to destroy it? YHWH said to me: Go up against this land and destroy it” (II Kings 18:25). What is this command to destroy the land? R' Yehoshua ben Levi explains: It is referring to the fact that he heard the prophet who said: “Since the people rejected the waters of Shiloah that flow slowly and rejoice with Rezin and the son of Remaliah.  Now therefore, behold, YHWH brings upon them…the king of Assyria” (Isaiah 8:6–7)."
        },
        {
          "verseLocation": "2 Kings 18:27",
          "verseText": "“to eat their own excrement [ ḥoreihem ] and drink their own urine [ meimei shineihem ]”",
          "talmudLocation": "Megillah 25b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/25b#section-15",
          "talmudFullText": "§ A baraita states in a baraita: All of the verses that are written in the Torah in a coarse manner are read in a refined manner. For example,  the term “shall lie with her [yishgalena]” (Deuteronomy 28:30) is read as though it said yishkavena,  which is a more refined term. The term “with hemorrhoids [bafolim]” (Deuteronomy 28:27) is read bateḥorim.  The term “doves’ dung [ḥiryonim]” (II Kings 6:25) is read divyonim.  The phrase “to eat their own excrement [ḥoreihem] and drink their own urine [meimei shineihem]” (II Kings 18:27) is read with more delicate terms: To eat their own excrement [tzo’atam] and drink their own urine [meimei ragleihem]. "
        },
        {
          "verseLocation": "2 Kings 18:32",
          "verseText": "that he did not speak [ sipper ] in disparagement of Eretz Yisrael, as it is stated: “Until I come and take you to a land like your own”",
          "talmudLocation": "Sanhedrin 94a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94a#section-13",
          "talmudFullText": "R' Yoḥanan says: For what reason was that wicked person privileged to be named “the great and noble Asenappar”?  It was due to the fact that he did not speak [sipper] in disparagement of Eretz Yisrael, as it is stated: “Until I come and take you to a land like your own” (II Kings 18:32), and he did not say that he was taking them to a superior land."
        },
        {
          "verseLocation": "2 Kings 18:35",
          "verseText": "“Who are they among all the gods of the countries",
          "talmudLocation": "Chullin 89a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/89a#section-7",
          "talmudFullText": "But the non-Jew nations of the world are not so. I granted greatness to Nimrod,  yet he said: “Come, let us build a city and a tower, with its top in heaven, and let us make for ourselves a name” (Genesis 11:4). I granted greatness to Pharaoh,  yet he said: “Who is YHWH” (Exodus 5:2). I granted greatness to Sennacherib,  yet he said: “Who are they among all the gods of the countries that have delivered their country out of my hand, that YHWH should deliver Jerusalem out of my hand” (II Kings 18:35). I granted greatness to Nebuchadnezzar,  yet he said: “I will ascend above the heights of the clouds” (Isaiah 14:14). I granted greatness to Ḥiram, king of Tyre,  yet he said: “I sit in the seat of God, in the heart of the seas” (Ezekiel 28:2)."
        },
        {
          "verseLocation": "2 Kings 18:37",
          "verseText": "“Then came Eliakim, son of Hilkiya, who was over the household, and Shebna the scribe, and Joah, son of Asaph, the recorder, to Hezekiah with their clothes rent”",
          "talmudLocation": "Moed Katan 26a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26a#section-11",
          "talmudFullText": "§ The Talmud continues its analysis of the baraita: From where do we derive that one must rend his garments upon hearing God’s name being blessed,  i.e., cursed? As it is written with regard to the blasphemous words said by Rab-shakeh: “Then came Eliakim, son of Hilkiya, who was over the household, and Shebna the scribe, and Joah, son of Asaph, the recorder, to Hezekiah with their clothes rent” (II Kings 18:37)."
        },
        {
          "verseLocation": "2 Kings 18:37",
          "verseText": "and Shebna the scribe, and Joah, son of Asaph, the recorder, to Hezekiah with torn garments, and they told him Rabshakeh’s statement”",
          "talmudLocation": "Sanhedrin 60a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/60a#section-13",
          "talmudFullText": "The Mishnah teaches that upon hearing the curse the judges each make a tear in their garments. The Talmud asks: From where do we derive this? The Talmud answers that it is derived from that which is written: “Then came Eliakim, son of Hilkiah,  who was over the household, and Shebna the scribe, and Joah, son of Asaph, the recorder, to Hezekiah with torn garments, and they told him Rabshakeh’s statement” (II Kings 18:37). Apparently, since they heard the blasphemous statement of Rabshakeh they were obligated to make a tear in their garments."
        }
      ]
    },
    {
      "chapterNumber": 19,
      "citations": [
        {
          "verseLocation": "2 Kings 19:1",
          "verseText": "This will not enter your mind, as it is written: “And it came to pass, when King Hezekiah heard it, that he rent his clothes”",
          "talmudLocation": "Moed Katan 26a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26a#section-13",
          "talmudFullText": "The Talmud asks: What difference does it make that they rent their garments when they heard the curse the first time? Didn’t they hear it again now?  The Talmud rejects this argument: This will not enter your mind, as it is written: “And it came to pass, when King Hezekiah heard it, that he rent his clothes” (II Kings 19:1). This indicates that the king rent his garments, but those who reported the blasphemy to him did not rend theirs, as they had already rent their garments the first time."
        },
        {
          "verseLocation": "2 Kings 19:1",
          "verseText": "as it is written: “And it came to pass, when King Hezekiah heard the statement of Rabshakeh, that he tore his clothes”",
          "talmudLocation": "Sanhedrin 60a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/60a#section-17",
          "talmudFullText": "The Talmud asks: And if they made a tear when they heard the curse, what of it? Aren’t they also hearing the curse now?  The Talmud answers: It should not enter your mind that they are obligated to make a tear a second time, as it is written: “And it came to pass, when King Hezekiah heard the statement of Rabshakeh, that he tore his clothes” (II Kings 19:1). It can be inferred that King Hezekiah tore his clothes, but those who reported the blasphemy did not tear their clothes a second time."
        },
        {
          "verseLocation": "2 Kings 19:23",
          "verseText": "as it is written: “By your messengers you have taunted the Lord”",
          "talmudLocation": "Sanhedrin 94b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94b#section-2",
          "talmudFullText": "Pharaoh blasphemed God, as it is written that he said to Moses and Aaron: “Who is YHWH that I should obey His voice? ” (Exodus 5:2) God Himself exacted retribution from him, as it is written: “And YHWH overthrew Egypt in the midst of the sea” (Exodus 14:27), and it is written: “You have trodden through the sea with Your horses” (Habakkuk 3:15). Sennacherib blasphemed God by means of an agent, as it is written: “By your messengers you have taunted YHWH” (II Kings 19:23). God exacted retribution from him by means of an agent, as it is written: “Then the angel of YHWH went forth and smote in the camp of the Assyrians one hundred and eighty-five thousand” (II Kings 19:35)."
        },
        {
          "verseLocation": "2 Kings 19:23",
          "verseText": "into its farthest lodge”",
          "talmudLocation": "Sanhedrin 94b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94b#section-3",
          "talmudFullText": "R' Ḥanina bar Pappa raises a contradiction. It is written that Sennacherib said: “And I will enter into its farthest height” (Isaiah 37:24), and it is written in a parallel verse that he said: “And I have entered into its farthest lodge” (II Kings 19:23). The Talmud resolves the contradiction. That wicked person said: Initially, I will destroy the earthly dwelling place below,  i.e., the Temple, its farthest lodge, and thereafter, I will destroy the heavenly dwelling place above,  its farthest height."
        },
        {
          "verseLocation": "2 Kings 19:34",
          "verseText": "as it is stated: “And I will protect this city to save it, for My sake and for the sake of David, My servant”",
          "talmudLocation": "Berakhot 10b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10b#section-13",
          "talmudFullText": "Hezekiah,  however, based his request upon his own merit, as it is written: “Please, remember that I walked before You” (Isaiah 38:3). When God answered his prayers, it was based upon the merit of others with no mention made of Hezekiah’s own merit, as it is stated: “And I will protect this city to save it, for My sake and for the sake of David, My servant” (II Kings 19:34). And that is what R' Yehoshua ben Levi said. As R' Yehoshua ben Levi said: What is the meaning of that which is written: “Behold, for my peace I had great bitterness;  but You have, in love to my soul, delivered it from the pit of corruption; for You have thrown all my sins behind Your back” (Isaiah 38:17)? This verse teaches that even when God sent him peace and told him that he would recover from his illness, it was bitter for him,  because God did not take his merit into consideration."
        },
        {
          "verseLocation": "2 Kings 19:34",
          "verseText": "Jerusalem, as it is stated: “For I will defend this city”",
          "talmudLocation": "Ketubot 111b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/111b#section-9",
          "talmudFullText": "§ R' Ḥiyya bar Yosef said: In the future,  at the time of the resurrection of the dead, the righteous will burst forth and arise in Jerusalem, as it is stated: “And may they blossom out of the city like the grass of the earth” (Psalms 72:16), and the term “city” means nothing other than Jerusalem, as it is stated: “For I will defend this city” (II Kings 19:34)."
        },
        {
          "verseLocation": "2 Kings 19:35",
          "verseText": "The Holy One, Blessed be He, exacted retribution from him by means of an agent, as it is written: “Then the angel of the Lord went forth and smote in the camp of the Assyrians one hundred and eighty-five thousand”",
          "talmudLocation": "Sanhedrin 94b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94b#section-2",
          "talmudFullText": "Pharaoh blasphemed God, as it is written that he said to Moses and Aaron: “Who is YHWH that I should obey His voice? ” (Exodus 5:2) God Himself exacted retribution from him, as it is written: “And YHWH overthrew Egypt in the midst of the sea” (Exodus 14:27), and it is written: “You have trodden through the sea with Your horses” (Habakkuk 3:15). Sennacherib blasphemed God by means of an agent, as it is written: “By your messengers you have taunted YHWH” (II Kings 19:23). God exacted retribution from him by means of an agent, as it is written: “Then the angel of YHWH went forth and smote in the camp of the Assyrians one hundred and eighty-five thousand” (II Kings 19:35)."
        },
        {
          "verseLocation": "2 Kings 19:35",
          "verseText": "immediately: “And it came to pass that night, that the angel of the Lord went forth and smote in the camp of the Assyrians one hundred and eighty-five thousand; and when men arose in the morning, behold, they were all dead corpses”",
          "talmudLocation": "Sanhedrin 95a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/95a#section-5",
          "talmudFullText": "His officers said to him: Let us attack now and begin the conquest of Jerusalem. Sennacherib said to them: You are weary. Tomorrow, each and every one of you will bring me a piece of a stone from the wall equivalent in size to the seal [gulmo harag] of a letter, and this will suffice to breach the wall and vanquish the city. The verse recounts that immediately: “And it came to pass that night, that the angel of YHWH went forth and smote in the camp of the Assyrians one hundred and eighty-five thousand; and when men arose in the morning, behold, they were all dead corpses” (II Kings 19:35). Rav Pappa says that this is in accordance with the adage that people say:  When quarrel lies and is delayed overnight, the quarrel is nullified.  Since Jerusalem was not conquered that day, the decree was voided."
        },
        {
          "verseLocation": "2 Kings 19:37",
          "verseText": "“And it came to pass as he was worshipping in the house of Nisroch his god that Adrammelech and Sarezer, his sons, smote him with the sword”",
          "talmudLocation": "Sanhedrin 95b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/95b#section-14",
          "talmudFullText": "R' Yehoshua ben Levi says: Fourteen remained, as it is stated: “Two or three…four or five, ” which total fourteen. R' Yoḥanan says: Five remained: Sennacherib, and his two sons,  and Nebuchadnezzar, and Nebuzaradan,  the captain of the guard. The fact that Nebuzaradan was among them is learned through tradition. Nebuchadnezzar was among them, as it is written that Nebuchadnezzar said when he saw an angel with Hananiah, Mishael, and Azariah: “And the appearance of the 4th is like that of an angel” (Daniel 3:25). And if he had not seen the angel that smote Sennacherib’s army, from where would he have known that the 4th person looked like an angel? Sennacherib and his two sons were among them, as it is written later in their regard: “And it came to pass as he was worshipping in the house of Nisroch his god that Adrammelech and Sarezer, his sons, smote him with the sword” (II Kings 19:37). Evidently, the three of them survived."
        },
        {
          "verseLocation": "2 Kings 19:37",
          "verseText": "which is written: “And it came to pass as he was worshipping in the house of Nisroch his god that Adrammelech and Sarezer, his sons, smote him with the sword,",
          "talmudLocation": "Sanhedrin 96a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/96a#section-3",
          "talmudFullText": "Sennacherib went and found a beam from Noah’s ark,  from which he fashioned a god. He said: This beam is the great god who delivered Noah from the flood. He said: If that man,  referring to himself, goes and succeeds, he will sacrifice his two sons before you. His sons heard his commitment and killed him. This is the meaning of that which is written: “And it came to pass as he was worshipping in the house of Nisroch his god that Adrammelech and Sarezer, his sons, smote him with the sword,  and they fled to Ararat” (II Kings 19:37), where Noah’s ark had come to rest. The Talmud explains that this interpretation is based upon the etymological similarity between neser, the Hebrew term for beam, and Nisroch, the god that Sennacherib fashioned from a beam."
        }
      ]
    },
    {
      "chapterNumber": 20,
      "citations": [
        {
          "verseLocation": "2 Kings 20:1",
          "verseText": "from here: “In those days Hezekiah became deathly ill, and Isaiah ben Amoz the prophet came to him, and said to him: So says the Lord: Instruct your household, for you will die, and you will not live”",
          "talmudLocation": "Bava Batra 147a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/147a#section-8",
          "talmudFullText": "Rav Menashya bar Yirmeya says:  The halakha with regard to the gift of a person on his deathbed is derived from here: “In those days Hezekiah became deathly ill, and Isaiah ben Amoz the prophet came to him, and said to him: So says YHWH: Instruct your household, for you will die, and you will not live” (II Kings 20:1). This indicates that merely by issuing an instruction,  a person on his deathbed can transfer ownership of his property."
        },
        {
          "verseLocation": "2 Kings 20:3",
          "verseText": "“And I have done what is good in Your eyes”",
          "talmudLocation": "Sanhedrin 104a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104a#section-10",
          "talmudFullText": "§ It is taught in a baraita that R' Shimon ben Elazar says: Because of Hezekiah’s boastful statement: “And I have done what is good in Your eyes” (II Kings 20:3), he also asked the prophet inappropriately: “What shall be the sign that YHWH shall heal me” (II Kings 20:8). Because of his question: “What shall be the sign, ” non-Jews ate at his table.  The sign was that the sun reversed its path and appeared lower, rather than higher, on the sundial of Ahaz, leading the king of Babylonia to dispatch messengers to Hezekiah. Because non-Jews ate at his table, it ultimately caused the exile of his descendants.  The Talmud comments: This supports the statement of Ḥizkiyya, as Ḥizkiyya said: Anyone who invites an idol worshipper into his house and serves him causes the exile of his descendants, as it is stated: “And of your sons who shall issue from you, whom you shall beget, shall they take away; and they shall be eunuchs in the palace of the king of Babylonia” (II Kings 20:18)."
        },
        {
          "verseLocation": "2 Kings 20:6",
          "verseText": "“And I will add to your days, fifteen years”",
          "talmudLocation": "Yevamot 49b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/49b#section-7",
          "talmudFullText": "The Talmud expands on the events surrounding Isaiah’s death: Rava said:  Manasseh judged him as a false witness for issuing statements contradicting the Torah and only then killed him.  Manasseh said to Isaiah: Moses your master said in the Torah: “And He said: You cannot see My face, for man cannot see Me and live” (Exodus 33:20), and yet you said: “I saw YHWH sitting upon a high and lofty throne” (Isaiah 6:1). Moses your master said:  “For which great nation is there, that has God so near to it, as YHWH our God is, whenever we call upon Him? ” (Deuteronomy 4:7), and yet you said: “Seek YHWH while He may be found, call upon Him while He is near” (Isaiah 55:6), which implies that God is not always near. Moses your master said: “I will fulfill the number of your days” (Exodus 23:26), which implies that each individual has a preordained allotted lifespan that he cannot outlive, and yet you said in a prophecy to King Hezekiah: “And I will add to your days, fifteen years” (II Kings 20:6)."
        },
        {
          "verseLocation": "2 Kings 20:8",
          "verseText": "“What shall be the sign",
          "talmudLocation": "Sanhedrin 104a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104a#section-10",
          "talmudFullText": "§ It is taught in a baraita that R' Shimon ben Elazar says: Because of Hezekiah’s boastful statement: “And I have done what is good in Your eyes” (II Kings 20:3), he also asked the prophet inappropriately: “What shall be the sign that YHWH shall heal me” (II Kings 20:8). Because of his question: “What shall be the sign, ” non-Jews ate at his table.  The sign was that the sun reversed its path and appeared lower, rather than higher, on the sundial of Ahaz, leading the king of Babylonia to dispatch messengers to Hezekiah. Because non-Jews ate at his table, it ultimately caused the exile of his descendants.  The Talmud comments: This supports the statement of Ḥizkiyya, as Ḥizkiyya said: Anyone who invites an idol worshipper into his house and serves him causes the exile of his descendants, as it is stated: “And of your sons who shall issue from you, whom you shall beget, shall they take away; and they shall be eunuchs in the palace of the king of Babylonia” (II Kings 20:18)."
        },
        {
          "verseLocation": "2 Kings 20:12",
          "verseText": "“At that time Berodach-baladan, son of Baladan, king of Babylon, sent",
          "talmudLocation": "Yevamot 62a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/62a#section-13",
          "talmudFullText": "R' Yoḥanan raises an objection to Reish Lakish based upon the verse: “At that time Berodach-baladan, son of Baladan, king of Babylon, sent a letter” (II Kings 20:12), which indicates that non-Jews are considered to be the children of their parents. Therefore, when they convert, they should already have fulfilled the mitzva to be fruitful and multiply. Reish Lakish said to R' Yoḥanan: When they are non-Jews they do have family lineage,  but when they convert they do not have lineage,  as they now belong to the family of the Jewish people and their previous lineage is disregarded."
        },
        {
          "verseLocation": "2 Kings 20:18",
          "verseText": "exile of his descendants, as it is stated: “And of your sons who shall issue from you, whom you shall beget, shall they take away; and they shall be eunuchs in the palace of the king of Babylonia”",
          "talmudLocation": "Sanhedrin 104a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104a#section-10",
          "talmudFullText": "§ It is taught in a baraita that R' Shimon ben Elazar says: Because of Hezekiah’s boastful statement: “And I have done what is good in Your eyes” (II Kings 20:3), he also asked the prophet inappropriately: “What shall be the sign that YHWH shall heal me” (II Kings 20:8). Because of his question: “What shall be the sign, ” non-Jews ate at his table.  The sign was that the sun reversed its path and appeared lower, rather than higher, on the sundial of Ahaz, leading the king of Babylonia to dispatch messengers to Hezekiah. Because non-Jews ate at his table, it ultimately caused the exile of his descendants.  The Talmud comments: This supports the statement of Ḥizkiyya, as Ḥizkiyya said: Anyone who invites an idol worshipper into his house and serves him causes the exile of his descendants, as it is stated: “And of your sons who shall issue from you, whom you shall beget, shall they take away; and they shall be eunuchs in the palace of the king of Babylonia” (II Kings 20:18)."
        }
      ]
    },
    {
      "chapterNumber": 21,
      "citations": [
        {
          "verseLocation": "2 Kings 21:7",
          "verseText": "as it is stated: “And he set the graven image of the ashera that he had crafted, in that house of which the Lord said to David, and to Solomon his son: In this house, and in Jerusalem, which I have chosen from all the tribes of Israel, will I put My name forever”",
          "talmudLocation": "Sanhedrin 103b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-8",
          "talmudFullText": "Ahaz placed that idol in the upper chamber in the Temple, as it is stated: “And the altars that were on the roof of the upper chamber of Ahaz” (II Kings 23:12). Manasseh placed it in the Sanctuary itself, as it is stated: “And he set the graven image of the ashera that he had crafted, in that house of which YHWH said to David, and to Solomon his son: In this house, and in Jerusalem, which I have chosen from all the tribes of Israel, will I put My name forever” (II Kings 21:7). Amon introduced it into the Holy of Holies, as it is stated: “For the bed is too short for spreading, and the covering too narrow for when he gathers himself” (Isaiah 28:20)."
        },
        {
          "verseLocation": "2 Kings 21:16",
          "verseText": "“And Manasseh shed a great deal of innocent blood, until he filled Jerusalem from one end to another [ peh lafeh ], beside his sin that he made Judea sin, to do evil in the eyes of the Lord”",
          "talmudLocation": "Sanhedrin 103b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-6",
          "talmudFullText": "It is stated: “And Manasseh shed a great deal of innocent blood, until he filled Jerusalem from one end to another [peh lafeh], beside his sin that he made Judea sin, to do evil in the eyes of YHWH” (II Kings 21:16). Here,  in Babylonia, they interpret the verse to mean that he killed the prophet Isaiah (see Yevamot 49b). In the West,  Eretz Yisrael, they say that Manasseh crafted an idol so large that it was a burden requiring one thousand people to carry it, and each and every day he would require them to carry it, which would kill all of them.  The Talmud asks: In accordance with whose opinion is that which Rabba bar bar Ḥana says: The soul of one righteous person is equal in value to the entire world?  It is in accordance with the opinion of the one who says: He killed Isaiah. "
        },
        {
          "verseLocation": "2 Kings 21:16",
          "verseText": "bloodshed, as it is stated: “Moreover Manasseh shed very [ meod ] much blood”",
          "talmudLocation": "Sanhedrin 109a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/109a#section-10",
          "talmudFullText": "It was taught in a baraita: “Wicked” is referring to sins they committed with their money; “and sinners” is referring to sins they committed with their bodies. “Wicked” is referring to sins they committed with their money, as it is written: “And your eye is wicked against your poor brother and you give him nothing” (Deuteronomy 15:9). “And sinners” is referring to sins they committed with their bodies, as it is written with regard to Joseph and the wife of Potiphar: “And sin against God” (Genesis 39:9). “Before YHWH”; this is referring to blessing,  a euphemism for cursing, God. “Exceedingly [meod ]” is referring to bloodshed, as it is stated: “Moreover Manasseh shed very [meod ] much blood” (II Kings 21:16)."
        },
        {
          "verseLocation": "2 Kings 21:16",
          "verseText": "And similarly, it says: “Furthermore, Manasseh spilled innocent blood very much, till he had filled Jerusalem from one end to another”",
          "talmudLocation": "Yoma 23a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/23a#section-13",
          "talmudFullText": "The father of the boy,  i.e., the young priest who was stabbed, came and found that he was still convulsing. He said: May my son’s death be an atonement for you.  But my son is still convulsing and has not yet died, and as such, the knife,  which is in his body, has not become ritually impure through contact with a corpse. If you remove it promptly, it will still be pure for future use. The Tosefta comments: This incident comes to teach you that the ritual purity of utensils was of more concern to them than the shedding of blood.  Even the boy’s father voiced more concern over the purity of the knife than over the death of his child. And similarly, it says: “Furthermore, Manasseh spilled innocent blood very much, till he had filled Jerusalem from one end to another” (II Kings 21:16), which shows that in his day as well people paid little attention to bloodshed."
        },
        {
          "verseLocation": "2 Kings 21:16",
          "verseText": "bloodshed it is written: “Moreover, Manasseh shed innocent blood very much, until he had filled Jerusalem from one end to another”",
          "talmudLocation": "Yoma 9b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/9b#section-7",
          "talmudFullText": "With regard to bloodshed it is written: “Moreover, Manasseh shed innocent blood very much, until he had filled Jerusalem from one end to another” (II Kings 21:16)."
        }
      ]
    },
    {
      "chapterNumber": 22,
      "citations": [
        {
          "verseLocation": "2 Kings 22:2",
          "verseText": "Rabbi Yonatan said: Anyone who says that Josiah sinned is nothing other than mistaken, as it is stated: “And he did that which was right in the sight of the Lord, and walked in all the way of David his father,",
          "talmudLocation": "Shabbat 56b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56b#section-16",
          "talmudFullText": "R' Shmuel bar Naḥmani said that R' Yonatan said: Anyone who says that Josiah sinned is nothing other than mistaken, as it is stated: “And he did that which was right in the sight of YHWH, and walked in all the way of David his father,  and turned not aside to the right hand nor to the left” (II Kings 22:2). However, how then do I establish the meaning of the verse: “And like him was there no king before him that returned to YHWH with all his heart, and with all his soul, and with all his might, according to all the Torah of Moses; neither after him arose there any like him” (II Kings 23:25)? The verse states: Josiah returned to YHWH. Apparently, in his early days he was a sinner, and later he returned to God."
        },
        {
          "verseLocation": "2 Kings 22:10",
          "verseText": "Josiah read them? Didn’t Shaphan read them, as it is written: “And Shaphan read it before the king”",
          "talmudLocation": "Sukkah 38b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/38b#section-6",
          "talmudFullText": "It was also stated that R' Shimon ben Pazi said that R' Yehoshua ben Levi said in the name of Bar Kappara: From where is it derived that the halakhic status of one who hears a passage recited is equivalent to that of one who recites it? It is as it is written: “All the words of the book which the king of Judea has read” (II Kings 22:16). And did King Josiah read them? Didn’t Shaphan read them, as it is written: “And Shaphan read it before the king” (II Kings 22:10)? Rather, from here it is derived that the halakhic status of one who hears a passage recited is equivalent to that of one who recites it, and it is as though Josiah read the words himself."
        },
        {
          "verseLocation": "2 Kings 22:14",
          "verseText": "the son of Harhas [ ḥarḥas ]”",
          "talmudLocation": "Megillah 14b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-11",
          "talmudFullText": "Furthermore, Rav Naḥman said: Huldah was a descendant of Joshua.  An allusion to this is written here:  “Huldah the prophetess, the wife of Shallum, the son of Tikvah, the son of Harhas [ḥarḥas]” (II Kings 22:14), and it says elsewhere with regard to Joshua: “And they buried him in the border of his inheritance in Timnath-heres [ḥeres]” (Judges 2:9), therefore intimating that there is a certain connection between them."
        },
        {
          "verseLocation": "2 Kings 22:14",
          "verseText": "as it is written: “So Hilkiah the priest and Ahikam and Achbor",
          "talmudLocation": "Megillah 14b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-5",
          "talmudFullText": "Huldah was a prophetess, as it is written: “So Hilkiah the priest and Ahikam and Achbor and Shaphan and Asaiah went to Huldah the prophetess” (II Kings 22:14) as emissaries of King Josiah. The Talmud asks: But if Jeremiah was found there, how could she prophesy?  Out of respect for Jeremiah, who was her superior, it would have been fitting that she not prophesy in his presence. The rabbis of the school of Rav say in the name of Rav: Huldah was a close relative of Jeremiah, and he did not object to her prophesying in his presence."
        },
        {
          "verseLocation": "2 Kings 22:15",
          "verseText": "the marten, it is written: “Say to the man",
          "talmudLocation": "Megillah 14b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-10",
          "talmudFullText": "An additional point is mentioned with regard to the prophetesses. Rav Naḥman said: Haughtiness is not befitting a woman.  And a proof to this is that there were two haughty women, whose names were identical to the names of loathsome creatures. One,  Deborah, was called a hornet,  as her Hebrew name, Devorah, means hornet; and one,  Huldah, was called a marten,  as her name is the Hebrew term for that creature. From where is it known that they were haughty? With regard to Deborah, the hornet, it is written: “And she sent and called Barak” (Judges 4:6), but she herself did not go to him.  And with regard to Huldah, the marten, it is written: “Say to the man that sent you to me” (II Kings 22:15), but she did not say: Say to the king. "
        },
        {
          "verseLocation": "2 Kings 22:16",
          "verseText": "has read”",
          "talmudLocation": "Sukkah 38b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/38b#section-6",
          "talmudFullText": "It was also stated that R' Shimon ben Pazi said that R' Yehoshua ben Levi said in the name of Bar Kappara: From where is it derived that the halakhic status of one who hears a passage recited is equivalent to that of one who recites it? It is as it is written: “All the words of the book which the king of Judea has read” (II Kings 22:16). And did King Josiah read them? Didn’t Shaphan read them, as it is written: “And Shaphan read it before the king” (II Kings 22:10)? Rather, from here it is derived that the halakhic status of one who hears a passage recited is equivalent to that of one who recites it, and it is as though Josiah read the words himself."
        },
        {
          "verseLocation": "2 Kings 22:19",
          "verseText": "as it is written: “Because your heart was tender and you humbled yourself before the Lord when you heard",
          "talmudLocation": "Sukkah 38b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/38b#section-7",
          "talmudFullText": "The Talmud asks: And perhaps after Shaphan read them Josiah read them again? Rav Aḥa bar Ya’akov said:  It should not enter your mind to say so, as it is written: “Because your heart was tender and you humbled yourself before YHWH when you heard what I spoke in this place” (II Kings 22:19). The Talmud infers: “When you heard” is written in the verse, and not: When you read.  In other words, immediately upon hearing Shaphan read the text, King Josiah sent for Huldah the prophetess, which shows that he humbled his heart. Clearly, the halakhic status of one who hears a passage recited is equivalent to that of one who recites it."
        },
        {
          "verseLocation": "2 Kings 22:20",
          "verseText": "said to Rabba bar Mari: It is written with regard to Josiah: “Behold, therefore I will gather you unto your fathers, and you shall be gathered into your grave in peace”",
          "talmudLocation": "Moed Katan 28b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/28b#section-21",
          "talmudFullText": "And Rava further said to Rabba bar Mari: It is written with regard to Josiah: “Behold, therefore I will gather you unto your fathers, and you shall be gathered into your grave in peace” (II Kings 22:20), and elsewhere it is written: “And the archers shot at King Josiah;  and the king said to his servants, Get me away; for I am grievously wounded” (II Chronicles 35:23). And with regard to this verse R' Yehuda said that Rav said:  With their many arrows, they made his body like a sieve. "
        },
        {
          "verseLocation": "2 Kings 22:20",
          "verseText": "that the Temple was not destroyed in his lifetime,",
          "talmudLocation": "Moed Katan 28b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/28b#section-22",
          "talmudFullText": "Rabba bar Mari said to him: R' Yoḥanan said as follows:  The words “in peace” stated with regard to King Josiah refer to the fact that the Temple was not destroyed in his lifetime,  as the verse itself continues: “And your eyes shall not see all the evil that I will bring upon this place” (II Kings 22:20)."
        }
      ]
    },
    {
      "chapterNumber": 23,
      "citations": [
        {
          "verseLocation": "2 Kings 23:6",
          "verseText": "and cast the dust of it upon the graves of the common people”",
          "talmudLocation": "Sanhedrin 47b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/47b#section-7",
          "talmudFullText": "§ It was related that people would take dirt from the grave of Rav as a cure for a one-day fever.  A number of people came and told Shmuel about this practice, thinking that perhaps the dirt should be forbidden, as one may not derive benefit from a corpse. Shmuel said to them:  They are acting properly, as the dirt in the grave is natural ground, and natural ground does not become forbidden in any situation, as it is written:  “And he brought out the ashera from the house of YHWH…and beat it into dust, and cast the dust of it upon the graves of the common people” (II Kings 23:6). This verse juxtaposes the graves of the common people to objects of idol worship. "
        },
        {
          "verseLocation": "2 Kings 23:6",
          "verseText": "and cast its powder upon the graves of the common people”",
          "talmudLocation": "Shabbat 83b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/83b#section-4",
          "talmudFullText": "Rav Avya said, and some say it was Rabba bar Ulla who said: Come and hear a resolution to this dilemma from that which was taught in a baraita: Idolatry that is less than an olive-bulk has no impurity at all, as it is stated:  “And he brought out the ashera from the house of YHWH, outside Jerusalem, to the brook of Kidron, and burned it at the brook of Kidron, and stamped it into powder, and cast its powder upon the graves of the common people” (II Kings 23:6). Just as a corpse transmits impurity when it is an olive-bulk, so too, idolatry transmits impurity when it is an olive-bulk. "
        },
        {
          "verseLocation": "2 Kings 23:9",
          "verseText": "As it is stated: “Nevertheless the priests of the private altars did not come up to the altar of the Lord in Jerusalem, but they did eat matza among their brethren”",
          "talmudLocation": "Menachot 109a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/109a#section-14",
          "talmudFullText": "Mishnah:  The priests who served in the temple of Onias may not serve in the Temple in Jerusalem; and needless to say,  if they served for something else,  a euphemism for idolatry, they are disqualified from service in the Temple. As it is stated: “Nevertheless the priests of the private altars did not come up to the altar of YHWH in Jerusalem, but they did eat matza among their brethren” (II Kings 23:9). The halakhic status of these priests is like that of blemished priests in that they receive a share in the distribution of the meat of the offerings and partake of that meat, but they do not sacrifice offerings or perform any of the sacrificial rites."
        },
        {
          "verseLocation": "2 Kings 23:12",
          "verseText": "as it is stated: “And the altars that were on the roof of the upper chamber of Ahaz”",
          "talmudLocation": "Sanhedrin 103b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-8",
          "talmudFullText": "Ahaz placed that idol in the upper chamber in the Temple, as it is stated: “And the altars that were on the roof of the upper chamber of Ahaz” (II Kings 23:12). Manasseh placed it in the Sanctuary itself, as it is stated: “And he set the graven image of the ashera that he had crafted, in that house of which YHWH said to David, and to Solomon his son: In this house, and in Jerusalem, which I have chosen from all the tribes of Israel, will I put My name forever” (II Kings 21:7). Amon introduced it into the Holy of Holies, as it is stated: “For the bed is too short for spreading, and the covering too narrow for when he gathers himself” (Isaiah 28:20)."
        },
        {
          "verseLocation": "2 Kings 23:13",
          "verseText": "“And the altars that were before Jerusalem, which were on the right hand of the Mount of Olives, which Solomon the king of Israel had built for Ashtoret the abomination of the Zidonim,",
          "talmudLocation": "Shabbat 56b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56b#section-9",
          "talmudFullText": "Rather,  this verse should be understood as it was taught in a baraita that R' Yosei says:  The verse states: “And the altars that were before Jerusalem, which were on the right hand of the Mount of Olives, which Solomon the king of Israel had built for Ashtoret the abomination of the Zidonim,  and for Kemosh the abomination of Moab, and for Milkom the abomination of the children of Ammon, did the king defile” (II Kings 23:13). All these were destroyed by Josiah."
        },
        {
          "verseLocation": "2 Kings 23:17",
          "verseText": "as it is written: “Then he said: What monument is that which I see? And the men of the city told him, It is the tomb of the man of God who came from Judah and proclaimed these things that you have done against the altar of Bethel”",
          "talmudLocation": "Megillah 14b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-8",
          "talmudFullText": "And Josiah the son of Amon ruled over the ten tribes, as it is written: “Then he said: What monument is that which I see? And the men of the city told him, It is the tomb of the man of God who came from Judah and proclaimed these things that you have done against the altar of Bethel” (II Kings 23:17). Now what connection did Josiah,  king of Judea, have with the altar at Bethel,  a city in the kingdom of Israel? Rather, this teaches that Josiah ruled over the ten tribes of Israel. Rav Naḥman said:  Proof that the tribes returned may be adduced from the verse here: “Also, O Judah, there is a harvest appointed for you, when I would return the captivity of My people” (Hosea 6:11), which indicates that they returned to their places."
        },
        {
          "verseLocation": "2 Kings 23:25",
          "verseText": "“And like him was there no king before him that returned",
          "talmudLocation": "Shabbat 56b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56b#section-16",
          "talmudFullText": "R' Shmuel bar Naḥmani said that R' Yonatan said: Anyone who says that Josiah sinned is nothing other than mistaken, as it is stated: “And he did that which was right in the sight of YHWH, and walked in all the way of David his father,  and turned not aside to the right hand nor to the left” (II Kings 22:2). However, how then do I establish the meaning of the verse: “And like him was there no king before him that returned to YHWH with all his heart, and with all his soul, and with all his might, according to all the Torah of Moses; neither after him arose there any like him” (II Kings 23:25)? The verse states: Josiah returned to YHWH. Apparently, in his early days he was a sinner, and later he returned to God."
        },
        {
          "verseLocation": "2 Kings 23:30",
          "verseText": "And Jehoahaz,",
          "talmudLocation": "Keritot 5b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/5b#section-4",
          "talmudFullText": "The baraita adds: And High Priests and kings were anointed with it, and even a High Priest, the son of a High Priest, requires anointing with the oil. But one does not anoint a king, the son of a king. And if you say:  If so, for what reason did they anoint King Solomon,  who was the son of King David? It was due to the dispute over the throne instigated by his older brother Adonijah,  who attempted to usurp the monarchy. And similarly Joash,  son of Ahaziah, was anointed king (see II Kings 11:12) due to the threat of Athaliah,  his paternal grandmother, who attempted to seize the monarchy for herself (II Kings 11:1–3). And Jehoahaz,  son of Josiah, was anointed as king (II Kings 23:30) due to the competition from Jehoiakim, his brother, who was two years older than his brother,  i.e., Jehoahaz. Ordinarily the older brother succeeds the father, but Jehoahaz was more worthy of the throne."
        }
      ]
    },
    {
      "chapterNumber": 24,
      "citations": [
        {
          "verseLocation": "2 Kings 24:16",
          "verseText": "as it is written with regard to the exile of Jeconiah: “And the craftsmen [ ḥarash ] and the smiths [ masger ] a thousand”",
          "talmudLocation": "Gittin 88a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/88a#section-21",
          "talmudFullText": "Rather,  it must be interpreted as follows: God performed charity [tzedaka] with the people of Israel by exiling them in the exile of Zedekiah while the exile of Jeconiah still existed in Babylonia, as it is written with regard to the exile of Jeconiah: “And the craftsmen [ḥarash] and the smiths [masger] a thousand” (II Kings 24:16). The great scholars, referred to in this verse as craftsmen and smiths, of the generation were exiled with Jeconiah, and they were therefore able to give guidance to those who were exiled in the time of Zedekiah when they came to Babylonia."
        },
        {
          "verseLocation": "2 Kings 24:16",
          "verseText": "the craftsmen [ heḥarash ] and the smiths [ vehammasger ] one thousand”",
          "talmudLocation": "Sanhedrin 38a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/38a#section-5",
          "talmudFullText": "This is as it is written concerning the exile of Jeconiah:  “And all the men of might, seven thousand, and the craftsmen [heḥarash] and the smiths [vehammasger] one thousand” (II Kings 24:16). The Talmud interprets: The term “ḥarash, ” which can be read as ḥeresh, deaf-mute, is referring to Torah scholars, as when they open their mouths to teach Torah, all the others become as though they were deaf-mutes,  as they would listen quietly to the one teaching Torah. The term “masger, ” which is related to saggur, meaning closed, teaches that when they close,  i.e., finish, teaching the halakha, they do not reopen the discussion, as all has been clarified. And how many were these Torah scholars? One thousand. "
        },
        {
          "verseLocation": "2 Kings 24:17",
          "verseText": "his name, as it is stated: “And the king of Babylon crowned Mattaniah his uncle in his stead, and changed his name to Zedekiah”",
          "talmudLocation": "Horayot 11b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/11b#section-18",
          "talmudFullText": "A baraita states: He is Shallum, he is Zedekiah. And why was he called Shallum?  It is due to the fact that he was perfect [meshullam] is his actions. Some say:  He was called Shallum because the kingdom of the house of David was concluded [sheshalema] during his days. And what was his actual name? Mattaniah was his name, as it is stated: “And the king of Babylon crowned Mattaniah his uncle in his stead, and changed his name to Zedekiah” (II Kings 24:17). Why did Nebuchadnezzar call him Zedekiah? He said to him: God will justify the judgment against you if you rebel against me; and it is written: “And he also rebelled against King Nebuchadnezzar, who had imposed upon him an oath by God” (II Chronicles 36:13)."
        },
        {
          "verseLocation": "2 Kings 24:17",
          "verseText": "his name, as it is stated: “And the king of Babylonia made Mattaniah, his father’s brother, king in his stead, and changed his name to Zedekiah”",
          "talmudLocation": "Keritot 5b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/5b#section-14",
          "talmudFullText": "A baraita states in a baraita: The one who is called Shallum is also called Zedekiah, and why was he called Shallum? Because he was perfect [shalem] in his good deeds. Alternatively,  he was called Shallum because in his days the kingdom of the house of David was completed [shalam],  as he was the last king in the Davidic dynasty. And what was his true name? Mattaniah was his name, as it is stated: “And the king of Babylonia made Mattaniah, his father’s brother, king in his stead, and changed his name to Zedekiah” (II Kings 24:17)."
        },
        {
          "verseLocation": "2 Kings 24:19",
          "verseText": "With regard to Zedekiah it is also written: “And he did evil in the eyes of the Lord”",
          "talmudLocation": "Sanhedrin 103a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103a#section-6",
          "talmudFullText": "Likewise, God sought to restore the entire world to chaos and void,  as it was in the beginning before Creation, on account of the generation of Zedekiah,  as only the wicked remained after the exile of the righteous; but He observed Zedekiah and His mind was set at ease.  The Talmud asks: With regard to Zedekiah it is also written: “And he did evil in the eyes of YHWH” (II Kings 24:19); why was God’s mind set at ease? The Talmud answers: Zedekiah was not wicked; rather, he had it in his power to rebuke the people of his generation and he did not rebuke them. Therefore, their sins are attributed to him."
        }
      ]
    },
    {
      "chapterNumber": 25,
      "citations": [
        {
          "verseLocation": "2 Kings 25:6",
          "verseText": "and brought him up to the king of Babylonia, to Riblah”",
          "talmudLocation": "Sanhedrin 96b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/96b#section-1",
          "talmudFullText": "The Talmud asks: And did Nebuchadnezzar ascend to Jerusalem? But isn’t it written with regard to Zedekiah: “And they took the king, and brought him up to the king of Babylonia, to Riblah” (II Kings 25:6), and R' Abbahu says: This place called Riblah is a reference to Antioch.  Apparently, Nebuchadnezzar was in Antioch, not in Jerusalem. Rav Ḥisda and Rav Yitzḥak bar Avudimi resolved this apparent contradiction. One says: An image of Nebuchadnezzar’s likeness was engraved on Nebuzaradan’s chariot,  and he regarded that image as though Nebuchadnezzar were actually there. And one says:  Nebuzaradan was in extreme fear of Nebuchadnezzar, and it was as though Nebuzaradan was always standing before Nebuchadnezzar. That is an example of the honor of a servant to his master mentioned in the verse."
        },
        {
          "verseLocation": "2 Kings 25:7",
          "verseText": "and put out the eyes of Zedekiah,",
          "talmudLocation": "Sotah 10a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-13",
          "talmudFullText": "Absalom was stricken in his hair, as we will state later. Zedekiah was stricken in his eyes, as it is written:  “And they slew the sons of Zedekiah before his eyes, and put out the eyes of Zedekiah,  and bound him in fetters, and carried him to Babylon” (II Kings 25:7)."
        },
        {
          "verseLocation": "2 Kings 25:9",
          "verseText": "which is written: “And he burnt the house of the Lord, and the king’s house, and all the houses of Jerusalem, and every great house he burnt with fire”",
          "talmudLocation": "Megillah 27a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/27a#section-2",
          "talmudFullText": "§ Bar Kappara interpreted a verse homiletically: What is the meaning of that which is written: “And he burnt the house of YHWH, and the king’s house, and all the houses of Jerusalem, and every great house he burnt with fire” (II Kings 25:9)? He explained: “The house of YHWH”; this is the Holy Temple. “The king’s house”; these are the king’s palaces [palterin]. “And all the houses of Jerusalem”; as understood in its literal sense.  With regard to the final phrase: “And every great house he burnt with fire, ” R' Yoḥanan and R' Yehoshua ben Levi disagree about the meaning of “great house”: One of them said:  It is referring to a place where the Torah is made great,  i.e., the study hall; and the other one said:  It is referring to a place where prayer is made great,  i.e., the synagogue."
        },
        {
          "verseLocation": "2 Kings 25:18",
          "verseText": "correspond to the three guards of the door",
          "talmudLocation": "Megillah 23a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/23a#section-7",
          "talmudFullText": "A question is raised with regard to the number of readers on different days. Corresponding to what were these three, five, and seven,  readers instituted? R' Yitzḥak bar Naḥmani and one other Sage who was with him disagree about this. And who was that other scholar? R' Shimon ben Pazi. And some say that this was a matter of dispute between R' Shimon ben Pazi and one other scholar who was with him. And who was that other scholar? R' Yitzḥak bar Naḥmani, and some say it was R' Shmuel bar Naḥmani. One said:  These numbers correspond to the number of Hebrew words in the three verses of the Priestly Benediction. And one said:  These numbers correspond to the three guards of the door (II Kings 25:18), five of the officers who saw the king’s face (II Kings 25:19), and the seven officers who saw the king’s face (Esther 1:14)."
        },
        {
          "verseLocation": "2 Kings 25:19",
          "verseText": "who saw the king’s face",
          "talmudLocation": "Megillah 23a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/23a#section-7",
          "talmudFullText": "A question is raised with regard to the number of readers on different days. Corresponding to what were these three, five, and seven,  readers instituted? R' Yitzḥak bar Naḥmani and one other Sage who was with him disagree about this. And who was that other scholar? R' Shimon ben Pazi. And some say that this was a matter of dispute between R' Shimon ben Pazi and one other scholar who was with him. And who was that other scholar? R' Yitzḥak bar Naḥmani, and some say it was R' Shmuel bar Naḥmani. One said:  These numbers correspond to the number of Hebrew words in the three verses of the Priestly Benediction. And one said:  These numbers correspond to the three guards of the door (II Kings 25:18), five of the officers who saw the king’s face (II Kings 25:19), and the seven officers who saw the king’s face (Esther 1:14)."
        },
        {
          "verseLocation": "2 Kings 25:30",
          "verseText": "“And as for his food allowance, there was a continual food allowance given him by the king,",
          "talmudLocation": "Sanhedrin 48b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-19",
          "talmudFullText": "The curse of those who “lack bread” was fulfilled among Solomon’s descendants in Jeconiah, as it is written concerning him: “And as for his food allowance, there was a continual food allowance given him by the king,  a daily portion for every day, all the days of his life” (II Kings 25:30). Rav Yehuda says that Rav says: This explains the adage that people say: "
        }
      ]
    }
  ]
}