{
  "bookName": "2 Samuel",
  "totalEntries": 207,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "2 Samuel 1:11",
          "verseText": "“And David took hold of his clothes and rent them”",
          "talmudLocation": "Moed Katan 22b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/22b#section-11",
          "talmudFullText": "The baraita continues: With regard to all other deceased relatives, one rends his garment the length of a handbreadth,  and that suffices. In the case of his father or mother,  he must rend his garment until he reveals his heart. R' Abbahu said: What is the verse that teaches that the rent must be a handbreadth? “And David took hold of his clothes and rent them” (II Samuel 1:11), and taking hold cannot be done for a garment less than a handbreadth. "
        },
        {
          "verseLocation": "2 Samuel 1:18",
          "verseText": "It is written: “And said: To teach the sons of Judah the bow. Behold, it is written in the book of Yashar”",
          "talmudLocation": "Avodah Zarah 25a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/25a#section-11",
          "talmudFullText": "The Talmud cites another exposition with regard to the book of Yashar. It is written: “And said: To teach the sons of Judah the bow. Behold, it is written in the book of Yashar” (II Samuel 1:18). The Talmud again asks: What is the book of Yashar? R' Ḥiyya bar Abba says that R' Yoḥanan says: This is the book of Abraham, Isaac, and Jacob, who were called righteous [yesharim], as it is written with regard to them: “Let me die the death of the righteous [yesharim] and let my end be like his” (Numbers 23:10)."
        },
        {
          "verseLocation": "2 Samuel 1:20",
          "verseText": "and it says: “Lest the daughters of the Philistines rejoice, lest the daughters of the uncircumcised triumph”",
          "talmudLocation": "Nedarim 31b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/31b#section-7",
          "talmudFullText": "Conversely, if he said: Benefiting from those who are circumcised is konam for me, he is prohibited from deriving benefit even from uncircumcised Jews and he is permitted to derive benefit from the circumcised of the nations of the world, as the term uncircumcised is used only to name the nations of the world, as it is stated: “For all the nations are uncircumcised, but all the house of Israel are uncircumcised in the heart” (Jeremiah 9:25), and it says: “And this uncircumcised Philistine shall be” (I Samuel 17:36), and it says: “Lest the daughters of the Philistines rejoice, lest the daughters of the uncircumcised triumph” (II Samuel 1:20). These verses indicate that ordinary non-Jews are referred to as uncircumcised, regardless of whether they are actually circumcised."
        },
        {
          "verseLocation": "2 Samuel 1:24",
          "verseText": "“Daughters of Israel, weep over Saul,",
          "talmudLocation": "Nedarim 66a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/66a#section-14",
          "talmudFullText": "At that time R' Yishmael wept and said: The daughters of Israel are beautiful, but poverty makes them ugly. And when R' Yishmael died, the daughters of Israel raised a lamentation, saying: Daughters of Israel, weep for R' Yishmael. And it likewise states about Saul,  who also concerned himself with the welfare of the daughters of Israel: “Daughters of Israel, weep over Saul,  who clothed you in scarlet with other delights, who put ornaments of gold upon your apparel” (II Samuel 1:24)."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "2 Samuel 2:21",
          "verseText": "said to him: “Turn to your right or to your left”",
          "talmudLocation": "Gittin 68a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/68a#section-3",
          "talmudFullText": "When Rav Sheshet was exiting the house of the Exilarch the servants dug a pit and placed a reed mat [tzifta] on top of it so that the pit would not be noticed. And they said to Rav Sheshet: The Master,  i.e., Rav Sheshet, should come and rest for a short time, and they intended for him to fall and be hurt. Rav Ḥisda,  who was also present, snorted [neḥar] to him from behind in order to signal to him. Rav Sheshet said to a child who was there: Recite your verse for me that you studied today. The child said to him: “Turn to your right or to your left” (II Samuel 2:21). Rav Sheshet, who was blind, said to his servant: What do you see?  His servant said to him:  I see a mat that has been placed on the ground. Rav Sheshet said to him: Turn away from it and we will go around it."
        },
        {
          "verseLocation": "2 Samuel 2:23",
          "verseText": "in the ḥomesh ”",
          "talmudLocation": "Sanhedrin 49a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/49a#section-13",
          "talmudFullText": "The Talmud asks: What is the meaning of “to speak with him quietly [basheli]”? Rav Yehuda says that Rav says:  He took him aside to speak to him by way of deception [shalu].  As for what is stated: “And Abner smote him with the butt end of the spear in the ḥomesh” (II Samuel 2:23), R' Yoḥanan says:  He hit him in the 5th [ḥamishit] rib, the place where the gallbladder and liver hang. "
        },
        {
          "verseLocation": "2 Samuel 2:23",
          "verseText": "in the fifth rib, as it is written: “And Abner smote him with the butt end of the spear in the ḥomesh ”",
          "talmudLocation": "Sanhedrin 49a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/49a#section-3",
          "talmudFullText": "Solomon said to him:  Abner was not able to injure Asahel, because he was running and could not aim with precision. Joab said to Solomon: Now Abner was able to aim and hit him precisely in the 5th rib, as it is written: “And Abner smote him with the butt end of the spear in the ḥomesh” (II Samuel 2:23), and R' Yoḥanan says that this means that he hit him in the 5th rib, the place where the gallbladder and liver hang.  If Abner could aim with precision at the 5th rib, could he not have successfully aimed at one of Asahel’s limbs? "
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "2 Samuel 3:14",
          "verseText": "“Deliver me my wife Michal”",
          "talmudLocation": "Sanhedrin 19b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-10",
          "talmudFullText": "The Talmud asks: And according to R' Yosei,  who explains that David married Michal after the death of Merab, with regard to this verse: “Deliver me my wife Michal” (II Samuel 3:14), what does he derive from it?  The Talmud answers: R' Yosei conforms to his standard line of reasoning, as it is taught in a baraita (Tosefta, Sota 11:8): R' Yosei would derive meaning from mixed verses that seem contradictory."
        },
        {
          "verseLocation": "2 Samuel 3:14",
          "verseText": "“Deliver me my wife Michal, whom I betrothed to me for one hundred foreskins of the Philistines”",
          "talmudLocation": "Sanhedrin 19b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-4",
          "talmudFullText": "The Talmud relates a discussion about David’s marriage to Merab and Michal from a baraita (Tosefta, Sota 11:9): R' Yosei’s students asked him: How did David marry two sisters while they were both alive?  R' Yosei said to them: He married Michal only after the death of Merab,  which is permitted. R' Yehoshua ben Korḥa says a different explanation: His betrothal to Merab was in error and therefore void from the outset, and so Michal was permitted to him. This is as it is stated in the words of King David to Saul’s son Ish-bosheth: “Deliver me my wife Michal, whom I betrothed to me for one hundred foreskins of the Philistines” (II Samuel 3:14)."
        },
        {
          "verseLocation": "2 Samuel 3:15",
          "verseText": "“Paltiel”",
          "talmudLocation": "Sanhedrin 19b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-19",
          "talmudFullText": "The Talmud cites a tradition with regard to Palti, son of Laish: It is written in one place “Palti” (I Samuel 25:44), and it is written in another place “Paltiel” (II Samuel 3:15). R' Yoḥanan says: Palti was his real name, and why was his name called Paltiel?  To teach that God [El ] saved [pelato] him from the sin,  by giving him the insight that he may not touch Michal, understanding that she was still David’s wife and therefore forbidden to him. What did he do? He embedded a sword in the bed between him and her,  and said: Anyone who engages in this matter,  i.e., sex, should be stabbed by this sword. "
        },
        {
          "verseLocation": "2 Samuel 3:16",
          "verseText": "But isn’t it written: “And her husband went with her,",
          "talmudLocation": "Sanhedrin 19b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-20",
          "talmudFullText": "The Talmud challenges this: But isn’t it written: “And her husband went with her,  weeping as he went, and followed her to Bahurim” (II Samuel 3:16), referring to Palti as Michal’s husband? The Talmud responds: This means that he became like a husband for her through his affection and concern for her. The Talmud counters: But isn’t it written in that very verse: “weeping as he went”?  If from the outset he thought that she was David’s wife, why was he crying? The Talmud responds: He was weeping about the mitzva that left him,  as from now on, he would receive no reward for restraining his desire. The end of the verse says that they went “to Bahurim, ” meaning that they both became like young men [baḥurim] in that they did not taste sex at all."
        },
        {
          "verseLocation": "2 Samuel 3:18",
          "verseText": "which is written: “David, My slave”",
          "talmudLocation": "Sanhedrin 105a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105a#section-4",
          "talmudFullText": "And that is what Reish Lakish says: What is the meaning of that which is written: “David, My slave” (II Samuel 3:18), and: “Nebuchadnezzar, my slave” (Jeremiah 43:10)? How can the wicked Nebuchadnezzar be depicted as a slave of God in the same manner that David was depicted? Rather, it is revealed and known before the One Who spoke and the world came into being, that the Jewish people are destined to say that God sold them to the nations and they no longer have ties to Him. Therefore, God preemptively called Nebuchadnezzar His slave.  With regard to the halakha concerning a slave who acquires property, the slave belongs to whom and the property belongs to whom?  They both belong to the master, in this case, God."
        },
        {
          "verseLocation": "2 Samuel 3:26",
          "verseText": "“And Joab went out from David, and sent messengers after Abner, and they brought him back from Bor Sirah”",
          "talmudLocation": "Sanhedrin 49a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/49a#section-11",
          "talmudFullText": "§ The verse states: “And Joab went out from David, and sent messengers after Abner, and they brought him back from Bor Sirah” (II Samuel 3:26). The Talmud asks: What is the meaning of the name Bor Sirah? R' Abba bar Kahana says: A well [bor] and a thorn [vesira] caused Abner to be killed.  Abner became liable to be killed when he failed to take advantage of two opportunities to bring about a reconciliation between King Saul and David. First, when David cut off a corner of Saul’s robe after he entered a cave in order to relieve himself, and second, when David found Saul sleeping and took the jug of water and the spear from next to his head. Rather than tell Saul that David could have killed him and refrained from doing so, Abner suggested to Saul that his robe may have been torn by a thornbush and that his jug of water may have been taken by one of his own men. These two incidents are alluded to by the words bor, well, i.e., jug of water, and sira, thornbush."
        },
        {
          "verseLocation": "2 Samuel 3:27",
          "verseText": "“And Joab took him aside in the gate to speak with him quietly”",
          "talmudLocation": "Sanhedrin 49a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/49a#section-12",
          "talmudFullText": "The verse states: “And Joab took him aside in the gate to speak with him quietly” (II Samuel 3:27). R' Yoḥanan says:  Joab judged Abner according to the halakha of the Sanhedrin,  which would sit in judgment by the gate of the city. How so? Joab said to Abner: What is the reason that you killed Asahel?  Abner said to him: Asahel was pursuing me with the intention to kill me, and therefore he had the status of a pursuer,  whom I had the right to kill in self-defense. Joab said to Abner: Even so, you could have saved yourself by wounding one of his limbs.  Abner replied: I was not able to do so as I was running and could not aim with precision. Joab said to him: Now seeing that you were able to aim and hit him precisely in the 5th rib, could you not have successfully aimed at one of his limbs? "
        },
        {
          "verseLocation": "2 Samuel 3:29",
          "verseText": "nd let there not fail from the house of Joab a zav , or a leper,",
          "talmudLocation": "Arakhin 16a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/16a#section-7",
          "talmudFullText": "For bloodshed, as it is written about Joab, as punishment for murdering Abner: “And let there not fail from the house of Joab a zav, or a metzora,  or that leans on a staff, or that falls by the sword, or that lacks bread” (II Samuel 3:29)."
        },
        {
          "verseLocation": "2 Samuel 3:29",
          "verseText": "“Let the house of Joab never lack such as are afflicted with a discharge, or a leper, or that hold onto a staff, or fall by the sword, or lack bread”",
          "talmudLocation": "Sanhedrin 48b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-14",
          "talmudFullText": "Rav Yehuda says that Rav says: All the curses with which David cursed Joab were ultimately fulfilled in David’s descendants,  due to the curse that Solomon accepted upon himself. David cursed Joab: “Let the house of Joab never lack such as are afflicted with a discharge, or a metzora, or that hold onto a staff, or fall by the sword, or lack bread” (II Samuel 3:29)."
        },
        {
          "verseLocation": "2 Samuel 3:31",
          "verseText": "David, who followed the bier of Abner. As it is stated: “And King David followed the bier”",
          "talmudLocation": "Sanhedrin 20a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/20a#section-6",
          "talmudFullText": "Mishnah:  If a relative of the king dies, he does not emerge from the entrance of his palace [palterin],  as it does not befit one of his stature to accompany the deceased. R' Yehuda says: If he wishes to follow the bier, he follows it, as that is what we found with regard to King David, who followed the bier of Abner. As it is stated: “And King David followed the bier” (II Samuel 3:31). The rabbis said to R' Yehuda: The matter was only to appease the people,  so that they should not suspect David of ordering Abner’s death. And when the people comfort the king with the meal of comfort, all the people recline on the ground, and he reclines on the dargash. "
        },
        {
          "verseLocation": "2 Samuel 3:35",
          "verseText": "which is written: “And all the people came to comfort David”",
          "talmudLocation": "Sanhedrin 20a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/20a#section-9",
          "talmudFullText": "Rava interpreted a verse homiletically: What is the meaning of that which is written: “And all the people came to comfort David” (II Samuel 3:35)? It is written: “To destroy [lehakhrot], ” and we read: “To comfort [lehavrot], ” meaning, in the beginning they wanted to destroy him,  as they suspected him of ordering Abner’s assassination, and ultimately,  when they saw that he was truly mourning, they decided to comfort him. "
        },
        {
          "verseLocation": "2 Samuel 3:37",
          "verseText": "that it was not from the king to slay Abner,",
          "talmudLocation": "Sanhedrin 20a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/20a#section-8",
          "talmudFullText": "The rabbis said to him: The matter was only to appease the people, and they were appeased. As David would go out from among the men and go in among the women, and went out from among the women and went in among the men, as it is stated: “So all the people and all Israel understood that day that it was not from the king to slay Abner,  son of Ner” (II Samuel 3:37)."
        },
        {
          "verseLocation": "2 Samuel 3:39",
          "verseText": "royalty, as it is written: “I am today a tender [ rakh ] and anointed king”",
          "talmudLocation": "Bava Batra 4a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/4a#section-5",
          "talmudFullText": "The Talmud explains: What is the meaning of the word reikha?  It denotes royalty, as it is written: “I am today a tender [rakh] and anointed king” (II Samuel 3:39). And if you wish, say that the meaning of the word is learned from here,  from the term describing Joseph after he was appointed viceroy to the king: “And they cried before him, Avrekh” (Genesis 41:43)."
        },
        {
          "verseLocation": "2 Samuel 3:39",
          "verseText": "as it is written: “And I am this day weak, though anointed king; and these men the sons of Zeruiah are too hard for me”",
          "talmudLocation": "Sanhedrin 105a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105a#section-15",
          "talmudFullText": "Rav Naḥman says: Impudence is effective even toward Heaven.  How so? Initially, it is written that God said to Balaam: “You shall not go with them” (Numbers 22:12), and ultimately after Balaam persisted and asked, it is written: “Rise up and go with them” (Numbers 22:20). Rav Sheshet says: Impudence is monarchy without a crown,  as it is an assertion of leadership and lacks only the official coronation as king, as it is written: “And I am this day weak, though anointed king; and these men the sons of Zeruiah are too hard for me” (II Samuel 3:39). The sons of Zeruiah, due to their impudence, were as formidable as David himself."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "2 Samuel 5:5",
          "verseText": "And it is written: “In Hebron he reigned over Judah seven years and six months",
          "talmudLocation": "Sanhedrin 107b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107b#section-1",
          "talmudFullText": "in Hebron he reigned seven years, and in Jerusalem he reigned thirty-three years” (I Kings 2:11). And it is written: “In Hebron he reigned over Judah seven years and six months and in Jerusalem he reigned for thirty-three years over all Israel and Judah” (II Samuel 5:5). And those six months,  the prophet did not tally them as part of the forty years of King David’s reign. Conclude from it that there were six months that he was not considered king because he was afflicted with tzara'at. "
        },
        {
          "verseLocation": "2 Samuel 5:13",
          "verseText": "But isn’t it written: “And David took more concubines and wives in Jerusalem",
          "talmudLocation": "Sanhedrin 21a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21a#section-17",
          "talmudFullText": "The Talmud challenges the notion that David had only this limited number of wives. But isn’t it written: “And David took more concubines and wives in Jerusalem after he came from Hebron” (II Samuel 5:13). The Talmud responds: All of these were to complete the tally of eighteen and no more. The Talmud asks about this verse: What is the meaning of “wives” and what is the meaning of “concubines” in that verse? Rav Yehuda says that Rav says: Wives receive a marriage contract and betrothal; concubines are taken without a marriage contract and without betrothal. "
        },
        {
          "verseLocation": "2 Samuel 5:21",
          "verseText": "took them away”",
          "talmudLocation": "Avodah Zarah 44a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/44a#section-12",
          "talmudFullText": "The Talmud answers in accordance with the resolution of Rav Huna, as Rav Huna raises a contradiction between the verses, as follows: It is written:  “And they left their gods there; and David gave an order, and they were burned with fire” (I Chronicles 14:12), and it is also written: “And David and his men took them away” (II Samuel 5:21)."
        },
        {
          "verseLocation": "2 Samuel 5:21",
          "verseText": "But isn’t it already stated: “And they left their images there, and David and his men took them away [ vayyissa’em ]”",
          "talmudLocation": "Avodah Zarah 44a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/44a#section-9",
          "talmudFullText": "R' Yosei said to the Rabbis, citing another proof for his opinion: But isn’t it already stated: “And they left their images there, and David and his men took them away [vayyissa’em]” (II Samuel 5:21)? And from where may it be inferred that the meaning of this formulation: “Vayyissa’em David, ” is winnowing,  i.e., scattering in the wind? It is as Rav Yosef translates the verse: “Tizrem veruaḥ tissa’em” (Isaiah 41:16), and we translate it as follows: “You shall fan them, and the wind shall carry them away. ” Apparently, this way of disposing of idolatrous objects is sufficient."
        },
        {
          "verseLocation": "2 Samuel 5:21",
          "verseText": "masi’in is an expression of burning? As it is written: “ Vayisa’em David and his men”",
          "talmudLocation": "Rosh Hashanah 22b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/22b#section-14",
          "talmudFullText": "Talmud:  The Mishnah taught that they would light torches [masi’in]. The Talmud asks: From where may it be inferred that the term masi’in is an expression of burning? As it is written: “Vayisa’em David and his men” (II Samuel 5:21), and we translate the verse as: And David and his men burned them. "
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "2 Samuel 6:2",
          "verseText": "whereupon is called the Name, the name of the Lord of hosts that sits upon the cherubs”",
          "talmudLocation": "Bava Batra 14b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/14b#section-4",
          "talmudFullText": "The Talmud asks: And according to R' Meir, where were the silver columns placed?  The Talmud answers: Outside the Ark. The Talmud further asks: And from where does R' Meir derive that the broken pieces of the first set of tablets were placed in the Ark,  as the verse from which R' Yehuda learns this: “There was nothing in the Ark except” (I Kings 8:9), is needed by R' Meir to teach that the Torah scroll was placed there? The Talmud answers: He derives this point from what Rav Huna expounded, as Rav Huna says: What is the meaning of that which is written:  “The Ark of God, whereupon is called the Name, the name of YHWH of hosts that sits upon the cherubs” (II Samuel 6:2)? The phrase “the name, the name of YHWH” teaches that both the second tablets and the broken pieces of the first set of tablets were placed in the Ark. "
        },
        {
          "verseLocation": "2 Samuel 6:3",
          "verseText": "on the first bier? As it is stated: “And they set the Ark of God upon a new cart”",
          "talmudLocation": "Moed Katan 25a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/25a#section-11",
          "talmudFullText": "They then thought to move him from his bier to a narrower bier so that it would fit through the door. But Rav Ḥisda said to them: I learned from him,  Rav Huna himself, as follows: A scholar’s honor is for him to be taken out on the first bier. As Rav Yehuda said that Rav said: From where is it derived that a scholar’s honor is for him to be taken out on the first bier? As it is stated: “And they set the Ark of God upon a new cart” (II Samuel 6:3). When taking the Ark to Jerusalem, King David had it placed back on the cart upon which it had been returned by the Philistines, and a Torah scholar is considered to be similar to the Ark of the Covenant. When they saw that there was nothing else that they could do, they broke the doorway and took him out through it."
        },
        {
          "verseLocation": "2 Samuel 6:6",
          "verseText": "Nacon”",
          "talmudLocation": "Sotah 35b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35b#section-5",
          "talmudFullText": "It is written that Uzzah died “when they came to the threshing floor of Chidon” (I Chronicles 13:9), and elsewhere it is written that it was “the threshing floor of Nacon” (II Samuel 6:6). R' Yoḥanan says: At first the Ark was similar to a javelin [kidon],  as it caused Uzzah’s death. But ultimately,  after the people asked for forgiveness, it was established [nakhon],  i.e., placed, in the house of Obed Edom, where it was a source of blessing."
        },
        {
          "verseLocation": "2 Samuel 6:7",
          "verseText": "smote him there for his error [ hashal ]”",
          "talmudLocation": "Sotah 35a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35a#section-17",
          "talmudFullText": "§ The verse states: “And the anger of YHWH was kindled against Uzzah; and God smote him there for his error [hashal]” (II Samuel 6:7). R' Yoḥanan and R' Elazar disagreed over the interpretation of this verse. One says:  God smote him for his forgetfulness [shalo],  because he did not remember that the Ark can carry itself. And one says:  God smote him because he lifted the edges [shulayyim] of his garment in front of the Ark and relieved himself in its presence. "
        },
        {
          "verseLocation": "2 Samuel 6:7",
          "verseText": "“And he died there with the Ark of God”",
          "talmudLocation": "Sotah 35a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35a#section-18",
          "talmudFullText": "The verse states: “And he died there with the Ark of God” (II Samuel 6:7). R' Yoḥanan says: Uzzah entered the World-to-Come, as it is stated: “With the Ark of God. ” Just as the Ark exists forever, so too, Uzzah entered the World-to-Come. "
        },
        {
          "verseLocation": "2 Samuel 6:7",
          "verseText": "the anger",
          "talmudLocation": "Sotah 35a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35a#section-20",
          "talmudFullText": "The Talmud questions this statement: If that is so, anywhere that the word vayyiḥar is written,  including when it is referring to God, should it be interpreted this way as well?  The Talmud answers: There, it is written:  “And the anger of YHWH was kindled [vayyiḥar af ]” (II Samuel 6:7), whereas here, the anger [af ] is not written,  but only vayyiḥar. Therefore it is interpreted differently."
        },
        {
          "verseLocation": "2 Samuel 6:8",
          "verseText": "“And David was displeased [ vayyiḥar ] because the Lord had broken forth upon Uzzah”",
          "talmudLocation": "Sotah 35a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35a#section-19",
          "talmudFullText": "The verse states: “And David was displeased [vayyiḥar] because YHWH had broken forth upon Uzzah” (II Samuel 6:8). R' Elazar says:  Vayyiḥar means that his face changed colors and darkened like baked bread [ḥarara] from displeasure."
        },
        {
          "verseLocation": "2 Samuel 6:12",
          "verseText": "“The Lord has blessed the house of Oved-edom…because of the ark of God”",
          "talmudLocation": "Berakhot 63b:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/63b#section-23",
          "talmudFullText": "R' Eliezer ben Yosei HaGelili, began to speak in honor of the hosts, and taught:  It is stated: “YHWH has blessed the house of Oved-edom…because of the ark of God” (II Samuel 6:12). Isn’t this an a fortiori inference: Just as in reward for honoring the ark, which neither ate nor drank, but before which Oved-edom simply swept and sprinkled water to settle the dust, he was treated this way and merited a blessing, all the more so should one who hosts a Torah scholar in his home, providing him with food and drink and availing him of his possessions without concern for his personal gain, be rewarded with such a blessing."
        },
        {
          "verseLocation": "2 Samuel 6:13",
          "verseText": "“And when they who carried the Ark of the Lord had gone six paces, he sacrificed an ox and a fatling”",
          "talmudLocation": "Sotah 35b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35b#section-3",
          "talmudFullText": "With regard to David’s journey with the Ark to Jerusalem, the verse states: “And when they who carried the Ark of YHWH had gone six paces, he sacrificed an ox and a fatling” (II Samuel 6:13). And it is written elsewhere that he sacrificed “seven oxen and seven rams” (I Chronicles 15:26). Rav Pappa bar Shmuel says: For each and every step David took, he sacrificed an ox and a fatling,  and for every six steps that he took, he sacrificed seven oxen and seven rams. "
        },
        {
          "verseLocation": "2 Samuel 6:16",
          "verseText": "that Michal the daughter of Saul looked out the window and saw King David leaping and dancing before the Lord, and she despised",
          "talmudLocation": "Sanhedrin 21a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21a#section-16",
          "talmudFullText": "The Talmud challenges this: Now,  these children of David’s, where does it count them? In Hebron,  as Eglon was listed above with David’s wives in Hebron. But the incident with Michal,  in the context of which the verse says she had no children, was in Jerusalem, as it is written:  “And it was so, as the Ark of YHWH came into the city of David, that Michal the daughter of Saul looked out the window and saw King David leaping and dancing before YHWH, and she despised him in her heart” (II Samuel 6:16). And Rav Yehuda says, and some say it is Rav Yosef who says: Michal received her punishment [lemitarpesah] immediately, and therefore could not have had children afterward. Rather, say a different explanation: Until that incident, she had a child; from that point forward, she did not have a child."
        },
        {
          "verseLocation": "2 Samuel 6:19",
          "verseText": "“And he dealt among all the people, among the whole multitude of Israel, both to men and women, to every one a cake of bread, and an eshpar , and an ashisha ,",
          "talmudLocation": "Pesachim 36b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/36b#section-14",
          "talmudFullText": "The Talmud asks: From where may it be inferred that ashisha is an expression that indicates importance? As it is written with regard to King David’s celebration after he brought the Ark of the Covenant to Jerusalem: “And he dealt among all the people, among the whole multitude of Israel, both to men and women, to every one a cake of bread, and an eshpar, and an ashisha,  and all the people departed, every one to his house” (II Samuel 6:19)."
        },
        {
          "verseLocation": "2 Samuel 6:23",
          "verseText": "And did Michal have children? But isn’t it written: “And Michal the daughter of Saul had no child until the day of her death”",
          "talmudLocation": "Sanhedrin 21a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21a#section-15",
          "talmudFullText": "The Talmud challenges the identification of Eglah with Michal: And did Michal have children? But isn’t it written: “And Michal the daughter of Saul had no child until the day of her death” (II Samuel 6:23)? Rav Ḥisda said: Until the day of her death she had no child, but on the day of her death she had a child."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "2 Samuel 7:1",
          "verseText": "“And it came to pass, when the king dwelt in his house”",
          "talmudLocation": "Megillah 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-7",
          "talmudFullText": "Similarly, the verse states: “And it came to pass, when Samuel was old” (I Samuel 8:1), and then it is written: “And his sons did not walk in his ways” (I Samuel 8:3). Also, it states: “And it came to pass that David was successful in all his ways, and YHWH was with him” (I Samuel 18:14), and only a few verses prior it is written: “And Saul viewed David with suspicion” (I Samuel 18:9). In another instance, the verse states: “And it came to pass, when the king dwelt in his house” (II Samuel 7:1). Here King David mentioned his desire to build a temple for God, but it is written elsewhere that he was told: “Yet you shall not build the house” (II Chronicles 6:9)."
        },
        {
          "verseLocation": "2 Samuel 7:1",
          "verseText": "states concerning David: “And it came to pass, when King David dwelled in his house and the Lord had given him rest round about",
          "talmudLocation": "Sanhedrin 20b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/20b#section-14",
          "talmudFullText": "The baraita continues: And so the verse states concerning David: “And it came to pass, when King David dwelled in his house and YHWH had given him rest round about from all his enemies” (II Samuel 7:1). And it is written immediately afterward: “That the king said to Nathan the prophet: See now, I dwell in a house of cedar but the Ark of God dwells within curtains” (II Samuel 7:2), and King David then began seeking a site to build the Temple."
        },
        {
          "verseLocation": "2 Samuel 7:2",
          "verseText": "“That the king said to Nathan the prophet: See now, I dwell in a house of cedar",
          "talmudLocation": "Sanhedrin 20b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/20b#section-14",
          "talmudFullText": "The baraita continues: And so the verse states concerning David: “And it came to pass, when King David dwelled in his house and YHWH had given him rest round about from all his enemies” (II Samuel 7:1). And it is written immediately afterward: “That the king said to Nathan the prophet: See now, I dwell in a house of cedar but the Ark of God dwells within curtains” (II Samuel 7:2), and King David then began seeking a site to build the Temple."
        },
        {
          "verseLocation": "2 Samuel 7:9",
          "verseText": "“And I will make you a great name, like the names of the great ones",
          "talmudLocation": "Pesachim 117b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/117b#section-10",
          "talmudFullText": "Incidentally, the Talmud cites the promise God issued to David through Nathan the Prophet: “And I will make you a great name, like the names of the great ones in the earth” (II Samuel 7:9). Rav Yosef teaches: This is the meaning of the phrase “like the names of the great ones,” that Jews will say: Shield of David,  just as they say: Shield of Avraham."
        },
        {
          "verseLocation": "2 Samuel 7:10",
          "verseText": "“be disturbed no more; neither shall the children of wickedness afflict them anymore, as in the beginning”",
          "talmudLocation": "Berakhot 7b:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/7b#section-23",
          "talmudFullText": "And R' Yoḥanan said in the name of R' Shimon ben Yoḥai:  Setting a fixed place for prayer is so important that one who sets a fixed place for his prayer, his enemies fall beneath him, as it is said: “And I will appoint a place for My nation, Israel, and I will plant them, that they may dwell in their own place. ” Through setting aside a place for prayer, they will merit to “be disturbed no more; neither shall the children of wickedness afflict them anymore, as in the beginning” (II Samuel 7:10)."
        },
        {
          "verseLocation": "2 Samuel 7:18",
          "verseText": "“Here,” as it is stated: “And King David came and sat before God and said: Who am I, Lord, God, and who is my family that You have brought me to here [ halom ]?”",
          "talmudLocation": "Shabbat 113b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/113b#section-9",
          "talmudFullText": "It also says: “And Boaz said to her at mealtime: Come here [halom] and eat from the bread and dip your bread in vinegar. And she sat beside the harvesters and he gave her roasted grain and she ate, and she was satiated, and she left some over” (Ruth 2:14). R' Elazar interpreted this and said that he hinted to her prophetically: In the future the kingdom of David will come from you, as it is written with regard to it,  i.e., the kingdom of David: “Here, ” as it is stated: “And King David came and sat before God and said: Who am I, Lord, God, and who is my family that You have brought me to here [halom]? ” (II Samuel 7:18). With regard to his saying: “And dip your bread in vinegar” (Ruth 2:14), R' Elazar said: From here we see that vinegar is good to have in hot weather. "
        },
        {
          "verseLocation": "2 Samuel 7:18",
          "verseText": "only for kings from the house of David, as it is stated: “Then King David went in, and sat before the Lord; and he said: Who am I,",
          "talmudLocation": "Sotah 40b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/40b#section-8",
          "talmudFullText": "It is stated in the Mishnah: And the High Priest stands, and receives the Torah scroll, and reads from it. The Talmud asks: From the fact that he stands, it can be understood by inference that until that point he had been sitting. But didn’t the Master say (Tosefta, Sanhedrin 4:4) that sitting in the Temple courtyard is permitted only for kings from the house of David, as it is stated: “Then King David went in, and sat before YHWH; and he said: Who am I,  O Lord God, and what is my house, that You have brought me thus far? ” (II Samuel 7:18)."
        },
        {
          "verseLocation": "2 Samuel 7:18",
          "verseText": "only for kings from the house of David, as it is stated: “Then King David went in, and sat before the Lord; and he said:",
          "talmudLocation": "Sotah 41b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/41b#section-3",
          "talmudFullText": "It is taught in the Mishnah: And the king stands, and receives the Torah scroll, and reads from it while sitting. King Agrippa arose, and received the Torah scroll, and read from it while standing.  The Talmud asks: By inference,  until that point he had been sitting. But didn’t the Master say (Tosefta, Sanhedrin 4:4) that sitting in the Temple courtyard is permitted only for kings from the house of David, as it is stated: “Then King David went in, and sat before YHWH; and he said:  Who am I? ” (II Samuel 7:18). The Talmud answers: As Rav Ḥisda said in a similar context: This took place not in the Israelite courtyard, where the prohibition against sitting applies, but in the women’s courtyard. Here too,  the assembly was in the women’s courtyard. "
        },
        {
          "verseLocation": "2 Samuel 7:18",
          "verseText": "that You have brought me hither”?",
          "talmudLocation": "Zevachim 102a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/102a#section-14",
          "talmudFullText": "The Talmud continues to discuss the roles of Moses: Ulla says: Moses requested that he be given the kingship, but it was not given to him, as it is written: “Do not draw hither” (Exodus 3:5); and the word “hither” refers to nothing other than kingship, as it is stated:  “Then David the king went in and sat before YHWH, and he said: Who am I, O Lord God,  and what is my house, that You have brought me hither”?  (II Samuel 7:18)."
        },
        {
          "verseLocation": "2 Samuel 7:23",
          "verseText": "“And who is like Your people, like Israel, a nation one in the earth, whom God went to redeem unto Himself for a people?”",
          "talmudLocation": "Sanhedrin 38b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/38b#section-15",
          "talmudFullText": "R' Yoḥanan cites several examples where the counterclaim is in the same verse as the claim of the heretics. The verse states: “For what nation is there so great that has God so near to them as YHWH our God is whenever we call upon Him? ” (Deuteronomy 4:7), where the term “near” is written in plural, kerovim, but the term “upon Him” is written in singular. Another verse states: “And who is like Your people, like Israel, a nation one in the earth, whom God went to redeem unto Himself for a people? ” (II Samuel 7:23), where the term “went” is written in plural, halekhu, but the term “Himself” is written in singular. Another verse states: “I beheld till thrones were placed, and one that was ancient of days did sit” (Daniel 7:9); where the term “thrones” is written in plural, kharsavan, but the term “sit” is written in singular."
        },
        {
          "verseLocation": "2 Samuel 7:23",
          "verseText": "A certain heretic said to Rabbi Avina: It is written: “And who is like Your people, Israel, one nation in the earth”",
          "talmudLocation": "Sanhedrin 39a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39a#section-16",
          "talmudFullText": "A certain heretic said to R' Avina: It is written: “And who is like Your people, Israel, one nation in the earth” (II Samuel 7:23). The heretic asked: What is your greatness? You are also mixed together with us, as it is written: “All nations before Him are as nothing;  they are counted by Him less than nothing and vanity” (Isaiah 40:17). R' Avina said to him: One of yours,  the non-Jew prophet Balaam, has already testified for us, as it is written: "
        },
        {
          "verseLocation": "2 Samuel 7:29",
          "verseText": "And from Your blessing may Your servant’s house be blessed forever”",
          "talmudLocation": "Berakhot 50a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/50a#section-4",
          "talmudFullText": "Abaye said to Rav Dimi: Isn’t it written that King David articulated his prayer in that manner: “Be pleased, therefore, to bless Your servant’s house, that it abide before You forever; for You, Lord God, have spoken. And from Your blessing may Your servant’s house be blessed forever” (II Samuel 7:29). David said: From Your blessing. The Talmud answers: In a case of request it is different,  as it is inappropriate to demand the full bounty of God’s blessing. The Talmud questions this: In a case of request, too, is it not written that a request for the full bounty of God’s blessing is granted: “Open your mouth wide, that I will fill it” (Psalms 81:11)? What one receives corresponds to what he requests. The Talmud answered: That verse is written with regard to matters of Torah,  where it is wholly appropriate to make excessive requests."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "2 Samuel 8:2",
          "verseText": "“And he smote Moab and measured them with the line, making them lie down on the ground",
          "talmudLocation": "Sanhedrin 39b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-16",
          "talmudFullText": "The verse states concerning King David: “And he smote Moab and measured them with the line, making them lie down on the ground and he measured two lines to put to death” (II Samuel 8:2). R' Yoḥanan says in the name of R' Shimon ben Yoḥai: This is as people say: From and within the forest comes the ax to it,  as King David was a descendant of Ruth the Moabite. When Rav Dimi came from Eretz Yisrael he stated something similar to this: A thigh rots from within,  i.e., when a piece of meat rots, the rotting begins from the inner part of it. Here too, the punishment is administered by one descended from that very nation."
        },
        {
          "verseLocation": "2 Samuel 8:3",
          "verseText": "“as he went",
          "talmudLocation": "Nedarim 37b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/37b#section-9",
          "talmudFullText": "Words that are read but not written are included in the halakha transmitted to Moses from Sinai. For example, the word “Euphrates” that is in the phrase “as he went to establish his control over the river Euphrates” (II Samuel 8:3) is not written in the text of the Bible. The same is true for the word “man” that is in the verse “now the counsel of Ahithophel, which he counseled in those days, was as if a man inquired of the word of God” (II Samuel 16:23); and for the word “come” that is in the verse “behold, the days come, says YHWH, that the city shall be built to YHWH from the tower of Hananel unto the gate of the corner” (Jeremiah 31:37); and for “her” that is in the phrase “let her not have escape” (Jeremiah 50:29); unto that is in the verse “it has been told me,  all that you have done unto your mother-in-law” (Ruth 2:11); and for “to me” that is found in the passage “and she said unto her: All that you say to me I will do. And she went down to the threshing floor” (Ruth 3:4–5); and for “to me” that is in the verse “he gave me these six measures of barley;  for he said to me” (Ruth 3:17). These words are read but not written. "
        },
        {
          "verseLocation": "2 Samuel 8:15",
          "verseText": "And similarly, with regard to David, it says: “And David executed justice and charity",
          "talmudLocation": "Sanhedrin 6b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/6b#section-7",
          "talmudFullText": "And similarly, with regard to David, it says: “And David executed justice and charity to all his people” (II Samuel 8:15). And is it not that wherever there is strict justice, there is no charity, and wherever there is charity, there is no strict justice? Rather, which is the justice that has within it charity? You must say: This is mediation. "
        },
        {
          "verseLocation": "2 Samuel 8:15",
          "verseText": "house. And similarly, with regard to David, it says: “And David executed justice and charity to all his people”",
          "talmudLocation": "Sanhedrin 6b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/6b#section-9",
          "talmudFullText": "The Talmud continues: It is justice for this one and charity for that one: It is justice for this one, because the judge restored his money to him; and it is charity for that poor person, because the judge paid for him from his own house. And similarly, with regard to David, it says: “And David executed justice and charity to all his people” (II Samuel 8:15). He executed justice for this one, because he restored his money to him, and charity for that one, because he paid for him from his own house. "
        },
        {
          "verseLocation": "2 Samuel 8:18",
          "verseText": "resolve my case first, as it is written: “And the sons of David were priests”",
          "talmudLocation": "Nedarim 62a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/62a#section-12",
          "talmudFullText": "Rava said further: It is permitted for a Torah scholar to say: I am a Torah scholar,  so resolve my case first, as it is written: “And the sons of David were priests” (II Samuel 8:18). The sons of David could not have been actual priests, as David was not a priest. Rather, the verse indicates that just as a priest takes his portion first, so too, a Torah scholar takes his portion first. And a priest, from where do we derive that he takes his portion first? As it is written: “And you shall sanctify him, for he offers the bread of your God” (Leviticus 21:8). And the school of R' Yishmael taught:  The phrase “and you shall sanctify him” applies with regard to every matter of sanctity: "
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "2 Samuel 9:4",
          "verseText": "Where is he? And Ziba said to the king: Behold, he is in the house of Machir, the son of Ammiel, in Lo-Devar [ belo devar ]”",
          "talmudLocation": "Shabbat 56a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-14",
          "talmudFullText": "The Talmud now examines the matter itself with regard to Rav’s statement cited in the course of the previous discussion. Rav said: David accepted a slanderous report, as it is written with regard to David’s search for a surviving son of Jonathan: “And the king said to him,  to Ziba, Saul’s slave: Where is he? And Ziba said to the king: Behold, he is in the house of Machir, the son of Ammiel, in Lo-Devar [belo devar]” (II Samuel 9:4). Ziba indicated to David that Jonathan’s son was inconsequential, lacking any matter [lo devar] of Torah. And it is written: “Then King David sent, and fetched him out of the house of Machir, the son of Ammiel, from Lo-Devar [milo devar]” (II Samuel 9:5). That verse can be read that after sending for him, David found him filled with matters [melo devar] of Torah."
        },
        {
          "verseLocation": "2 Samuel 9:5",
          "verseText": "sent, and fetched him out of the house of Machir, the son of Ammiel, from Lo-Devar [ milo devar ]”",
          "talmudLocation": "Shabbat 56a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-14",
          "talmudFullText": "The Talmud now examines the matter itself with regard to Rav’s statement cited in the course of the previous discussion. Rav said: David accepted a slanderous report, as it is written with regard to David’s search for a surviving son of Jonathan: “And the king said to him,  to Ziba, Saul’s slave: Where is he? And Ziba said to the king: Behold, he is in the house of Machir, the son of Ammiel, in Lo-Devar [belo devar]” (II Samuel 9:4). Ziba indicated to David that Jonathan’s son was inconsequential, lacking any matter [lo devar] of Torah. And it is written: “Then King David sent, and fetched him out of the house of Machir, the son of Ammiel, from Lo-Devar [milo devar]” (II Samuel 9:5). That verse can be read that after sending for him, David found him filled with matters [melo devar] of Torah."
        },
        {
          "verseLocation": "2 Samuel 9:10",
          "verseText": "“And Ziba had fifteen sons and twenty servants”",
          "talmudLocation": "Yevamot 62a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/62a#section-14",
          "talmudFullText": "Rav said: Everyone agrees with regard to a Canaanite slave, that he does not have lineage, as it is written that Abraham said to his slaves: “Remain here with the donkey” (Genesis 22:5). This verse is interpreted to mean that they are a nation comparable to a donkey,  which has no lineage. The Talmud raises an objection based upon a verse pertaining to Jonathan’s Canaanite slave: “And Ziba had fifteen sons and twenty servants” (II Samuel 9:10), which indicates that a slave’s sons are in fact considered his sons. Rav Aḥa bar Ya’akov said:  This is like the expression: A bullock, son of a bull.  The word son in this context merely denotes progeny, not lineage."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "2 Samuel 10:12",
          "verseText": "As it is stated: “Be strong and we will be strong for the sake of our nation",
          "talmudLocation": "Berakhot 32b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/32b#section-14",
          "talmudFullText": "From where is it derived that occupation requires bolstering? As it is stated: “Be strong and we will be strong for the sake of our nation and for the cities of our God” (II Samuel 10:12). All of one’s labor requires bolstering."
        },
        {
          "verseLocation": "2 Samuel 10:18",
          "verseText": "is written: “Shobach”",
          "talmudLocation": "Sotah 42b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-11",
          "talmudFullText": "§ According to the Mishnah, the priest would say: The Ammonites came championed by Shobach (see II Samuel, chapter 10). In one account, his name is written: “Shobach” (II Samuel 10:18), and in another place it is written: “Shophach” (I Chronicles 19:18). Rav and Shmuel engaged in a dispute concerning this matter. One of them said: His name was Shophach, and why is he called by the name Shobach?  It is because he was built like a dovecote [shovakh],  as he was exceptionally tall. And one of them said: His name was Shobach, and why is he called by the name Shophach?  It is because anyone who would see him would become terrified and his courage would be spilled [nishpakh] before him like water from a jug. "
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "2 Samuel 11:2",
          "verseText": "“And it came to pass one evening that David rose from his bed”",
          "talmudLocation": "Sanhedrin 107a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107a#section-3",
          "talmudFullText": "God said to him: I will subject you to an ordeal, and I will perform a matter for you that I did not perform for the Patriarchs, as for them, I did not inform them of the nature of the ordeal, while I am informing you that I will subject you to an ordeal involving a matter of a married woman, with whom sex are forbidden. Immediately,  it is written: “And it came to pass one evening that David rose from his bed” (II Samuel 11:2)."
        },
        {
          "verseLocation": "2 Samuel 11:2",
          "verseText": "“And he walked upon the roof of the king’s house; from the roof he saw a woman bathing, and the woman was very fair to look upon”",
          "talmudLocation": "Sanhedrin 107a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107a#section-5",
          "talmudFullText": "The verse states: “And he walked upon the roof of the king’s house; from the roof he saw a woman bathing, and the woman was very fair to look upon” (II Samuel 11:2). Bathsheba was shampooing her head behind a beehive,  which concealed her from sight. Satan came and appeared to David as a bird.  David shot an arrow at the bird, the arrow severed the beehive,  Bathsheba was exposed, and David saw her. "
        },
        {
          "verseLocation": "2 Samuel 11:3",
          "verseText": "It is written: “Is this not Bathsheba, daughter of Eliam, wife of Uriah the Hittite?”",
          "talmudLocation": "Sanhedrin 69b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/69b#section-7",
          "talmudFullText": "The Talmud asks: And from where do we derive that in earlier generations men fathered children at this age? If we say that we know this from the following calculation: It is written: “Is this not Bathsheba, daughter of Eliam, wife of Uriah the Hittite? ” (II Samuel 11:3). And it is also written: “And Eliam, son of Ahithophel the Gilonite” (II Samuel 23:34), which teaches that Bathsheba was the granddaughter of Ahithophel. And it is written with reference to the birth of Solomon: “And he sent by the hand of Nathan the prophet, and he called his name Jedidiah, for YHWH’s sake” (II Samuel 12:25)."
        },
        {
          "verseLocation": "2 Samuel 11:11",
          "verseText": "“And my lord Joab, and the servants of my lord, are encamped in the open field”",
          "talmudLocation": "Kiddushin 43a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/43a#section-12",
          "talmudFullText": "And the other opinion, i.e., the first tanna, who holds that the one who appoints the killer is exempt, explains the verse as follows: Behold this killing is for you like the sword of Ammon. Just as you are not punished for those killed by the sword of Ammon in the course of the war, so too you are not punished for the death of Uriah the Hittite,  not even according to the laws of Heaven. What is the reason for this? Uriah was a rebel against the monarchy and was consequently liable to the death penalty, as he said to King David: “And my lord Joab, and the servants of my lord, are encamped in the open field” (II Samuel 11:11). By referring to Joab as his lord in front of the king, he indicated that he answered to Joab rather than to the king, which is tantamount to rebellion."
        },
        {
          "verseLocation": "2 Samuel 11:11",
          "verseText": "“And my lord Joab and the servants of my lord are encamped in the open fields”",
          "talmudLocation": "Shabbat 56a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-11",
          "talmudFullText": "What is the reason that David was not liable for the death of Uriah? Because Uriah was a traitor against the throne. As he said to David: “And my lord Joab and the servants of my lord are encamped in the open fields” (II Samuel 11:11). In the presence of the king, one may not refer to another as his lord. Doing so is treason."
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "2 Samuel 12:3",
          "verseText": "but the poor man had nothing except one little lamb, which he had bought and reared”",
          "talmudLocation": "Bava Batra 15a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15a#section-16",
          "talmudFullText": "The Talmud asks: But if that is so,  that the words “there was” prove that Job existed, what shall we say about the parable that Natan the prophet presented to David: “There were two men in one city; the one rich and the other poor. The rich man had very many flocks and herds, but the poor man had nothing except one little lamb, which he had bought and reared” (II Samuel 12:3)? Was there really such a person? Rather, it was merely a parable; here too it is merely a parable.  The Talmud answers: If so,  that it is a parable, why state his name and the name of his city?  Rather, Job was clearly a real person."
        },
        {
          "verseLocation": "2 Samuel 12:3",
          "verseText": "And so it states: “But the poor man had nothing, except one little ewe lamb, which he had bought and reared: And it grew up together with him, and with his children; it did eat of his bread, and drank of his own cup, and lay in his bosom, and was like a daughter [ kevat ] to him”",
          "talmudLocation": "Megillah 13a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-14",
          "talmudFullText": "The verse states: “And when her father and mother were dead, Mordecai took her for his own daughter” (Esther 2:7). A tanna taught a baraita in the name of R' Meir: Do not read the verse literally as for a daughter [bat],  but rather read it as for a home [bayit].  This indicates that Mordecai took Esther to be his wife. And so it states: “But the poor man had nothing, except one little ewe lamb, which he had bought and reared: And it grew up together with him, and with his children; it did eat of his bread, and drank of his own cup, and lay in his bosom, and was like a daughter [kevat] to him” (II Samuel 12:3). The Talmud questions: Because it lay in his bosom, it “was like a daughter to him”? Rather,  the parable in II Samuel referenced the illicit taking of another’s wife, and the phrase should be read: Like a home [bayit] to him, i.e., a wife. So too, here,  Mordecai took her for a home,  i.e., a wife."
        },
        {
          "verseLocation": "2 Samuel 12:4",
          "verseText": "“And there came a traveler to the rich man, and he was reluctant to take of his own flock and of his own herd, to prepare for the guest”",
          "talmudLocation": "Sukkah 52b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52b#section-5",
          "talmudFullText": "Rava said: Initially,  the verse called the evil inclination a traveler coming from afar. Subsequently,  the verse calls it a guest,  as one welcomes it. Ultimately,  the verse calls it man,  indicating significance, as it became the homeowner. As it is stated in the parable of the poor man’s lamb that Nathan the prophet said to David: “And there came a traveler to the rich man, and he was reluctant to take of his own flock and of his own herd, to prepare for the guest” (II Samuel 12:4). And it is written in the same verse: “And he took the poor man’s lamb, and prepared it for the man that was come to him. ” In other words, the evil inclination that began as a traveler gradually rose in prominence."
        },
        {
          "verseLocation": "2 Samuel 12:6",
          "verseText": "“And he shall restore the lamb fourfold”",
          "talmudLocation": "Yoma 22b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-12",
          "talmudFullText": "The Talmud asks: But were these his only two sins? There is also the incident of Bathsheba,  in which he took another man’s wife as his own. The Talmud answers: There,  in that case, punishment was exacted from him separately, so the matter is no longer listed among his sins, as it is written with regard to this incident: “And he shall restore the lamb fourfold” (II Samuel 12:6). The lamb was a metaphor for Bathsheba, and ultimately David was indeed given a fourfold punishment for taking Bathsheba: The first child born to Bathsheba and David died (see II Samuel 12:13–23); David’s son Amnon was killed; Tamar,  his daughter, was raped by Amnon (see II Samuel 13); and his son Avshalom rebelled against him and was ultimately killed (see II Samuel 15–18)."
        },
        {
          "verseLocation": "2 Samuel 12:8",
          "verseText": "Saul, as it is stated: “And I have given you the house of your master and the wives of your master in your bosom”",
          "talmudLocation": "Sanhedrin 18a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/18a#section-10",
          "talmudFullText": "And no one may marry a king’s widow,  due to his honor. R' Yehuda says:  Another king may marry the widow of a king, as we found that King David married the widow of King Saul, as it is stated: “And I have given you the house of your master and the wives of your master in your bosom” (II Samuel 12:8)."
        },
        {
          "verseLocation": "2 Samuel 12:8",
          "verseText": "And no one may marry",
          "talmudLocation": "Sanhedrin 19b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-3",
          "talmudFullText": "The Mishnah teaches: And no one may marry the king’s widow, and R' Yehuda says that a king may marry another king’s widow, as proven by King David, who was promised with regard to King Saul after his death: “And I have given you the house of your master and the wives of your master” (II Samuel 12:8). It is taught in a baraita: The rabbis said to R' Yehuda:  The meaning of the verse is not that David married Saul’s widows, but that he married women appropriate for him from the house of the king. And who are they? Merab and Michal,  the daughters of Saul."
        },
        {
          "verseLocation": "2 Samuel 12:8",
          "verseText": "if that were too little, then I would add to you like these and like those”",
          "talmudLocation": "Sanhedrin 21a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21a#section-10",
          "talmudFullText": "And the prophet Nathan said to King David in his rebuke: “And I gave you your master’s house and your master’s wives into your bosom and I gave you the house of Israel and Judah; and if that were too little, then I would add to you like these and like those” (II Samuel 12:8). “Like these”;  this is referring to the wives enumerated above, meaning another six. “And like those”;  this is referring to another six,  so that all together there are eighteen he would be permitted to marry."
        },
        {
          "verseLocation": "2 Samuel 12:9",
          "verseText": "“Him you have slain with the sword of the children of Ammon”",
          "talmudLocation": "Kiddushin 43a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/43a#section-8",
          "talmudFullText": "The Talmud questions the statement that there is no agency for transgressions: But there is that which is taught in a baraita: One who says to his agent: Go kill a person, he,  the killer, is liable if he kills, and the one who appointed him is exempt. Shammai the Elder says in the name of Haggai the prophet: The one who appointed him is liable, as it stated with regard to David, who directed Joab to kill Uriah: “Him you have slain with the sword of the children of Ammon” (II Samuel 12:9). David was held responsible for the death of Uriah."
        },
        {
          "verseLocation": "2 Samuel 12:9",
          "verseText": "“Why have you despised the word of the Lord, to do that which is evil",
          "talmudLocation": "Shabbat 56a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-5",
          "talmudFullText": "However, how then do I establish the meaning of the rebuke of the prophet Nathan: “Why have you despised the word of YHWH, to do that which is evil in My sight? Uriah the Hittite you have smitten with the sword, and his wife you have taken to be your wife, and him you have slain with the sword of the children of Ammon” (II Samuel 12:9), indicating that David sinned? The Talmud answers: David sought to do evil and have sex with Bathsheba while she was still married to Uriah but did not do so."
        },
        {
          "verseLocation": "2 Samuel 12:11",
          "verseText": "“Behold, I will raise up evil against you from your house”",
          "talmudLocation": "Berakhot 7b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/7b#section-14",
          "talmudFullText": "So too was the case with David. When God told him,  through Natan the prophet, after the incident with Bathsheba, “Behold, I will raise up evil against you from your house” (II Samuel 12:11), David was despondent. He said: Perhaps it will be a slave or a mamzer who will rise up in my house, a person of such lowly status, who will have no pity on me. But once David saw that Absalom was the one through whom the prophecy was to be fulfilled, he rejoiced,  as he was certain that Absalom would show him mercy. That is why David said a psalm,  not a lament, thanking God for punishing him in the least severe manner possible."
        },
        {
          "verseLocation": "2 Samuel 12:11",
          "verseText": "Behold, I will raise up evil against you out of your own house”",
          "talmudLocation": "Sotah 11a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11a#section-1",
          "talmudFullText": "This is as it is written there: “Thus said YHWH: Behold, I will raise up evil against you out of your own house” (II Samuel 12:11), and this prophecy was fulfilled through Absalom. Similarly, you can say about Joseph, who was sent by his father to inquire as to the well-being of his brothers, where the verse states: “And he sent him from the valley [emek] of Hebron” (Genesis 37:14). R' Ḥanina bar Pappa says: From the deep [amukka] counsel of that righteous individual who is interred in Hebron,  i.e., Abraham, as it is written:  “And He said unto Abram: Know that your seed shall be a stranger in a land that is not theirs, and shall serve them; and they shall afflict them four hundred years” (Genesis 15:13). The journey Joseph took to his brothers set in motion the descent of the Jewish people to Egypt."
        },
        {
          "verseLocation": "2 Samuel 12:13",
          "verseText": "“The Lord also [ gam ] has put away your sin; you shall not die”",
          "talmudLocation": "Berakhot 56b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/56b#section-19",
          "talmudFullText": "The Talmud says: One who sees Ishmael in a dream,  it is an omen that his prayer will be heard,  just as Ishmael’s prayer was heard. The Talmud notes: This refers specifically to where one saw Ishmael, son of Abraham,  but not if one saw a random Arab. One who sees a camel [gamal] in a dream,  it is an omen that death was decreed upon him from heaven but he was spared. R' Ḥama ben Ḥanina, said: What verse alludes to this? “I will go down with you into Egypt; and I will also surely bring you up again [gam alo]” (Genesis 46:4),  the acronym for which is gamal. Rav Naḥman bar Yitzḥak said:  The source for this is from here,  another verse: “YHWH also [gam] has put away your sin; you shall not die” (II Samuel 12:13)."
        },
        {
          "verseLocation": "2 Samuel 12:24",
          "verseText": "A mourner is prohibited from engaging in sexual relations, as it is written: “And David comforted Bath-Sheba his wife, and went into her,",
          "talmudLocation": "Moed Katan 15b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/15b#section-10",
          "talmudFullText": "§ The Talmud considers another issue: A mourner is prohibited from having sex, as it is written: “And David comforted Bath-Sheba his wife, and went into her,  and lay with her” (II Samuel 12:24), after their son had died. This proves by inference that initially,  during the period of mourning, sexual sex were forbidden. "
        },
        {
          "verseLocation": "2 Samuel 12:25",
          "verseText": "“And He sent by the hand of Nathan the prophet, and he called his name Yedidya, for the Lord’s sake”",
          "talmudLocation": "Menachot 53a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/53a#section-20",
          "talmudFullText": "R' Ezra explained this statement: With regard to yadid in the phrase: Let yadid, this is King Solomon, as it is written after Solomon’s birth: “And He sent by the hand of Nathan the prophet, and he called his name Yedidya, for YHWH’s sake” (II Samuel 12:25)."
        },
        {
          "verseLocation": "2 Samuel 12:25",
          "verseText": "Yedidya",
          "talmudLocation": "Pesachim 117a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/117a#section-1",
          "talmudFullText": "The Mishnah states that we will say before Him: Halleluya. The Talmud discusses the meaning of this term. Rav Ḥisda said that R' Yoḥanan said:  The word halleluya and the word kesya (Exodus 17:16) and the name Yedidya (II Samuel 12:25) are each regarded as a single word, not an amalgamation of two smaller words, i.e., Hallelu-ya. Rav said that kesya and merḥavya (Psalms 118:5) are single words. Rabba said: Only merḥavya is a single word; the others are two words."
        },
        {
          "verseLocation": "2 Samuel 12:25",
          "verseText": "“And he sent by the hand of Nathan the prophet, and he called his name Jedidiah, for the Lord’s sake”",
          "talmudLocation": "Sanhedrin 69b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/69b#section-7",
          "talmudFullText": "The Talmud asks: And from where do we derive that in earlier generations men fathered children at this age? If we say that we know this from the following calculation: It is written: “Is this not Bathsheba, daughter of Eliam, wife of Uriah the Hittite? ” (II Samuel 11:3). And it is also written: “And Eliam, son of Ahithophel the Gilonite” (II Samuel 23:34), which teaches that Bathsheba was the granddaughter of Ahithophel. And it is written with reference to the birth of Solomon: “And he sent by the hand of Nathan the prophet, and he called his name Jedidiah, for YHWH’s sake” (II Samuel 12:25)."
        },
        {
          "verseLocation": "2 Samuel 12:30",
          "verseText": "“And he took the crown of Malcam from off his head, and its weight was a talent of gold,",
          "talmudLocation": "Avodah Zarah 44a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/44a#section-14",
          "talmudFullText": "Another difficulty is resolved by Ittai’s arrival; as it is written with regard to the Ammonite idol: “And he took the crown of Malcam from off his head, and its weight was a talent of gold,  and in it were precious stones; and it was set on David’s head” (II Samuel 12:30). But is it permitted for David to wear the crown? Isn’t it an object of idol worship and therefore under the category of items from which deriving benefit is prohibited? Rav Naḥman says: Ittai the Gittite arrived and revoked its status as an object of idol worship."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "2 Samuel 13:3",
          "verseText": "wise man”",
          "talmudLocation": "Sanhedrin 21a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21a#section-20",
          "talmudFullText": "The Talmud continues to interpret the story of Amnon and Tamar. The verse states: “And Amnon had a friend whose name was Jonadab, son of Shimeah, David’s brother,  and Jonadab was a very wise man” (II Samuel 13:3). Rav Yehuda says that Rav says: A wise man for wickedness. "
        },
        {
          "verseLocation": "2 Samuel 13:4",
          "verseText": "Why, son of the king, are you so sick [ dal ] from morning to morning?”",
          "talmudLocation": "Nedarim 40a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/40a#section-4",
          "talmudFullText": "Rav said: Anyone who visits the ill is spared from the judgment of Gehenna, as it is stated: “Happy is he that considers the poor; YHWH will deliver him in the day of evil” (Psalms 41:2). In this verse, the term poor [dal] means nothing other than ill, as it is stated in the prayer of Hezekiah when he was ill: “He will cut me off from the illness [middalla]” (Isaiah 38:12). Alternatively,  it may be derived from this verse in which Jonadab asked his sick friend Amnon, son of King David: “Why, son of the king, are you so sick [dal] from morning to morning? ” (II Samuel 13:4). And the term evil means nothing other than Gehenna, as it is stated: “YHWH made everything for His own purpose, and even the wicked for the day of evil” (Proverbs 16:4), and the ultimate punishment of the evildoer is Gehenna."
        },
        {
          "verseLocation": "2 Samuel 13:13",
          "verseText": "as it is stated: “Now, therefore, speak, please, to the king, for he will not withhold me from you”",
          "talmudLocation": "Sanhedrin 21a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21a#section-19",
          "talmudFullText": "And Rav Yehuda says that Rav says:  David’s daughter Tamar was the daughter of a beautiful woman taken captive in war and was born before her mother converted. Therefore, Tamar was not considered the daughter of David according to halakha. The proof of this is in what she said to Amnon, son of David, as it is stated: “Now, therefore, speak, please, to the king, for he will not withhold me from you” (II Samuel 13:13). And if it enters your mind to say that she was the daughter of a woman David married, would David have permitted Amnon’s sister to him as a wife? Rather, learn from this verse that she was the daughter of a beautiful woman who converted after Tamar was born, so halakhically Tamar was not a daughter of David."
        },
        {
          "verseLocation": "2 Samuel 13:15",
          "verseText": "“Then Amnon hated her with exceeding, great hatred,",
          "talmudLocation": "Sanhedrin 21a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21a#section-22",
          "talmudFullText": "At the end of the story, the verse states: “Then Amnon hated her with exceeding, great hatred,  for greater was the hatred with which he hated her than the love with which he had loved her” (II Samuel 13:15). The Talmud asks: What is the reason for Amnon’s intense hatred? R' Yitzḥak says:  While he raped her, a hair [nima] of hers became tied around his penis and caused him to be one whose penis has been severed. The Talmud asks: But if the hair became tied around his penis, what did she do?  Why would Amnon hold this against her? Rather, say that she intentionally tied a hair around his penis during sex, and she made him one whose penis has been severed in order to take revenge on him, and for this he hated her."
        },
        {
          "verseLocation": "2 Samuel 13:19",
          "verseText": "“And Tamar put ashes on her head and rent her garment of many colors that was on her”",
          "talmudLocation": "Sanhedrin 21a:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21a#section-24",
          "talmudFullText": "The verse relates that after Amnon raped her: “And Tamar put ashes on her head and rent her garment of many colors that was on her” (II Samuel 13:19). The rabbis taught in the name of R' Yehoshua ben Korḥa: Tamar established a great fence at that time by way of her public outcry, as people said:  If such an occurrence could happen to the daughters of kings, all the more so could it happen to the daughters of ordinary people. If such an occurrence could happen to modest women like Tamar, who resisted, all the more so could it happen to licentious women. Rav Yehuda says that Rav says: At that time they decreed"
        },
        {
          "verseLocation": "2 Samuel 13:23",
          "verseText": "it is written: “And it came to pass after two years, that Absalom had sheepshearers”",
          "talmudLocation": "Sanhedrin 69b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/69b#section-8",
          "talmudFullText": "And later it is written: “And it came to pass after two years, that Absalom had sheepshearers” (II Samuel 13:23), and at that time Amnon was killed (see II Samuel 13:23–29), this being at least two years after Solomon was born. And afterward it is written: “So Absalom fled, and went to Geshur, and was there three years” (II Samuel 13:38), so that this was five years after Solomon was born."
        },
        {
          "verseLocation": "2 Samuel 13:31",
          "verseText": "“Then the king arose, and rent his garments”",
          "talmudLocation": "Moed Katan 21a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/21a#section-4",
          "talmudFullText": "The Talmud concludes: Rather,  this source must be rejected, and instead the halakha is derived from here,  the verse that describes David’s mourning over his son: “Then the king arose, and rent his garments” (II Samuel 13:31). The Talmud asks: But perhaps he too did something extra beyond what is required, and he was not actually obligated to stand; as, if you do not say that he did more than what was required of him, then how do you explain the continuation of the verse: “And he lay on the earth” (II Samuel 13:31)? Is every mourner required to act in this manner also? "
        },
        {
          "verseLocation": "2 Samuel 13:38",
          "verseText": "it is written: “So Absalom fled, and went to Geshur, and was there three years”",
          "talmudLocation": "Sanhedrin 69b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/69b#section-8",
          "talmudFullText": "And later it is written: “And it came to pass after two years, that Absalom had sheepshearers” (II Samuel 13:23), and at that time Amnon was killed (see II Samuel 13:23–29), this being at least two years after Solomon was born. And afterward it is written: “So Absalom fled, and went to Geshur, and was there three years” (II Samuel 13:38), so that this was five years after Solomon was born."
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "2 Samuel 14:2",
          "verseText": "“And Joab sent to Tekoa, and fetched from there a wise woman”",
          "talmudLocation": "Menachot 85b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/85b#section-13",
          "talmudFullText": "Talmud:  The Talmud notes the effect of Tekoa’s oil on those living there: The verse states: “And Joab sent to Tekoa, and fetched from there a wise woman” (II Samuel 14:2). What is different about Tekoa that Joab chose to bring a woman from there? R' Yoḥanan says: Since the residents of Tekoa are accustomed to use olive oil, wisdom is prevalent there. "
        },
        {
          "verseLocation": "2 Samuel 14:2",
          "verseText": "A mourner is prohibited from laundering his clothes, as it is written: “And Joab sent to Tekoa, and fetched from there a wise woman, and said to her, I pray you, feign yourself to be a mourner, and put on now mourning apparel, and do not anoint yourself with oil, but be as a woman that had a long time mourned for the dead”",
          "talmudLocation": "Moed Katan 15a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/15a#section-20",
          "talmudFullText": "§ The Talmud proceeds to discuss another issue: A mourner is prohibited from laundering his clothes, as it is written: “And Joab sent to Tekoa, and fetched from there a wise woman, and said to her, I pray you, feign yourself to be a mourner, and put on now mourning apparel, and do not anoint yourself with oil, but be as a woman that had a long time mourned for the dead” (II Samuel 14:2)."
        },
        {
          "verseLocation": "2 Samuel 14:2",
          "verseText": "A mourner is prohibited from bathing, as it is written: “And do not anoint yourself with oil,",
          "talmudLocation": "Moed Katan 15b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/15b#section-5",
          "talmudFullText": "§ The Talmud discusses a different prohibition: A mourner is prohibited from bathing, as it is written: “And do not anoint yourself with oil,  but be as a woman that had for a long time mourned for the dead” (II Samuel 14:2). And bathing is included in the category of anointing,  as both activities have a similar goal, i.e., cleanliness."
        },
        {
          "verseLocation": "2 Samuel 14:26",
          "verseText": "now it was at every year’s [ yamim ] end",
          "talmudLocation": "Nazir 4b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/4b#section-21",
          "talmudFullText": "§ The Talmud clarifies a halakha taught in the Mishnah: And where is the concept of a permanent nazirite written? As it is taught in a baraita: R' Yehuda HaNasi says: Absalom was a permanent nazirite, as it is stated: “And it came to pass at the end of forty years, that Absalom said to the king: I pray to you, let me go and pay my vow, which I have vowed to YHWH, in Hebron” (II Samuel 15:7). And he cut his hair once every twelve months, as it is stated:  “And when he polled his head, now it was at every year’s [yamim] end that he polled it; because the hair was heavy on him” (II Samuel 14:26)."
        },
        {
          "verseLocation": "2 Samuel 14:26",
          "verseText": "weight",
          "talmudLocation": "Nazir 5a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/5a#section-11",
          "talmudFullText": "It was taught in the baraita that R' Nehorai says that Absalom cut his hair once every thirty days.  The Talmud explains the basis for this opinion: What is the reason that with regard to priests,  the halakha is that they must cut their hair every thirty days? It is because after that interval there is noticeable weight to the hair. Here, too,  in the case of Absalom, there is noticeable weight after this period of time has passed, and it is clear that Absalom cut his hair due to its weight, as it is stated: “Because the hair was heavy on him, therefore he polled it” (II Samuel 14:26)."
        },
        {
          "verseLocation": "2 Samuel 14:26",
          "verseText": "weight",
          "talmudLocation": "Nazir 5a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/5a#section-4",
          "talmudFullText": "The Talmud answers: He learned this verbal analogy because the verse states that Absalom would trim his hair due to its weight (II Samuel 14:26), and in two days there is no significant weight added to the hair. Consequently, the term yamim cannot be understood to mean two days in the case of Absalom."
        },
        {
          "verseLocation": "2 Samuel 14:27",
          "verseText": "not have sons? But isn’t it written: “And to Absalom there were born three sons, and one daughter”",
          "talmudLocation": "Sotah 11a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11a#section-2",
          "talmudFullText": "The Talmud continues its discussion of Absalom. The verse states concerning Absalom: “For he said: I have no son to keep my name in remembrance; and he called the pillar after his own name; and it is called Absalom’s monument to this day” (II Samuel 18:18). The Talmud asks: And did Absalom not have sons? But isn’t it written: “And to Absalom there were born three sons, and one daughter” (II Samuel 14:27)? Rav Yitzḥak bar Avdimi says:  He meant that he did not have a son worthy for royalty. Rav Ḥisda said: It is learned as a tradition: Anyone who burns the produce of another does not leave a son to inherit from him, and he,  Absalom, burned the produce of Joab, as it is written: “Therefore he said to his servants: See, Joab’s field is near mine, and he has barley there; go and set it on fire. And Absalom’s servants set the field on fire” (II Samuel 14:30)."
        },
        {
          "verseLocation": "2 Samuel 14:28",
          "verseText": "And it is written: “So Absalom dwelt two years in Jerusalem, and did not see the king’s face”",
          "talmudLocation": "Sanhedrin 69b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/69b#section-9",
          "talmudFullText": "And it is written: “So Absalom dwelt two years in Jerusalem, and did not see the king’s face” (II Samuel 14:28), bringing the tally to seven years after Solomon was born. And it is written: “And it came to pass after forty years, that Absalom said to the king, I pray you, let me go and pay my vow, which I have vowed to YHWH, in Hebron” (II Samuel 15:7). This was the beginning of Absalom’s rebellion against David. Accordingly, at that time Solomon was at least seven years old. And at some point during the rebellion it is written: “And when Ahithophel saw that his counsel was not followed, he saddled his donkey, and arose, and went to his house, to his city, and put his household in order, and strangled himself and died” (II Samuel 17:23)."
        },
        {
          "verseLocation": "2 Samuel 14:30",
          "verseText": "of Joab, as it is written: “Therefore he said to his servants: See, Joab’s field is near mine, and he has barley there; go and set it on fire. And Absalom’s servants set the field on fire”",
          "talmudLocation": "Sotah 11a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11a#section-2",
          "talmudFullText": "The Talmud continues its discussion of Absalom. The verse states concerning Absalom: “For he said: I have no son to keep my name in remembrance; and he called the pillar after his own name; and it is called Absalom’s monument to this day” (II Samuel 18:18). The Talmud asks: And did Absalom not have sons? But isn’t it written: “And to Absalom there were born three sons, and one daughter” (II Samuel 14:27)? Rav Yitzḥak bar Avdimi says:  He meant that he did not have a son worthy for royalty. Rav Ḥisda said: It is learned as a tradition: Anyone who burns the produce of another does not leave a son to inherit from him, and he,  Absalom, burned the produce of Joab, as it is written: “Therefore he said to his servants: See, Joab’s field is near mine, and he has barley there; go and set it on fire. And Absalom’s servants set the field on fire” (II Samuel 14:30)."
        }
      ]
    },
    {
      "chapterNumber": 15,
      "citations": [
        {
          "verseLocation": "2 Samuel 15:6",
          "verseText": "and the heart of the Jewish people, as it is stated: “So Absalom stole the hearts of the men of Israel”",
          "talmudLocation": "Sotah 9b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-7",
          "talmudFullText": "Absalom was excessively proud of his hair,  and therefore he was hanged by his hair. And furthermore, because he had sex with ten of his father’s concubines (see II Samuel 15:16 and 16:22), therefore ten spears [loneviyyot] were put,  i.e., thrust, into him, as it is stated: “And ten young men that bore Joab’s armor compassed about and smote Absalom, and slew him” (II Samuel 18:15). And because he stole three times, committing three thefts of people’s hearts: The heart of his father,  as he tricked him by saying that he was going to sacrifice offerings; the heart of the court,  as he tricked them into following him; and the heart of the Jewish people, as it is stated: “So Absalom stole the hearts of the men of Israel” (II Samuel 15:6), therefore three spears were embedded into his heart, as it is stated:  “Then said Joab: I may not tarry like this with you. And he took three spears in his hand, and thrust them through the heart of Absalom,  while he was yet alive” (II Samuel 18:14)."
        },
        {
          "verseLocation": "2 Samuel 15:7",
          "verseText": "says: Absalom was a permanent nazirite, as it is stated: “And it came to pass at the end of forty years, that Absalom said to the king: I pray to you, let me go and pay my vow, which I have vowed to the Lord, in Hebron”",
          "talmudLocation": "Nazir 4b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/4b#section-21",
          "talmudFullText": "§ The Talmud clarifies a halakha taught in the Mishnah: And where is the concept of a permanent nazirite written? As it is taught in a baraita: R' Yehuda HaNasi says: Absalom was a permanent nazirite, as it is stated: “And it came to pass at the end of forty years, that Absalom said to the king: I pray to you, let me go and pay my vow, which I have vowed to YHWH, in Hebron” (II Samuel 15:7). And he cut his hair once every twelve months, as it is stated:  “And when he polled his head, now it was at every year’s [yamim] end that he polled it; because the hair was heavy on him” (II Samuel 14:26)."
        },
        {
          "verseLocation": "2 Samuel 15:7",
          "verseText": "And it is written: “And it came to pass after forty years, that Absalom said to the king, I pray you, let me go and pay my vow, which I have vowed to the Lord, in Hebron”",
          "talmudLocation": "Sanhedrin 69b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/69b#section-9",
          "talmudFullText": "And it is written: “So Absalom dwelt two years in Jerusalem, and did not see the king’s face” (II Samuel 14:28), bringing the tally to seven years after Solomon was born. And it is written: “And it came to pass after forty years, that Absalom said to the king, I pray you, let me go and pay my vow, which I have vowed to YHWH, in Hebron” (II Samuel 15:7). This was the beginning of Absalom’s rebellion against David. Accordingly, at that time Solomon was at least seven years old. And at some point during the rebellion it is written: “And when Ahithophel saw that his counsel was not followed, he saddled his donkey, and arose, and went to his house, to his city, and put his household in order, and strangled himself and died” (II Samuel 17:23)."
        },
        {
          "verseLocation": "2 Samuel 15:7",
          "verseText": "stony? But isn’t it written: “And it came to pass at the end of forty years, that Absalom said to the king: I pray, let me go",
          "talmudLocation": "Sotah 34b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/34b#section-13",
          "talmudFullText": "The Talmud asks: But is the land in Hebron in fact stony? But isn’t it written: “And it came to pass at the end of forty years, that Absalom said to the king: I pray, let me go and pay my vow, which I have vowed to YHWH, in Hebron” (II Samuel 15:7)? And Rav Avya says, and some say that it was Rabba bar bar Ḥanan:  This means that Absalom went to bring sheep specifically from Hebron. And it is taught in a baraita (Tosefta, Menaḥot 9:3): One must bring the choicest animals to the Temple as offerings. Rams are brought from Moab,  and sheep are brought from Hebron.  This indicates that Hebron has rich land where fat and healthy sheep are raised. The Talmud answers: From this very source it can be proven that Hebron is not suitable for agriculture. Since the earth there is thin, it produces only grass for grazing and fattens the livestock. "
        },
        {
          "verseLocation": "2 Samuel 15:7",
          "verseText": "which I have vowed to the Lord, in Hebron”",
          "talmudLocation": "Temurah 14b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/14b#section-20",
          "talmudFullText": "The Talmud rejects Rabba bar Rav Ḥanan’s answer: But rather, what is our explanation of the verse? That Absalom went to bring sheep from Hebron?  If so, this verse that states: “Please let me go and pay my vow, which I have vowed to YHWH, in Hebron” (II Samuel 15:7), should instead have stated: Which I have vowed to YHWH from Hebron. "
        },
        {
          "verseLocation": "2 Samuel 15:9",
          "verseText": "Absalom: “Go in peace”",
          "talmudLocation": "Berakhot 64a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/64a#section-9",
          "talmudFullText": "And R' Avin HaLevi said: One who takes leave from another should not say to him: Go in peace, but rather,  he should say: Go to peace. As we see that, on the one hand, Jethro said to Moses: “Go to peace” (Exodus 4:18), and Moses ascended and was successful.  On the other hand, David said to his son, Absalom: “Go in peace” (II Samuel 15:9), and Absalom went and was ultimately hanged. "
        },
        {
          "verseLocation": "2 Samuel 15:9",
          "verseText": "One who departs from the living should not say to him: Go in peace, but rather: Go to peace, as David said to Absalom: “Go in peace”",
          "talmudLocation": "Moed Katan 29a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/29a#section-4",
          "talmudFullText": "One who departs from the living should not say to him: Go in peace, but rather: Go to peace, as David said to Absalom: “Go in peace” (II Samuel 15:9), and he subsequently went and was hanged;  whereas Jethro said to Moses: “Go to peace” (Exodus 4:18), and he went and was successful. "
        },
        {
          "verseLocation": "2 Samuel 15:19",
          "verseText": "But isn’t there Ittai the Gittite",
          "talmudLocation": "Kiddushin 76b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/76b#section-16",
          "talmudFullText": "The Talmud further asks: But isn’t there Ittai the Gittite (II Samuel 15:19)? And if you would say that so too his name indicates that he dwelled in Gath but was born a Jew, but doesn’t Rav Naḥman say,  to explain how David could make use of the crown of the idol of Ammon in apparent violation of the prohibition against deriving benefit from idolatry: Ittai the Gittite came and nullified its status of an idol. The halakha is that only a non-Jew can nullify an idol, by doing something degrading to it. This indicates that Ittai the Gittite must have been a non-Jew."
        },
        {
          "verseLocation": "2 Samuel 15:24",
          "verseText": "is stated: “And Abiathar went up”",
          "talmudLocation": "Sotah 48b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/48b#section-2",
          "talmudFullText": "§ The Mishnah taught: From the time when the early prophets died,  the Urim VeTummim was nullified. The Talmud poses a question: Who are the early prophets? Rav Huna says: This is referring to David, and Samuel, and Solomon,  and after their death the Urim VeTummim was no longer used. Rav Naḥman said: In the days of David there were times an answer rose up for them from the Urim VeTummim and there were times an answer did not rise up,  i.e., they did not receive an answer. The proof for this is that Tzadok,  the High Priest in David’s time, asked the Urim VeTummim and an answer rose up for him,  whereas Abiathar asked and an answer did not rise up for him, as it is stated: “And Abiathar went up” (II Samuel 15:24), and he was removed from serving as the High Priest as a result."
        },
        {
          "verseLocation": "2 Samuel 15:24",
          "verseText": "As it is stated: “But Ebiathar went up until all the people had finished”",
          "talmudLocation": "Yoma 73b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/73b#section-9",
          "talmudFullText": "The Talmud raises an objection from a baraita: Any priest who does not speak with Holy Spirit and upon whom the Shekhina does not rest is not consulted to inquire of the Urim VeTummim. As Zadok inquired of the Urim VeTummim and it was effective for him,  and he received an answer; but Ebiathar inquired and it was not effective for him,  and he did not receive an answer. As it is stated: “But Ebiathar went up until all the people had finished” (II Samuel 15:24), which is taken to mean that he was removed from the High Priesthood since the Holy Spirit had departed from him."
        },
        {
          "verseLocation": "2 Samuel 15:30",
          "verseText": "As it is written: “And David went up by the ascent of the Mount of Olives, and wept as he went up, and he had his head covered, and was walking barefoot”",
          "talmudLocation": "Yoma 77a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/77a#section-11",
          "talmudFullText": "§ The Talmud clarifies the next point in the Mishnah: The fact that not wearing shoes is considered an affliction, from where do we derive this? As it is written: “And David went up by the ascent of the Mount of Olives, and wept as he went up, and he had his head covered, and was walking barefoot” (II Samuel 15:30). Barefoot implies a lack of what? Is it not a lack of wearing shoes?  All these deprivations are described as affliction. The Talmud rejects this: No, perhaps he was barefoot from a horse and whip.  Even if he was wearing shoes, a king without a horse and whip was considered as if he were going barefoot."
        },
        {
          "verseLocation": "2 Samuel 15:32",
          "verseText": "“And earth upon his head”",
          "talmudLocation": "Chullin 139b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/139b#section-10",
          "talmudFullText": "§ The residents of Pappunya said to Rav Mattana:  If one found a nest on the head of a person, what is the halakha with regard to the mitzva of sending away the mother? Is the nest considered to be on the ground, such that one is obligated in the mitzva? Rav Mattana said to them that one is obligated in the mitzva in such a case because the verse states: “And earth upon his head” (II Samuel 15:32), rather than: Dirt upon his head, indicating that one’s head is considered like the ground. They also asked Rav Mattana: From where in the Torah is the existence of Moses [Moshe] alluded to before his birth? He replied that the verse states: “For that he also [beshaggam] is flesh;  therefore shall his days be one hundred and twenty years” (Genesis 6:3). The numerical value of beshaggam is the same as that of the Hebrew name Moshe, and it is known that Moses lived a total of 120 years (see Deuteronomy 34:7)."
        },
        {
          "verseLocation": "2 Samuel 15:32",
          "verseText": "as it is stated: “And it came to pass when David was at the top [ rosh ] of the ascent, where he would bow to God”",
          "talmudLocation": "Sanhedrin 107a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107a#section-12",
          "talmudFullText": "Rav Yehuda says that Rav says: Even during the time of his illness he fulfilled the mitzva of conjugal rights for eighteen wives, as it is stated: “I am weary with my groaning; every night I speak in my bed; I melt away my couch with tears” (Psalms 6:7). Even when he was weary and groaning he still spoke in his bed, a euphemism for sex. And Rav Yehuda says that Rav says: David sought to engage in idol worship during Absalom’s coup, as it is stated: “And it came to pass when David was at the top [rosh] of the ascent, where he would bow to God” (II Samuel 15:32), and rosh means nothing other than idol worship, as it is stated: “As for that image, its head [reishei] was of fine gold” (Daniel 2:32)."
        },
        {
          "verseLocation": "2 Samuel 15:32",
          "verseText": "“Behold Hushai the Archite came to meet him with his coat rent and earth upon his head”",
          "talmudLocation": "Sanhedrin 107a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107a#section-13",
          "talmudFullText": "It is written: “Behold Hushai the Archite came to meet him with his coat rent and earth upon his head” (II Samuel 15:32). Hushai said to David: Shall they say a king like you will engage in idol worship?  David said to him:  Is it preferable that they say with regard to a king like me,  known to be righteous, that his son will kill him?  David continued, referring to himself in 3rd person: It is preferable that he shall engage in idol worship and the name of Heaven shall not be desecrated in public through the murder of a righteous king in this manner."
        }
      ]
    },
    {
      "chapterNumber": 16,
      "citations": [
        {
          "verseLocation": "2 Samuel 16:3",
          "verseText": "“And the king said: And where is your master’s son? And Ziba said to the king: Behold, he is staying in Jerusalem,",
          "talmudLocation": "Shabbat 56a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-15",
          "talmudFullText": "Now, after David saw that Ziba was a liar, when Ziba once again slandered Jonathan’s son, Mephibosheth, why did David accept his report? As it is written that when David fled from Absalom, he met Ziba: “And the king said: And where is your master’s son? And Ziba said to the king: Behold, he is staying in Jerusalem,  as he said: Today shall the house of Israel restore to me the kingdom of my father” (II Samuel 16:3). And from where do we derive that David accepted Ziba’s slanderous report? As it is written: “Then said the king to Ziba: Behold, all that belongs to Mephibosheth is yours. And Ziba said: I humbly beseech you that I may find favor in your sight,  my lord, O king” (II Samuel 16:4)."
        },
        {
          "verseLocation": "2 Samuel 16:4",
          "verseText": "O king",
          "talmudLocation": "Shabbat 56a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-15",
          "talmudFullText": "Now, after David saw that Ziba was a liar, when Ziba once again slandered Jonathan’s son, Mephibosheth, why did David accept his report? As it is written that when David fled from Absalom, he met Ziba: “And the king said: And where is your master’s son? And Ziba said to the king: Behold, he is staying in Jerusalem,  as he said: Today shall the house of Israel restore to me the kingdom of my father” (II Samuel 16:3). And from where do we derive that David accepted Ziba’s slanderous report? As it is written: “Then said the king to Ziba: Behold, all that belongs to Mephibosheth is yours. And Ziba said: I humbly beseech you that I may find favor in your sight,  my lord, O king” (II Samuel 16:4)."
        },
        {
          "verseLocation": "2 Samuel 16:23",
          "verseText": "and so it says: “Now the counsel of Ahitophel, which he counseled in those days, was as a man who inquires of the word of God;",
          "talmudLocation": "Berakhot 3b:32",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/3b#section-32",
          "talmudFullText": "The individuals named in this verse correspond with the roles in the aggada as follows: Ahitophel is the adviser whose advice they sought first with regard to going to war, and so it says: “Now the counsel of Ahitophel, which he counseled in those days, was as a man who inquires of the word of God;  so was the counsel of Ahitophel both with David and with Absalom” (II Samuel 16:23)."
        },
        {
          "verseLocation": "2 Samuel 16:23",
          "verseText": "was as if a man inquired of the word of God”",
          "talmudLocation": "Nedarim 37b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/37b#section-9",
          "talmudFullText": "Words that are read but not written are included in the halakha transmitted to Moses from Sinai. For example, the word “Euphrates” that is in the phrase “as he went to establish his control over the river Euphrates” (II Samuel 8:3) is not written in the text of the Bible. The same is true for the word “man” that is in the verse “now the counsel of Ahithophel, which he counseled in those days, was as if a man inquired of the word of God” (II Samuel 16:23); and for the word “come” that is in the verse “behold, the days come, says YHWH, that the city shall be built to YHWH from the tower of Hananel unto the gate of the corner” (Jeremiah 31:37); and for “her” that is in the phrase “let her not have escape” (Jeremiah 50:29); unto that is in the verse “it has been told me,  all that you have done unto your mother-in-law” (Ruth 2:11); and for “to me” that is found in the passage “and she said unto her: All that you say to me I will do. And she went down to the threshing floor” (Ruth 3:4–5); and for “to me” that is in the verse “he gave me these six measures of barley;  for he said to me” (Ruth 3:17). These words are read but not written. "
        },
        {
          "verseLocation": "2 Samuel 16:23",
          "verseText": "and so it says: “Now the advice of Ahithophel, which he counseled",
          "talmudLocation": "Sanhedrin 16b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/16b#section-1",
          "talmudFullText": "It is: And after Ahithophel was Benaiah, son of Jehoiada; and Ebiathar; and the general of the king’s army, Yoav (see I Chronicles 27:34). The individuals named in this verse correspond to the roles in the aggada as follows: Ahithophel is the advisor whose counsel they sought first with regard to going to war, and so it says: “Now the advice of Ahithophel, which he counseled in those days, was like that of a man who inquires of the word of God; so was the counsel of Ahithophel both with David and with Absalom” (II Samuel 16:23). And Benaiah, son of Jehoiada corresponds to the Sanhedrin,  since he was the head of the Sanhedrin, and Ebiathar corresponds to the Urim VeTummim,  as Ebiathar, son of Ahimelech the priest would oversee inquiries directed to the Urim VeTummim (see I Samuel 23:9)."
        }
      ]
    },
    {
      "chapterNumber": 17,
      "citations": [
        {
          "verseLocation": "2 Samuel 17:4",
          "verseText": "Isn’t it written: “And the saying pleased Absalom well and all the elders of Israel”",
          "talmudLocation": "Sanhedrin 102b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-12",
          "talmudFullText": "The Talmud suggests: Perhaps the delight of his eyes was an object of idol worship.  The Talmud answers: That could not enter your mind, as it is written that Ahab consulted the rabbis with regard to this matter: “And all the elders and all the people said to him: Do not consent and heed not” (I Kings 20:8). The elders in this verse are presumably the rabbis. The Talmud continues: But perhaps they were wicked elders,  who worshipped idols. Isn’t it written: “And the saying pleased Absalom well and all the elders of Israel” (II Samuel 17:4), and Rav Yosef says:  The elders of Israel mentioned in that verse were wicked elders.  Perhaps the elders of Israel with whom Ahab consulted were also wicked."
        },
        {
          "verseLocation": "2 Samuel 17:19",
          "verseText": "As it is written: “And strewed groats [ harifot ] thereon”",
          "talmudLocation": "Keritot 11a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/11a#section-8",
          "talmudFullText": "R' Yitzḥak says: Actually, he is liable only in a case where he has sex with a non-virgin female slave, as it is stated: “And she is a female slave designated [neḥerefet] for a man. ” And from where may it be inferred that this word “designated [neḥerefet], ” is a term of change,  i.e., that she has already changed from her status as a virgin to that of a non-virgin? R' Yitzḥak explains: As it is written: “And strewed groats [harifot] thereon” (II Samuel 17:19). Since groats are grains that have been crushed or otherwise changed from their original form, the linguistic correlation between harifot and neḥerefet indicates that both terms are referring to some form of change. And if you wish, say that it is inferred from the verse: “Though you should bray a fool in a mortar with a pestle among groats [harifot]” (Proverbs 27:22)."
        },
        {
          "verseLocation": "2 Samuel 17:19",
          "verseText": "“And the woman took and spread the covering over the well’s mouth, and strewed groats [ harifot ] thereon”",
          "talmudLocation": "Sotah 42b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-7",
          "talmudFullText": "It is written that Goliath’s mother was: “Harafa” (II Samuel 21:16), and in another place it is written: “Orpah” (Ruth 1:4), and the Talmud will soon explain that this was the same woman. Rav and Shmuel engaged in a dispute concerning this matter. One of them said: Her name was Harafa, and why is she called by the name Orpah?  It is because everyone came at her from behind [orfin] her,  i.e., sodomized her. And one of them said: Her name was Orpah, and why is she called by the name Harafa?  It is because everyone threshed her like groats [harifot],  i.e., had sex with her, and so it says that this word means groats: “And the woman took and spread the covering over the well’s mouth, and strewed groats [harifot] thereon” (II Samuel 17:19). And if you wish,  you can say from here: “Though you should crush a fool in a mortar with a pestle among groats [harifot],  yet will not his foolishness depart from him” (Proverbs 27:22)."
        },
        {
          "verseLocation": "2 Samuel 17:23",
          "verseText": "and went to his home, to his city; and he instructed his household, and strangled himself”",
          "talmudLocation": "Bava Batra 147a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/147a#section-9",
          "talmudFullText": "Rami bar Yeḥezkel says:  The halakha with regard to the gift of a person on his deathbed is derived from here: “And when Ahithophel saw that his counsel was not followed, he saddled his ass,  and he arose, and went to his home, to his city; and he instructed his household, and strangled himself” (II Samuel 17:23). This indicates that merely by issuing an instruction,  a person on his deathbed can transfer ownership of his property."
        },
        {
          "verseLocation": "2 Samuel 17:23",
          "verseText": "“And Ahithophel saw that his counsel was not taken, and he saddled his donkey and he arose and went to his house, to his town, and he commanded his household and strangled himself”",
          "talmudLocation": "Makkot 11a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/11a#section-20",
          "talmudFullText": "And even so it is written that during the rebellion of Absalom: “And Ahithophel saw that his counsel was not taken, and he saddled his donkey and he arose and went to his house, to his town, and he commanded his household and strangled himself” (II Samuel 17:23). Although David stipulated that his curse would take effect only if one who knows the answer fails to share it with him, and Ahithophel did not fail to share it with him, the curse was realized."
        },
        {
          "verseLocation": "2 Samuel 17:23",
          "verseText": "it is written: “And when Ahithophel saw that his counsel was not followed, he saddled his donkey, and arose, and went to his house, to his city, and put his household in order, and strangled himself",
          "talmudLocation": "Sanhedrin 69b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/69b#section-9",
          "talmudFullText": "And it is written: “So Absalom dwelt two years in Jerusalem, and did not see the king’s face” (II Samuel 14:28), bringing the tally to seven years after Solomon was born. And it is written: “And it came to pass after forty years, that Absalom said to the king, I pray you, let me go and pay my vow, which I have vowed to YHWH, in Hebron” (II Samuel 15:7). This was the beginning of Absalom’s rebellion against David. Accordingly, at that time Solomon was at least seven years old. And at some point during the rebellion it is written: “And when Ahithophel saw that his counsel was not followed, he saddled his donkey, and arose, and went to his house, to his city, and put his household in order, and strangled himself and died” (II Samuel 17:23)."
        },
        {
          "verseLocation": "2 Samuel 17:24",
          "verseText": "“ Maḥanaima ”",
          "talmudLocation": "Yevamot 13b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/13b#section-6",
          "talmudFullText": "As it is taught in a baraita: R' Neḥemya says that with regard to any word that requires the letter lamed at its beginning,  meaning: To, the verse at times placed a letter heh at its end,  but the meaning is the same. And the school of R' Yishmael taught: For example,  the term: To “Elim” (Exodus 16:1) can be rendered as “Elima” (Exodus 15:27) instead of le’Elim; “Maḥanaim” (I Kings 2:8) becomes “Maḥanaima” (II Samuel 17:24); “Mitzraim” (e.g., Genesis 13:1) into “Mitzraima” (Genesis 12:10); Divlatayim is “Divlataima” (Numbers 33:46); to Yerushalaim is “Yerushalaima” (Ezekiel 8:3); and “midbara” (Joshua 18:12) means: To the wilderness [midbar]. All these words that contain the letter heh at the end mean the same as if there were a lamed at the beginning."
        },
        {
          "verseLocation": "2 Samuel 17:25",
          "verseText": "it is written explicitly: “And Absalom placed Amasa over the army instead of Joab, and Amasa was the son of a man whose name was Ithra the Israelite, who engaged in intercourse with Abigail, daughter of Nahash, the sister of Zeruiah, mother of Joab”",
          "talmudLocation": "Bava Batra 17a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/17a#section-6",
          "talmudFullText": "A baraita states in a baraita: There were four people who died only because of the counsel of the primordial snake,  in the wake of which all of humanity became mortal, and not on account of any personal sin. And they are: Benjamin, son of Jacob; Amram, father of Moses; Yishai, father of David; and Chileab, son of David. And all of these are known through tradition except for Yishai, father of David, with regard to whom it is written explicitly: “And Absalom placed Amasa over the army instead of Joab, and Amasa was the son of a man whose name was Ithra the Israelite, who had sex with Abigail, daughter of Nahash, the sister of Zeruiah, mother of Joab” (II Samuel 17:25). But was Abigail the daughter of Nahash? Was she not the daughter of Yishai, as it is written: “And their sisters were Zeruiah and Abigail” (I Chronicles 2:16)? Rather,  she was called “daughter of Nahash” to indicate that she was the daughter of one who died only because of the counsel of the snake. "
        },
        {
          "verseLocation": "2 Samuel 17:25",
          "verseText": "as it is written: “And Absalom placed Amasa in charge of the army in place of Joab, and Amasa was the son of a man named Ithra the Israelite, who had taken to himself Abigail the daughter of Nahash, sister of Zeruiah, the mother of Joab”",
          "talmudLocation": "Shabbat 55b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55b#section-3",
          "talmudFullText": "The Talmud raises an objection from what was taught in the following baraita: Four people died due to Adam’s sin with the serpent,  in the wake of which death was decreed upon all of mankind, although they themselves were free of sin. And they are: Benjamin, son of Jacob; Amram, father of Moses; Yishai, father of David; and Kilab, son of David. And all of them were learned through tradition, except for Yishai, father of David, with regard to whom there is an explicit verse interpreted homiletically, as it is written: “And Absalom placed Amasa in charge of the army in place of Joab, and Amasa was the son of a man named Ithra the Israelite, who had taken to himself Abigail the daughter of Nahash, sister of Zeruiah, the mother of Joab” (II Samuel 17:25)."
        },
        {
          "verseLocation": "2 Samuel 17:25",
          "verseText": "“Now Amasa was the son of a man, whose name was Jithra the Israelite, that went into Abigal the daughter of Nahash”",
          "talmudLocation": "Yevamot 77a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/77a#section-1",
          "talmudFullText": "Doeg raised before them all those objections from the others who are disqualified from entering into the congregation, and they were silent,  not knowing how to respond. Doeg then wanted to proclaim that David was disqualified from entering into the congregation. He was immediately answered. Here it says: “Now Amasa was the son of a man, whose name was Jithra the Israelite, that went into Abigal the daughter of Nahash” (II Samuel 17:25), and yet elsewhere it is written that Amasa’s father was named “Jether the Ishmaelite” (I Chronicles 2:17). Rava said:  This teaches that he girded his sword like Ishmael,  i.e., like an Arab, and said: Whoever does not accept this halakha and act accordingly shall be stabbed with the sword. This is the tradition that I received from the court of Samuel from Rama: An Ammonite man is prohibited from entering into the congregation, but not an Ammonite woman; a Moabite man is prohibited from entering into the congregation, but not a Moabite woman. "
        },
        {
          "verseLocation": "2 Samuel 17:28",
          "verseText": "beds, and basins, and earthen vessels, and wheat, and barley, and meal, and parched grain, and beans, and lentils, and parched pulse”",
          "talmudLocation": "Avodah Zarah 38b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/38b#section-17",
          "talmudFullText": "Apropos the mention of shetita’a, the Talmud relates that Rav said: Barzillai the Gileadite sent two kinds of shetita’a to David, as it is written:  “And Barzillai the Gileadite of Rogelim brought beds, and basins, and earthen vessels, and wheat, and barley, and meal, and parched grain, and beans, and lentils, and parched pulse” (II Samuel 17:28). Barzillai brought two kinds of parched foods: Grain and pulse. The Talmud concludes: And now shetita’a is taken out in baskets upon baskets to the markets of Neharde’a, and there is no one who is concerned about that stringent ruling of Shmuel’s father and Levi. "
        },
        {
          "verseLocation": "2 Samuel 17:29",
          "verseText": "And it is written with regard to David: “For they said the people is hungry, and weary, and thirsty in the wilderness”",
          "talmudLocation": "Yoma 77a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/77a#section-9",
          "talmudFullText": "§ The Talmud returns to the issue of whether refraining from bathing is considered affliction. If you wish, say instead: The fact that bathing is considered affliction, from where do we derive this? As it is written: “And to Ebiathar the priest the king said: Get to Anatoth to your fields, for you are deserving of death. But I will not put you to death today, because you carried the Ark of YHWH God before David my father, and because you have been afflicted in all that my father was afflicted” (I Kings 2:26). And it is written with regard to David: “For they said the people is hungry, and weary, and thirsty in the wilderness” (II Samuel 17:29). Hunger means from lack of bread to eat, and thirst means from lack of water to drink. The word weary means lack from what? Is it not from bathing?  The comparison of the verses suggests that that too is affliction. The Talmud challenges: And perhaps “weary” means from lack of wearing shoes?  Therefore, this does not teach us that refraining from bathing is considered an affliction."
        }
      ]
    },
    {
      "chapterNumber": 18,
      "citations": [
        {
          "verseLocation": "2 Samuel 18:9",
          "verseText": "“And Absalom chanced to meet the servants of David. And Absalom was riding upon his mule, and the mule went under the thick boughs of a great terebinth, and his head caught hold of the terebinth, and he was taken up between the heaven and the earth; and the mule that was under him went on”",
          "talmudLocation": "Sotah 10b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10b#section-14",
          "talmudFullText": "The baraita continues: And since he was proud of his hair, therefore, he was hung by his hair, as it is stated in the verse describing the battle between the forces of David and Absalom: “And Absalom chanced to meet the servants of David. And Absalom was riding upon his mule, and the mule went under the thick boughs of a great terebinth, and his head caught hold of the terebinth, and he was taken up between the heaven and the earth; and the mule that was under him went on” (II Samuel 18:9). After he was spotted by the opposing troops, Absalom took a sword [safseira] and wanted to cut his hair to save himself. The school of R' Yishmael taught: At that moment,  the gates of the netherworld opened beneath him and he was afraid to fall into it, so he did not cut his hair, and he was killed by the opposing troops."
        },
        {
          "verseLocation": "2 Samuel 18:14",
          "verseText": "And he took three spears in his hand, and thrust them through the heart of Absalom,",
          "talmudLocation": "Sotah 9b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-7",
          "talmudFullText": "Absalom was excessively proud of his hair,  and therefore he was hanged by his hair. And furthermore, because he had sex with ten of his father’s concubines (see II Samuel 15:16 and 16:22), therefore ten spears [loneviyyot] were put,  i.e., thrust, into him, as it is stated: “And ten young men that bore Joab’s armor compassed about and smote Absalom, and slew him” (II Samuel 18:15). And because he stole three times, committing three thefts of people’s hearts: The heart of his father,  as he tricked him by saying that he was going to sacrifice offerings; the heart of the court,  as he tricked them into following him; and the heart of the Jewish people, as it is stated: “So Absalom stole the hearts of the men of Israel” (II Samuel 15:6), therefore three spears were embedded into his heart, as it is stated:  “Then said Joab: I may not tarry like this with you. And he took three spears in his hand, and thrust them through the heart of Absalom,  while he was yet alive” (II Samuel 18:14)."
        },
        {
          "verseLocation": "2 Samuel 18:15",
          "verseText": "Rabbi Meir would say: Absalom has no share in the World-to-Come, as it is stated: “And they smote Absalom and they killed him”",
          "talmudLocation": "Sanhedrin 103b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-5",
          "talmudFullText": "It is taught in a baraita that R' Meir would say: Absalom has no share in the World-to-Come, as it is stated: “And they smote Absalom and they killed him” (II Samuel 18:15). “And they smote Absalom” is referring to death in this world,  while “and they killed him” is referring to death in the World-to-Come. It is taught in a baraita that R' Shimon ben Elazar says in the name of R' Meir: Ahaz and Ahaziah,  kings of Judea, and all of the kings of the kingdom of Israel about whom it is written: “And he did evil in the eyes of YHWH” (see, e.g., I Kings 15:34), neither live in the World-to-Come nor are sentenced to Gehenna."
        },
        {
          "verseLocation": "2 Samuel 18:15",
          "verseText": "into him, as it is stated: “And ten young men that bore Joab’s armor compassed about",
          "talmudLocation": "Sotah 9b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-7",
          "talmudFullText": "Absalom was excessively proud of his hair,  and therefore he was hanged by his hair. And furthermore, because he had sex with ten of his father’s concubines (see II Samuel 15:16 and 16:22), therefore ten spears [loneviyyot] were put,  i.e., thrust, into him, as it is stated: “And ten young men that bore Joab’s armor compassed about and smote Absalom, and slew him” (II Samuel 18:15). And because he stole three times, committing three thefts of people’s hearts: The heart of his father,  as he tricked him by saying that he was going to sacrifice offerings; the heart of the court,  as he tricked them into following him; and the heart of the Jewish people, as it is stated: “So Absalom stole the hearts of the men of Israel” (II Samuel 15:6), therefore three spears were embedded into his heart, as it is stated:  “Then said Joab: I may not tarry like this with you. And he took three spears in his hand, and thrust them through the heart of Absalom,  while he was yet alive” (II Samuel 18:14)."
        },
        {
          "verseLocation": "2 Samuel 18:18",
          "verseText": "“Now Absalom in his lifetime had taken and reared up for himself",
          "talmudLocation": "Sotah 10b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10b#section-16",
          "talmudFullText": "It is written there: “Now Absalom in his lifetime had taken and reared up for himself the pillar, which is in the king’s valley; for he said: I have no son to keep my name in remembrance” (II Samuel 18:18). The Talmud asks: What did Absalom take? Reish Lakish says: He engaged in a bad transaction for himself by accepting bad advice for which he was punished. The verse continues: “The pillar, which is in the king’s valley [be’emek hammelekh]. ” R' Ḥanina bar Pappa says:  This alludes to the pillar that is in the deep [amukka] counsel of the King [melekh] of the universe,  as God had already decreed in the aftermath of the incident with Bathsheba that this would occur."
        },
        {
          "verseLocation": "2 Samuel 18:18",
          "verseText": "“For he said: I have no son",
          "talmudLocation": "Sotah 11a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11a#section-2",
          "talmudFullText": "The Talmud continues its discussion of Absalom. The verse states concerning Absalom: “For he said: I have no son to keep my name in remembrance; and he called the pillar after his own name; and it is called Absalom’s monument to this day” (II Samuel 18:18). The Talmud asks: And did Absalom not have sons? But isn’t it written: “And to Absalom there were born three sons, and one daughter” (II Samuel 14:27)? Rav Yitzḥak bar Avdimi says:  He meant that he did not have a son worthy for royalty. Rav Ḥisda said: It is learned as a tradition: Anyone who burns the produce of another does not leave a son to inherit from him, and he,  Absalom, burned the produce of Joab, as it is written: “Therefore he said to his servants: See, Joab’s field is near mine, and he has barley there; go and set it on fire. And Absalom’s servants set the field on fire” (II Samuel 14:30)."
        },
        {
          "verseLocation": "2 Samuel 18:23",
          "verseText": "over is the language of precedence? Rav Naḥman bar Yitzḥak said that the verse states: “And Ahimaaz ran by the way of the plain, and overran [ vaya’avor ] the Cushite”",
          "talmudLocation": "Megillah 21b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/21b#section-4",
          "talmudFullText": "The Talmud asks: From where may it be inferred that the word over is the language of precedence? Rav Naḥman bar Yitzḥak said that the verse states: “And Ahimaaz ran by the way of the plain, and overran [vaya’avor] the Cushite” (II Samuel 18:23), i.e., Ahimaaz overtook the Cushite. Abaye said:  It is derived from here: “And he passed [avar] before them” (Genesis 33:3). And if you wish, say instead that the proof is from here: “And their king passed [vaya’avor] before them and YHWH at their head” (Micah 2:13)."
        },
        {
          "verseLocation": "2 Samuel 18:23",
          "verseText": "over is a formulation of priority? Rav Naḥman bar Yitzḥak said that the verse states: “And Ahimaaz ran by the way of the plain, and overran [ vayya’avor ] the Cushite”",
          "talmudLocation": "Niddah 63a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/63a#section-8",
          "talmudFullText": "The Talmud asks: From where may it be inferred that the word over is a formulation of priority? Rav Naḥman bar Yitzḥak said that the verse states: “And Ahimaaz ran by the way of the plain, and overran [vayya’avor] the Cushite” (II Samuel 18:23), i.e., Ahimaaz overtook the Cushite. Abaye said:  It is derived from here: “And he passed [avar] before them” (Genesis 33:3). And if you wish, say instead that the proof is from here: “And their king passed [vayya’avor] before them and YHWH at their head” (Micah 2:13)."
        },
        {
          "verseLocation": "2 Samuel 18:23",
          "verseText": "as it is written: “And Ahimaaz ran by way of the square and he passed [ vaya’avor ] the Kushite”",
          "talmudLocation": "Pesachim 119b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/119b#section-2",
          "talmudFullText": "The Talmud asks: From where may it be inferred that the word over is a formulation that means before an action is performed? Rav Naḥman bar Yitzḥak said that this is as it is written: “And Ahimaaz ran by way of the square and he passed [vaya’avor] the Kushite” (II Samuel 18:23), i.e., Ahimaaz overtook the Kushite. Abaye said that it is derived from here: “And he passed [avar] before them” (Genesis 33:3). Some say that the proof is from here: “And their king shall pass on [vaya’avor] before them, and God at their head” (Micah 2:13)."
        },
        {
          "verseLocation": "2 Samuel 18:23",
          "verseText": "over is the language of priority? Rav Naḥman bar Yitzḥak said that the verse said: “And Ahimaaz ran by the way of the plain, and overran [ vaya’avor ] the Cushite”",
          "talmudLocation": "Pesachim 7b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/7b#section-10",
          "talmudFullText": "The Talmud asks: From where may it be inferred that the word over is the language of priority? Rav Naḥman bar Yitzḥak said that the verse said: “And Ahimaaz ran by the way of the plain, and overran [vaya’avor] the Cushite” (II Samuel 18:23), i.e., Ahimaaz overtook the Cushite. Abaye said:  It is derived from here: “And he passed [avar] before them” (Genesis 33:3). And if you wish, say instead that the proof is from here: “And their king passed [vaya’avor] before them and God at their head” (Micah 2:13)."
        },
        {
          "verseLocation": "2 Samuel 18:23",
          "verseText": "as Rav Naḥman bar Yitzḥak said that it is written: “And Ahimaaz ran by the way of the plain and overtook [ vaya’avor ] the Cushite”",
          "talmudLocation": "Sukkah 39a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/39a#section-3",
          "talmudFullText": "§ The Mishnah continues: In a place where the custom is to recite a blessing when reciting hallel, he should recite a blessing. Abaye said:  The rabbis taught that the obligation to recite a blessing is dependent on custom only with regard to the blessing recited after hallel. However, before hallel, there is a mitzva to recite a blessing, as Rav Yehuda said that Shmuel said:  With regard to all the mitzvot, one recites a blessing over them prior to [over] their performance.  The Talmud asks: From where may it be inferred that the word over is the language of priority?  It is as Rav Naḥman bar Yitzḥak said that it is written: “And Ahimaaz ran by the way of the plain and overtook [vaya’avor] the Cushite” (II Samuel 18:23). Abaye said:  It is derived from here: “And he passed [avar] before them” (Genesis 33:3). And if you wish, say instead that the proof is from here: “And their king passed [vaya’avor] before them and YHWH at their head” (Micah 2:13)."
        }
      ]
    },
    {
      "chapterNumber": 19,
      "citations": [
        {
          "verseLocation": "2 Samuel 19:1",
          "verseText": "“And the king was much moved, and went up to the chamber over the gate, and wept; and as he went about he said: O my son Absalom, my son, my son Absalom! Would I had died in your place, O Absalom, my son, my son”",
          "talmudLocation": "Sotah 10b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10b#section-15",
          "talmudFullText": "It is written with regard to David’s reaction after he learns of the death of Absalom: “And the king was much moved, and went up to the chamber over the gate, and wept; and as he went about he said: O my son Absalom, my son, my son Absalom! Would I had died in your place, O Absalom, my son, my son” (II Samuel 19:1), and a few verses later it adds: “And the king covered his face, and the king cried with a loud voice: O my son Absalom, O Absalom, my son, my son” (II Samuel 19:5). The Talmud asks: Why are there these eight mentions of “my son” by David, i.e., to what do they correspond? The Talmud answers: Seven times he said “my son,” by which he raised him up from the seven chambers of Gehenna. And as for the other,  8th, time, some say that David brought the head of Absalom close to Absalom’s body, and some say that with this 8th mention David brought Absalom to the World-to-Come. "
        },
        {
          "verseLocation": "2 Samuel 19:5",
          "verseText": "“And the king covered his face, and the king cried with a loud voice: O my son Absalom, O Absalom, my son, my son”",
          "talmudLocation": "Sotah 10b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10b#section-15",
          "talmudFullText": "It is written with regard to David’s reaction after he learns of the death of Absalom: “And the king was much moved, and went up to the chamber over the gate, and wept; and as he went about he said: O my son Absalom, my son, my son Absalom! Would I had died in your place, O Absalom, my son, my son” (II Samuel 19:1), and a few verses later it adds: “And the king covered his face, and the king cried with a loud voice: O my son Absalom, O Absalom, my son, my son” (II Samuel 19:5). The Talmud asks: Why are there these eight mentions of “my son” by David, i.e., to what do they correspond? The Talmud answers: Seven times he said “my son,” by which he raised him up from the seven chambers of Gehenna. And as for the other,  8th, time, some say that David brought the head of Absalom close to Absalom’s body, and some say that with this 8th mention David brought Absalom to the World-to-Come. "
        },
        {
          "verseLocation": "2 Samuel 19:25",
          "verseText": "As it is written: “And Mephibosheth, the son of Saul, came down to meet the king, and he had neither dressed his feet, nor trimmed his beard, nor washed his clothes",
          "talmudLocation": "Shabbat 56a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56a#section-16",
          "talmudFullText": "And Shmuel said: David did not accept Ziba’s slanderous report without substantiation. Rather, he himself saw conspicuous matters in Mephibosheth that indicated that Ziba was right. As it is written: “And Mephibosheth, the son of Saul, came down to meet the king, and he had neither dressed his feet, nor trimmed his beard, nor washed his clothes from the day the king departed until the day he came back in peace” (II Samuel 19:25). David thought that he was mourning the fact that he had returned in peace. And it is written: “And it came to pass, when he came to Jerusalem to meet the king, and the king said to him: Why did you not go with me, Mephibosheth? And he answered: My lord, O king, my servant deceived me; for your servant said: I will saddle me a donkey, and I will ride on it, and go to the king; because lame is"
        },
        {
          "verseLocation": "2 Samuel 19:25",
          "verseText": "“He had neither dressed his feet [ raglav ], nor trimmed his beard”",
          "talmudLocation": "Yevamot 103a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/103a#section-15",
          "talmudFullText": "The Talmud continues its challenge. Come and hear another verse: “He had neither dressed his feet [raglav], nor trimmed his beard” (II Samuel 19:25). The phrase “dressed his feet [raglav]” is referring to treating his pubic hair, implying that even the area around the thigh is referred to as regel. The Talmud answers: This is a euphemism.  The Talmud attempts another challenge: Come and hear from another verse: “And Saul went in to cover his feet [raglav]” (I Samuel 24:3), meaning: To urinate, implying that regel refers even to the thighs. The Talmud answers: This is also a euphemism. "
        },
        {
          "verseLocation": "2 Samuel 19:25",
          "verseText": "“And Mephibosheth, the son of Saul, came down to meet the king; and he had neither done his feet nor done his mustache”",
          "talmudLocation": "Yevamot 48a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/48a#section-11",
          "talmudFullText": "And a proof for the statement of R' Eliezer may be adduced from the verse that states: “And Mephibosheth, the son of Saul, came down to meet the king; and he had neither done his feet nor done his mustache” (II Samuel 19:25). What is the meaning of doing in that context? Clearly it means the removal of his toenails and his mustache."
        },
        {
          "verseLocation": "2 Samuel 19:30",
          "verseText": "Rav said: At the time when David said to Mephibosheth: “I say that you and Ziba should divide the field”",
          "talmudLocation": "Yoma 22b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-16",
          "talmudFullText": "The Talmud continues: And even according to Rav, who said that David accepted a slanderous report,  one could answer that that sin is not counted, as was he not punished for it? As Rav Yehuda said that Rav said: At the time when David said to Mephibosheth: “I say that you and Ziba should divide the field” (II Samuel 19:30), a bat kol came forth and said to him: Rehoboam and Jeroboam will divide the kingship.  Because David believed Ziba’s slanderous report and awarded him half of Mephibosheth’s field, David was punished by having his kingdom divided into two. Following King Solomon’s death the Jewish people split into two kingdoms, Israel to the north and Judea to the south (see I Kings 12). Therefore, David was punished for that sin too."
        },
        {
          "verseLocation": "2 Samuel 19:36",
          "verseText": "And even Barzilai the Gileadite said to David: “Today I am eighty years old, can I discern between good and bad?",
          "talmudLocation": "Shabbat 152a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/152a#section-9",
          "talmudFullText": "And even Barzilai the Gileadite said to David: “Today I am eighty years old, can I discern between good and bad?  Can your servant taste what I eat or what I drink? Can I hear any more the voice of singing men and singing women? ” (II Samuel 19:36). The Talmud explains: “Can I discern between good and bad”; from here we derive that the minds of the elderly change and they no longer discern properly. “Can your servant taste what I eat or what I drink”; from here we derive that the lips of the elderly crack and wither. “Can I hear any more the voice of singing men and singing women”; from here we derive that the ears of the elderly become heavy. "
        }
      ]
    },
    {
      "chapterNumber": 20,
      "citations": [
        {
          "verseLocation": "2 Samuel 20:10",
          "verseText": "“But Amasa took no heed of the sword in Joab’s hand”",
          "talmudLocation": "Sanhedrin 49a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/49a#section-15",
          "talmudFullText": "The verse states: “But Amasa took no heed of the sword in Joab’s hand” (II Samuel 20:10). Rav says:  Amasa took no heed of the sword because he did not suspect that Joab was capable of murdering him."
        },
        {
          "verseLocation": "2 Samuel 20:23",
          "verseText": "“And Benayahu ben Yehoyada was over the Kereti and over the Peleti ”",
          "talmudLocation": "Berakhot 4a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/4a#section-2",
          "talmudFullText": "And so it says regarding Benayahu ben Yehoyada’s position as head of the Sanhedrin: “And Benayahu ben Yehoyada was over the Kereti and over the Peleti” (II Samuel 20:23). And why was the Sanhedrin called Kereti UPeleti?  It was called Kereti because they were decisive [koretim] in their pronouncements.  It was called Peleti because their pronouncements and wisdom were wondrous [mufla’im]. The head of the Kereti UPeleti was the head of the Sanhedrin. According to the order of the verse, upon being instructed by King David to go to war, the rabbis first consulted with Ahitophel, then with the Sanhedrin, then they would ask the Urim VeTummim, and only thereafter was the general of the king’s army, Yoav,  given the command to ready the military for battle."
        },
        {
          "verseLocation": "2 Samuel 20:23",
          "verseText": "“And Benaiah, son of Jehoiada, was over the Kereti and over the Peleti ”",
          "talmudLocation": "Sanhedrin 16b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/16b#section-2",
          "talmudFullText": "And so it says with regard to the position of Benaiah, son of Jehoiada, as head of the Sanhedrin: “And Benaiah, son of Jehoiada, was over the Kereti and over the Peleti” (II Samuel 20:23). And why was the Sanhedrin called Kereti and Peleti?  It was called Kereti because they were decisive [shekoretin] in their pronouncements.  It was called Peleti because their actions and wisdom were wondrous [shemufla’in],  as Peleti and mufla’in share the same root. According to the order of the verse, upon being instructed by King David to go to war, the rabbis first consulted with Ahithophel, then with the Sanhedrin, and then they would ask the Urim VeTummim; and only thereafter was the general of the king’s army, Yoav,  given the command to ready the army for battle."
        },
        {
          "verseLocation": "2 Samuel 20:26",
          "verseText": "Ira HaYa’iri was a priest for David”",
          "talmudLocation": "Eruvin 63a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/63a#section-23",
          "talmudFullText": "Having mentioned Ira HaYa’iri, the Talmud now cites a related teaching. R' Abba bar Zavda said: Whoever gives all his priestly gifts to one priest has acted improperly and brings famine into the world as punishment. As it is stated:  “And also Ira HaYa’iri was a priest for David” (II Samuel 20:26), which invites the question: Was he a priest for David alone, and not for anyone else? Rather,  it means that David would send all his priestly gifts to him alone, i.e., he was the only priest to enjoy David’s gifts. And it is written afterward: “And there was a famine in the days of David,  three years, year after year” (II Samuel 21:1)."
        }
      ]
    },
    {
      "chapterNumber": 21,
      "citations": [
        {
          "verseLocation": "2 Samuel 21:1",
          "verseText": "It is for Saul, and for his bloody house, because he put to death the Gibeonites”",
          "talmudLocation": "Bava Kamma 119a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/119a#section-14",
          "talmudFullText": "And it states:  “Egypt shall be a desolation, and Edom shall be a desolate wilderness, for the extortion of the children of Judah, because they have shed innocent blood in their land” (Joel 4:19). The verse here considers extortion like the shedding of innocent blood. And it states with regard to a famine: “And YHWH said: It is for Saul, and for his bloody house, because he put to death the Gibeonites” (II Samuel 21:1)."
        },
        {
          "verseLocation": "2 Samuel 21:1",
          "verseText": "And it is written afterward: “And there was a famine in the days of David,",
          "talmudLocation": "Eruvin 63a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/63a#section-23",
          "talmudFullText": "Having mentioned Ira HaYa’iri, the Talmud now cites a related teaching. R' Abba bar Zavda said: Whoever gives all his priestly gifts to one priest has acted improperly and brings famine into the world as punishment. As it is stated:  “And also Ira HaYa’iri was a priest for David” (II Samuel 20:26), which invites the question: Was he a priest for David alone, and not for anyone else? Rather,  it means that David would send all his priestly gifts to him alone, i.e., he was the only priest to enjoy David’s gifts. And it is written afterward: “And there was a famine in the days of David,  three years, year after year” (II Samuel 21:1)."
        },
        {
          "verseLocation": "2 Samuel 21:1",
          "verseText": "As it is written: “And there was a famine in the days of David three years, year after year”",
          "talmudLocation": "Yevamot 78b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/78b#section-14",
          "talmudFullText": "The Talmud asks: What is the reason that David decreed that they may not enter into the congregation? In order to answer this question, the Talmud recounts all the relevant background events. As it is written: “And there was a famine in the days of David three years, year after year” (II Samuel 21:1). In the first year David said to the Jewish people: Perhaps there are idol worshippers among you,  this being a sin that can lead to drought, as it is written:  “Take heed to yourselves, lest your heart be deceived, and you turn aside, and serve other gods, and worship them;  and the anger of YHWH be kindled against you, and He shut up the heaven, so that there shall be no rain,  and the ground shall not yield her fruit” (Deuteronomy 11:16–17). They examined the matter but did not find sinners of this kind."
        },
        {
          "verseLocation": "2 Samuel 21:1",
          "verseText": "“And David sought the presence of the Lord”",
          "talmudLocation": "Yevamot 78b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/78b#section-17",
          "talmudFullText": "Having unsuccessfully searched the Jewish people for sins that cause drought, David said: The matter depends on nothing other than myself. Immediately it is stated: “And David sought the presence of YHWH” (II Samuel 21:1). The Talmud asks: What is this?  How did David seek God? Reish Lakish said: He inquired through the Urim VeTummim,  the stones embedded in the High Priest’s breastplate, which served as a means of communicating with God."
        },
        {
          "verseLocation": "2 Samuel 21:1",
          "verseText": "“And the Lord said: It is for Saul, and for his bloody house, because he put to death the Gibeonites”",
          "talmudLocation": "Yevamot 78b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/78b#section-19",
          "talmudFullText": "The verse continues: “And YHWH said: It is for Saul, and for his bloody house, because he put to death the Gibeonites” (II Samuel 21:1). The Talmud explains: “For Saul” means that the Jewish people were punished because he was not eulogized properly. “And for his bloody house” is “because he put to death the Gibeonites. ” The Talmud is puzzled by this explanation: Now, where do we find that Saul put to death the Gibeonites?  The Talmud clarifies: Rather, because he killed the people of Nob, the city of priests, who would provide the Gibeonites with water and food in exchange for their services, the verse ascribes to him as if he himself had killed them. "
        },
        {
          "verseLocation": "2 Samuel 21:2",
          "verseText": "as it is stated: “And the king called the Gibeonites and said to them. Now the Gibeonites are not of the children of Israel,",
          "talmudLocation": "Yevamot 78b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/78b#section-13",
          "talmudFullText": "§ Rav Ḥana bar Adda said:  As for the Gibeonites,  it was King David who decreed that they may not enter into the congregation, as it is stated: “And the king called the Gibeonites and said to them. Now the Gibeonites are not of the children of Israel,  but of the remnant of the Amorites” (II Samuel 21:2). This verse indicates that it was David who ruled that they are not part of the Jewish people and that they are barred from the congregation even though they converted."
        },
        {
          "verseLocation": "2 Samuel 21:6",
          "verseText": "and we will hang them up unto the Lord in the Giva of Saul, the chosen of the Lord”",
          "talmudLocation": "Berakhot 12b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/12b#section-13",
          "talmudFullText": "And the Rabbis say that proof that Saul was pardoned is derived from here,  from what the Gibeonites said to David: “Let seven men of his sons be given to us and we will hang them up unto YHWH in the Giva of Saul, the chosen of YHWH” (II Samuel 21:6). Certainly the Gibeonites, who were furious at Saul, would not refer to him as the chosen of YHWH. Therefore, this phrase must be understood as having been spoken by a bat kol that emerged and said the chosen of YHWH,  because Saul had been pardoned for his transgressions and included among the completely righteous. The Talmud returns to the primary focus of the chapter, the recitation of Shema."
        },
        {
          "verseLocation": "2 Samuel 21:6",
          "verseText": "as it is written: “ Vehoka’anum unto the Lord in Gibeah of Saul, the chosen of the Lord”",
          "talmudLocation": "Sanhedrin 34b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/34b#section-21",
          "talmudFullText": "§ The Mishnah teaches: In cases of capital law,  the court judges during the daytime,  and concludes the deliberations and issues the ruling in the daytime. The Talmud asks: From where are these matters derived? Rav Shimi bar Ḥiyya says: The verse states with regard to Israelites who worshipped the idol of Peor in the wilderness: “And hang [hoka] them unto YHWH, facing the sun” (Numbers 25:4), indicating that capital cases are judged in the face of the sun, i.e., during the day. Rav Ḥisda says: From where is it derived that hoka’a is hanging?  Where the Gibeonites requested to be given Saul’s sons, as it is written: “Vehoka’anum unto YHWH in Gibeah of Saul, the chosen of YHWH” (II Samuel 21:6)."
        },
        {
          "verseLocation": "2 Samuel 21:7",
          "verseText": "“And the king had pity on Mephibosheth, son of Jonathan, son of Saul,",
          "talmudLocation": "Yevamot 79a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/79a#section-5",
          "talmudFullText": "Rav Ḥana bar Ketina raised an objection:  The verse states: “And the king had pity on Mephibosheth, son of Jonathan, son of Saul,  because of YHWH’s oath that was between them, between David and Jonathan, son of Saul” (II Samuel 21:7). If the seven men were condemned by the Ark, how did the king’s pity affect their sentence? The Talmud answers: It means that he did not pass Mephibosheth before the Ark at all, so that he would not be in danger of being held back at all."
        },
        {
          "verseLocation": "2 Samuel 21:8",
          "verseText": "the Meholathite”",
          "talmudLocation": "Sanhedrin 19b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-11",
          "talmudFullText": "The Tosefta continues. It is written: “But the king took the two sons of Rizpah, daughter of Aiah, whom she bore unto Saul, Armoni and Mephibosheth, and the five sons of Michal,  daughter of Saul, whom she bore to Adriel,  son of Barzillai the Meholathite” (II Samuel 21:8). But did Saul give Michal to Adriel? But didn’t he give her to Palti, son of Laish, as it is written: “Now Saul had given Michal his daughter, David’s wife, to Palti, son of Laish” (I Samuel 25:44)?"
        },
        {
          "verseLocation": "2 Samuel 21:8",
          "verseText": "Rabbi Yehoshua ben Korḥa as well, isn’t it written: “And the five sons of Michal, daughter of Saul,",
          "talmudLocation": "Sanhedrin 19b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-13",
          "talmudFullText": "The Talmud asks: And according to R' Yehoshua ben Korḥa as well, isn’t it written: “And the five sons of Michal, daughter of Saul,  whom she bore to Adriel” (II Samuel 21:8). R' Yehoshua ben Korḥa could have said to you to understand it this way: And did Michal give birth to these children? But didn’t Merab give birth to them for Adriel? Rather, Merab gave birth to them and died, and Michal raised them in her house. Therefore,  the children were called by her name, to teach you that with regard to anyone who raises an orphan in his house, the verse ascribes him credit as if he gave birth to him. "
        },
        {
          "verseLocation": "2 Samuel 21:8",
          "verseText": "“And the king took the two sons of Rizpah, daughter of Aiah, whom she bore unto Saul, Armoni and Mephibosheth, and the five sons of Michal, daughter of Saul, whom she bore to Adriel the son of Barzillai the Meholathite”",
          "talmudLocation": "Yevamot 79a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/79a#section-4",
          "talmudFullText": "The Talmud continues with its understanding of the incident: “And the king took the two sons of Rizpah, daughter of Aiah, whom she bore unto Saul, Armoni and Mephibosheth, and the five sons of Michal, daughter of Saul, whom she bore to Adriel the son of Barzillai the Meholathite” (II Samuel 21:8). The Talmud asks: What is different about these sons that David chose them from among all the descendants of Saul? Rav Huna said: He passed all of Saul’s descendants before the Ark of the Covenant. Whoever was held back by the Ark,  so that he could not move on, was condemned to death; whoever was not held back by the Ark was set apart for life. "
        },
        {
          "verseLocation": "2 Samuel 21:10",
          "verseText": "And it is written: “And Rizpah, daughter of Aiah, took sackcloth and spread it for her upon the rock, from the beginning of harvest",
          "talmudLocation": "Sanhedrin 35a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/35a#section-1",
          "talmudFullText": "And it is written: “And Rizpah, daughter of Aiah, took sackcloth and spread it for her upon the rock, from the beginning of harvest until water was poured upon them from heaven; and she suffered neither the birds of the air to rest on them by day, nor the beasts of the field by night” (II Samuel 21:10). It is clear from this verse that the bodies of the children of Saul remained exposed outdoors; presumably, they were hung."
        },
        {
          "verseLocation": "2 Samuel 21:10",
          "verseText": "“And Rizpah, daughter of Aiah, took sackcloth and spread it for her upon the rock, from the beginning of harvest until water was poured upon them from heaven; and she allowed neither the birds of the air to rest on them by day, nor the beasts of the field by night”",
          "talmudLocation": "Yevamot 79a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/79a#section-8",
          "talmudFullText": "The Talmud continues with its analysis of the incident. The verse states: “And Rizpah, daughter of Aiah, took sackcloth and spread it for her upon the rock, from the beginning of harvest until water was poured upon them from heaven; and she allowed neither the birds of the air to rest on them by day, nor the beasts of the field by night” (II Samuel 21:10). The Talmud raises a difficulty: How could they have left Saul’s executed sons unburied all that time? Isn’t it written: “His body shall not remain all night upon the tree;  but you shall surely bury him the same day” (Deuteronomy 21:23)?"
        },
        {
          "verseLocation": "2 Samuel 21:16",
          "verseText": "“And Ishbibenob, who was of the sons of the giant, the weight of whose spear was three hundred shekels of brass; and he was girded with new armor and planned to slay David”",
          "talmudLocation": "Sanhedrin 95a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/95a#section-6",
          "talmudFullText": "§ Apropos the massacre of Nov, the Talmud relates: “And Ishbibenob, who was of the sons of the giant, the weight of whose spear was three hundred shekels of brass; and he was girded with new armor and planned to slay David” (II Samuel 21:16). The Talmud asks: What is the meaning of Ishbibenob? Rav Yehuda says that Rav says:  This is a man [ish] who came to punish David over matters of Nov. God said to David: Until when will this sin be concealed in your hand without punishment? Through your actions the inhabitants of Nov, the city of priests, were massacred, and through your actions, Doeg the Edomite was banished from the World-to-Come, and through your actions Saul and his three sons were killed. "
        },
        {
          "verseLocation": "2 Samuel 21:16",
          "verseText": "“Harafa”",
          "talmudLocation": "Sotah 42b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-7",
          "talmudFullText": "It is written that Goliath’s mother was: “Harafa” (II Samuel 21:16), and in another place it is written: “Orpah” (Ruth 1:4), and the Talmud will soon explain that this was the same woman. Rav and Shmuel engaged in a dispute concerning this matter. One of them said: Her name was Harafa, and why is she called by the name Orpah?  It is because everyone came at her from behind [orfin] her,  i.e., sodomized her. And one of them said: Her name was Orpah, and why is she called by the name Harafa?  It is because everyone threshed her like groats [harifot],  i.e., had sex with her, and so it says that this word means groats: “And the woman took and spread the covering over the well’s mouth, and strewed groats [harifot] thereon” (II Samuel 17:19). And if you wish,  you can say from here: “Though you should crush a fool in a mortar with a pestle among groats [harifot],  yet will not his foolishness depart from him” (Proverbs 27:22)."
        },
        {
          "verseLocation": "2 Samuel 21:17",
          "verseText": "which is written: “And Abishai, son of Zeruiah, came to his aid,",
          "talmudLocation": "Sanhedrin 95a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/95a#section-14",
          "talmudFullText": "David said to him: If so, help me. That is the meaning of that which is written: “And Abishai, son of Zeruiah, came to his aid,  and smote the Philistine and killed him” (II Samuel 21:17). Rav Yehuda says that Rav says:  This means that he came to his aid in prayer. Abishai recited another sacred name of God and caused David to land safely after being suspended between heaven and earth, and they fled."
        },
        {
          "verseLocation": "2 Samuel 21:17",
          "verseText": "that it is written: “Then David’s men took an oath to him saying: You shall not go with us to war anymore and you will not douse the lamp of Israel”",
          "talmudLocation": "Sanhedrin 95a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/95a#section-15",
          "talmudFullText": "Ishbibenob pursued them,  intending to kill them. When they reached the place named Kuvi they said:  The name of the place is an abbreviation for the phrase meaning: Stand and battle against him [kum beih]. When they reached a place called Bei Terei,  David and Abishai said: With two [bitrei] cubs they killed the lion,  meaning they expected to be successful. They said to Ishbibenob: Go find Orpah, your mother, in the grave. When they mentioned his mother’s name to him and told him she died, his strength diminished, and they killed him.  The Talmud notes: It is after this that it is written: “Then David’s men took an oath to him saying: You shall not go with us to war anymore and you will not douse the lamp of Israel” (II Samuel 21:17)."
        },
        {
          "verseLocation": "2 Samuel 21:20",
          "verseText": "“And there was again war",
          "talmudLocation": "Bekhorot 45b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/45b#section-1",
          "talmudFullText": "§ The Mishnah teaches that if one has an extra appendage on his hands and on his feet,  six on each for a total of twenty-four, R' Yehuda deems him fit while the Rabbis disqualify him. R' Yitzḥak says: And both derived their opinions from one verse,  as it is stated with regard to David’s war against the Philistines: “And there was again war at Gath” (II Samuel 21:20), and it is also written in that same verse: “And there was a champion, who had on every hand six fingers, and on every foot six toes,  twenty-four in number. ” One Sage,  i.e., the Rabbis, holds that the verse speaks of negative qualities of the champion, and therefore it may be derived from here that extra appendages are blemishes; and one Sage,  R' Yehuda, holds that the verse speaks in his praise,  which means that extra appendages are not blemishes at all."
        },
        {
          "verseLocation": "2 Samuel 21:22",
          "verseText": "“These four were born to Harafa in Gath; and they fell by the hand of David, and by the hand of his servants”",
          "talmudLocation": "Sotah 42b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-8",
          "talmudFullText": "The Talmud continues its discussion of the battle of David and Goliath. “These four were born to Harafa in Gath; and they fell by the hand of David, and by the hand of his servants” (II Samuel 21:22). The Talmud asks: What are the names of the four siblings mentioned here? Rav Ḥisda said:  They are Saph, and Madon, Goliath, and Ishbi in Nob (see II Samuel 21:16–20)."
        }
      ]
    },
    {
      "chapterNumber": 22,
      "citations": [
        {
          "verseLocation": "2 Samuel 22:1",
          "verseText": "“And David spoke to the Lord the words of this song in the day that the Lord delivered him out of the hand of his enemies, and out of the hand of Saul”",
          "talmudLocation": "Moed Katan 16b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16b#section-16",
          "talmudFullText": "The Talmud asks: But now that we have come to discuss this issue, since the verse mentions David’s last words, by inference there are also first words. What then are these first words of David? The Talmud answers: The first words are: “And David spoke to YHWH the words of this song in the day that YHWH delivered him out of the hand of his enemies, and out of the hand of Saul” (II Samuel 22:1), as that song is also referred to as words."
        },
        {
          "verseLocation": "2 Samuel 22:11",
          "verseText": "And it is written: “And He rode upon a cherub, and flew”",
          "talmudLocation": "Rosh Hashanah 31a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/31a#section-15",
          "talmudFullText": "The Talmud cites the sources for each of these stages: From the Ark cover the Shekhina traveled to the cherub,  and from one cherub to the other cherub, and from the second cherub to the threshold, as it is written with regard to Moses in the Tabernacle: “And there I will meet with you, and I will speak to you from above the Ark cover,  from between the two cherubs” (Exodus 25:22). And it is written: “And He rode upon a cherub, and flew” (II Samuel 22:11), which indicates that the glory of the Shekhina can rest upon one cherub. And it is written: “And the glory of the God of Israel had ascended from the cherub, on which it was, to the threshold of the House” (Ezekiel 9:3), i.e., the Shekhina moved from the cherub to the threshold."
        },
        {
          "verseLocation": "2 Samuel 22:12",
          "verseText": "“Gathering of [ ḥashrat ] waters, thick clouds of the skies”",
          "talmudLocation": "Taanit 10a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/10a#section-4",
          "talmudFullText": "The Master said above: The ocean waters are sweetened in the clouds.  The Talmud asks: From where does R' Eliezer derive this?  The Talmud answers that Rav Yitzḥak bar Yosef said that R' Yoḥanan said that it is written: “Darkness [ḥeshkhat] of waters, thick clouds of the skies” (Psalms 18:12). And it is written,  in a similar verse: “Gathering of [ḥashrat] waters, thick clouds of the skies” (II Samuel 22:12)."
        },
        {
          "verseLocation": "2 Samuel 22:12",
          "verseText": "are perforated like a sieve, and they come and sprinkle water onto the ground, as it is stated: “Gathering of waters, thick clouds of the skies”",
          "talmudLocation": "Taanit 9b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/9b#section-12",
          "talmudFullText": "And the clouds are perforated like a sieve, and they come and sprinkle water onto the ground, as it is stated: “Gathering of waters, thick clouds of the skies” (II Samuel 22:12). And between each and every drop there is only a hairbreadth,  and yet each drop emerges individually. This serves to teach you that the day of rains is as great as the day on which Heaven and Earth were created,  i.e., rainfall is as miraculous as creation."
        },
        {
          "verseLocation": "2 Samuel 22:16",
          "verseText": "rain, as it is stated: “And the streams of the sea appeared”",
          "talmudLocation": "Taanit 8b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/8b#section-15",
          "talmudFullText": "§ The Talmud cites five statements of R' Yoḥanan, in accordance with the following mnemonic: Ingathering; armies; charity; tithe; sustainer. R' Yoḥanan said: The day of the rains is as great as the day of the ingathering of the exiles, as it is stated: “Turn our captivity, O Lord, as the streams in the dry land” (Psalms 126:4), and “streams” means nothing other than rain, as it is stated: “And the streams of the sea appeared” (II Samuel 22:16)."
        },
        {
          "verseLocation": "2 Samuel 22:26",
          "verseText": "Rabbi Yitzḥak said: Anyone who conducts himself with wholeheartedness, the Holy One, Blessed be He, treats him with wholeheartedness, as it is stated: “With the devout You act devoutly, and with the one who is strong in his wholeheartedness You act wholeheartedly”",
          "talmudLocation": "Nedarim 32a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/32a#section-10",
          "talmudFullText": "R' Yitzḥak said: Anyone who conducts himself with wholeheartedness, God treats him with wholeheartedness, as it is stated: “With the devout You act devoutly, and with the one who is strong in his wholeheartedness You act wholeheartedly” (II Samuel 22:26)."
        },
        {
          "verseLocation": "2 Samuel 22:27",
          "verseText": "“With the pure You show Yourself pure; and with the crooked You show Yourself subtle”",
          "talmudLocation": "Bava Batra 123a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/123a#section-19",
          "talmudFullText": "Jacob said to her: What is his method of deceit of which I need be aware? Rachel said to him: I have a sister who is older than me, and he will not marry me off before he marries her off, even if he promises that he will do so. Jacob said to her: I am his brother,  i.e., equal, in deceit,  and he will not be able to deceive me. That is why Jacob said that he was “her father’s brother. ” Rachel said to him: But is it permitted for the righteous to act deceitfully?  Jacob answered her: Yes,  in certain circumstances. As the verse states concerning God: “With the pure You show Yourself pure; and with the crooked You show Yourself subtle” (II Samuel 22:27). Therefore, to counter Laban’s deceit, Jacob gave Rachel secret signs to prove to him that she was the one marrying him."
        },
        {
          "verseLocation": "2 Samuel 22:27",
          "verseText": "“With the pure you will show yourself pure, and with the perverse you will show yourself subtle”",
          "talmudLocation": "Megillah 13b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-3",
          "talmudFullText": "Rather,  it must be understood that when Jacob met Rachel, he said to her: Will you marry me? She said to him: Yes, but my father,  Laban, is a swindler, and you will not be able to outwit him.  Jacob alleviated her fears, as he said to her that he is her father’s brother, referring not to their familial affiliation but rather to his ability to deal with her father on his level, as if to say: I am his brother in deception. She said to him: But is it really permitted for the righteous to be involved in deception? He said to her: Yes,  it is permitted when dealing with deceptive individuals, as the verse states: “With the pure you will show yourself pure, and with the perverse you will show yourself subtle” (II Samuel 22:27), indicating that one should deal with others in the manner appropriate for their personality."
        },
        {
          "verseLocation": "2 Samuel 22:28",
          "verseText": "as it is stated: “And the afflicted people You will redeem”",
          "talmudLocation": "Sanhedrin 98a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98a#section-10",
          "talmudFullText": "R' Yoḥanan says: If you saw a generation whose wisdom and Torah study is steadily diminishing, await the coming of the Messiah, as it is stated: “And the afflicted people You will redeem” (II Samuel 22:28). R' Yoḥanan says: If you saw a generation whose troubles inundate it like a river, await the coming of the Messiah, as it is stated: “When distress will come like a river that the breath of YHWH drives” (Isaiah 59:19). And juxtaposed to it is the verse: “And a redeemer will come to Zion” (Isaiah 59:20)."
        },
        {
          "verseLocation": "2 Samuel 22:40",
          "verseText": "“For You have girded me [ vatazreni ] with strength for battle”",
          "talmudLocation": "Niddah 31a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/31a#section-19",
          "talmudFullText": "This is in accordance with a statement of R' Abbahu, as R' Abbahu raises a contradiction: It is written in one of King David’s psalms: “For You have girded me [vatazreni] with strength for battle” (II Samuel 22:40), without the letter alef in vatazreni; and it is written in another psalm: “Who girds me [hame’azreni] with strength” (Psalms 18:33), with an alef in hame’azreini. What is the difference between these two expressions? David said before God: God!, You selected me [zeiritani],  i.e., You separated between the procreative part and the rest of the semen in order to create me, and You have girded me [zeraztani] with strength. "
        },
        {
          "verseLocation": "2 Samuel 22:40",
          "verseText": "with strength for battle”",
          "talmudLocation": "Yoma 47a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/47a#section-10",
          "talmudFullText": "And some say this reference to selection is a euphemism for semen, in accordance with a statement of R' Abbahu, as R' Abbahu raised a contradiction between two verses. It is written: “For You have girded me [vatazreni] with strength for battle” (II Samuel 22:40), and it is written in a parallel verse: “Who girds me [hame’azreni] with strength” (Psalms 18:33). What is the difference between these two expressions? David said before God: God!: You selected me [zeritani] with the best drop of semen that my mother absorbed, with which, You fashioned me [zeraztani] within her. This accounts for the variant forms of this expression."
        }
      ]
    },
    {
      "chapterNumber": 23,
      "citations": [
        {
          "verseLocation": "2 Samuel 23:1",
          "verseText": "which is written: “The saying of David, son of Yishai, and the saying of the man raised on high [ al ]”",
          "talmudLocation": "Avodah Zarah 5a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/5a#section-3",
          "talmudFullText": "And this is similar to that which R' Shmuel bar Naḥmani says that R' Yonatan says: What is the meaning of that which is written: “The saying of David, son of Yishai, and the saying of the man raised on high [al]” (II Samuel 23:1)? This is the meaning of the verse: The saying of David, son of Yishai, who raised and lightened the yoke [ullah] of repentance,  as he taught the power of repentance through his own example."
        },
        {
          "verseLocation": "2 Samuel 23:1",
          "verseText": "before Rav Yehuda. When he reached the verse: “Now these are the last words of David”",
          "talmudLocation": "Moed Katan 16b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16b#section-14",
          "talmudFullText": "§ Zutra bar Toviyya was once reading the portion of the Bible before Rav Yehuda. When he reached the verse: “Now these are the last words of David” (II Samuel 23:1), Zutra bar Toviyya said to Rav Yehuda: If it is written that these are the last of David’s words, by inference there are first words as well. If this is the case, what are these first words of David? Prior to this, it mentions only David’s song, but not his words."
        },
        {
          "verseLocation": "2 Samuel 23:1",
          "verseText": "which is written: “The saying of David, son of Yishai, and the saying of the man who was raised up on high [ al ]”",
          "talmudLocation": "Moed Katan 16b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16b#section-21",
          "talmudFullText": "§ Having mentioned the last words of David, the Talmud continues to explain other expressions in that passage. R' Shmuel bar Naḥmani said in the name of R' Yonatan: What is the meaning of that which is written: “The saying of David, son of Yishai, and the saying of the man who was raised up on high [al ]” (II Samuel 23:1)? It means as follows: The saying of David, son of Yishai, who raised the yoke of [ulla] repentance,  as through his actions he taught the power of repentance. The word al, on high, and the word ulla are comprised of the same consonants in Hebrew."
        },
        {
          "verseLocation": "2 Samuel 23:3",
          "verseText": "“The God of Israel said, the Rock of Israel spoke to me, He that rules over men must be righteous, ruling in the fear of God”",
          "talmudLocation": "Moed Katan 16b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16b#section-22",
          "talmudFullText": "The passage continues: “The God of Israel said, the Rock of Israel spoke to me, He that rules over men must be righteous, ruling in the fear of God” (II Samuel 23:3). The Talmud asks: What is this verse saying?  What does it mean? R' Abbahu said: This is what the verse is saying: The God of Israel said, the Rock of Israel spoke to me:  Although I rule over man, who rules over Me?  It is a righteous person.  How is it possible to say that a righteous person rules over God, as it were? As I,  God, issue a decree and the righteous person nullifies it. "
        },
        {
          "verseLocation": "2 Samuel 23:4",
          "verseText": "“And as the light [ or ] of the morning, when the sun rises,",
          "talmudLocation": "Pesachim 2a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/2a#section-4",
          "talmudFullText": "The Talmud raises an objection from another verse: “And as the light [or] of the morning, when the sun rises,  a morning without clouds; when through clear shining after rain the tender grass springs out of the earth” (II Samuel 23:4). Apparently, or is day.  The Talmud rejects this proof as well: Is it written that the light was morning? “As the light of the morning” is written, and this is what the verse is saying: And as brightly as the morning light of this world shines at its peak, so will be the rising of the sun for the righteous in the World-to-Come,  as in those days the light of the sun will be seven times stronger than at present (see Isaiah 30:26)."
        },
        {
          "verseLocation": "2 Samuel 23:8",
          "verseText": "“These are the names of David’s warriors; Josheb-Basshebeth",
          "talmudLocation": "Moed Katan 16b:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16b#section-23",
          "talmudFullText": "Similarly, the verse states there: “These are the names of David’s warriors; Josheb-Basshebeth a Tahchemonite, chief of the captains; the same was Adino the Eznite; he raised his spear against eight hundred, whom he slew at one time” (II Samuel 23:8). The Talmud asks: What is this verse saying? R' Abbahu said: This is what the verse is saying: These are the names of the mighty actions of David.  These expressions should not be read as names of people but instead as descriptions of David’s good deeds."
        },
        {
          "verseLocation": "2 Samuel 23:11",
          "verseText": "where was a plot of ground full of lentils;",
          "talmudLocation": "Bava Kamma 60b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/60b#section-22",
          "talmudFullText": "The Talmud discusses the different explanations: Granted, according to the one who says that David was asking whether he could take the stacks of barley and exchange them, i.e., repay the owners of the barley, with stacks of lentils, this is as it is written in one verse:  “And the Philistines were gathered together into a troop, where was a plot of ground full of lentils;  and the people fled from the Philistines” (II Samuel 23:11), and it is written in one other verse:  “He was with David at Pas Dammim, and there the Philistines were gathered together to battle, where was a plot of ground full of barley;  and the people fled from before the Philistines” (I Chronicles 11:13). This apparent contradiction can be reconciled by saying that there were two fields, one of barley and one of lentils."
        },
        {
          "verseLocation": "2 Samuel 23:12",
          "verseText": "“But he stood in the midst of the plot, and saved it,",
          "talmudLocation": "Bava Kamma 60b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/60b#section-24",
          "talmudFullText": "Granted, according to the one who says that David asked his question because he wanted to burn the stacks, this is as it is written in the following verse with regard to David: “But he stood in the midst of the plot, and saved it,  and slew the Philistines; and YHWH performed a great victory” (II Samuel 23:12). But according to the one who says that David’s question was asked with regard to exchanging the lentils for the barley, what is the meaning of the phrase: “And saved it”? "
        },
        {
          "verseLocation": "2 Samuel 23:16",
          "verseText": "“But he would not drink it”",
          "talmudLocation": "Bava Kamma 61a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/61a#section-2",
          "talmudFullText": "Granted, according to the one who says one of these two explanations, that David was asking either about repaying barley with lentils or burning the stacks of barley, this is as it is written of David: “But he would not drink it” (II Samuel 23:16). David said to himself: Since there is a prohibition involved in this action, it is not satisfactory to me to act in this manner, even though technically it is permitted for a king. But according to the one who says that David was raising a dilemma with regard to the halakha of a concealed article damaged by a fire, since they sent him an answer that was a tradition with regard to the halakha, what is the meaning of: “But he would not drink it”? "
        },
        {
          "verseLocation": "2 Samuel 23:16",
          "verseText": "“He poured it out to the Lord”",
          "talmudLocation": "Bava Kamma 61a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/61a#section-4",
          "talmudFullText": "The Talmud asks another question: The verse states: “He poured it out to YHWH” (II Samuel 23:16), which indicates that David acted stringently and did not rely on the lenient ruling that he received. Granted, according to the one who says either of these two explanations, that David asked either about burning the stacks of barley or about replacing their value with lentils, he poured out the water to God due to the fact that he acted for the sake of Heaven and did not rely on the lenient ruling he had received. But according to the one who says that David asked about a concealed article damaged by a fire, what is the reason that he poured out the water to YHWH?  The Talmud answers: The reason is that they said this halakha in the name of the tradition,  without associating it with any specific individual."
        },
        {
          "verseLocation": "2 Samuel 23:20",
          "verseText": "as it is stated: “And Benayahu, son of Yehoyada, son of a valiant man of Kabze’el, who had done mighty deeds, he smote the two altar-hearths of Moab; he went down also and slew a lion in the midst of a pit in time of snow”",
          "talmudLocation": "Berakhot 18a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/18a#section-14",
          "talmudFullText": "R' Yonatan said to him: Do the dead know so much? Isn’t it stated: “And the dead know nothing” (Ecclesiastes 9:5)? R' Ḥiyya said to him: If you read the verse, you did not read it a second time, and if you read it a second time, you did not read it a 3rd time, and if you read it a 3rd time, they did not explain it to you properly. The meaning of the verse: “For the living know that they will die, and the dead know nothing and have no more reward, for their memory has been forgotten” (Ecclesiastes 9:5): For the living know that they will die, these are the righteous, who even in their death are called living.  An allusion to this is as it is stated: “And Benayahu, son of Yehoyada, son of a valiant man of Kabze’el, who had done mighty deeds, he smote the two altar-hearths of Moab; he went down also and slew a lion in the midst of a pit in time of snow” (II Samuel 23:20)."
        },
        {
          "verseLocation": "2 Samuel 23:21",
          "verseText": "and he robbed the spear out of the Egyptian’s hand, and slew him with his own spear”",
          "talmudLocation": "Bava Kamma 79b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/79b#section-4",
          "talmudFullText": "The Talmud asks: But if so, what are the circumstances of a robber? R' Abbahu said:  Robbers are like the case of Benaiah ben Jehoiada, as it is stated concerning him: “He slew an Egyptian, a goodly man; and the Egyptian had a spear in his hand; but he went down to him with a staff, and he robbed the spear out of the Egyptian’s hand, and slew him with his own spear” (II Samuel 23:21)."
        },
        {
          "verseLocation": "2 Samuel 23:34",
          "verseText": "written: “And Eliam, son of Ahithophel the Gilonite”",
          "talmudLocation": "Sanhedrin 69b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/69b#section-7",
          "talmudFullText": "The Talmud asks: And from where do we derive that in earlier generations men fathered children at this age? If we say that we know this from the following calculation: It is written: “Is this not Bathsheba, daughter of Eliam, wife of Uriah the Hittite? ” (II Samuel 11:3). And it is also written: “And Eliam, son of Ahithophel the Gilonite” (II Samuel 23:34), which teaches that Bathsheba was the granddaughter of Ahithophel. And it is written with reference to the birth of Solomon: “And he sent by the hand of Nathan the prophet, and he called his name Jedidiah, for YHWH’s sake” (II Samuel 12:25)."
        },
        {
          "verseLocation": "2 Samuel 23:37",
          "verseText": "But isn’t there Zelek the Ammonite,",
          "talmudLocation": "Kiddushin 76b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/76b#section-15",
          "talmudFullText": "The Talmud asks: But isn’t there Zelek the Ammonite,  one of David’s warriors (II Samuel 23:37); what, is it not indicated that he was a convert who came from Ammon?  The Talmud rejects this: No,  his name indicates only that he dwelled in Ammon,  but he was born a Jew. The Talmud asks: But isn’t there Uriah the Hittite (II Samuel 23:39); what, is it not indicated that he came from Heth?  The Talmud rejects this: No,  his name indicates only that he dwelled in Heth. "
        },
        {
          "verseLocation": "2 Samuel 23:39",
          "verseText": "But isn’t there Uriah the Hittite",
          "talmudLocation": "Kiddushin 76b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/76b#section-15",
          "talmudFullText": "The Talmud asks: But isn’t there Zelek the Ammonite,  one of David’s warriors (II Samuel 23:37); what, is it not indicated that he was a convert who came from Ammon?  The Talmud rejects this: No,  his name indicates only that he dwelled in Ammon,  but he was born a Jew. The Talmud asks: But isn’t there Uriah the Hittite (II Samuel 23:39); what, is it not indicated that he came from Heth?  The Talmud rejects this: No,  his name indicates only that he dwelled in Heth. "
        }
      ]
    },
    {
      "chapterNumber": 24,
      "citations": [
        {
          "verseLocation": "2 Samuel 24:1",
          "verseText": "and He incited David against them, saying: Go, number Israel and Judea”",
          "talmudLocation": "Berakhot 62b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-11",
          "talmudFullText": "As for David’s statement to Saul: “If it be YHWH that has incited you against me, let Him accept an offering” (I Samuel 26:19), R' Elazar said that God said to David: Do you call Me an inciter?  In retribution, I will cause you to fail in a matter that even schoolchildren know, as it is written: “When you take the sum of the children of Israel, according to their number, then shall they give every man a ransom for his soul unto YHWH, when you number them; that there be no plague among them, when you number them” (Exodus 30:12). Immediately after God said this to David, “Satan stood up against Israel and incited David to number Israel” (I Chronicles 21:1). Moreover, it is written:  “And again the anger of YHWH was kindled against Israel, and He incited David against them, saying: Go, number Israel and Judea” (II Samuel 24:1). The proportional response to David’s calling God an inciter was that He incited David. And when he counted them, he did not take a ransom from them,  and he was punished, as it is written: “So YHWH sent a pestilence upon Israel from the morning even to the appointed time” (II Samuel 24:15)."
        },
        {
          "verseLocation": "2 Samuel 24:15",
          "verseText": "as it is written: “So the Lord sent a pestilence upon Israel from the morning even to the appointed time”",
          "talmudLocation": "Berakhot 62b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-11",
          "talmudFullText": "As for David’s statement to Saul: “If it be YHWH that has incited you against me, let Him accept an offering” (I Samuel 26:19), R' Elazar said that God said to David: Do you call Me an inciter?  In retribution, I will cause you to fail in a matter that even schoolchildren know, as it is written: “When you take the sum of the children of Israel, according to their number, then shall they give every man a ransom for his soul unto YHWH, when you number them; that there be no plague among them, when you number them” (Exodus 30:12). Immediately after God said this to David, “Satan stood up against Israel and incited David to number Israel” (I Chronicles 21:1). Moreover, it is written:  “And again the anger of YHWH was kindled against Israel, and He incited David against them, saying: Go, number Israel and Judea” (II Samuel 24:1). The proportional response to David’s calling God an inciter was that He incited David. And when he counted them, he did not take a ransom from them,  and he was punished, as it is written: “So YHWH sent a pestilence upon Israel from the morning even to the appointed time” (II Samuel 24:15)."
        },
        {
          "verseLocation": "2 Samuel 24:15",
          "verseText": "as it is written: “And the Lord sent a plague against Israel from the morning until the appointed time”",
          "talmudLocation": "Yoma 22b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-13",
          "talmudFullText": "The Talmud asks: If sins for which David was punished separately are not counted, one could ask: There, too,  with regard to the sin of the census, he was punished separately, as it is written: “And YHWH sent a plague against Israel from the morning until the appointed time” (II Samuel 24:15). The Talmud responds: There,  David was not punished personally, in his own body;  rather, the punishment was inflicted on the Jewish people."
        },
        {
          "verseLocation": "2 Samuel 24:16",
          "verseText": "and said to the angel that destroyed the many [ rav ] people:",
          "talmudLocation": "Berakhot 62b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-13",
          "talmudFullText": "It is also stated there: “YHWH repented Him of the evil and said to the angel that destroyed the many [rav] people:  It is enough; now stay your hand” (II Samuel 24:16). Explaining the meaning of the word rav, R' Elazar said that God said to the angel: Take for me a great one [rav] from among them, who is worthy of defraying several of Israel’s debts.  As a result, at that moment Avishai ben Tzeruya, who was equivalent to the majority of the Sanhedrin, died.  His death atoned for the entire nation."
        },
        {
          "verseLocation": "2 Samuel 24:22",
          "verseText": "“And Araunah said unto David: Let my lord the king take and offer up what seems good unto him; behold the cattle for the burnt-offering, and the threshing instruments [ morigim ] and the accoutrements of the cattle for the wood”",
          "talmudLocation": "Avodah Zarah 24b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/24b#section-4",
          "talmudFullText": "Come and hear another objection from a verse: “And Araunah said unto David: Let my lord the king take and offer up what seems good unto him; behold the cattle for the burnt-offering, and the threshing instruments [morigim] and the accoutrements of the cattle for the wood” (II Samuel 24:22). Apparently, David was willing to accept oxen as offerings from a non-Jew. Rav Naḥman says: Araunah was a non-Jew who resided in Eretz Yisrael and observed the seven Noahide mitzvot [ger toshav].  The seven Noahide mitzvot include the prohibition against engaging in bestiality, and therefore Araunah was not suspected of this practice."
        },
        {
          "verseLocation": "2 Samuel 24:22",
          "verseText": "But isn’t it written: “And Araunah said to David: Let my lord the king take and offer up what seems good to him; behold the oxen for the burnt offering, and the threshing instruments [ morigim ] and the equipment of the oxen for the wood”",
          "talmudLocation": "Menachot 22a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/22a#section-4",
          "talmudFullText": "The Talmud asks: And is it in fact the halakha that old,  i.e., previously used, wood is not fit to be burned on the altar? But isn’t it written: “And Araunah said to David: Let my lord the king take and offer up what seems good to him; behold the oxen for the burnt offering, and the threshing instruments [morigim] and the equipment of the oxen for the wood” (II Samuel 24:22)? Despite the fact that the threshing instruments and equipment of the oxen have been used previously, apparently they are fit to be used when offering a burnt offering. The Talmud answers: Here too,  the verse is speaking of new instruments and equipment that had not been previously used."
        },
        {
          "verseLocation": "2 Samuel 24:22",
          "verseText": "as it is written: “And Araunah said to David: Let my lord the king take and offer that which is good in his eyes; see the cattle for the burnt offering, and the threshing tools, and the implements of the cattle for the wood”",
          "talmudLocation": "Zevachim 116b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/116b#section-9",
          "talmudFullText": "R' Elazar ben Shammua says likewise: David purchased the cattle and the wood and the site of the altar for fifty shekels, and the site of the entire Temple for six hundred shekels, as it is written: “And Araunah said to David: Let my lord the king take and offer that which is good in his eyes; see the cattle for the burnt offering, and the threshing tools, and the implements of the cattle for the wood” (II Samuel 24:22), to which David replied: “No, but I will buy it from you at a price” (II Samuel 24:24). Consequently, according to the opinion of R' Elazar ben Shammua, David purchased the threshing instruments and the furniture of the oxen for use as wood. And Rava could have said to you in response: There too,  in the case of David, the verse is dealing with new vessels that had not yet been used."
        },
        {
          "verseLocation": "2 Samuel 24:23",
          "verseText": "were fulfilled in them. And they were David and Daniel. David, for Araunah blessed him, as it is written: “And Araunah said to the king,",
          "talmudLocation": "Megillah 15a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-17",
          "talmudFullText": "Apropos a statement that R' Elazar said that R' Ḥanina said, the Talmud records other such statements: And R' Elazar further said that R' Ḥanina said: One should never regard the blessing of an ordinary person [hedyot] as light in your eyes, as two of the great men of their generations received blessings from ordinary people and those blessings were fulfilled in them. And they were David and Daniel. David, for Araunah blessed him, as it is written: “And Araunah said to the king,  May YHWH your God accept you” (II Samuel 24:23), and it was fulfilled. Daniel, for Darius blessed him, as it is written: “Your God Whom you serve continually, He will rescue you” (Daniel 6:17), and this too was fulfilled when Daniel was saved from the lions’ den."
        },
        {
          "verseLocation": "2 Samuel 24:24",
          "verseText": "and it is written: “So David bought…",
          "talmudLocation": "Zevachim 116b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/116b#section-11",
          "talmudFullText": "With regard to the contradiction between the verses that relate the sum of shekels paid by David, the Talmud says that Rava was teaching these verses to his son, and raised a contradiction between verses: It is written: “So David gave to Ornan…six hundred shekels of gold by weight” (I Chronicles 21:25), and it is written: “So David bought…fifty shekels of silver” (II Samuel 24:24). How can these texts be reconciled? David would collect from each tribe of the twelve tribes fifty shekels, which are a sum of six hundred shekels."
        }
      ]
    }
  ]
}