{
  "bookName": "Amos",
  "totalEntries": 74,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Amos 1:11",
          "verseText": "as it is written: “Thus says the Lord: For three transgressions of Edom,",
          "talmudLocation": "Sotah 21a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/21a#section-2",
          "talmudFullText": "The Talmud answers: <b>Actually, </b> the Mishnah is in accordance with the opinion of <b>R' Yishmael, </b> who states that merit delays punishment for one year, <b>and he found a verse which states and repeats</b> the possibility that punishment can be delayed, indicating that merit can delay punishment up to three times, <b>as it is written: “Thus says YHWH: For three transgressions of Edom, </b> yes, but for four, I will not reverse it” (Amos 1:11). Punishment can therefore be delayed for three consecutive periods of one year."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Amos 2:1",
          "verseText": "as it is written: “So says the Lord: For three transgressions of Moab, indeed for four I will not reverse for him, because he burned the bones of the King of Edom into lime”",
          "talmudLocation": "Bava Batra 22a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/22a#section-8",
          "talmudFullText": "Based on this exchange, Rav Adda bar Abba decided that Rav Dimi was not a great Torah scholar, and therefore <b>he did not reserve the market for him, and</b> Rav Dimi <b>lost his dried figs, </b> as they rotted. Rav Dimi <b>came before Rav Yosef</b> to complain, and <b>said to him: The Master</b> should <b>see what they did to me. </b> Rav Yosef <b>said to him: He Who did not delay</b> retribution for <b>the humiliation of the King of Edom should not delay</b> His response to <b>your humiliation, </b> but should punish whoever distressed you, <b>as it is written: “So says YHWH: For three transgressions of Moab, indeed for four I will not reverse for him, because he burned the bones of the King of Edom into lime”</b> (Amos 2:1)."
        },
        {
          "verseLocation": "Amos 2:6",
          "verseText": "“So says the Lord: For three transgressions of Israel, or for four, I will not repay it”",
          "talmudLocation": "Sanhedrin 7a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/7a#section-9",
          "talmudFullText": "There was <b>a certain</b> man <b>who was saying as he walked</b> by: <b>For</b> only <b>two</b> or <b>three</b> thefts, <b>the thief</b> is <b>not executed</b> by the heavenly court. <b>Shmuel said to Rav Yehuda: A verse</b> is <b>written</b> that conveys the message of this aphorism: <b>“So says YHWH: For three transgressions of Israel, or for four, I will not repay it”</b> (Amos 2:6). Shmuel interprets the verse rhetorically, as if saying: Will I not repay the 4th offense? Accordingly, before the 4th offense, it is still possible to rectify the sins."
        },
        {
          "verseLocation": "Amos 2:6",
          "verseText": "he is not forgiven, as it is stated: “Thus said the Lord: For three transgressions of Israel, but for four I will not reverse it”",
          "talmudLocation": "Yoma 86b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/86b#section-10",
          "talmudFullText": "§ <b>It was taught</b> in a <i>baraita</i> that <b>R' Yosei bar Yehuda says: </b> When <b>a person commits a transgression</b> the <b>first time, he is forgiven; a second</b> time, <b>he is forgiven; a 3rd</b> time, <b>he is forgiven; </b> but the <b>4th</b> time, <b>he is not forgiven, as it is stated: “Thus said YHWH: For three transgressions of Israel, but for four I will not reverse it”</b> (Amos 2:6). <b>And it says: “All these things does God do twice or three times with a man”</b> (Job 33:29)."
        },
        {
          "verseLocation": "Amos 2:9",
          "verseText": "those of stature? As it is stated: “Yet I destroyed the Amorite before them, whose height was like the height of the cedars”",
          "talmudLocation": "Bekhorot 45b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/45b#section-7",
          "talmudFullText": "§ The Mishnah teaches that <b>a <i>kipe’aḥ</i></b> is disqualified. <b>Rav Zevid taught</b> that this is referring to one who is extremely <b>tall. </b> The Talmud asks: <b>Is that so, </b> that one who is tall is considered blemished? <b>But didn’t R' Abbahu teach: From where</b> is it derived <b>that God is praised through</b> His destruction of <b>those of stature? As it is stated: “Yet I destroyed the Amorite before them, whose height was like the height of the cedars”</b> (Amos 2:9). <b>Rav Pappa said</b> in response: The Mishnah is not referring to one who is tall and has a healthy build, but to one who is <b>long, emaciated, </b> and <b>ugly. </b>"
        },
        {
          "verseLocation": "Amos 2:9",
          "verseText": "and it blinded their eyes from above and castrated them from below, as it is stated: “Yet I destroyed the Amorites before them, whose height was like the height of the cedars, and they were strong as the oaks; yet I destroyed their fruit from above, and their roots from beneath”",
          "talmudLocation": "Sotah 36a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/36a#section-9",
          "talmudFullText": "<b>R' Shimon ben Lakish says: </b> The hornet <b>stood on the banks of the Jordan and threw its venom at</b> the inhabitants of the land <b>and it blinded their eyes from above and castrated them from below, as it is stated: “Yet I destroyed the Amorites before them, whose height was like the height of the cedars, and they were strong as the oaks; yet I destroyed their fruit from above, and their roots from beneath”</b> (Amos 2:9)."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Amos 3:2",
          "verseText": "said to him: It is written: “You only have I known of all the families of the earth; therefore, I will visit upon you all your iniquities”",
          "talmudLocation": "Avodah Zarah 4a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-11",
          "talmudFullText": "With regard to the afflictions of the Jewish people, the Talmud relates: <b>R' Abbahu would praise Rav Safra to the heretics</b> by saying <b>that he is a great man. </b> Therefore, <b>they remitted</b> Rav Safra’s obligation to pay <b>taxes for thirteen years, </b> as they relied upon R' Abbahu’s word and wanted to reward a great man. <b>One day they found</b> Rav Safra and <b>said to him: It is written: “You only have I known of all the families of the earth; therefore, I will visit upon you all your iniquities”</b> (Amos 3:2). The meaning of this verse is unclear, as why would God punish specifically the Jewish people because He loves them? <b>One who has wrath [<i>siseya</i>], </b> does <b>he raise it against his beloved? </b> Rav Safra <b>was silent and did not say anything</b> in response <b>to them. They threw a scarf around his neck and tormented him, </b> by pulling and denigrating him."
        },
        {
          "verseLocation": "Amos 3:7",
          "verseText": "as it is written: “For the Lord God will do nothing, unless He reveals His counsel",
          "talmudLocation": "Sanhedrin 89b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89b#section-4",
          "talmudFullText": "The Talmud asks: <b>From where do they know</b> that he received a prophecy? <b>Abaye says: </b> They know, <b>as it is written: “For YHWH God will do nothing, unless He reveals His counsel</b> to His servants the prophets” (Amos 3:7). The Talmud challenges: <b>And perhaps</b> the heavenly court <b>reconsidered with regard to</b> the prophecy, and the prophet is no longer commanded to disseminate the prophecy. The Talmud answers: <b>If it is so that they reconsidered with regard to</b> the prophecy, the heavenly court <b>would have informed all the prophets. </b>"
        },
        {
          "verseLocation": "Amos 3:7",
          "verseText": "“Would be done”; as it is written: “For the Lord God will do nothing”",
          "talmudLocation": "Sotah 11a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11a#section-5",
          "talmudFullText": "With regard to Miriam’s deed the verse states: <b>“And his sister stood afar off, </b> to know what would be done to him” (Exodus 2:4). <b>R' Yitzḥak says: This entire verse is stated in reference to the Shekhina, </b> i.e., each phrase alludes to the Shekhina watching over Moses. <b>“And</b> his sister <b>stood”; as it is written: “And YHWH came, and stood”</b> (I Samuel 3:10). <b>“His sister”; as it is written: “Say to wisdom: You are my sister”</b> (Proverbs 7:4). <b>“Afar off”; as it is written: “From afar YHWH appeared to me”</b> (Jeremiah 31:2). <b>“To know”; as it is written: “For YHWH is a God of knowledge”</b> (I Samuel 2:3). <b>“What”; as it is written: “What does YHWH God require of you”</b> (Deuteronomy 10:12). <b>“Would be done”; as it is written: “For YHWH God will do nothing”</b> (Amos 3:7). <b>“To him”; as it is written: “And YHWH said to him: Peace</b> be with you” (Judges 6:23)."
        },
        {
          "verseLocation": "Amos 3:8",
          "verseText": "rise early and recite: “The lion has roared, who will not fear?",
          "talmudLocation": "Berakhot 56b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/56b#section-12",
          "talmudFullText": "<b>One who sees a dog in a dream</b> should <b>rise early and recite: “But against any of the children of Israel shall not a dog whet his tongue”</b> (Exodus 11:7), <b>before a different verse, </b> with a negative connotation, <b>can precede it</b> in becoming reality: <b>“Yea, the dogs are greedy”</b> (Isaiah 56:11). <b>One who sees a lion in a dream</b> should <b>rise early and recite: “The lion has roared, who will not fear? </b> YHWH God has spoken, who can but prophesy? ” (Amos 3:8), <b>before a different verse, </b> with a negative connotation, <b>can precede it</b> in becoming reality: <b>“A lion is gone up from his thicket, </b> and a destroyer of nations is set out, gone forth from his place” (Jeremiah 4:7)."
        },
        {
          "verseLocation": "Amos 3:8",
          "verseText": "emperor said to Rabbi Yehoshua ben Ḥananya: Your God is compared to a lion, as it is written: “The lion has roared, who will not fear”",
          "talmudLocation": "Chullin 59b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/59b#section-9",
          "talmudFullText": "The Talmud recounts: The Roman <b>emperor said to R' Yehoshua ben Ḥananya: Your God is compared to a lion, as it is written: “The lion has roared, who will not fear”</b> (Amos 3:8). But if so, <b>what is His greatness? A cavalryman</b> can <b>kill a lion. </b> R' Yehoshua <b>said to him: </b> God <b>is not compared to that lion</b> which a cavalryman can kill. Rather, God is <b>compared to the lion of Bei Ila’ei. </b> The emperor <b>said to him: I ask that you show it to me. </b> R' Yehoshua <b>said to him: You cannot see it. </b> The emperor <b>said to him: Truly, I</b> wish to <b>see it. </b> R' Yehoshua <b>prayed for mercy, </b> and the lion of Bei Ila’ei <b>set off from its place</b> of origin toward Rome."
        },
        {
          "verseLocation": "Amos 3:15",
          "verseText": "Isn’t it written: “I will strike the winter-house with the summer-house”",
          "talmudLocation": "Yoma 10a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/10a#section-15",
          "talmudFullText": "The Talmud asks: <b>What is the reason</b> for the opinion <b>of R' Yehuda</b> that there was no fundamental obligation to affix a <i>mezuza</i> in the <i>Parhedrin</i> chamber, and that one was affixed there due to a decree? <b>Rava said</b> that <b>R' Yehuda holds: </b> The legal status of <b>any house that is not designated</b> for residence both <b>for the summer and for the winter is not</b> that of <b>a house</b> and therefore does not require a <i>mezuza</i>. <b>Abaye raised an objection to his</b> opinion from a verse. How could you suggest that the legal status of a residence occupied for only part of the year is not that of a house? <b>Isn’t it written: “I will strike the winter-house with the summer-house”</b> (Amos 3:15)? Apparently, even a residence occupied only half the year is a house. Rava <b>said to him: </b> A residence occupied only part of the year may be <b>called the winter-house or the summer-house. It is not called a house unmodified. </b> A house is a structure used year round."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Amos 4:1",
          "verseText": "it is stated: “Hear this word, you cows of Bashan, that are in the mountain of Samaria, that oppress the poor, that crush the needy,",
          "talmudLocation": "Shabbat 32b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/32b#section-9",
          "talmudFullText": "<b>Due to the sin of robbery, locusts emerge, and famine prevails, and people eat the flesh of their sons and daughters, </b> as <b>it is stated: “Hear this word, you cows of Bashan, that are in the mountain of Samaria, that oppress the poor, that crush the needy, </b> that say unto their lords: Bring, that we may feast” (Amos 4:1). Afterward it says: “And I also have given you cleanness of teeth in all your cities, and want of bread in all your places” (Amos 4:6), which refers to famine. <b>Rava said: </b> The cows of Bashan; <b>like those women of</b> the city of <b>Meḥoza, </b>"
        },
        {
          "verseLocation": "Amos 4:2",
          "verseText": "and your residue in fishing boats [ duga ]”",
          "talmudLocation": "Bava Batra 73a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/73a#section-7",
          "talmudFullText": "<b>Rava said: </b> The <b><i>bitzit</i> is</b> the same as the <b><i>dugit</i>. R' Natan was a Babylonian, </b> and therefore <b>he called</b> small boats <b><i>butzit</i>, as people say: The <i>botziata</i>, </b> small boats, <b>of Miashan. Sumakhos, who was from Eretz Yisrael, called</b> these boats <b><i>dugit</i>, as it is written: </b> “You shall be taken away with hooks, <b>and your residue in fishing boats [<i>duga</i>]”</b> (Amos 4:2)."
        },
        {
          "verseLocation": "Amos 4:6",
          "verseText": "as it is stated: “And I also have given you cleanness of teeth in all your cities, and lack of bread in all your places”",
          "talmudLocation": "Niddah 65a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/65a#section-10",
          "talmudFullText": "Since the Talmud cited Rav Ḥinnana bar Shelamya, it cites another of his statements: <b>Rav Ḥinnana bar Shelamya said in the name of Rav: Once a person’s teeth fall out</b> and he has difficulty eating, <b>his food diminshes</b> accordingly, <b>as it is stated: “And I also have given you cleanness of teeth in all your cities, and lack of bread in all your places”</b> (Amos 4:6). The term “cleanness of teeth” is here a euphemism for having no teeth at all, which leads to a lack of bread."
        },
        {
          "verseLocation": "Amos 4:7",
          "verseText": "the first year, this verse will be fulfilled: “And I will cause it to rain upon one city and cause it not to rain upon another city”",
          "talmudLocation": "Sanhedrin 97a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/97a#section-2",
          "talmudFullText": "<b>A baraita states</b> in a <i>baraita</i>: With regard to <b>the seven-year</b> period, i.e., the Sabbatical cycle, <b>during which</b> the Messiah, <b>son of David, comes: </b> During <b>the first year, this verse will be fulfilled: “And I will cause it to rain upon one city and cause it not to rain upon another city”</b> (Amos 4:7). During the <b>second</b> year of that period, <b>arrows of famine will be shot, </b> indicating that there will be famine only in certain places. During the <b>3rd</b> year <b>there will be a great famine, and men, women, children, the pious, and men of action will die, and the Torah is forgotten by those who study it. During the 4th</b> year there will be <b>plenty but not</b> great <b>plenty. During the 5th</b> year there will be <b>great plenty and they will eat, and drink, and rejoice, and the Torah will return to those who study it. During the 6th</b> year, heavenly <b>voices</b> will be heard. <b>During the Sabbatical</b> Year, <b>wars, </b> e.g., the war of Gog and Magog, will be waged involving the Jewish people. <b>During</b> the year after <b>the conclusion of the Sabbatical</b> Year, <b>the son of David will come. </b>"
        },
        {
          "verseLocation": "Amos 4:7",
          "verseText": "as it is written: “And I caused it to rain upon one city, but caused it not to rain upon another city; one piece was rained upon,",
          "talmudLocation": "Taanit 18b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/18b#section-15",
          "talmudFullText": "If sufficient rain <b>fell for the vegetation but not</b> enough <b>fell for the trees; </b> or if it was enough <b>for the trees but not for the vegetation; </b> or if sufficient rain fell <b>for both this and that, </b> i.e., vegetation and trees, <b>but not</b> enough <b>to</b> fill the <b>cisterns, ditches, and caves</b> with water to last the summer, <b>they cry out about it immediately. And likewise, </b> if there is a particular <b>city upon which it did not rain, </b> while the surrounding area did receive rain, this is considered a divine curse, <b>as it is written: “And I caused it to rain upon one city, but caused it not to rain upon another city; one piece was rained upon, </b> and the portion upon which it did not rain withered” (Amos 4:7)."
        },
        {
          "verseLocation": "Amos 4:7",
          "verseText": "city upon which it did not rain,",
          "talmudLocation": "Taanit 20a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/20a#section-9",
          "talmudFullText": "§ The Mishnah taught: <b>And likewise, </b> if there is a particular <b>city upon which it did not rain, </b> while the surrounding area did receive rain, this is considered a divine curse, as it is written: “And I will cause it to rain on one city, but on one city I will not cause it to rain, one portion will be rained upon, and the portion upon which it did not rain shall wither” (Amos 4:7). <b>Rav Yehuda said</b> that <b>Rav said: And both of</b> the cities are faced <b>with a curse, </b> as one city suffers from drought while the other is afflicted with destructive storms."
        },
        {
          "verseLocation": "Amos 4:7",
          "verseText": "Is that so? But isn’t it written: “And I have also withheld the rain from you, when there were yet three months to the harvest; and I would cause it to rain upon one city, and caused it not to rain upon another city; one piece was rained upon,",
          "talmudLocation": "Taanit 6b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/6b#section-13",
          "talmudFullText": "<b>And Rav Ḥisda</b> also <b>said: Rain that fell on</b> one <b>part of a country and did not fall on another part of</b> the <b>country does not constitute</b> a fulfillment of the verse: <b>“And He will close up</b> the heavens. ” The Talmud raises an objection: <b>Is that so? But isn’t it written: “And I have also withheld the rain from you, when there were yet three months to the harvest; and I would cause it to rain upon one city, and caused it not to rain upon another city; one piece was rained upon, </b> and the piece upon which it did not rain withered” (Amos 4:7). <b>And Rav Yehuda said</b> that <b>Rav said: Both</b> the area that receives rain and the area that does not receive rain <b>are cursed. </b> This statement indicates that rain that falls on only part of a country is a curse."
        },
        {
          "verseLocation": "Amos 4:9",
          "verseText": "And it is written: “I have smitten you with blight and mildew; the multitude of your gardens and your vineyards and your fig trees and your olive trees has the palmerworm devoured”",
          "talmudLocation": "Shabbat 33a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/33a#section-1",
          "talmudFullText": "<b>who eat and do nothing</b> to support themselves, and cause their husbands to commit the sin of theft. <b>And it is written: “I have smitten you with blight and mildew; the multitude of your gardens and your vineyards and your fig trees and your olive trees has the palmerworm devoured”</b> (Amos 4:9). <b>And it is written: “That which the palmerworm has left the locust has eaten; and that which the locust has left the cankerworm has eaten; and that which the cankerworm has left the caterpillar has eaten”</b> (Joel 1:4). <b>And it is written: “And one snatches on the right hand, and is hungry; and he eats on the left hand, and is not satisfied; they eat every man the flesh of his own arm [<i>besar zero</i>’<i>o</i>]”</b> (Isaiah 9:19). <b>Do not read</b> it: <b>The flesh of his own arm [<i>besar zero</i>’<i>o</i>]; rather, the flesh of his own offspring [<i>besar zaro</i>]. </b> All the punishments for theft listed above were explicitly mentioned in the verses."
        },
        {
          "verseLocation": "Amos 4:12",
          "verseText": "Rabbi Yonatan said: One who needs to relieve himself may not pray, because it is stated: “Prepare to greet your God, O Israel”",
          "talmudLocation": "Berakhot 23a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/23a#section-5",
          "talmudFullText": "<b>R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: One who needs to relieve himself may not pray, because it is stated: “Prepare to greet your God, O Israel”</b> (Amos 4:12), and one must clear his mind of all distractions to prepare to receive YHWH during prayer."
        },
        {
          "verseLocation": "Amos 4:12",
          "verseText": "One who drinks in pairs should not recite a blessing, because it is stated: “Prepare to meet your God, O Israel”",
          "talmudLocation": "Berakhot 51b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/51b#section-8",
          "talmudFullText": "<b>Rav Asi said: One may not speak over a cup of blessing</b> from the moment he takes it in his hand until he drinks it. <b>And Rav Asi said: One may not recite a blessing over a cup of punishment. </b> The Talmud clarifies: <b>What is a cup of punishment? Rav Naḥman bar Yitzḥak said: A second cup. That</b> opinion <b>was also taught</b> in a <i>baraita</i>: <b>One who drinks in pairs should not recite a blessing, because it is stated: “Prepare to meet your God, O Israel”</b> (Amos 4:12). One must be well-prepared in order to stand before his Creator, <b>and this</b> person who drank two cups of wine <b>is not prepared, </b> as drinking an even number of cups of wine is dangerous due to demons."
        },
        {
          "verseLocation": "Amos 4:12",
          "verseText": "since it is stated: “Prepare to greet your God, Israel”",
          "talmudLocation": "Shabbat 10a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/10a#section-1",
          "talmudFullText": "The Talmud responds that there is a difference between the cases. <b>There, </b> at the time of the afternoon prayer, <b>drunkenness is uncommon, </b> as it is unusual to drink excessively during the day. However, <b>here, </b> in the case of the evening prayer, <b>drunkenness is common, </b> and therefore there was room to issue a decree requiring one to interrupt his meal to recite the evening prayer. <b>Alternatively, </b> it is possible to explain that <b>with regard to the afternoon prayer, since its time is fixed, he is anxious, and he won’t come to be negligent</b> and forget to pray. However, with regard to the <b>evening prayer, since all night is the time for the evening prayer, he is not anxious, and he will come to be negligent. Rav Sheshet strongly objects to this: Is it a burden to tie his belt? </b> In addition, if it is a burden, <b>let him stand that way, </b> without a belt, <b>and pray. </b> The Talmud answers: It is necessary to wear a belt while praying, <b>since it is stated: “Prepare to greet your God, Israel”</b> (Amos 4:12). One must prepare and adorn himself when standing before God."
        },
        {
          "verseLocation": "Amos 4:13",
          "verseText": "“Who forms mountains and creates [ boreh ] wind”",
          "talmudLocation": "Berakhot 52b:29",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/52b#section-29",
          "talmudFullText": "<b>Rav Yosef raised an objection: </b> How can there be a dispute over the meaning of the word <i>boreh</i>? In the following verses it is clear that it refers to acts of creation in the past: <b>“Who forms light and creates [<i>boreh</i>] darkness”</b> (Isaiah 45:7), <b>“Who forms mountains and creates [<i>boreh</i>] wind”</b> (Amos 4:13), or <b>“Who creates [<i>boreh</i>] the heavens and stretches them out”</b> (Isaiah 42:5). <b>Rather, said Rav Yosef: With regard to both <i>bara</i> and <i>boreh</i>, everyone agrees that</b> they <b>mean created. Where they disagree is with regard to the light</b> of the fire or <b>the lights</b> of the fire. <b>As Beit Shammai hold</b> that <b>there is one light in a fire, and Beit Hillel hold</b> that <b>there are many lights in a fire, </b> as a flame consists of red, green, and white light. <b>That was also taught</b> in a <i>baraita</i>: <b>Beit Hillel said to Beit Shammai: There are many lights in the fire. </b>"
        },
        {
          "verseLocation": "Amos 4:13",
          "verseText": "wind, as it is stated: “For behold He forms the mountains and creates the wind”",
          "talmudLocation": "Chagigah 12b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12b#section-2",
          "talmudFullText": "§ <b>It is taught</b> in a <i>baraita</i>: <b>R' Yosei says: Woe to them, the creations, who see and know not what they see; </b> who <b>stand and know not upon what they stand. </b> He clarifies: <b>Upon what does the earth stand? Upon pillars, as it is stated: “Who shakes the earth out of its place, and its pillars tremble”</b> (Job 9:6). These <b>pillars</b> are positioned <b>upon water, as it is stated: “To Him Who spread forth the earth over the waters”</b> (Psalms 136:6). These <b>waters</b> stand <b>upon mountains, as it is stated: “The waters stood above the mountains”</b> (Psalms 104:6). The <b>mountains</b> are upon the <b>wind, as it is stated: “For behold He forms the mountains and creates the wind”</b> (Amos 4:13). The <b>wind</b> is <b>upon a storm, as it is stated: “Stormy wind, fulfilling His word”</b> (Psalms 148:8). The <b>storm hangs upon the arm of God as it is stated: “And underneath are the everlasting arms”</b> (Deuteronomy 33:27), which demonstrates that the entire world rests upon the arms of God."
        },
        {
          "verseLocation": "Amos 4:13",
          "verseText": "“For, lo, He Who forms the mountains, and creates the wind, and declares to man what is his speech”",
          "talmudLocation": "Chagigah 5b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/5b#section-7",
          "talmudFullText": "The Talmud relates that <b>R' Ila was ascending the stairs in the house of Rabba bar Sheila, </b> a children’s teacher. <b>He heard a child who was reading</b> a verse out loud: <b>“For, lo, He Who forms the mountains, and creates the wind, and declares to man what is his speech”</b> (Amos 4:13). R' Ila <b>said: </b> With regard to <b>a servant whose master declares to him what is his</b> proper <b>speech, is there a remedy for him? </b> The Talmud asks. <b>What</b> is the meaning of the phrase: <b>“What is his speech”? Rav said: Even frivolous speech that is between a man and his wife</b> before engaging in sex <b>is declared to a person at the time of death, </b> and he will have to account for it."
        },
        {
          "verseLocation": "Amos 4:13",
          "verseText": "as it is written: “For behold, He Who forms the mountains and He Who creates the wind”",
          "talmudLocation": "Chullin 87a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/87a#section-6",
          "talmudFullText": "The Talmud suggests: <b>Come</b> and <b>hear</b> a proof from an incident in <b>which a certain heretic said to R'</b> Yehuda HaNasi: <b>He who created mountains did not create wind, and he who created wind did not create mountains; </b> rather, each was created by a separate deity, <b>as it is written: “For behold, He Who forms the mountains and He Who creates the wind”</b> (Amos 4:13), indicating that there are two deities: One who forms the mountains and one who creates the wind. R' Yehuda HaNasi <b>said to him: Imbecile, go to the end of the verse, </b> which states: <b>“YHWH, the God of hosts, is His name. ”</b> The verse emphasizes that God is the One Who both forms and creates."
        },
        {
          "verseLocation": "Amos 4:13",
          "verseText": "“For He Who forms the mountains and creates the wind”",
          "talmudLocation": "Niddah 23a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/23a#section-7",
          "talmudFullText": "<b>R' Ami said to him: If that is so, </b> then in the case of a woman <b>who discharges</b> an item that has <b>the shape of a mountain, its mother</b> should be <b>impure</b> with the impurity of a woman after <b>childbirth, as it is stated</b> with regard to the creation of mountains: <b>“For He Who forms the mountains and creates the wind”</b> (Amos 4:13). R' Ḥiyya bar Abba <b>said to him: Does she discharge a mountain? </b> The discharged item cannot possibly be that large. <b>It is</b> an item with the form of <b>a stone that she discharges, </b> and <b>that is called a clod, </b> not a mountain."
        },
        {
          "verseLocation": "Amos 4:13",
          "verseText": "as it is stated: “For, lo, He forms mountains and creates wind”",
          "talmudLocation": "Sanhedrin 39a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39a#section-7",
          "talmudFullText": "<b>The emperor said to Rabban Gamliel: He Who created mountains did not create wind, </b> rather two separate gods created them, <b>as it is stated: “For, lo, He forms mountains and creates wind”</b> (Amos 4:13); one is described with the verb “forms,” and the other with the verb “creates. ” Rabban Gamliel said to him: <b>If that is so, </b> then <b>with regard to Adam, as it is written</b> concerning him: <b>“And</b> God <b>created”</b> (Genesis 1:27), and also: <b>“And</b> YHWH God <b>formed”</b> (Genesis 2:7), <b>so too</b> should one say that <b>He who created this did not create that? </b>"
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Amos 5:2",
          "verseText": "As it is written: “The virgin of Israel has fallen and she will rise no more;",
          "talmudLocation": "Berakhot 4b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/4b#section-21",
          "talmudFullText": "Additionally, with regard to this psalm, <b>R' Yoḥanan said: Why is there no</b> verse beginning with the letter <b><i>nun</i> in <i>ashrei</i>? Because it contains</b> an allusion to <b>the downfall of the enemies of Israel, </b> a euphemism for Israel itself. <b>As it is written: “The virgin of Israel has fallen and she will rise no more; </b> abandoned in her land, none will raise her up” (Amos 5:2), which begins with the letter <i>nun</i>. Due to this verse, <i>ashrei</i> does not include a verse beginning with the letter <i>nun</i>."
        },
        {
          "verseLocation": "Amos 5:4",
          "verseText": "upon one, as it is stated: “So says the Lord to the house of Israel: Seek Me and live”",
          "talmudLocation": "Makkot 24a:27",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/24a#section-27",
          "talmudFullText": "<b>Isaiah then established</b> the 613 mitzvot <b>upon two, as it is stated: “So says YHWH: Observe justice and perform righteousness”</b> (Isaiah 56:1). <b>Amos came and established</b> the 613 mitzvot <b>upon one, as it is stated: “So says YHWH to the house of Israel: Seek Me and live”</b> (Amos 5:4). <b>Rav Naḥman bar Yitzḥak objects to this: </b> There is no proof that the verse in Amos is establishing all the mitzvot upon one; <b>say</b> that Amos is saying: <b>Seek Me throughout the entire Torah, </b> as the verse does not specify the manner in which one should seek YHWH. <b>Rather, </b> say: <b>Habakkuk came and established</b> the 613 mitzvot <b>upon one, as it is stated: “But the righteous person shall live by his faith”</b> (Habakkuk 2:4)."
        },
        {
          "verseLocation": "Amos 5:8",
          "verseText": "it is written: “He Who makes Pleiades and Orion”",
          "talmudLocation": "Berakhot 58b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58b#section-12",
          "talmudFullText": "On the subject of stars, the Talmud notes that <b>Shmuel raised a contradiction</b> between the implications of two verses with regard to constellations. On the one hand <b>it is written: “Who makes Ursa Major, Orion, and Pleiades, </b> and the chambers of the south” (Job 9:9); Orion precedes Pleiades. <b>And</b> on the other hand <b>it is written: “He Who makes Pleiades and Orion”</b> (Amos 5:8); Pleiades precedes Orion. <b>So how</b> is this reconciled? The Talmud replies: <b>Were it not for Orion’s heat, the universe could not exist because of the cold of Pleiades; </b> and conversely, <b>were it not for the cold of Pleiades, the universe could not exist because of the heat of Orion. </b>"
        },
        {
          "verseLocation": "Amos 5:9",
          "verseText": "“He that causes destruction [ shod ] to flash upon the mighty,",
          "talmudLocation": "Shabbat 77b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/77b#section-7",
          "talmudFullText": "With regard to these creatures, the Talmud cites that which <b>our rabbis taught: There are five dreads, </b> i.e., <b>dread</b> that <b>the weak</b> cast <b>over</b> the <b>mighty: The dread of the <i>mafgia</i>, </b> a small creature, <b>over the lion; the dread of the mosquito over the elephant; the dread of the gecko over the scorpion; the dread of the swallow over the eagle; the dread of the <i>kilbit</i>, </b> a small fish, <b>over a whale. Rav Yehuda said</b> that <b>Rav said: What</b> is <b>the verse</b> that alludes to these matters? As it is written: <b>“He that causes destruction [<i>shod</i>] to flash upon the mighty, </b> so that destruction comes upon the fortress” (Amos 5:9), which is interpreted as: He who lifts the downtrodden [<i>shadud</i>] over the mighty."
        },
        {
          "verseLocation": "Amos 5:15",
          "verseText": "when Rabbi Asi reached this verse, he cried: “Hate the evil, and love the good, and establish justice in the gate; perhaps the Lord, the God of hosts, will be gracious”",
          "talmudLocation": "Chagigah 4b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/4b#section-10",
          "talmudFullText": "<b>When R' Ami reached this verse, he cried: “Let him put his mouth in the dust, perhaps there may be hope”</b> (Lamentations 3:29). <b>He said: </b> A sinner suffers through <b>all this</b> punishment <b>and</b> only <b>perhaps</b> there may be hope? <b>When R' Ami reached this verse, he cried: “Seek righteousness, seek humility; perhaps you shall be hidden on the day of YHWH’s anger”</b>(Zephaniah 2:3). <b>He said: All of this</b> is expected of each individual, <b>and</b> only <b>perhaps</b> God’s anger may be hidden? Likewise, <b>when R' Asi reached this verse, he cried: “Hate the evil, and love the good, and establish justice in the gate; perhaps YHWH, the God of hosts, will be gracious”</b> (Amos 5:15). <b>He said: All of this, and</b> only <b>perhaps? </b>"
        },
        {
          "verseLocation": "Amos 5:18",
          "verseText": "which is written: “Woe to you who desire the day of the Lord. Why would you have this day of the Lord? It is darkness, and not light”",
          "talmudLocation": "Sanhedrin 98b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98b#section-17",
          "talmudFullText": "§ <b>R' Simlai taught: What</b> is the meaning of that <b>which is written: “Woe to you who desire the day of YHWH. Why would you have this day of YHWH? It is darkness, and not light”</b> (Amos 5:18)? It is <b>comparable to a rooster and a bat who were looking forward to</b> the <b>light</b> of day. <b>The rooster said to the bat: I look forward to light, as light is</b> an indication of <b>my</b> time to be active. <b>But</b> as for <b>you, why do you</b> need <b>light? </b> Nighttime for you is like daytime for me."
        },
        {
          "verseLocation": "Amos 5:19",
          "verseText": "“As when a man did flee from a lion and a bear met him, or went into the house and leaned his arm on the wall and a snake bit him”",
          "talmudLocation": "Sanhedrin 98b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98b#section-8",
          "talmudFullText": "<b>And so</b> too <b>R' Yoḥanan said: Let</b> the Messiah <b>come, but</b> after my death, so that <b>I will not see him. Reish Lakish said to him: What is the reason</b> that you are concerned? <b>If we say it is because it is written</b> with regard to the day of God: <b>“As when a man did flee from a lion and a bear met him, or went into the house and leaned his arm on the wall and a snake bit him”</b> (Amos 5:19), that is not a reason. <b>Come, and I will show you a counterpart in this world</b> to the situation described in this verse, as even today one encounters those situations. <b>At a time when a person goes out to the field and is accosted by a guard [<i>santar</i>]</b> who demands payment, his situation <b>is similar to</b> that of <b>one who is accosted by a lion. He</b> then <b>enters the city and is accosted by</b> a royal <b>tax collector. </b> His situation <b>is similar to</b> that of <b>one who is accosted by a bear. He</b> then <b>enters his house and finds his sons and daughters afflicted with famine. </b> His situation <b>is similar to</b> that of <b>one whom a snake bit. </b>"
        },
        {
          "verseLocation": "Amos 5:25",
          "verseText": "in the wilderness,",
          "talmudLocation": "Chagigah 10b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/10b#section-9",
          "talmudFullText": "<b>Rather, </b> the Talmud rejects this explanation in favor of the claim that the source for a Festival peace-offering <b>comes</b> from a verbal analogy between the term <b>“wilderness”</b> stated here and the term: <b>“wilderness”</b> stated elsewhere. <b>It is written here: “They shall make an offering to Me in the wilderness”</b> (Exodus 5:1), <b>and it is written there: “Did you bring to Me sacrifices and offerings</b> forty years <b>in the wilderness, </b> house of Israel? ” (Amos 5:25). <b>Just as there</b> it is referring to actual <b>animal offerings, so too here, </b> it is referring to <b>animal offerings, </b> not merely the celebration of a Festival."
        },
        {
          "verseLocation": "Amos 5:25",
          "verseText": "“Did you bring to Me sacrifices and offerings for forty years in the wilderness, house of Israel?”",
          "talmudLocation": "Chagigah 6b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/6b#section-4",
          "talmudFullText": "<b>R' Akiva says: It was sacrificed</b> when they stood at Mount Sinai <b>and</b> its sacrifice <b>never ceased. </b> The Talmud asks: <b>But</b> if so, <b>how do I uphold, </b> i.e., how does R' Akiva explain the following verse: <b>“Did you bring to Me sacrifices and offerings for forty years in the wilderness, house of Israel? ”</b> (Amos 5:25). This verse indicates that they did not sacrifice these offerings."
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "Amos 6:4",
          "verseText": "from those about whom it is written: “That lie upon beds of ivory, and stretch themselves upon their couches”",
          "talmudLocation": "Kiddushin 71b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/71b#section-6",
          "talmudFullText": "<b>And if you would say</b> that you are not concerned about that possibility, since you maintain that in the case of <b>a non-Jew or a slave who had sex with a Jewish woman, </b> the lineage of <b>the offspring is unflawed, perhaps</b> we come <b>from those about whom it is written: “That lie upon beds of ivory, and stretch themselves upon their couches”</b> (Amos 6:4), <b>and R' Yosei ben Ḥanina, says</b> in explanation of this verse: <b>These are people who urinate naked before their couches. </b>"
        },
        {
          "verseLocation": "Amos 6:4",
          "verseText": "will ultimately be exiled, as it is stated: “And eat the lambs of the flock and the calves out of the midst of the stall”",
          "talmudLocation": "Pesachim 49a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/49a#section-18",
          "talmudFullText": "<b>R' Yitzḥak said: Anyone who benefits from</b> partaking in <b>an optional feast, </b> which is not a mitzva, <b>will ultimately be exiled, as it is stated: “And eat the lambs of the flock and the calves out of the midst of the stall”</b> (Amos 6:4), <b>and it is written: “Therefore now they shall go into exile at the head of the exiles; </b> and the revelry of those who stretched themselves out shall pass away” (Amos 6:7)."
        },
        {
          "verseLocation": "Amos 6:4",
          "verseText": "“That lie upon beds of ivory and stretch [ seruḥim ] upon their couches",
          "talmudLocation": "Shabbat 62b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/62b#section-10",
          "talmudFullText": "The Talmud interprets additional verses related to the critique of the leadership of Samaria. It is stated: <b>“That lie upon beds of ivory and stretch [<i>seruḥim</i>] upon their couches</b> and eat the lambs out of the flock and the calves out of the midst of the stall” (Amos 6:4). <b>R' Yosei ben Ḥanina, said: This</b> term, <i>seruḥim</i>, interpreted homiletically, <b>teaches</b> that their sin was that <b>they would urinate before their beds</b> while <b>naked. </b>"
        },
        {
          "verseLocation": "Amos 6:6",
          "verseText": "and anoint themselves with the chief ointments;",
          "talmudLocation": "Shabbat 62b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/62b#section-6",
          "talmudFullText": "Related to the mention of perfume, the Talmud cites several statements. It is stated: “That drink wine in <i>mizrekei</i>, <b>and anoint themselves with the chief ointments; </b> but they are not grieved for the hurt of Joseph” (Amos 6:6). <b>Rav Yehuda said</b> that <b>Shmuel said: “</b>The chief ointments” <b>is balsam oil. </b>"
        },
        {
          "verseLocation": "Amos 6:7",
          "verseText": "from here: “And the revelry [ mirzaḥ ] of those who stretched themselves shall pass away [ sar ]”",
          "talmudLocation": "Ketubot 69b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/69b#section-3",
          "talmudFullText": "<b>Mar Zutra said: </b> That the mourner sits at the head may be derived <b>from here: “And the revelry [<i>mirzaḥ</i>] of those who stretched themselves shall pass away [<i>sar</i>]”</b> (Amos 6:7). The word <i>mirzaḥ</i> may alternatively be read as two distinct words: Bitter [<i>mar</i>] and flustered [<i>zaḥ</i>], and the word <i>sar</i> has a homonym that means ruler. Read this way, the verse indicates: One who is <b>bitter and flustered, </b> i.e., the mourner, <b>is made</b> the <b>ruler of those who sit, </b> i.e., the visitors who come to comfort him and sit with him. Therefore, he sits at the head."
        },
        {
          "verseLocation": "Amos 6:7",
          "verseText": "is this what is written: “Therefore now shall they go captive at the head of them that go captive”",
          "talmudLocation": "Kiddushin 71b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/71b#section-7",
          "talmudFullText": "<b>And R' Abbahu ridiculed this</b> interpretation and said: <b>If so, </b> if this was their sin, <b>is this what is written: “Therefore now shall they go captive at the head of them that go captive”</b> (Amos 6:7)? Could it be that <b>because they urinated naked before their couches</b> that <b>they go captive at the head of them that go captive? </b> That act is admittedly distasteful, but it is not so severe a transgression to warrant such a punishment."
        },
        {
          "verseLocation": "Amos 6:7",
          "verseText": "“And the revelry [ mirzaḥ ] of those who stretched themselves out shall pass away [ sar ]”",
          "talmudLocation": "Moed Katan 28b:26",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/28b#section-26",
          "talmudFullText": "<b>Mar Zutra said: </b> A proof may be derived <b>from here: </b> The verse <b>“And the revelry [<i>mirzaḥ</i>] of those who stretched themselves out shall pass away [<i>sar</i>]”</b> (Amos 6:7) means that <b><i>mirzaḥ</i>, </b> he who is bitter [<i>mar</i>] and whose mind is overwrought <b>[</b><i>zaḥ</i><b>]</b> due to grief, <b>is made a prince [<i>sar</i>] over those who</b> sit beside him <b>stretched out</b> below him to comfort him."
        },
        {
          "verseLocation": "Amos 6:7",
          "verseText": "and it is written: “Therefore now they shall go into exile at the head of the exiles;",
          "talmudLocation": "Pesachim 49a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/49a#section-18",
          "talmudFullText": "<b>R' Yitzḥak said: Anyone who benefits from</b> partaking in <b>an optional feast, </b> which is not a mitzva, <b>will ultimately be exiled, as it is stated: “And eat the lambs of the flock and the calves out of the midst of the stall”</b> (Amos 6:4), <b>and it is written: “Therefore now they shall go into exile at the head of the exiles; </b> and the revelry of those who stretched themselves out shall pass away” (Amos 6:7)."
        },
        {
          "verseLocation": "Amos 6:7",
          "verseText": "that which is written: “Therefore now they shall go into exile at the head of the exiles",
          "talmudLocation": "Shabbat 62b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/62b#section-11",
          "talmudFullText": "<b>R' Abbahu ridiculed that</b> interpretation: <b>If so, </b> that this is the meaning of the term <i>seruḥim</i>, <b>is this</b> the meaning of <b>that which is written: “Therefore now they shall go into exile at the head of the exiles</b> and the revelry of those <i>seruḥim</i> shall pass away” (Amos 6:7), <b>because they urinate before their beds</b> while <b>naked they will be exiled at the head of exiles? </b> Although doing so is revolting, a punishment so severe is certainly excessive."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Amos 7:5",
          "verseText": "cease, I beseech You; how shall Jacob stand,",
          "talmudLocation": "Makkot 24a:28",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/24a#section-28",
          "talmudFullText": "§ <b>R' Yosei bar Ḥanina says: Moses our teacher issued four decrees upon the Jewish people, </b> and <b>four prophets came and revoked them. Moses said: “And Israel dwells in safety, the fountain [<i>ein</i>] of Jacob alone”</b> (Deuteronomy 33:28), indicating that the Jewish people will dwell in safety only when they reach a lofty spiritual level similar to [<i>me’ein</i>] that of Jacob our forefather. <b>Amos came and revoked it, as it is stated: </b> “Lord God, <b>cease, I beseech You; how shall Jacob stand, </b> as he is small” (Amos 7:5), <b>and</b> immediately afterward <b>it states: “YHWH regretted this; </b> it too shall not be, says YHWH God” (Amos 7:6)."
        },
        {
          "verseLocation": "Amos 7:6",
          "verseText": "it states: “The Lord regretted this;",
          "talmudLocation": "Makkot 24a:28",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/24a#section-28",
          "talmudFullText": "§ <b>R' Yosei bar Ḥanina says: Moses our teacher issued four decrees upon the Jewish people, </b> and <b>four prophets came and revoked them. Moses said: “And Israel dwells in safety, the fountain [<i>ein</i>] of Jacob alone”</b> (Deuteronomy 33:28), indicating that the Jewish people will dwell in safety only when they reach a lofty spiritual level similar to [<i>me’ein</i>] that of Jacob our forefather. <b>Amos came and revoked it, as it is stated: </b> “Lord God, <b>cease, I beseech You; how shall Jacob stand, </b> as he is small” (Amos 7:5), <b>and</b> immediately afterward <b>it states: “YHWH regretted this; </b> it too shall not be, says YHWH God” (Amos 7:6)."
        },
        {
          "verseLocation": "Amos 7:7",
          "verseText": "mistreatment, as it is stated: “And behold, the Lord stood upon a wall built with a plumb line, and a plumb line in His hand”",
          "talmudLocation": "Bava Metzia 59a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/59a#section-7",
          "talmudFullText": "<b>Rav Ḥisda says: All the gates</b> of Heaven are apt to be <b>locked, except for the gates</b> of prayer for victims <b>of</b> verbal <b>mistreatment, as it is stated: “And behold, YHWH stood upon a wall built with a plumb line, and a plumb line in His hand”</b> (Amos 7:7). God stands with the scales of justice in His hand to determine if one has been subjected to injustice. <b>R' Elazar says: </b> In response to <b>all</b> transgressions, God <b>punishes</b> the perpetrator <b>by means of an agent, except for mistreatment [<i>ona’a</i>], as it is stated: “And a plumb line [<i>anakh</i>] in His hand. ”</b> The term for mistreatment and the term for plumb line are spelled in a similar manner, indicating that God Himself inflicts retribution."
        },
        {
          "verseLocation": "Amos 7:7",
          "verseText": "From the roof to the wall, as it is written: “And behold, the Lord stood upon a wall made by a plumb line”",
          "talmudLocation": "Rosh Hashanah 31a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/31a#section-16",
          "talmudFullText": "<b>And from the threshold</b> of the Sanctuary the Shekhina went <b>to the courtyard, as it is written: “And the House was filled with the cloud and the courtyard was full of the brightness of YHWH’s glory”</b> (Ezekiel 10:4). <b>From the courtyard to the altar, as it is written: “I saw YHWH standing on the altar”</b> (Amos 9:1). <b>And from the altar to the roof, as it is written: “It is better to dwell in a corner of the roof</b> than in a house together with a contentious woman” (Proverbs 21:9). <b>From the roof to the wall, as it is written: “And behold, YHWH stood upon a wall made by a plumb line”</b> (Amos 7:7). <b>From the wall to the city, as it is written: “YHWH’s voice cries to the city”</b> (Micah 6:9)."
        },
        {
          "verseLocation": "Amos 7:10",
          "verseText": "that he did not accept slander? As it is written: “Then Amaziah the priest of Beth-El sent to Jeroboam king of Israel, saying: Amos has conspired against you",
          "talmudLocation": "Pesachim 87b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-12",
          "talmudFullText": "<b>And from where do we</b> derive <b>that he did not accept slander? As it is written: “Then Amaziah the priest of Beth-El sent to Jeroboam king of Israel, saying: Amos has conspired against you</b> in the midst of the house of Israel” (Amos 7:10). <b>And it is written: “For thus said Amos: Jeroboam shall die by the sword</b> and Israel shall surely be led away captive out of his land” (Amos 7:11). Jeroboam <b>said: Heaven forfend</b> that <b>that righteous person, </b> Amos, <b>said this, </b> that I will die by the sword; <b>and if he</b> indeed <b>said</b> it, <b>what shall I do to him</b> and why should I punish him? <b>The Shekhina said it to him, </b> and he is required to transmit his prophecy."
        },
        {
          "verseLocation": "Amos 7:11",
          "verseText": "And it is written: “For thus said Amos: Jeroboam shall die by the sword",
          "talmudLocation": "Pesachim 87b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-12",
          "talmudFullText": "<b>And from where do we</b> derive <b>that he did not accept slander? As it is written: “Then Amaziah the priest of Beth-El sent to Jeroboam king of Israel, saying: Amos has conspired against you</b> in the midst of the house of Israel” (Amos 7:10). <b>And it is written: “For thus said Amos: Jeroboam shall die by the sword</b> and Israel shall surely be led away captive out of his land” (Amos 7:11). Jeroboam <b>said: Heaven forfend</b> that <b>that righteous person, </b> Amos, <b>said this, </b> that I will die by the sword; <b>and if he</b> indeed <b>said</b> it, <b>what shall I do to him</b> and why should I punish him? <b>The Shekhina said it to him, </b> and he is required to transmit his prophecy."
        },
        {
          "verseLocation": "Amos 7:14",
          "verseText": "said to them: “I am no prophet, neither am I a prophet’s son”",
          "talmudLocation": "Bava Kamma 50a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/50a#section-21",
          "talmudFullText": "<b>They said to her: Who brought you up</b> out of the well? <b>She said to them: A male sheep, </b> i.e., a ram, <b>happened</b> to come <b>to me, and a certain old man, </b> i.e., Abraham, <b>was leading it, </b> and he pulled me out. <b>They said to</b> R' Ḥanina ben Dosa: <b>Are you a prophet? </b> How did you know she had ascended? R' Ḥanina ben Dosa <b>said to them: “I am no prophet, neither am I a prophet’s son”</b> (Amos 7:14), <b>but this</b> is what <b>I said</b> to myself: <b>Shall the offspring</b> of Neḥunya <b>stumble by means of</b> the very <b>matter which distressed that righteous man? </b>"
        },
        {
          "verseLocation": "Amos 7:14",
          "verseText": "as it is written: “Then answered Amos, and said to Amaziah: I am neither a prophet, nor son of a prophet, but I am a herdsman, and a dresser of sycamore-trees”",
          "talmudLocation": "Nedarim 38a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/38a#section-14",
          "talmudFullText": "<b>Amos</b> was wealthy, <b>as it is written: “Then answered Amos, and said to Amaziah: I am neither a prophet, nor son of a prophet, but I am a herdsman, and a dresser of sycamore-trees”</b> (Amos 7:14). Amos is saying, <b>as Rav Yosef translates: Because I am the owner of flocks and I have sycamores in the lowland, </b> and I do not come to prophesy for financial gain. Apparently, Amos was wealthy."
        },
        {
          "verseLocation": "Amos 7:14",
          "verseText": "“I am not a prophet, nor the son of a prophet am I”",
          "talmudLocation": "Yevamot 121b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/121b#section-7",
          "talmudFullText": "When she came to R' Ḥanina ben Dosa, <b>he said to her: My daughter, who pulled you up</b> from the cistern? <b>She said to him: A male sheep, </b> i.e., a ram, <b>happened by</b> and sensed <b>me</b> in that cistern, <b>and</b> there was <b>an old man leading him</b> who pulled me out. <b>They said</b> to R' Ḥanina ben Dosa: <b>Are you a prophet</b> with knowledge of what is happening far away? <b>He said to them, </b> using a figure of speech from the Bible: <b>“I am not a prophet, nor the son of a prophet am I”</b> (Amos 7:14). <b>Rather, </b> I reasoned as follows: Could it be that concerning <b>the endeavor that the righteous</b> Neḥunya <b>is engaged</b> in, i.e., digging for the benefit of the public, <b>his offspring would stumble upon</b> its fruits and thereby be killed? I therefore knew that God would certainly save her."
        },
        {
          "verseLocation": "Amos 7:17",
          "verseText": "“You shall die in an unclean land”",
          "talmudLocation": "Ketubot 111a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/111a#section-10",
          "talmudFullText": "§ The Talmud relates: <b>Ulla was accustomed to ascend to Eretz Yisrael</b> from time to time. However, <b>he died outside</b> of <b>Eretz</b> Yisrael. <b>They came and said to R' Elazar</b> that Ulla had passed away. <b>He said: </b> Woe for <b>you Ulla, </b> as through you a verse was fulfilled: <b>“You shall die in an unclean land”</b> (Amos 7:17). <b>They said to him: But his coffin is coming</b> for burial in Eretz Yisrael. <b>He said to them: </b> Even so, <b>one who was absorbed</b> by the soil of Eretz Yisrael <b>while</b> he was yet <b>alive is not similar to one who was absorbed</b> only <b>after death. </b>"
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "Amos 8:7",
          "verseText": "And it is written: “The Lord has sworn by the pride of Jacob: Surely I will never forget any of their works”",
          "talmudLocation": "Bava Batra 90b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/90b#section-4",
          "talmudFullText": "<b>A baraita states: Hoarders of produce, </b> who drive up prices by causing a shortage of available goods, <b>and usurers, and those</b> sellers <b>who</b> falsely <b>reduce</b> their <b>measures, and those who raise</b> market <b>prices</b> by selling for more than the accepted price, <b>about them the verse states: </b> “You that would swallow the needy and destroy the poor of the land, <b>saying: When will the new moon be gone, that we may sell produce? And the Shabbat, that we may set forth grain? Making the measure small, and the shekel great, and falsifying the balances of deceit”</b> (Amos 8:4–5). <b>And it is written: “YHWH has sworn by the pride of Jacob: Surely I will never forget any of their works”</b> (Amos 8:7)."
        },
        {
          "verseLocation": "Amos 8:10",
          "verseText": "and the end will be like a bitter day”",
          "talmudLocation": "Berakhot 16b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/16b#section-8",
          "talmudFullText": "<strong>Talmud: </strong> With regard to Rabban Gamliel’s bathing on the first night after the death of his wife, the Talmud asks: <b>What is the reason</b> that <b>Rabban Gamliel</b> did not practice the customs of mourning after his wife died? The Talmud answers: <b>He holds that</b> acute mourning [<i>aninut</i>] is in effect only on the day of the death itself, but <b>acute mourning at night is</b> only <b>by rabbinic law, as it is written: </b> “And I will turn your feasts into mourning, and all your songs into lamentations; I will bring sackcloth upon your loins and baldness upon every head; and I will make you like a mourner for an only child, <b>and the end will be like a bitter day”</b> (Amos 8:10). Therefore, by Torah law one’s acute mourning is only during the day, like a bitter day, while the acute mourning at night that follows is only rabbinic. <b>And in the case of a delicate person, the rabbis did not issue a decree</b> that one should afflict himself during the period of acute mourning."
        },
        {
          "verseLocation": "Amos 8:10",
          "verseText": "A mourner is prohibited from performing work, as it is written: “And I will turn your Festivals into mourning”",
          "talmudLocation": "Moed Katan 15b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/15b#section-2",
          "talmudFullText": "§ The Talmud proceeds to the next topic: <b>A mourner is prohibited from performing work, as it is written: “And I will turn your Festivals into mourning”</b> (Amos 8:10). The Talmud infers: <b>Just as a Festival</b> is a time when it is <b>prohibited to work, so too, a mourner is prohibited from performing work. </b>"
        },
        {
          "verseLocation": "Amos 8:10",
          "verseText": "As it is written: “And I will turn your Festivals into mourning”",
          "talmudLocation": "Moed Katan 20a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/20a#section-10",
          "talmudFullText": "§ It was related that <b>R' Ḥiyya bar Abba, R' Ami, and R' Yitzḥak Nappaḥa were</b> once <b>sitting in the pavilion of R' Yitzḥak ben Elazar</b> and were conversing. <b>A matter emerged from among them: From where</b> is it derived that the rites of <b>mourning</b> are observed for <b>seven</b> days? <b>As it is written: “And I will turn your Festivals into mourning”</b> (Amos 8:10). <b>Just as a Festival</b> lasts for <b>seven</b> days, <b>so too mourning</b> lasts for <b>seven</b> days."
        },
        {
          "verseLocation": "Amos 8:10",
          "verseText": "and its end as a bitter day”",
          "talmudLocation": "Moed Katan 21a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/21a#section-11",
          "talmudFullText": "<b>Rav Mattana said: What is the reason of R' Eliezer? As it is written: “And the days of weeping and mourning for Moses ended”</b> (Deuteronomy 34:8). The plural term “days” implies a minimum of two, and it indicates that the main portion of the mourning period is the first two full days. <b>Rav Eina said: What is the reason of R' Yehoshua? As it is written: </b> “And I will make it as the mourning for an only son, <b>and its end as a bitter day”</b> (Amos 8:10), i.e., a single “day. ”"
        },
        {
          "verseLocation": "Amos 8:10",
          "verseText": "and the end thereof as a bitter day”",
          "talmudLocation": "Sukkah 25b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/25b#section-5",
          "talmudFullText": "The Talmud comments: <b>This</b> exemption <b>applies</b> only <b>on the first day</b> of mourning, <b>as it is written: </b> “And I will make it as the mourning for an only son, <b>and the end thereof as a bitter day”</b> (Amos 8:10). From this verse it is derived that the primary bitterness of a mourner lasts only one day."
        },
        {
          "verseLocation": "Amos 8:10",
          "verseText": "and the end thereof as a bitter day”",
          "talmudLocation": "Zevachim 100b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/100b#section-12",
          "talmudFullText": "<b>And furthermore, </b> if we are dealing with the day of death, then when <b>R'</b> Yehuda HaNasi <b>says: As long as</b> his relative <b>has not been buried, </b> it indicates that <b>consequently, </b> once he <b>has buried him, it becomes permitted for him</b> to partake of sacrificial meat, even on the day of death itself. <b>But is there</b> a <i>tanna</i> <b>who does not hold</b> that acute mourning extends for the entire day of death, even after burial? The verse states: “And I will turn your feasts into mourning, and all your songs into lamentation; and I will bring up sackcloth upon all loins, and baldness upon every head; and I will make it as the mourning for an only son, <b>and the end thereof as a bitter day”</b> (Amos 8:10)."
        },
        {
          "verseLocation": "Amos 8:11",
          "verseText": "it is stated: “Behold, days are approaching, says the Lord God, and I will send forth a hunger in the land, not a hunger for bread and not a thirst for water, but for hearing the words of the Lord”",
          "talmudLocation": "Shabbat 138b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/138b#section-10",
          "talmudFullText": "<b>A baraita states</b> a similar idea in the <i>Tosefta</i>: <b>When our rabbis entered the vineyard in Yavne, they said: The Torah is destined to be forgotten from the Jewish people, </b> as <b>it is stated: “Behold, days are approaching, says YHWH God, and I will send forth a hunger in the land, not a hunger for bread and not a thirst for water, but for hearing the words of YHWH”</b> (Amos 8:11). <b>And it states: “And they will drift from sea to sea, and from north to east they will roam to find the word of YHWH, but they will not find it”</b> (Amos 8:12)."
        },
        {
          "verseLocation": "Amos 8:12",
          "verseText": "And it states: “And they will drift from sea to sea, and from north to east they will roam to find the word of the Lord, but they will not find it”",
          "talmudLocation": "Shabbat 138b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/138b#section-10",
          "talmudFullText": "<b>A baraita states</b> a similar idea in the <i>Tosefta</i>: <b>When our rabbis entered the vineyard in Yavne, they said: The Torah is destined to be forgotten from the Jewish people, </b> as <b>it is stated: “Behold, days are approaching, says YHWH God, and I will send forth a hunger in the land, not a hunger for bread and not a thirst for water, but for hearing the words of YHWH”</b> (Amos 8:11). <b>And it states: “And they will drift from sea to sea, and from north to east they will roam to find the word of YHWH, but they will not find it”</b> (Amos 8:12)."
        },
        {
          "verseLocation": "Amos 8:14",
          "verseText": "Dan is nothing other than a term of idol worship, as it is stated: “They that swear by the sin of Samaria and say: As your god Dan lives”",
          "talmudLocation": "Shabbat 67b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/67b#section-3",
          "talmudFullText": "One who says: <b>Let my jugs be strengthened [<i>donu danei</i>], </b> that <b>contains an element of the ways of the Amorite. R' Yehuda says: </b> That is more severe than the ways of the Amorite, as <b><i>Dan</i> is nothing other than a term of idol worship, as it is stated: “They that swear by the sin of Samaria and say: As your god <i>Dan</i> lives”</b> (Amos 8:14)."
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "Amos 9:1",
          "verseText": "From the courtyard to the altar, as it is written: “I saw the Lord standing on the altar”",
          "talmudLocation": "Rosh Hashanah 31a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/31a#section-16",
          "talmudFullText": "<b>And from the threshold</b> of the Sanctuary the Shekhina went <b>to the courtyard, as it is written: “And the House was filled with the cloud and the courtyard was full of the brightness of YHWH’s glory”</b> (Ezekiel 10:4). <b>From the courtyard to the altar, as it is written: “I saw YHWH standing on the altar”</b> (Amos 9:1). <b>And from the altar to the roof, as it is written: “It is better to dwell in a corner of the roof</b> than in a house together with a contentious woman” (Proverbs 21:9). <b>From the roof to the wall, as it is written: “And behold, YHWH stood upon a wall made by a plumb line”</b> (Amos 7:7). <b>From the wall to the city, as it is written: “YHWH’s voice cries to the city”</b> (Micah 6:9)."
        },
        {
          "verseLocation": "Amos 9:6",
          "verseText": "the house afterward? As it is stated: “It is He Who builds His upper chambers in the heaven, and has founded His vault upon the earth”",
          "talmudLocation": "Chagigah 12a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12a#section-17",
          "talmudFullText": "<b>Beit Hillel said to Beit Shammai: According to your words, </b> does <b>a person build a second floor and build</b> the first floor of <b>the house afterward? As it is stated: “It is He Who builds His upper chambers in the heaven, and has founded His vault upon the earth”</b> (Amos 9:6), indicating that the upper floor, heaven, was built above the earth. <b>Beit Shammai said to Beit Hillel: According to your words, </b> does <b>a person make a stool</b> for his feet, <b>and make a seat afterward? As it is stated: “So said YHWH: The heavens are My seat, and the earth My footstool”</b> (Isaiah 66:1). <b>But the Rabbis say: </b> Both <b>this and that were created as one, for it is stated: “Indeed, My hand has laid the foundation of the earth, and My right hand has spread out the heavens; when I call to them, they stand up together”</b> (Isaiah 48:13), implying that they were created as one."
        },
        {
          "verseLocation": "Amos 9:6",
          "verseText": "and has established His bundle on the earth”",
          "talmudLocation": "Keritot 6b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/6b#section-18",
          "talmudFullText": "<b>Rav Ḥana bar Bizna says</b> that <b>R' Shimon Ḥasida says: Any fast that does not include</b> the participation of some <b>of the sinners of the Jewish people is not a fast, as the smell of galbanum is foul and</b> yet <b>the verse lists it with the ingredients of the incense. Abaye says</b> that this is derived <b>from here: </b> “It is He Who builds His upper chambers in the heavens <b>and has established His bundle on the earth”</b> (Amos 9:6), i.e., when the people are united as a bundle, including their sinners, they are established upon the earth."
        },
        {
          "verseLocation": "Amos 9:6",
          "verseText": "in a single bundle, as it is stated: “It is He that builds His upper chambers in the Heaven, and has established His bundle upon the earth”",
          "talmudLocation": "Menachot 27a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/27a#section-23",
          "talmudFullText": "<b>And so too, </b> when <b>the Jewish people</b> fast and pray <b>for acceptance</b> of their repentance, this is not accomplished <b>until they are all</b> bound together <b>in a single bundle, as it is stated: “It is He that builds His upper chambers in the Heaven, and has established His bundle upon the earth”</b> (Amos 9:6), which is interpreted as stating that only when the Jewish people are bound together are they established upon the earth. This <i>baraita</i> contradicts Rav Ḥanan bar Rava’s statement, since it teaches that the four species of the <i>lulav</i> must be taken together in order for one to fulfill his obligation of taking the <i>lulav</i>."
        },
        {
          "verseLocation": "Amos 9:7",
          "verseText": "“Are you not as much Mine as the children of the Cushites, O children of Israel?”",
          "talmudLocation": "Moed Katan 16b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16b#section-20",
          "talmudFullText": "<b>Similarly, you can explain</b> the verse: <b>“Are you not as much Mine as the children of the Cushites, O children of Israel? ”</b> (Amos 9:7). <b>Is their name Cushite? Israel is their name. Rather, just as a Cushite is distinguished by his</b> dark <b>skin, so too, the Jewish people are distinguished by their actions, </b> and they are different <b>from all the</b> other <b>nations. </b>"
        },
        {
          "verseLocation": "Amos 9:11",
          "verseText": "the Tabernacle of David that is fallen [ hanofelet ]”",
          "talmudLocation": "Sanhedrin 97a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/97a#section-1",
          "talmudFullText": "<b>the Tabernacle of David that is fallen [<i>hanofelet</i>]”</b> (Amos 9:11). That is why the Messiah is called <i>bar nifli</i>. R' Yitzḥak <b>said to him</b> that <b>this</b> is what <b>R' Yoḥanan says: </b> During <b>the generation in which</b> the Messiah, <b>son of David, comes, Torah scholars decrease; and</b> as for <b>the rest</b> of the people, <b>their eyes fail with sorrow and grief, and troubles increase. And the harsh decrees will be introduced; before the first passes the second quickly comes. </b>"
        },
        {
          "verseLocation": "Amos 9:14",
          "verseText": "“And I will turn the captivity of My people Israel",
          "talmudLocation": "Berakhot 28a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/28a#section-8",
          "talmudFullText": "<b>R' Yehoshua said to</b> Rabban Gamliel: That is no proof. <b>Wasn’t it already stated</b> in another prophecy: <b>“And I will turn the captivity of My people Israel</b> and they shall build the waste cities, and inhabit them; and they shall plant vineyards, and drink the wine thereof; they shall also make gardens, and eat the fruit of them” (Amos 9:14), <b>and they have not yet returned? </b> In rendering the ruling, only proven facts may be taken into consideration. <b>They immediately permitted him to enter the congregation. </b> This proves that Rabban Gamliel did not absent himself from the study hall that day and participated in the halakhic discourse."
        }
      ]
    }
  ]
}