{
  "bookName": "Job",
  "totalEntries": 288,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Job 1:1",
          "verseText": "it is written here: “There was a man in the land of Utz, whose name was Job”",
          "talmudLocation": "Bava Batra 15a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15a#section-14",
          "talmudFullText": "Rava says: Job lived at the time of the spies whom Moses sent to scout the land of Canaan. This is proven by the fact that it is written here: “There was a man in the land of Utz, whose name was Job” (Job 1:1), and it is written there in the account of the spies: “Whether there are trees [eitz] in it” (Numbers 13:20). The Talmud asks: Is it comparable? Here the word that is used is Utz,  whereas there the word is eitz.  The Talmud answers: This is what Moses said to Israel,  i.e., to the spies: Is that man named Job still alive, he whose years are as long as the years of a tree and who protects his generation like a tree?  This is why the allusion to him here is through the word eitz, rather than Utz."
        },
        {
          "verseLocation": "Job 1:1",
          "verseText": "to you, the verse states: “There was a man in the Land of Utz whose name was Job”",
          "talmudLocation": "Bava Batra 15a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15a#section-15",
          "talmudFullText": "The Talmud relates that one of the rabbis sat before R' Shmuel bar Naḥmani and he sat and said: Job never existed and was never created;  there was never such a person as Job. Rather,  his story was a parable.  R' Shmuel bar Naḥmani said to him:  In rebuttal to you, the verse states: “There was a man in the Land of Utz whose name was Job” (Job 1:1), which indicates that such a man did indeed exist."
        },
        {
          "verseLocation": "Job 1:1",
          "verseText": "wholehearted and upright, and God-fearing, and shunned evil”",
          "talmudLocation": "Sotah 27b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/27b#section-14",
          "talmudFullText": "R' Yehoshua said: Who will remove the dirt from your eyes, Rabban Yoḥanan ben Zakkai,  so that you could live and see this? As you taught all your life that Job worshipped God only out of fear, as it is stated:  “And that man was wholehearted and upright, and God-fearing, and shunned evil” (Job 1:1); but now Yehoshua ben Hyrcanus, the disciple of your disciple, has taught that Job acted out of love. "
        },
        {
          "verseLocation": "Job 1:1",
          "verseText": "“God-fearing”",
          "talmudLocation": "Sotah 31a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/31a#section-6",
          "talmudFullText": "It is taught in a baraita (Tosefta 6:1) that R' Meir says: It is stated with regard to Job that he was “God-fearing” (Job 1:1), and it is stated with regard to Abraham that he was “God-fearing” (Genesis 22:12). Just as the description “God-fearing, ” which is stated with regard to Abraham,  is referring to Abraham’s fearing God out of love, so too,  the description “God-fearing” that is stated with regard to Job indicates that Job feared God out of love. "
        },
        {
          "verseLocation": "Job 1:7",
          "verseText": "From going to and fro [ mishut ] the earth",
          "talmudLocation": "Yoma 77b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/77b#section-16",
          "talmudFullText": "The Talmud continues its discussion of the river that will in the future come out of the Holy of Holies. R' Yehuda ben Pazi said: Even the Angel of Death does not have permission to pass through it to the other side of this river, and proof of this is in the verse, as it is written here: “No galley with oars [ani shayt] can travel” and as it was written there:  “Then Satan answered YHWH and said: From going to and fro [mishut] the earth and from walking up and down in it” (Job 1:7). Even Satan, who is also the Angel of Death, cannot cross through this river."
        },
        {
          "verseLocation": "Job 1:8",
          "verseText": "“And the Lord said to the Satan: Have you considered My servant Job, that there is none like him on earth,",
          "talmudLocation": "Bava Batra 15b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-13",
          "talmudFullText": "“And YHWH said to the Satan: Have you considered My servant Job, that there is none like him on earth,  a perfect and upright man, one who fears God and turns away from evil? ” (Job 1:8). About this R' Yoḥanan says: That which is stated about Job is greater than that which is stated about Abraham. As with regard to Abraham it is written: “For now I know that you fear God” (Genesis 22:12), with regard to Job it is written: “A perfect and an upright man, one who fears God and turns away from evil” (Job 1:8)."
        },
        {
          "verseLocation": "Job 1:10",
          "verseText": "“And his livestock is increased [ paratz ] in the land”",
          "talmudLocation": "Bava Batra 15b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-16",
          "talmudFullText": "The Talmud continues with its explication of these verses. What is meant by: “And his livestock is increased [paratz] in the land” (Job 1:10)? R' Yosei bar Ḥanina says: Job’s livestock breached [paretzu] the order of the world.  It is the way of the world that wolves kill goats,  but in the case of Job’s livestock, the goats killed the wolves. "
        },
        {
          "verseLocation": "Job 1:10",
          "verseText": "which is written: “You have blessed the work of his hands”",
          "talmudLocation": "Pesachim 112a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/112a#section-11",
          "talmudFullText": "Rav Pappa said in explanation of this last statement: Do not buy from him and do not sell to him.  If he is the beneficiary of good fortune, he will profit from any business transaction and you will suffer from it. Rather, form a partnership with him. And now we have heard that Rav Shmuel bar Yitzḥak said: What is the meaning of that which is written: “You have blessed the work of his hands” (Job 1:10)? This means that anyone who took a peruta from Job would be blessed,  even if he received it via a business transaction. This shows that one should engage in business with a person who is blessed, for even if he wishes to buy from him or to sell to him it is well,  i.e., he will share in the good fortune of the other."
        },
        {
          "verseLocation": "Job 1:12",
          "verseText": "and it is written here: “Only upon himself do not put forth your hand”",
          "talmudLocation": "Bava Batra 16a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-8",
          "talmudFullText": "Reish Lakish says: Satan, the evil inclination, and the Angel of Death are one,  that is, they are three aspects of the same essence. He is the Satan who seduces people and then accuses them, as it is written: “So the Satan went forth from the presence of YHWH,  and smote Job with vile sores” (Job 2:7). He is also the evil inclination,  as it is written there:  “The impulse of the thoughts of his heart was only evil continuously” (Genesis 6:5); and it is written here: “Only upon himself do not put forth your hand” (Job 1:12). The verbal analogy between the various uses of the word “only” teaches that the evil inclination is to be identified with the Satan. He is also the Angel of Death, as it is written: “Only spare his life” (Job 2:6); apparently Job’s life depends upon him,  the Satan, and accordingly the Satan must also be the Angel of Death."
        },
        {
          "verseLocation": "Job 1:15",
          "verseText": "malkat Sheba? The kingdom [ malkhuta ] of Sheba,",
          "talmudLocation": "Bava Batra 15b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-11",
          "talmudFullText": "R' Shmuel bar Naḥmani says that R' Yonatan says: Anyone who says that the queen of Sheba [malkat Sheva] who came to visit King Solomon (see I Kings, chapter 10) was a woman is nothing other than mistaken. What is the meaning of malkat Sheba? The kingdom [malkhuta] of Sheba,  as is mentioned in Job: “And Sheba fell on them and took them away” (Job 1:15)."
        },
        {
          "verseLocation": "Job 1:15",
          "verseText": "in the days of the kingdom of Sheba, as it is stated: “And Sheba fell upon them, and took them away”",
          "talmudLocation": "Bava Batra 15b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-7",
          "talmudFullText": "R' Natan says: Job lived in the days of the kingdom of Sheba, as it is stated: “And Sheba fell upon them, and took them away” (Job 1:15). And the Rabbis say: Job lived in the days of the kingdom of the Chaldeans in the time of Nebuchadnezzar, as it is stated: “The Chaldeans formed three bands” (Job 1:17). And some say that Job lived in the days of Jacob and that he married Dina, the daughter of Jacob.  As it is written here: “You speak as one of the loathsome women speaks” (Job 2:10), and it is written there in the account of the incident involving Dina: “He has done a loathsome act in Israel” (Genesis 34:7). This concludes the text of the baraita. The Talmud comments: And all these tanna’im hold that Job was a Jew except for the opinion introduced with the phrase: And some say,  according to which Job lived in the time of Jacob, and he was certainly not one of Jacob’s sons."
        },
        {
          "verseLocation": "Job 1:15",
          "verseText": "And the Sabeans made a raid and took them away, and they have slain the servants with the edge of the sword”",
          "talmudLocation": "Bava Metzia 93b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/93b#section-2",
          "talmudFullText": "Abaye raised an objection to him from a baraita: These are the circumstances beyond one’s control for which a paid bailee is exempt: For example,  as it is stated in the verse: “The oxen were plowing, and the donkeys feeding beside them. And the Sabeans made a raid and took them away, and they have slain the servants with the edge of the sword” (Job 1:15). This teaches that only a robbery by an army is considered a circumstance beyond his control, but nothing less. Rabba said to him: There it is referring to city watchmen,  i.e., professionals hired to watch over city property, who are exempt due to an occurrence on that scale, i.e., a military incursion."
        },
        {
          "verseLocation": "Job 1:17",
          "verseText": "as it is stated: “The Chaldeans formed three bands”",
          "talmudLocation": "Bava Batra 15b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-7",
          "talmudFullText": "R' Natan says: Job lived in the days of the kingdom of Sheba, as it is stated: “And Sheba fell upon them, and took them away” (Job 1:15). And the Rabbis say: Job lived in the days of the kingdom of the Chaldeans in the time of Nebuchadnezzar, as it is stated: “The Chaldeans formed three bands” (Job 1:17). And some say that Job lived in the days of Jacob and that he married Dina, the daughter of Jacob.  As it is written here: “You speak as one of the loathsome women speaks” (Job 2:10), and it is written there in the account of the incident involving Dina: “He has done a loathsome act in Israel” (Genesis 34:7). This concludes the text of the baraita. The Talmud comments: And all these tanna’im hold that Job was a Jew except for the opinion introduced with the phrase: And some say,  according to which Job lived in the time of Jacob, and he was certainly not one of Jacob’s sons."
        },
        {
          "verseLocation": "Job 1:20",
          "verseText": "“Then Job arose, and rent his coat”",
          "talmudLocation": "Moed Katan 20b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/20b#section-17",
          "talmudFullText": "With regard to this issue, the Talmud reports that Rav Ashi said to Ameimar: From where do we derive that rending must be done while standing?  He responded: As it is written about the deaths of Job’s sons: “Then Job arose, and rent his coat” (Job 1:20)."
        },
        {
          "verseLocation": "Job 1:20",
          "verseText": "arose, and rent",
          "talmudLocation": "Moed Katan 21a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/21a#section-2",
          "talmudFullText": "He said to him: There,  in the case of ḥalitza, it is not written: And he will stand and he will say,  which would imply an obligation to stand; whereas here,  in the case of rending, it is written: “Then Job arose, and rent his coat” (Job 1:20)."
        },
        {
          "verseLocation": "Job 1:20",
          "verseText": "standing? As it is stated: “Then Job arose, and rent",
          "talmudLocation": "Moed Katan 21a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/21a#section-3",
          "talmudFullText": "Rami bar Ḥama said: From where is it derived that rending must be performed while standing? As it is stated: “Then Job arose, and rent his coat” (Job 1:20). The Talmud asks: Perhaps he did something extra beyond what is required, and actually there is no obligation to stand; as, if you do not say that he did more than what was required of him, then how do you explain the continuation of the verse: “And he shaved his head” (Job 1:20)? Is every mourner required to act in this manner also and shave his head?"
        },
        {
          "verseLocation": "Job 1:21",
          "verseText": "“The Lord has given and the Lord has taken away; blessed be the name of the Lord”",
          "talmudLocation": "Berakhot 60b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/60b#section-11",
          "talmudFullText": "And the Rabbis said:  The proof is from here,  as it is stated: “YHWH has given and YHWH has taken away; blessed be the name of YHWH” (Job 1:21)."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Job 2:3",
          "verseText": "And still he holds fast to his integrity, although you moved Me against him, to destroy him without cause”",
          "talmudLocation": "Bava Batra 16a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-4",
          "talmudFullText": "About this it says: “And YHWH said to the Satan: Have you considered My servant Job, that there is none like him on earth,  a perfect and an upright man, one that fears God and turns away from evil? And still he holds fast to his integrity, although you moved Me against him, to destroy him without cause” (Job 2:3)."
        },
        {
          "verseLocation": "Job 2:3",
          "verseText": "“Although you did incite Me against him, to destroy him without cause”",
          "talmudLocation": "Chagigah 5a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/5a#section-4",
          "talmudFullText": "§ The Talmud returns to the previous topic. When R' Yoḥanan reached this verse, he cried,  as God said to the Satan about Job: “Although you did incite Me against him, to destroy him without cause” (Job 2:3). R' Yoḥanan said: With regard to a slave whose master is one whom others incite to act harshly against the slave and the master is incited to do so, is there a remedy for the slave? Additionally, when R' Yoḥanan reached this verse, he cried: “Behold He puts no trust in His sacred ones” (Job 15:15), saying: If He does not place trust in His sacred ones, in whom does He place trust? "
        },
        {
          "verseLocation": "Job 2:3",
          "verseText": "“And you incited Me against him, to destroy him gratuitously”",
          "talmudLocation": "Chullin 4b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/4b#section-10",
          "talmudFullText": "The Talmud asks: And is there not incitement with words? But isn’t it written: “If your brother…entices you secretly, saying: Let us go and serve other gods” (Deuteronomy 13:7)? The Talmud answers: There too the incitement is with eating and with drinking.  The Talmud asks: But isn’t it written that God said to Satan, who denounced Job: “And you incited Me against him, to destroy him gratuitously” (Job 2:3)? Clearly Satan did not incite God with food and drink. The Talmud answers: Incitement against the One on High is different,  as the term is used metaphorically. By contrast, incitement with regard to people involves food and drink."
        },
        {
          "verseLocation": "Job 2:6",
          "verseText": "the Angel of Death, as it is written: “Only spare his life”",
          "talmudLocation": "Bava Batra 16a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-8",
          "talmudFullText": "Reish Lakish says: Satan, the evil inclination, and the Angel of Death are one,  that is, they are three aspects of the same essence. He is the Satan who seduces people and then accuses them, as it is written: “So the Satan went forth from the presence of YHWH,  and smote Job with vile sores” (Job 2:7). He is also the evil inclination,  as it is written there:  “The impulse of the thoughts of his heart was only evil continuously” (Genesis 6:5); and it is written here: “Only upon himself do not put forth your hand” (Job 1:12). The verbal analogy between the various uses of the word “only” teaches that the evil inclination is to be identified with the Satan. He is also the Angel of Death, as it is written: “Only spare his life” (Job 2:6); apparently Job’s life depends upon him,  the Satan, and accordingly the Satan must also be the Angel of Death."
        },
        {
          "verseLocation": "Job 2:6",
          "verseText": "“Only spare his life”",
          "talmudLocation": "Chullin 43a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/43a#section-6",
          "talmudFullText": "And R' Yitzḥak ben Yosef, says that R' Yoḥanan says: What did the friends of R' Yosei ben Yehuda, respond to him?  They responded that Job said: “He pours out my gall upon the ground” (Job 16:13), and yet Job was still alive.  Evidently, one with a perforated gallbladder can live. R' Yosei said to them:  Job was kept alive by a miracle, and one does not mention miraculous acts as proof for a general ruling. As, if you do not say so,  then the other phrase in the verse: “He cleaves my kidneys asunder, and does not spare, ” is problematic. Does one with cleaved kidneys live? Rather, a miracle is different, as it is written that God said to Satan with regard to Job: “Only spare his life” (Job 2:6). Under natural circumstances, Job should have died from his injuries, but in this case he was kept alive by a miracle. Here too,  with regard to the gallbladder, one must say that a miracle is different,  and one cannot bring proof from it."
        },
        {
          "verseLocation": "Job 2:7",
          "verseText": "as it is written: “So the Satan went forth from the presence of the Lord,",
          "talmudLocation": "Bava Batra 16a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-8",
          "talmudFullText": "Reish Lakish says: Satan, the evil inclination, and the Angel of Death are one,  that is, they are three aspects of the same essence. He is the Satan who seduces people and then accuses them, as it is written: “So the Satan went forth from the presence of YHWH,  and smote Job with vile sores” (Job 2:7). He is also the evil inclination,  as it is written there:  “The impulse of the thoughts of his heart was only evil continuously” (Genesis 6:5); and it is written here: “Only upon himself do not put forth your hand” (Job 1:12). The verbal analogy between the various uses of the word “only” teaches that the evil inclination is to be identified with the Satan. He is also the Angel of Death, as it is written: “Only spare his life” (Job 2:6); apparently Job’s life depends upon him,  the Satan, and accordingly the Satan must also be the Angel of Death."
        },
        {
          "verseLocation": "Job 2:10",
          "verseText": "it is written here: “You speak as one of the loathsome women speaks”",
          "talmudLocation": "Bava Batra 15b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-7",
          "talmudFullText": "R' Natan says: Job lived in the days of the kingdom of Sheba, as it is stated: “And Sheba fell upon them, and took them away” (Job 1:15). And the Rabbis say: Job lived in the days of the kingdom of the Chaldeans in the time of Nebuchadnezzar, as it is stated: “The Chaldeans formed three bands” (Job 1:17). And some say that Job lived in the days of Jacob and that he married Dina, the daughter of Jacob.  As it is written here: “You speak as one of the loathsome women speaks” (Job 2:10), and it is written there in the account of the incident involving Dina: “He has done a loathsome act in Israel” (Genesis 34:7). This concludes the text of the baraita. The Talmud comments: And all these tanna’im hold that Job was a Jew except for the opinion introduced with the phrase: And some say,  according to which Job lived in the time of Jacob, and he was certainly not one of Jacob’s sons."
        },
        {
          "verseLocation": "Job 2:10",
          "verseText": "“In all this Job did not sin with his lips”",
          "talmudLocation": "Bava Batra 16a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-10",
          "talmudFullText": "The Talmud considers the character of Job. The verse states: “In all this Job did not sin with his lips” (Job 2:10). Rava says:  A close reading of the verse indicates that he did not sin with his lips,  but he sinned in his heart. What did he say that suggests that he had wicked thoughts? “The earth is given into the hand of the wicked, he covers the faces of its judges; if not he, then who is it? ” (Job 9:24). Rava says: Job sought to turn the bowl upside down,  that is to say, he alluded here to a heretical thought, as he said that the earth is given into the hand of the wicked, indicating that he had God in mind. Abaye said to him: Job was referring here only to the Satan,  he being the wicked one into whose hands the land was given."
        },
        {
          "verseLocation": "Job 2:11",
          "verseText": "“And Job’s three friends heard of all this evil that was come upon him, they came every one from his own place, Eliphaz the Temanite, and Bildad the Shuhite, and Zophar the Naamathite; for they had made an appointment together to come to mourn with him and to comfort him”",
          "talmudLocation": "Bava Batra 16b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16b#section-4",
          "talmudFullText": "The verse states: “And Job’s three friends heard of all this evil that was come upon him, they came every one from his own place, Eliphaz the Temanite, and Bildad the Shuhite, and Zophar the Naamathite; for they had made an appointment together to come to mourn with him and to comfort him” (Job 2:11). What does “they had made an appointment together” mean? Rav Yehuda says that Rav says: This phrase teaches that they all entered through one gate at the same time. And a Sage taught in a baraita: There were three hundred parasangs between each and every one of them, i.e., each one lived three hundred parasangs away from the other."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Job 3:3",
          "verseText": "As it is stated: “Let the day perish on which I was born, and the night on which it was said: Conceived is a man-child”",
          "talmudLocation": "Niddah 16b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/16b#section-11",
          "talmudFullText": "§ R' Yoḥanan says: It is prohibited for a person to have sex by day. Rav Hamnuna says: What is the verse from which this is derived? As it is stated: “Let the day perish on which I was born, and the night on which it was said: Conceived is a man-child” (Job 3:3). It is derived from here that nighttime is meant for conception, but daytime is not meant for conception. Reish Lakish says that the proof is from here: “But he who despises his ways shall die” (Proverbs 19:16). One might see something unpleasing in his wife in the daylight and come to despise her."
        },
        {
          "verseLocation": "Job 3:3",
          "verseText": "Laila is his name, as it is stated: “And Laila said: A man-child is brought forth”",
          "talmudLocation": "Sanhedrin 96a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/96a#section-4",
          "talmudFullText": "§ Apropos the war between the kings and Abraham mentioned above, the Talmud explains a verse: “And he pursued as far as Dan. And he divided himself against them by night [laila], he and his servants, and smote them” (Genesis 14:14–15). The term “by night” [laila] appears out of place in this verse. R' Yoḥanan says: That angel that happened to come and assist Abraham in that war, Laila is his name, as it is stated: “And Laila said: A man-child is brought forth” (Job 3:3), indicating that there is an angel named Laila. And R' Yitzḥak Nappaḥa says:  God performed for him an act of night,  i.e., the stars in heaven waged war on his behalf, as it is stated: “They fought from heaven; the stars in their courses fought against Sisera” (Judges 5:20). Reish Lakish said:  The statement of R' Yitzḥak Nappaḥa, the smith, is preferable to the statement of the son of the smith,  R' Yoḥanan."
        },
        {
          "verseLocation": "Job 3:9",
          "verseText": "“Let the stars of the twilight be dark; let it look for or but have none; neither let it see the eyelids of the morning”",
          "talmudLocation": "Pesachim 2b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/2b#section-2",
          "talmudFullText": "The Talmud raises an objection to the opinion that or means evening: “Let the stars of the twilight be dark; let it look for or but have none; neither let it see the eyelids of the morning” (Job 3:9). From the fact that the verse states: “Let it look for or but have none, ” apparently or is day.  The Talmud rejects this contention. Actually, it is possible that or, in this context, means light in general, not specifically day. There, Job is cursing his fortune. He said: Let it be His will that this man,  referring to himself, will seek light and not find it. "
        },
        {
          "verseLocation": "Job 3:10",
          "verseText": "Rabbi Yehoshua says: Just as a house has doors, so too, a woman has doors, as it is stated: “Because it did not shut the doors of my womb”",
          "talmudLocation": "Bekhorot 45a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/45a#section-18",
          "talmudFullText": "It is taught in a baraita that R' Elazar says: Just as a house has hinges [tzirim], so too, a woman has hinges, as it is stated: “And she bowed herself and brought forth, for her pains [tzireha] came suddenly upon her” (I Samuel 4:19). R' Yehoshua says: Just as a house has doors, so too, a woman has doors, as it is stated: “Because it did not shut the doors of my womb” (Job 3:10)."
        },
        {
          "verseLocation": "Job 3:13",
          "verseText": "Sleep, as it is written: “I should have slept; then had I been at rest”",
          "talmudLocation": "Berakhot 57b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/57b#section-14",
          "talmudFullText": "Similarly: Six matters are good omens for the sick: Sneezing, sweating, diarrhea, a seminal emission, sleep, and a dream.  These are all alluded to in Scripture: Sneezing, as it is written: “His sneezes flash forth light” (Job 41:10), indicating that by means of a sneeze one comes to see the light of the world. Sweat, as it is written: “In the sweat of your face shall you eat bread” (Genesis 3:19). Diarrhea, as it is written: “He that is bent down shall speedily be loosed; and he shall not go down dying into the pit” (Isaiah 51:14). A seminal emission, as it is written: “That he might see his seed, prolong his days” (Isaiah 53:10). Sleep, as it is written: “I should have slept; then had I been at rest” (Job 3:13). A dream, as it is written: “Wherefore You recover me [vataḥalimeni], and make me to live” (Isaiah 38:16); vataḥalimeni is interpreted as etymologically similar to ḥalom, dream."
        },
        {
          "verseLocation": "Job 3:17",
          "verseText": "It is written here: “But if you refrain [ teḥdal ] from vowing,” and it is written there: “There the wicked cease [ ḥadlu ] from troubling”",
          "talmudLocation": "Nedarim 22a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/22a#section-7",
          "talmudFullText": "And furthermore, we also do not broach dissolution with this statement of Shmuel, as Shmuel said:  With regard to one who vows, although he fulfills it, he is called wicked. R' Abbahu said: What is the verse from which this is derived? It is “But if you refrain [teḥdal] from vowing there will be no sin in you” (Deuteronomy 23:23), and he derives the word ḥadala here from the word ḥadala elsewhere. It is written here: “But if you refrain [teḥdal] from vowing, ” and it is written there: “There the wicked cease [ḥadlu] from troubling” (Job 3:17). The parallel language demonstrates that vowing is an act of the wicked."
        },
        {
          "verseLocation": "Job 3:19",
          "verseText": "“The humble and great are there; and the servant is free from his master”",
          "talmudLocation": "Bava Metzia 85b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/85b#section-3",
          "talmudFullText": "R' Yirmeya said to R' Zeira: What is the meaning of that which is written with regard to the World-to-Come: “The humble and great are there; and the servant is free from his master” (Job 3:19)? Is that to say that we do not know that the humble and the great are there in the World-to-Come? Rather,  this is the meaning of the verse: Anyone who humbles himself over matters of Torah in this world becomes great in the World-to-Come; and anyone who establishes himself as a servant over matters of Torah in this world becomes free in the World-to-Come. "
        },
        {
          "verseLocation": "Job 3:22",
          "verseText": "“Who rejoice in exultation and are glad when they can find a grave”",
          "talmudLocation": "Berakhot 8a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/8a#section-14",
          "talmudFullText": "R' Yoḥanan said: The time of finding refers to a respectful burial,  for which one should pray. Supporting R' Yoḥanan’s interpretation, R' Ḥanina said: What is the verse that teaches that the time of finding refers to burial? “Who rejoice in exultation and are glad when they can find a grave” (Job 3:22), as there are situations in which one is relieved when his body finds a grave in which to rest. Rabba bar Rav Sheila said, that is the meaning of the folk saying: A person should even pray for mercy until the final shovelful of dirt is thrown upon his grave."
        },
        {
          "verseLocation": "Job 3:25",
          "verseText": "said to him: Do you wish to bring suffering upon yourself; as it is stated: “For that which I did fear is come upon me, and that which I was afraid of has overtaken me”",
          "talmudLocation": "Berakhot 60a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/60a#section-18",
          "talmudFullText": "In a similar vein, the Talmud relates: Yehuda bar Natan was coming and going after Rav Hamnuna.  Yehuda bar Natan sighed;  Rav Hamnuna said to him: Do you wish to bring suffering upon yourself; as it is stated: “For that which I did fear is come upon me, and that which I was afraid of has overtaken me” (Job 3:25)? He responded: Is it not said: “Happy is the man who fears always”?  Rav Hamnuna answered: That verse is written with regard to matters of Torah. "
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Job 4:1",
          "verseText": "And afterward: “And Eliphaz the Temanite answered",
          "talmudLocation": "Moed Katan 28b:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/28b#section-23",
          "talmudFullText": "The Talmud returns to examining the halakhot of consolation. R' Yoḥanan said: The consolers are not permitted to speak words of consolation until the mourner opens and speaks first. As it is stated:  “And they sat down with him upon the ground for seven days and seven nights, and none spoke a word to him; for they saw that his suffering was very great. After this Job opened his mouth” (Job 2:13–3:1). And afterward: “And Eliphaz the Temanite answered and said” (Job 4:1)."
        },
        {
          "verseLocation": "Job 4:6",
          "verseText": "“Is not your fear of God your foolishness?”",
          "talmudLocation": "Sanhedrin 89b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89b#section-13",
          "talmudFullText": "Satan said to Abraham: “Is not your fear of God your foolishness? ” (Job 4:6). In other words, your fear will culminate in the slaughter of your son. Abraham said to him: “Remember, please, whoever perished, being innocent” (Job 4:7). God is righteous and His pronouncements are just. Once Satan saw that Abraham was not heeding him, he said to him: “Now a word was secretly brought to me,  and my ear received a whisper thereof” (Job 4:12). This is what I heard from behind the heavenly curtain [pargod],  which demarcates between God and the ministering angels: The sheep is to be sacrificed as a burnt-offering, and Isaac is not to be sacrificed as a burnt-offering.  Abraham said to him:  Perhaps that is so. However, this is the punishment of the liar, that even if he speaks the truth,  others do not listen to him.  Therefore, I do not believe you and will fulfill that which I was commanded to perform."
        },
        {
          "verseLocation": "Job 4:7",
          "verseText": "said to him: “Remember, please, whoever perished, being innocent”",
          "talmudLocation": "Sanhedrin 89b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89b#section-13",
          "talmudFullText": "Satan said to Abraham: “Is not your fear of God your foolishness? ” (Job 4:6). In other words, your fear will culminate in the slaughter of your son. Abraham said to him: “Remember, please, whoever perished, being innocent” (Job 4:7). God is righteous and His pronouncements are just. Once Satan saw that Abraham was not heeding him, he said to him: “Now a word was secretly brought to me,  and my ear received a whisper thereof” (Job 4:12). This is what I heard from behind the heavenly curtain [pargod],  which demarcates between God and the ministering angels: The sheep is to be sacrificed as a burnt-offering, and Isaac is not to be sacrificed as a burnt-offering.  Abraham said to him:  Perhaps that is so. However, this is the punishment of the liar, that even if he speaks the truth,  others do not listen to him.  Therefore, I do not believe you and will fulfill that which I was commanded to perform."
        },
        {
          "verseLocation": "Job 4:12",
          "verseText": "was not heeding him, he said to him: “Now a word was secretly brought to me,",
          "talmudLocation": "Sanhedrin 89b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89b#section-13",
          "talmudFullText": "Satan said to Abraham: “Is not your fear of God your foolishness? ” (Job 4:6). In other words, your fear will culminate in the slaughter of your son. Abraham said to him: “Remember, please, whoever perished, being innocent” (Job 4:7). God is righteous and His pronouncements are just. Once Satan saw that Abraham was not heeding him, he said to him: “Now a word was secretly brought to me,  and my ear received a whisper thereof” (Job 4:12). This is what I heard from behind the heavenly curtain [pargod],  which demarcates between God and the ministering angels: The sheep is to be sacrificed as a burnt-offering, and Isaac is not to be sacrificed as a burnt-offering.  Abraham said to him:  Perhaps that is so. However, this is the punishment of the liar, that even if he speaks the truth,  others do not listen to him.  Therefore, I do not believe you and will fulfill that which I was commanded to perform."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Job 5:7",
          "verseText": "and the sparks [ reshef ] fly [ uf ] upward”",
          "talmudLocation": "Berakhot 5a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/5a#section-5",
          "talmudFullText": "And R' Yitzḥak said: Anyone who recites Shema upon his bed, demons stay away from him.  This is alluded to, as it is stated:  “But man is born into trouble, and the sparks [reshef ] fly [uf ] upward” (Job 5:7). The verse is explained: The word fly [uf ] means nothing other than Torah,  as Torah is difficult to grasp and easy to lose, like something that floats away, as it is stated: “Will you set your eyes upon it? It is gone;  for riches certainly make themselves wings, like an eagle that flies into the heavens” (Proverbs 23:5). The word “sparks” means nothing other than demons, as it is stated: “Wasting of hunger, and the devouring of the sparks [reshef] and bitter destruction [ketev meriri],  and the teeth of beasts I will send upon them, with the venom of crawling things of the dust” (Deuteronomy 32:24). Here we see reshef listed along with ketev meriri, both of which are understood by the rabbis to be names of demons."
        },
        {
          "verseLocation": "Job 5:7",
          "verseText": "Rabbi Elazar says: Every man was created for labor, as it is stated: “Man is born for toil”",
          "talmudLocation": "Sanhedrin 99b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/99b#section-2",
          "talmudFullText": "R' Elazar says: Every man was created for labor, as it is stated: “Man is born for toil” (Job 5:7). Based on this verse, I do not know whether he was created for toil of the mouth,  speech, or whether he was created for the toil of labor. When the verse states: “For his mouth presses upon him” (Proverbs 16:26), you must say that he was created for toil of the mouth. And still I do not know with regard to the toil of the mouth whether it is for the toil of Torah or for the toil of conversation. When the verse states: “This Torah scroll shall not depart from your mouth” (Joshua 1:8), you must say that he was created for the toil of Torah. And that is the meaning of what Rava said: All bodies are like receptacles to store items until use. Happy is one who is privileged, who is a receptacle for Torah. "
        },
        {
          "verseLocation": "Job 5:9",
          "verseText": "as it is stated: “Who does great things beyond comprehension, marvels without number”",
          "talmudLocation": "Taanit 2a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/2a#section-8",
          "talmudFullText": "§ The Talmud asks a question with regard to the language of the Mishnah: And let the tanna simply teach: From when does one mention the rains. What is the meaning of the phrase: The might of the rains? R' Yoḥanan said: Because the rains fall with might.  The might of the rain displays God’s power in the world, as it is stated: “Who does great things beyond comprehension, marvels without number” (Job 5:9). And it is also written: “Who gives rain upon the earth, and sends water upon the fields” (Job 5:10)."
        },
        {
          "verseLocation": "Job 5:10",
          "verseText": "and sends [ shole’aḥ ] water upon the fields”",
          "talmudLocation": "Bava Batra 68a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/68a#section-8",
          "talmudFullText": "The Talmud attempts to adduce proof in support of one of the opinions: We learned in the Mishnah here that the olive presses and beit hashelaḥin are sold along with the city. The rabbis initially maintained: What is meant by shelaḥin?  This is referring to irrigated fields,  fields that require additional irrigation to supplement the rain that they receive. As it is written:  “Who gives rain upon the earth and sends [shole’aḥ] water upon the fields” (Job 5:10). Granted, according to the one who says that santar means the land registrar, the first tanna of the Mishnah said that the fields that surround the city are sold with the city, but the land registrar is not sold, and Rabban Shimon ben Gamliel comes to say that even the land registrar is sold. But according to the one who says that santar means fields, this is what the first tanna is saying as well.  In what way, then, does Rabban Shimon ben Gamliel disagree with the first tanna?"
        },
        {
          "verseLocation": "Job 5:10",
          "verseText": "and sends [ sholeaḥ ] waters upon the fields”",
          "talmudLocation": "Bava Batra 68b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/68b#section-1",
          "talmudFullText": "But according to the one who says that santar means the land registrar,  is it reasonable that the first tanna of the Mishnah said that the gardens within the city are included in the sale of the city, and Rabban Shimon ben Gamliel responded to him that the land registrar is included? How are the two connected? The Talmud answers: Do you maintain that what is meant by shelaḥin is gardens?  This is not the case. Rather, what is meant by shelaḥin?  This is referring to the fields that surround the city, as it is written:  “Who gives rain upon the earth and sends [sholeaḥ] waters upon the fields” (Job 5:10). According to the first tanna, it is specifically the fields that are sold with the city, but the land registrar is not sold. And Rabban Shimon ben Gamliel comes to say that even the land registrar is also sold. "
        },
        {
          "verseLocation": "Job 5:10",
          "verseText": "transfer, as it is written: “And sends [ shole’aḥ ] water upon the earth”",
          "talmudLocation": "Nazir 3a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/3a#section-8",
          "talmudFullText": "The Talmud suggests: Say that it is referring to a matter involving transfer, as it is written: “And sends [shole’aḥ] water upon the earth” (Job 5:10), where the word shole’aḥ is referring to the transport of water from one place to another. Here too, the individual taking the vow might mean that he intends to transfer, i.e., to remove, his hair."
        },
        {
          "verseLocation": "Job 5:10",
          "verseText": "and sends [ veshole’aḥ ] waters upon the fields”",
          "talmudLocation": "Niddah 19b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/19b#section-11",
          "talmudFullText": "Rather, this is what R' Meir was saying to the Rabbis: Learn this halakha that green blood renders food susceptible to ritual impurity from the following verbal analogy: It is written here,  in a description of the beloved woman that alludes to her menstrual blood: “Your shoots [shelaḥayikh] are an orchard of pomegranates” (Song of Songs 4:13), and it is written there:  “Who gives rain upon the earth, and sends [veshole’aḥ] waters upon the fields” (Job 5:10). This verbal analogy indicates that menstrual blood is similar to water in that both render food susceptible to ritual impurity."
        },
        {
          "verseLocation": "Job 5:10",
          "verseText": "through an intermediary, as it is stated: “Who gives rain upon the land, and sends water upon the fields”",
          "talmudLocation": "Taanit 10a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/10a#section-2",
          "talmudFullText": "A baraita states in a baraita: Eretz Yisrael was created first and the rest of the entire world was created afterward, as it is stated: “While as yet He had not made the land, nor the fields” (Proverbs 8:26). Here, and in the following statements, the term “land” is understood as a reference to the Land of Israel, while “the fields” means all the fields in other lands. Furthermore, Eretz Yisrael is watered by God Himself, and the rest of the entire world is watered through an intermediary, as it is stated: “Who gives rain upon the land, and sends water upon the fields” (Job 5:10)."
        },
        {
          "verseLocation": "Job 5:10",
          "verseText": "written: “Who gives rain upon the earth, and sends water upon the fields”",
          "talmudLocation": "Taanit 2a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/2a#section-8",
          "talmudFullText": "§ The Talmud asks a question with regard to the language of the Mishnah: And let the tanna simply teach: From when does one mention the rains. What is the meaning of the phrase: The might of the rains? R' Yoḥanan said: Because the rains fall with might.  The might of the rain displays God’s power in the world, as it is stated: “Who does great things beyond comprehension, marvels without number” (Job 5:9). And it is also written: “Who gives rain upon the earth, and sends water upon the fields” (Job 5:10)."
        },
        {
          "verseLocation": "Job 5:12",
          "verseText": "taken effect, as it is written: “He nullifies the thoughts of the crafty”",
          "talmudLocation": "Nedarim 90a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/90a#section-2",
          "talmudFullText": "And Rav Pappi said with regard to this issue: The dispute between R' Natan and the Rabbis is with regard to nullification only, as R' Natan holds that a husband can nullify a vow only once the vow has taken effect, as it is written: “And the moon shall be confounded [ḥafera]” (Isaiah 24:23). He employs this phrase as an allusion, interpreting the word ḥafera as if it were hafara, nullification, and concludes from here that only a vow that already exists, like the moon, can be nullified. And the Rabbis hold that a husband can nullify a vow even though the vow has not yet taken effect, as it is written: “He nullifies the thoughts of the crafty” (Job 5:12), implying that nullification pertains even to thoughts, to prevent them from going into effect."
        },
        {
          "verseLocation": "Job 5:12",
          "verseText": "statements of Torah, as it is stated: “He frustrates the thoughts of the crafty, so that their hands can perform nothing [ velo…tushiyya ]”",
          "talmudLocation": "Sanhedrin 26b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/26b#section-9",
          "talmudFullText": "Ulla says: Thought,  i.e., concern, is effective [mo’elet] in disturbing even the study of statements of Torah, as it is stated: “He frustrates the thoughts of the crafty, so that their hands can perform nothing [velo…tushiyya]” (Job 5:12), and tushiyya is a reference to Torah."
        },
        {
          "verseLocation": "Job 5:20",
          "verseText": "starves himself in years of famine will be saved from an unusual death, as it is stated: “In famine, He will redeem you from death”",
          "talmudLocation": "Taanit 11a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/11a#section-3",
          "talmudFullText": "Rav Yehuda said that Rav said: Anyone who has food for himself but nevertheless starves himself in years of famine will be saved from an unusual death, as it is stated: “In famine, He will redeem you from death” (Job 5:20). This is derived from the precise wording of the verse. According to its straightforward meaning, instead of “in famine,” it should have said: From famine,  as one is delivered from famine. Rather, this is what the verse is saying: As a reward for starving himself in years of famine,  Job will be saved from an unusual death. "
        },
        {
          "verseLocation": "Job 5:21",
          "verseText": "“You shall be hid from the scourge of the tongue”",
          "talmudLocation": "Gittin 57b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/57b#section-11",
          "talmudFullText": "And this is what R' Elazar says:  The verse that says: “You shall be hid from the scourge of the tongue” (Job 5:21), means: You shall need to hide on account of quarrels provoked by the tongue. Rav Yehuda says that Rav says: What is the meaning of that which is written: “By the rivers of Babylonia, there we sat down and wept, when we remembered Zion” (Psalms 137:1)? This teaches that God showed David the destruction of the First Temple and the destruction of the Second Temple.  He saw the destruction of the First Temple, as it is stated: “By the rivers of Babylon, there we sat down and wept. ” He saw the destruction of the Second Temple, as it is written later in that same psalm: “Remember, O Lord, against the children of Edom the day of Jerusalem, when they said: Raze it, raze it, to its very foundation” (Psalms 137:7), as the Second Temple was destroyed by the Romans, “the children of Edom. ”"
        },
        {
          "verseLocation": "Job 5:24",
          "verseText": "Concerning him the verse states: “And you shall know that your tent is in peace; and you shall visit your habitation and shall miss nothing”",
          "talmudLocation": "Sanhedrin 76b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/76b#section-3",
          "talmudFullText": "The Talmud raises an objection to one element of the ruling of Rav from a baraita: One who loves his wife as he loves himself, and who esteems her by giving her clothing and jewelry more than he esteems himself, and one who instructs his sons and daughters to follow an upright path, and who marries them to appropriate spouses adjacent to their reaching puberty,  ensures that his home will be devoid of quarrel and sin. Concerning him the verse states: “And you shall know that your tent is in peace; and you shall visit your habitation and shall miss nothing” (Job 5:24). The baraita indicates that it is a mitzva to marry one’s children to appropriate spouses while they are young, contrary to the statement of Rav that one who takes a wife for his minor son causes sin. The Talmud replies: Adjacent to their reaching puberty is different from marrying her to a minor, as there is no concern that his daughter will sin during the brief period until her husband reaches puberty."
        },
        {
          "verseLocation": "Job 5:24",
          "verseText": "the verse said: “And you shall know that your tent is in peace; and you shall visit your habitation, and shall not sin”",
          "talmudLocation": "Shabbat 34a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/34a#section-4",
          "talmudFullText": "Talmud:  The Talmud attempts to clarify: From where are these matters,  that one must ask these questions in his home at nightfall of Shabbat, derived? R' Yehoshua ben Levi said: As the verse said: “And you shall know that your tent is in peace; and you shall visit your habitation, and shall not sin” (Job 5:24). From here it is derived that one should visit his habitation, i.e., ask in his home, so that he will not come to sin. Rabba bar Rav Huna said: Although the rabbis said that there are three things a person should,  indeed he is required to, say in his home on Shabbat eve at nightfall, one must say them calmly so that the members of his household will accept them from him.  If he says them harshly, his family members may mislead him and cause him to sin. Rav Ashi said: I did not hear this halakha of Rabba bar Rav Huna, but I fulfilled it based on my own reasoning. "
        },
        {
          "verseLocation": "Job 5:24",
          "verseText": "without peace, as it is written: “And you shall know that your tent is in peace; and you shall visit your habitation and shall miss nothing”",
          "talmudLocation": "Yevamot 62b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/62b#section-15",
          "talmudFullText": "Rava bar Ulla said:  One who does not have a wife is left without peace, as it is written: “And you shall know that your tent is in peace; and you shall visit your habitation and shall miss nothing” (Job 5:24). This indicates that a man has peace only when he has a tent, i.e., a wife."
        },
        {
          "verseLocation": "Job 5:26",
          "verseText": "As it is written: “You shall come to your grave in a ripe age [ bekhelaḥ ]”",
          "talmudLocation": "Moed Katan 28a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/28a#section-9",
          "talmudFullText": "Mar Zutra said: What is the verse from which this is derived? As it is written: “You shall come to your grave in a ripe age [bekhelaḥ]” (Job 5:26). The word “ripe age” [bekhelaḥ] has the numerical value of sixty,  and it is alluded to there that dying at this age involves a divine punishment."
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "Job 6:2",
          "verseText": "“O that my vexation were thoroughly weighed, and my calamity laid in the balances”",
          "talmudLocation": "Bava Batra 16a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-15",
          "talmudFullText": "Job further said: “O that my vexation were thoroughly weighed, and my calamity laid in the balances” (Job 6:2). Rav says: Dust should be put in the mouth of Job,  meaning, he should not have spoken in such a manner, as if he were weighing his deeds against those of God; may one act as if he is in a friendship with Heaven?  And similarly, Job said: “There is no arbiter between us, who may lay his hand upon us both” (Job 9:33). Rav says: Dust should be put in the mouth of Job for saying this; is there a servant who rebukes his master?  Job also said: “I have made a covenant with my eyes; why then should I look upon a virgin? ” (Job 31:1). Rava says: Dust should be put in the mouth of Job for saying this; he did not look at other women, but Abraham did not even look at his own wife, as it is written: “Now I know that you are a beautiful woman” (Genesis 12:11). One may learn by inference that initially he did not know how beautiful she was because he had not gazed at her."
        },
        {
          "verseLocation": "Job 6:13",
          "verseText": "without Torah, as it is written: “Is it that I have no help in me, and that sound wisdom is driven from me?”",
          "talmudLocation": "Yevamot 62b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/62b#section-14",
          "talmudFullText": "In the West,  Eretz Yisrael, they say:  One who lives without a wife is left without Torah,  and without a wall of protection. He is without Torah, as it is written: “Is it that I have no help in me, and that sound wisdom is driven from me? ” (Job 6:13), indicating that one who does not have a wife lacks sound wisdom, i.e., Torah. He is without a wall, as it is written: “A woman shall go round a man” (Jeremiah 31:22), similar to a protective wall."
        },
        {
          "verseLocation": "Job 6:14",
          "verseText": "Rabbi Yoḥanan said: Anyone who prevents his student from serving him, it is as if he withheld from him kindness, as it is stated: “To him that is ready to faint [ lamas ], from his friend kindness is due”",
          "talmudLocation": "Ketubot 96a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/96a#section-6",
          "talmudFullText": "R' Ḥiyya bar Abba said that R' Yoḥanan said: Anyone who prevents his student from serving him, it is as if he withheld from him kindness, as it is stated: “To him that is ready to faint [lamas], from his friend kindness is due” (Job 6:14). R' Yoḥanan interprets this to mean that one who prevents [memis] another from performing acts on his behalf, prevents him from performing the mitzva of kindness. Rav Naḥman bar Yitzḥak says: He even removes from the student the fear of Heaven, as it is stated in the continuation of the verse: “Even to one who forsakes the fear of God. ”"
        },
        {
          "verseLocation": "Job 6:14",
          "verseText": "kindness from his friend",
          "talmudLocation": "Shabbat 63b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/63b#section-1",
          "talmudFullText": "kindness from his friend and awe of God will leave” (Job 6:14), since in the Greek language they call a dog lamas. Rav Naḥman bar Yitzḥak said:  One who keeps an evil dog in his home even divests himself of fear of Heaven, as it is stated at the end of that verse: “And awe of God will leave. ”"
        },
        {
          "verseLocation": "Job 6:15",
          "verseText": "As it is written: “My brothers have dealt deceitfully like a wadi, like the channel [ afik ] of brooks that pass by [ ya’avoru ]”",
          "talmudLocation": "Eruvin 65a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/65a#section-6",
          "talmudFullText": "The Talmud poses a question: From where may it be inferred that the meaning of this word afik is a formulation denoting passing [aborei]?  The Talmud answers: As it is written: “My brothers have dealt deceitfully like a wadi, like the channel [afik] of brooks that pass by [ya’avoru]” (Job 6:15). This implies that the term afik is synonymous with the verb ya’avoru, which refers to something that travels and passes by."
        },
        {
          "verseLocation": "Job 6:18",
          "verseText": "shroud him and lead him on the Day of Judgment, as it is stated: “The paths of their way do wind,",
          "talmudLocation": "Avodah Zarah 5a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/5a#section-4",
          "talmudFullText": "And R' Shmuel bar Naḥmani further says that R' Yonatan says:  With regard to anyone who performs one mitzva in this world,  the mitzva will precede him and walk before him in the World-to-Come, as it is stated: “And your righteousness shall go before you, the glory of YHWH shall be your reward” (Isaiah 58:8). And with regard to anyone who commits one transgression,  that transgression will shroud him and lead him on the Day of Judgment, as it is stated: “The paths of their way do wind,  they go up into the waste, and are lost” (Job 6:18)."
        },
        {
          "verseLocation": "Job 6:18",
          "verseText": "And anyone who commits one transgression in this world, it shrouds him and goes before him to the Day of Judgment, as it is stated: “The paths of their way do wind, they go up into the waste, and are lost”",
          "talmudLocation": "Sotah 3b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/3b#section-13",
          "talmudFullText": "R' Shmuel bar Naḥmani says that R' Yonatan says: Anyone who fulfills one mitzva in this world,  that mitzva precedes him and goes before him to the World-to-Come, as it is stated: “And your righteousness shall go before you,  the glory of YHWH shall be your reward” (Isaiah 58:8). And anyone who commits one transgression in this world, it shrouds him and goes before him to the Day of Judgment, as it is stated: “The paths of their way do wind, they go up into the waste, and are lost” (Job 6:18)."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Job 7:9",
          "verseText": "“As the cloud is consumed and vanishes away, so he who goes down to the grave shall come up no more”",
          "talmudLocation": "Bava Batra 16a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-16",
          "talmudFullText": "Job further said: “As the cloud is consumed and vanishes away, so he who goes down to the grave shall come up no more” (Job 7:9). Rava says: From here it may be inferred that Job denied the resurrection of the dead,  as he said that one who goes down to the grave will not come up and live again, just as a cloud that dissipates will not return. He also stated: “He crushes me with a tempest, and multiplies my wounds without cause” (Job 9:17). Rabba says: Job blasphemed with mention of a tempest and he was answered with mention of a tempest. "
        },
        {
          "verseLocation": "Job 7:18",
          "verseText": "as it is stated: “You visit him every morning”",
          "talmudLocation": "Rosh Hashanah 16a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/16a#section-7",
          "talmudFullText": "R' Yosei says: A person is judged every day,  and not just once a year, as it is stated: “You visit him every morning” (Job 7:18), meaning that every morning an accounting is made and a judgment is passed. R' Natan says: A person is judged every hour, as it is stated: “You try him every moment” (Job 7:18)."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "Job 8:7",
          "verseText": "as it is stated: “And your beginning was in pain, your end shall greatly increase”",
          "talmudLocation": "Kiddushin 40b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/40b#section-6",
          "talmudFullText": "Talmud:  R' Elazar ben Tzadok, says: To what are the righteous in this world compared? To a tree that is standing entirely in a pure place and its branches hang over an impure place.  If its branches are cut, it will stand entirely in a pure place. So too, God brings afflictions upon the righteous in this world to cleanse them of their few sins. He makes them suffer so that they will inherit the World-to-Come entirely, as it is stated: “And your beginning was in pain, your end shall greatly increase” (Job 8:7)."
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "Job 9:6",
          "verseText": "Upon what does the earth stand? Upon pillars, as it is stated: “Who shakes the earth out of its place, and its pillars tremble”",
          "talmudLocation": "Chagigah 12b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12b#section-2",
          "talmudFullText": "§ It is taught in a baraita: R' Yosei says: Woe to them, the creations, who see and know not what they see;  who stand and know not upon what they stand.  He clarifies: Upon what does the earth stand? Upon pillars, as it is stated: “Who shakes the earth out of its place, and its pillars tremble” (Job 9:6). These pillars are positioned upon water, as it is stated: “To Him Who spread forth the earth over the waters” (Psalms 136:6). These waters stand upon mountains, as it is stated: “The waters stood above the mountains” (Psalms 104:6). The mountains are upon the wind, as it is stated: “For behold He forms the mountains and creates the wind” (Amos 4:13). The wind is upon a storm, as it is stated: “Stormy wind, fulfilling His word” (Psalms 148:8). The storm hangs upon the arm of God as it is stated: “And underneath are the everlasting arms” (Deuteronomy 33:27), which demonstrates that the entire world rests upon the arms of God."
        },
        {
          "verseLocation": "Job 9:7",
          "verseText": "to the sun? As it is written: “Who commands the sun [ ḥeres ], and it does not rise;",
          "talmudLocation": "Menachot 110a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/110a#section-2",
          "talmudFullText": "The verse states: “One shall be called the city of destruction” (Isaiah 19:18). The Talmud asks: What is the meaning of the verse: “One shall be called the city of destruction”?  The Talmud answers: As Rav Yosef translates into Aramaic: Concerning the City of the Sun, which will be destroyed in the future, it will be said that it is one of them. And from where is it derived that in the phrase: “The city of destruction [heres], ” the term heres is referring to the sun? As it is written: “Who commands the sun [ḥeres], and it does not rise;  and seals up the stars” (Job 9:7)."
        },
        {
          "verseLocation": "Job 9:9",
          "verseText": "it is written: “Who makes Ursa Major, Orion, and Pleiades,",
          "talmudLocation": "Berakhot 58b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58b#section-12",
          "talmudFullText": "On the subject of stars, the Talmud notes that Shmuel raised a contradiction between the implications of two verses with regard to constellations. On the one hand it is written: “Who makes Ursa Major, Orion, and Pleiades,  and the chambers of the south” (Job 9:9); Orion precedes Pleiades. And on the other hand it is written: “He Who makes Pleiades and Orion” (Amos 5:8); Pleiades precedes Orion. So how is this reconciled? The Talmud replies: Were it not for Orion’s heat, the universe could not exist because of the cold of Pleiades;  and conversely, were it not for the cold of Pleiades, the universe could not exist because of the heat of Orion. "
        },
        {
          "verseLocation": "Job 9:10",
          "verseText": "I will interpret it homiletically: Yours, O Lord, is the greatness; that is the act of creation, and so it says: “Who does great things past finding out”",
          "talmudLocation": "Berakhot 58a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58a#section-16",
          "talmudFullText": "R' Sheila said: Since a miracle was performed on my behalf with this verse that I cited, I will interpret it homiletically: Yours, O Lord, is the greatness; that is the act of creation, and so it says: “Who does great things past finding out” (Job 9:10); And the power; that is the exodus from Egypt, as it is stated: “And Israel saw the great work which YHWH did to the Egyptians” (Exodus 14:31); And the glory; that is the sun and the moon that stood still for Joshua, as it is stated: “And the sun stood still, and the moon stayed,  until the nation had avenged themselves of their enemies” (Joshua 10:13); And the triumph; that is the downfall of Rome, and so it says describing the downfall of Edom, whom the rabbis identified as the forefather of Rome: “Their lifeblood is dashed against My garments and I have stained all My raiment” (Isaiah 63:3); And the majesty; this is the war of the valleys of Arnon, as it is stated: “Wherefore it is said in the book of the Wars of YHWH: Vahev in Sufa,  and the valleys of Arnon” (Numbers 21:14); For all that is in the heaven and in the earth is Yours; this is the war of Sisera, as it is stated: “They fought from heaven, the stars in their courses fought against Sisera” (Judges 5:20). Yours is the kingdom, O Lord; this is the war of Amalek, and so it says:  “And he said: The hand upon the throne of YHWH:  YHWH will have war with Amalek from generation to generation” (Exodus 17:16), as then God will sit on His throne. And you are exalted; this is the war of Gog and Magog, and so it says: “I am against you, O Gog, the chief prince of Meshekh and Tubal” (Ezekiel 38:3); and:As head above all; Rav Ḥanan bar Rava said that R' Yoḥanan said:  All leadership and authority, even the most insignificant, the one responsible for distributing water, is appointed by heaven. "
        },
        {
          "verseLocation": "Job 9:10",
          "verseText": "which is written: “Who does great deeds beyond comprehension, wondrous deeds without number”",
          "talmudLocation": "Niddah 31a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/31a#section-11",
          "talmudFullText": "§ Rav Ḥinnana bar Pappa taught: What is the meaning of that which is written: “Who does great deeds beyond comprehension, wondrous deeds without number” (Job 9:10)? Come and see that the attribute of flesh and blood is unlike the attribute of God. The attribute of flesh and blood is that if one puts an article in a flask,  even if the flask is tied and its opening faces upward, it is uncertain whether the item is preserved from getting lost, and it is uncertain whether it is not preserved from being lost. But God forms the fetus in a woman’s open womb, and its opening faces downward, and yet the fetus is preserved. "
        },
        {
          "verseLocation": "Job 9:10",
          "verseText": "“Who does great things past finding out”",
          "talmudLocation": "Taanit 9b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/9b#section-13",
          "talmudFullText": "As it is stated,  with regard to the creation of the world: “Who does great things past finding out” (Job 9:10), and as an example of this it is written: “Who gives rain upon the earth” (Job 5:9–10). And it is written below: “Have you not known? Have you not heard that the everlasting God, YHWH,  the Creator of the ends of the earth, does not faint and is not weary; His discernment is past finding out” (Isaiah 40:28). The repetition of “past finding out” indicates that rainfall is as wondrous as the creation of the world. The Talmud adds: And it is written in a psalm that deals with rainfall: “Who by Your strength sets fast the mountains;  Who is girded about with might” (Psalms 65:7)."
        },
        {
          "verseLocation": "Job 9:17",
          "verseText": "“He crushes me with a tempest, and multiplies my wounds without cause”",
          "talmudLocation": "Bava Batra 16a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-16",
          "talmudFullText": "Job further said: “As the cloud is consumed and vanishes away, so he who goes down to the grave shall come up no more” (Job 7:9). Rava says: From here it may be inferred that Job denied the resurrection of the dead,  as he said that one who goes down to the grave will not come up and live again, just as a cloud that dissipates will not return. He also stated: “He crushes me with a tempest, and multiplies my wounds without cause” (Job 9:17). Rabba says: Job blasphemed with mention of a tempest and he was answered with mention of a tempest. "
        },
        {
          "verseLocation": "Job 9:17",
          "verseText": "But isn’t it written: “He crushes me with a tempest, and multiplies my wounds without cause”",
          "talmudLocation": "Niddah 52a:25",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/52a#section-25",
          "talmudFullText": "The Talmud asks: And is there actually a case like this,  of two hairs in one follicle? But isn’t it written: “He crushes me with a tempest, and multiplies my wounds without cause” (Job 9:17); and Rava said with regard to this verse: Job blasphemed with a tempest,  and with a tempest he was answered. He blasphemed with a tempest,  as Job said before God: God!, perhaps a tempest passed before You and You confused Iyyov,  Job, with oyev,  enemy. With a tempest he was answered,  as the verse states: “Then YHWH answered"
        },
        {
          "verseLocation": "Job 9:24",
          "verseText": "“The earth is given into the hand of the wicked, he covers the faces of its judges; if not he, then who is it?”",
          "talmudLocation": "Bava Batra 16a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-10",
          "talmudFullText": "The Talmud considers the character of Job. The verse states: “In all this Job did not sin with his lips” (Job 2:10). Rava says:  A close reading of the verse indicates that he did not sin with his lips,  but he sinned in his heart. What did he say that suggests that he had wicked thoughts? “The earth is given into the hand of the wicked, he covers the faces of its judges; if not he, then who is it? ” (Job 9:24). Rava says: Job sought to turn the bowl upside down,  that is to say, he alluded here to a heretical thought, as he said that the earth is given into the hand of the wicked, indicating that he had God in mind. Abaye said to him: Job was referring here only to the Satan,  he being the wicked one into whose hands the land was given."
        },
        {
          "verseLocation": "Job 9:33",
          "verseText": "“There is no arbiter between us, who may lay his hand upon us both”",
          "talmudLocation": "Bava Batra 16a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-15",
          "talmudFullText": "Job further said: “O that my vexation were thoroughly weighed, and my calamity laid in the balances” (Job 6:2). Rav says: Dust should be put in the mouth of Job,  meaning, he should not have spoken in such a manner, as if he were weighing his deeds against those of God; may one act as if he is in a friendship with Heaven?  And similarly, Job said: “There is no arbiter between us, who may lay his hand upon us both” (Job 9:33). Rav says: Dust should be put in the mouth of Job for saying this; is there a servant who rebukes his master?  Job also said: “I have made a covenant with my eyes; why then should I look upon a virgin? ” (Job 31:1). Rava says: Dust should be put in the mouth of Job for saying this; he did not look at other women, but Abraham did not even look at his own wife, as it is written: “Now I know that you are a beautiful woman” (Genesis 12:11). One may learn by inference that initially he did not know how beautiful she was because he had not gazed at her."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "Job 10:7",
          "verseText": "“Although You know that I am not wicked, and there is none that can deliver out of Your hand”",
          "talmudLocation": "Bava Batra 16a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-12",
          "talmudFullText": "The Talmud continues to discuss Job’s statements: “Although You know that I am not wicked, and there is none that can deliver out of Your hand” (Job 10:7). Rava says: Job sought to exempt the whole world from judgment,  claiming that all of a person’s actions are directed by God, and therefore one cannot be held culpable for his misdeeds. Job said before God: God!, You created the ox with split hooves,  making it kosher, and You created the donkey with closed hooves,  making it forbidden; You created the Garden of Eden,  and You created Gehenna;  and similarly, You created righteous people and You created wicked people; who can restrain You?  Seeing that You created people as either righteous or wicked, You cannot later complain about their actions."
        },
        {
          "verseLocation": "Job 10:11",
          "verseText": "are made to protect their innards, as it is stated: “With skin and flesh You have clothed me, and with bones and sinews You have knitted me together”",
          "talmudLocation": "Sukkah 21b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/21b#section-5",
          "talmudFullText": "Rather, Rava rejected that explanation and said: Oxen are different and their status is that of a tent since their bellies and backs are made to protect their innards, as it is stated: “With skin and flesh You have clothed me, and with bones and sinews You have knitted me together” (Job 10:11). Since flesh and skin are mentioned in the verse as providing shelter, the status of the oxen is that of a tent."
        },
        {
          "verseLocation": "Job 10:12",
          "verseText": "supports him, as it is stated: “And Your Providence [ pekudatekha ] has preserved my spirit”",
          "talmudLocation": "Sanhedrin 91b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/91b#section-6",
          "talmudFullText": "And Antoninos said to R' Yehuda HaNasi: From when is the soul placed in a person?  Is it from the moment of conception or from the moment of the formation of the embryo, forty days after conception? R' Yehuda HaNasi said to him:  It is from the moment of the formation of the embryo. Antoninos said to him:  That is inconceivable. Is it possible that a piece of meat could stand for even three days without salt as a preservative and would not rot?  The embryo could not exist for forty days without a soul. Rather,  the soul is placed in man from the moment of conception. R' Yehuda HaNasi said: Antoninos taught me this matter, and there is a verse that supports him, as it is stated: “And Your Providence [pekudatekha] has preserved my spirit” (Job 10:12) indicating that it is from the moment of conception [pekida] that the soul is preserved within a person."
        },
        {
          "verseLocation": "Job 10:22",
          "verseText": "of aggada . As it is stated: “A land of thick darkness, as darkness itself; a land of the shadow of death, without any order”",
          "talmudLocation": "Sotah 49a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/49a#section-8",
          "talmudFullText": "The Talmud poses a question: But if everything is deteriorating, why does the world continue to exist?  The Talmud answers: By the sanctification that is said in the order of prayers, after the passage that begins: And a redeemer shall come to Israel, which includes the recitation and translation of the sanctification said by the angels, and by the response: Let His great name be blessed, etc., which is recited after the study of aggada. As it is stated: “A land of thick darkness, as darkness itself; a land of the shadow of death, without any order” (Job 10:22). Therefore,  it can be inferred from this verse that if there are orders of prayer and study, the land shall appear from amidst the darkness. "
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "Job 11:9",
          "verseText": "did not explain it, as it is written: “Its measure is longer than the earth and broader than the sea”",
          "talmudLocation": "Eruvin 21a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/21a#section-14",
          "talmudFullText": "Rav Ḥisda explains: This idea was stated by David, but he did not explain it, as it is written: “I have seen a limit to every purpose; but Your commandment is exceedingly broad, ” i.e., he stated that the Torah is exceedingly broad, but he did not explain how broad. And likewise this idea was stated by Job, but he too did not explain it, as it is written: “Its measure is longer than the earth and broader than the sea” (Job 11:9)."
        },
        {
          "verseLocation": "Job 11:12",
          "verseText": "after he eats and drinks he has only one heart, as it is stated: “A hollow [ nevuv ] man is two-hearted”",
          "talmudLocation": "Bava Batra 12b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/12b#section-7",
          "talmudFullText": "Having already cited one statement of R' Avdimi from Haifa, the Talmud cites another statement in his name: R' Avdimi from Haifa says: Before a person eats and drinks he has two hearts,  meaning his heart is unsettled because he is distracted by hunger. But after he eats and drinks he has only one heart, as it is stated: “A hollow [nevuv] man is two-hearted” (Job 11:12). How is it indicated that “nevuv” means hungry? As it is written concerning the altar: “Nevuv luḥot” (Exodus 27:8), which we translate into Aramaic as: Hollow with planks,  meaning that a hollow person, i.e., one who has not yet eaten, is two-hearted."
        },
        {
          "verseLocation": "Job 11:14",
          "verseText": "let not injustice dwell in your tents”",
          "talmudLocation": "Ketubot 19a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/19a#section-12",
          "talmudFullText": "Rav Ashi said: Actually,  it is the witnesses who are saying it, and it is a case where their handwriting does not emerge from another place. And with regard to that which you are saying: Why are they not deemed credible,  it is in accordance with the opinion of Rav Kahana, as Rav Kahana said: It is prohibited for a person to keep a document of trust in his house, as it is stated:  “And let not injustice dwell in your tents” (Job 11:14). This false document is likely to engender injustice when the lender seeks to collect payment with it."
        },
        {
          "verseLocation": "Job 11:14",
          "verseText": "let not injustice dwell in your tents”",
          "talmudLocation": "Ketubot 19b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/19b#section-2",
          "talmudFullText": "R' Yehoshua ben Levi said: It is prohibited for a person to keep a repaid document within his house, due to the fact that the verse states:  “And let not injustice dwell in your tents” (Job 11:14). Even if he does not use the document to collect payment, the concern is that it might fall into the hands of one who will use it illegally to collect payment. In the West,  in Eretz Yisrael, they say in the name of Rav:  With regard to the first half of the verse: “If iniquity be in your hand, put it far away” (Job 11:14), this is referring to a document of trust and a document of security [passim].  With regard to the second half of the verse: “And let not injustice dwell in your tents, ” this is referring to a repaid document. "
        },
        {
          "verseLocation": "Job 11:14",
          "verseText": "let not injustice dwell in your tents”",
          "talmudLocation": "Ketubot 19b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/19b#section-4",
          "talmudFullText": "On a similar note it is stated,  with regard to keeping items with potential to lead to transgression: With regard to a Torah scroll that is not proofread and therefore contains errors, R' Ami says: It is permitted to keep it without emending the mistakes for up to thirty days,  and from that time onward it is prohibited to keep it, as it is stated:  “And let not injustice dwell in your tents” (Job 11:14)."
        },
        {
          "verseLocation": "Job 11:20",
          "verseText": "be lost, as it is stated: “But the eyes of the wicked shall fail, and they shall have no way to flee, and their hope shall be the drooping of the soul”",
          "talmudLocation": "Rosh Hashanah 31a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/31a#section-18",
          "talmudFullText": "R' Yoḥanan said:  For six months the Shekhina lingered in the wilderness,  waiting for the Jewish people,  hoping that perhaps they would repent and it would be able to return to its place. When they did not repent,  the Shekhina said: Let them despair and be lost, as it is stated: “But the eyes of the wicked shall fail, and they shall have no way to flee, and their hope shall be the drooping of the soul” (Job 11:20). This concludes the discussion of the ten stages of the exile of the Shekhina from the Holy of Holies."
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "Job 12:4",
          "verseText": "about himself: “I am as one that is a laughingstock to his neighbor,",
          "talmudLocation": "Chagigah 5b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/5b#section-21",
          "talmudFullText": "The Talmud relates: Rav Idi, father of R' Ya’akov bar Idi, would regularly travel three months on the road to reach the study hall and as he would immediately travel back again to arrive home for the festival of Sukkot, he spent only one day in the school of Rav. And the rabbis would disparagingly call him: A student of Torah for one day. He was offended and read the following verse about himself: “I am as one that is a laughingstock to his neighbor,  a man who calls upon God, and He answers him” (Job 12:4). R' Yoḥanan said to him: Please do not punish the rabbis,  i.e., do not take offense and be harsh with them, as this will cause them to be punished by God."
        },
        {
          "verseLocation": "Job 12:5",
          "verseText": "which is written: “A contemptible torch [ lapid ] in the thought of him that is at ease, a thing ready for them whose foot slips”",
          "talmudLocation": "Sanhedrin 108b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108b#section-2",
          "talmudFullText": "Rava taught: What is the meaning of that which is written: “A contemptible torch [lapid] in the thought of him that is at ease, a thing ready for them whose foot slips” (Job 12:5)? This teaches that Noah the righteous would rebuke the people of his generation, and he said to them statements that are harsh as torches [kelapidim], and they would treat him with contempt. They said to him: Old man, why are you building this ark?  Noah said to them: God is bringing a flood upon you. They said to him: A flood of what? If it is a flood of fire, we have another item and it is called alita,  and it is fireproof. And if it is a flood of water that He brings, if He brings the water from the earth, we have iron plates with which we can plate the earth to prevent the water from rising. And if He brings the water from the heavens, we have an item and it is called ekev, and some say it is called ikkesh,  which will absorb the water."
        },
        {
          "verseLocation": "Job 12:6",
          "verseText": "Ishmaelites, as it is written: “The tents of robbers prosper, and they that provoke God are secure, in whatsoever God brings with His hand”",
          "talmudLocation": "Sukkah 52b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52b#section-8",
          "talmudFullText": "Ishmaelites, as it is written: “The tents of robbers prosper, and they that provoke God are secure, in whatsoever God brings with His hand” (Job 12:6). God brought upon Himself these Arabs that dwell in the deserts in tents. The evil inclination, as it is written:  “On that day, says YHWH, will I assemble her that is lame, and I will gather her that is driven away, and her that I corrupted” (Micah 4:6). God is saying that He created the evil inclination that led the people to sin and to be cast into exile."
        },
        {
          "verseLocation": "Job 12:12",
          "verseText": "Rabbi Yishmael, son of Rabbi Yosei, says: As Torah scholars grow older, wisdom is increased in them, as it is stated: “With aged men is wisdom; and length of days brings understanding”",
          "talmudLocation": "Shabbat 152a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/152a#section-10",
          "talmudFullText": "Rav said: Barzilai the Gileadite was a liar and he merely wanted to avoid joining David upon his return to Jerusalem, for an eighty-year old man is not usually this debilitated. For there was a particular female slave in the house of R' Yehuda HaNasi who was ninety-two years old, and she would taste the food that was cooking in the pots. Rava said:  Barzilai was speaking the truth, but Barzilai the Gileadite was steeped in promiscuity, and anyone who is steeped in promiscuity is overtaken by old age before his time. It was taught in a baraita that R' Yishmael ben Yosei, says: As Torah scholars grow older, wisdom is increased in them, as it is stated: “With aged men is wisdom; and length of days brings understanding” (Job 12:12). And as ignoramuses grow older, foolishness is increased in them, as it is stated: “He removes the speech of men of trust and takes away the understanding of the aged” (Job 12:20)."
        },
        {
          "verseLocation": "Job 12:20",
          "verseText": "And as ignoramuses grow older, foolishness is increased in them, as it is stated: “He removes the speech of men of trust and takes away the understanding of the aged”",
          "talmudLocation": "Shabbat 152a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/152a#section-10",
          "talmudFullText": "Rav said: Barzilai the Gileadite was a liar and he merely wanted to avoid joining David upon his return to Jerusalem, for an eighty-year old man is not usually this debilitated. For there was a particular female slave in the house of R' Yehuda HaNasi who was ninety-two years old, and she would taste the food that was cooking in the pots. Rava said:  Barzilai was speaking the truth, but Barzilai the Gileadite was steeped in promiscuity, and anyone who is steeped in promiscuity is overtaken by old age before his time. It was taught in a baraita that R' Yishmael ben Yosei, says: As Torah scholars grow older, wisdom is increased in them, as it is stated: “With aged men is wisdom; and length of days brings understanding” (Job 12:12). And as ignoramuses grow older, foolishness is increased in them, as it is stated: “He removes the speech of men of trust and takes away the understanding of the aged” (Job 12:20)."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "Job 13:4",
          "verseText": "“But you are plasterers of lies, you are all physicians of no value [ elil ]”",
          "talmudLocation": "Chullin 121a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/121a#section-3",
          "talmudFullText": "The Talmud raises an objection to the explanation of Reish Lakish from that which is written: “But you are plasterers of lies, you are all physicians of no value [elil]” (Job 13:4). The term “no value [elil]” stems from the same linguistic root as the word alal. Granted, according to the one who says that the word alal is referring to the nuchal ligament,  i.e., R' Yoḥanan, that is why Job accused his companions of giving advice without merit by making an analogy to a physician who attempts to heal the nuchal ligament, which cannot be healed. But according to the one who says that the word alal is referring to the meat residue that is attached to the hide after the knife has flayed the flesh, i.e., Reish Lakish, flesh that is hanging from the hide is able to be healed. "
        },
        {
          "verseLocation": "Job 13:15",
          "verseText": "“Though He slay me, I will trust in Him”",
          "talmudLocation": "Berakhot 10a:32",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10a#section-32",
          "talmudFullText": "With regard to the fact that one should not despair of God’s mercy, the Talmud cites that it was also said that R' Yoḥanan and R' Eliezer both said: Even if a sharp sword is resting upon a person’s neck, he should not prevent himself from praying for mercy, as it is stated in the words of Job: “Though He slay me, I will trust in Him” (Job 13:15). Even though God is about to take his life, he still prays for God’s mercy."
        },
        {
          "verseLocation": "Job 13:15",
          "verseText": "On that same day Rabbi Yehoshua ben Hyrcanus taught: Job served the Holy One, Blessed be He, only out of love, as it is stated: “Though He will slay me, still I will trust in Him”",
          "talmudLocation": "Sotah 27b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/27b#section-13",
          "talmudFullText": "On that same day R' Yehoshua ben Hyrcanus taught: Job served God only out of love, as it is stated: “Though He will slay me, still I will trust in Him” (Job 13:15). And still, the matter is even,  i.e., the verse is ambiguous, as there are two possible interpretations of the verse. Was Job saying: I will await Him,  expressing his yearning for God; or should the verse be interpreted as saying I will not await Him. As the word “lo” can mean either “to him” or “not,” it is unclear which meaning is intended here. This dilemma is resolved elsewhere, where the verse states a clearer indication of Job’s intent: “Till I die I will not put away my integrity from me” (Job 27:5). This teaches that he acted out of love. "
        },
        {
          "verseLocation": "Job 13:15",
          "verseText": "only",
          "talmudLocation": "Sotah 31a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/31a#section-3",
          "talmudFullText": "§ On that same day R' Yehoshua ben Hyrcanus taught that Job served God, only out of love, as it is stated: “Though He will slay me, still I will trust in Him [lo]” (Job 13:15). The Mishnah continues that the word lo in the verse is ambiguous as to whether it is indicative of Job expressing his yearning for God or his lack thereof. The Talmud asks: Let us see whether this word lo is written lamed alef,  and therefore its meaning is:  I will not trust, or whether it is written lamed vav,  according to which its meaning is:  I trust in Him.  Why is there room for doubt with regard to the meaning of the verse?"
        },
        {
          "verseLocation": "Job 13:16",
          "verseText": "the group of flatterers, as it is written: “That a flatterer shall not come before Him”",
          "talmudLocation": "Sanhedrin 103a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103a#section-12",
          "talmudFullText": "Apropos the previous statement, the Talmud cites an additional statement. And Rav Ḥisda says that R' Yirmeya bar Abba says that four groups do not receive the Shekhina:  This pertains to the group of cynics, the group of liars, the group of flatterers,  and the group of slanderers.  This pertains to the group of cynics, as it is written: “He withdrew His hand with cynics” (Hosea 7:5), indicating that God distanced Himself from them. This pertains to the group of liars, as it is written: “He that speaks falsehoods shall not be established before My eyes” (Psalms 101:7). This pertains to the group of flatterers, as it is written: “That a flatterer shall not come before Him” (Job 13:16). This pertains to the group of slanderers, as it is stated: “For You are not a God who desires wickedness; evil shall not dwell with You” (Psalms 5:5), which means: You are righteous, and there will be no form of evil in Your dwelling. "
        },
        {
          "verseLocation": "Job 13:16",
          "verseText": "the class of flatterers, as it is written: “That a flatterer cannot come before Him”",
          "talmudLocation": "Sotah 42a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42a#section-5",
          "talmudFullText": "The proof for this statement is as follows: The class of cynics, as it is written: “He draws His hand from cynics” (Hosea 7:5), i.e., God does not want to be in their presence; the class of flatterers, as it is written: “That a flatterer cannot come before Him” (Job 13:16); the class of liars, as it is written: “He who speaks falsehood shall not dwell before My eyes” (Psalms 101:7)."
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "Job 14:4",
          "verseText": "not the One?”",
          "talmudLocation": "Niddah 9a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/9a#section-13",
          "talmudFullText": "That explanation is also taught in a baraita: Menstrual blood spoils and becomes milk;  this is the statement of R' Meir. R' Yosei says: Her limbs become dislocated and her spirit does not return to her until twenty-four months have passed. The Talmud analyzes their respective reasons. R' Ilai says: What is the reason of R' Meir?  It is based upon a verse, as it is written: “Who can bring a pure thing out of an impure?  Is it not the One? ” (Job 14:4). In other words, is it not true that the One, i.e., God, can bring a pure thing, such as milk, out of an impure thing, such as menstrual blood?"
        },
        {
          "verseLocation": "Job 14:19",
          "verseText": "and it states: “The water wears the stones”",
          "talmudLocation": "Kiddushin 30b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/30b#section-8",
          "talmudFullText": "A Sage from the school of R' Yishmael taught: My son, if this wretched one,  the evil inclination, encounters you, pull it into the study hall,  i.e., go and study Torah. If it is a stone it will melt, and if it is iron it will break, as it is stated with regard to the Torah: “Is not My word like fire, says YHWH, and like a hammer that breaks the rock in pieces? ” (Jeremiah 23:29). Just as a stone shatters a hammer, so too one can overcome his evil inclination, which is as strong as iron, through Torah study. With regard to the second part of the statement: If it is a stone it will melt,  this is as it is stated with regard to the Torah: “Ho, everyone who thirsts, come for water” (Isaiah 55:1), and it states: “The water wears the stones” (Job 14:19), indicating that water is stronger than stone."
        },
        {
          "verseLocation": "Job 14:19",
          "verseText": "and it is written: “Stones were worn by water”",
          "talmudLocation": "Sukkah 52b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52b#section-2",
          "talmudFullText": "The school of R' Yishmael taught: If this scoundrel,  the evil inclination, accosted you,  seeking to tempt you to sin, drag it to the study hall and study Torah. If it is like a stone, it will be dissolved by the Torah. If it is like iron, it will be shattered.  The Talmud elaborates: If it is like stone, it will be dissolved, as it is written: “Ho, everyone who is thirsty, come you for the water” (Isaiah 55:1), water in this context meaning Torah; and it is written: “Stones were worn by water” (Job 14:19). If it is like iron, it will be shattered, as it is written: “Is not My word like fire, says YHWH; and like a hammer that shatters rock” (Jeremiah 23:29)."
        },
        {
          "verseLocation": "Job 14:21",
          "verseText": "anguish? The other said to him: From where would he know? Isn’t it written: “His sons are honored yet he shall not know it,",
          "talmudLocation": "Berakhot 18b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/18b#section-4",
          "talmudFullText": "The Talmud relates a story on this topic: The sons of R' Ḥiyya went out to the villages to oversee the laborers. They forgot what they had learned and were struggling to recall it. One of them said to the other:  Does our deceased father know of our anguish? The other said to him: From where would he know? Isn’t it written: “His sons are honored yet he shall not know it,  they come to sorrow and he shall not understand them” (Job 14:21)? The dead do not know."
        },
        {
          "verseLocation": "Job 14:22",
          "verseText": "not know? Isn’t it written: “Only in his flesh does he feel pain, in his soul does he mourn”",
          "talmudLocation": "Berakhot 18b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/18b#section-5",
          "talmudFullText": "The other said back to him: And do the dead truly not know? Isn’t it written: “Only in his flesh does he feel pain, in his soul does he mourn” (Job 14:22)? Based on this verse R' Yitzḥak said:  Gnawing maggots are as excruciating to the dead as the stab of a needle to the flesh of the living.  The dead must have the capacity to feel and know."
        },
        {
          "verseLocation": "Job 14:22",
          "verseText": "“But his flesh shall hurt him, and his soul mourns over him”",
          "talmudLocation": "Shabbat 13b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/13b#section-7",
          "talmudFullText": "Alternatively: The flesh of a dead person does not feel the scalpel [izemel] cutting into him, and we, too, are in such a difficult situation that we no longer feel the pains and troubles. With regard to the last analogy, the Talmud asks: Is that so? Didn’t Rav Yitzḥak say: The gnawing of maggots is as excruciating to the dead as the stab of a needle is to the flesh of the living,  as it is stated with regard to the dead: “But his flesh shall hurt him, and his soul mourns over him” (Job 14:22)? Rather, say and explain the matter: The dead flesh in parts of the body of the living person that are insensitive to pain does not feel the scalpel that cuts him."
        },
        {
          "verseLocation": "Job 14:22",
          "verseText": "“But his flesh is in pain for him,",
          "talmudLocation": "Shabbat 152a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/152a#section-15",
          "talmudFullText": "And R' Yitzḥak said: The maggots that eat the flesh of the deceased are as painful to the dead as a needle in the flesh of the living, as it says with regard to the dead: “But his flesh is in pain for him,  and his soul mourns over him” (Job 14:22). Rav Ḥisda said: A person’s soul mourns for him during all seven days of mourning following his death, as it is stated: And his soul mourns over him, ” and it is also written: “And he mourned his father seven days” (Genesis 50:10)."
        },
        {
          "verseLocation": "Job 14:22",
          "verseText": "“But his flesh grieves for him, and his soul mourns over him”",
          "talmudLocation": "Shabbat 152b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/152b#section-3",
          "talmudFullText": "The one who said that it is until the flesh decomposes can support his position based on that which is written in the following verse: “But his flesh grieves for him, and his soul mourns over him” (Job 14:22). This indicates that the deceased is aware of the pain of his flesh in the grave. The one who said that the deceased is aware only until the tomb is sealed with the top-stone can support his view based on that which is written in a different verse: “And the dust returns to the earth as it was,  and the spirit returns to God who gave it” (Ecclesiastes 12:7). This indicates that when the body returns to the earth, the spirit also returns to its place and is no longer aware of what is happening to the body."
        }
      ]
    },
    {
      "chapterNumber": 15,
      "citations": [
        {
          "verseLocation": "Job 15:4",
          "verseText": "And how did Job’s friends answer him? “You do away with fear, and impair devotion before God”",
          "talmudLocation": "Bava Batra 16a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-13",
          "talmudFullText": "And how did Job’s friends answer him? “You do away with fear, and impair devotion before God” (Job 15:4) with such statements. True, God created the evil inclination,  but He also created the Torah as an antidote to counter its effects and prevent it from gaining control of a person."
        },
        {
          "verseLocation": "Job 15:5",
          "verseText": "“And you choose the language of the crafty”",
          "talmudLocation": "Pesachim 3a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/3a#section-12",
          "talmudFullText": "Likewise, a baraita was taught in the school of R' Yishmael: A person should always converse euphemistically, as one finds in the following verses. The first: “And whichever saddle that the zav rides upon shall be ritually impure” (Leviticus 15:9), which discusses the impurity imparted by a zav to an object on which he sits, calls this action riding. And the verse: “And anyone who touches anything on which she sat” (Leviticus 15:22), which discusses the parallel ritual impurity of a woman,  a zava, calls the action sitting.  Since riding is slightly demeaning for a woman, as it involves an immodest splaying of the legs, the verse avoids the term riding and opts to convey the more modest image of sitting. And it says in another verse: “And you choose the language of the crafty” (Job 15:5), meaning that one should be clever when speaking and avoid inappropriate phrases. And it says in another verse: “My words shall utter the uprightness of my heart; and that which my lips know they shall speak sincerely” (Job 33:3)."
        },
        {
          "verseLocation": "Job 15:7",
          "verseText": "as the verse stated: “Are you first [ rishon ] man born?",
          "talmudLocation": "Pesachim 5a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/5a#section-6",
          "talmudFullText": "The school of R' Yishmael taught: We found that the fourteenth day is called: First, as it is stated: “On harishon, on the fourteenth day of the month” (Exodus 12:18). Rav Naḥman bar Yitzḥak said:  It is evident from the verse itself that it is referring to the removal of leaven on the fourteenth, as rishon means previous.  In this context, first means the day that precedes the others, i.e., the day before the Festival begins, as the verse stated: “Are you first [rishon] man born?  Or were you brought forth before the hills? ” (Job 15:7). Based on the parallelism between the two parts of the verse, the word rishon here means before; the one preceding all others."
        },
        {
          "verseLocation": "Job 15:15",
          "verseText": "when Rabbi Yoḥanan reached this verse, he cried: “Behold He puts no trust in His sacred ones”",
          "talmudLocation": "Chagigah 5a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/5a#section-4",
          "talmudFullText": "§ The Talmud returns to the previous topic. When R' Yoḥanan reached this verse, he cried,  as God said to the Satan about Job: “Although you did incite Me against him, to destroy him without cause” (Job 2:3). R' Yoḥanan said: With regard to a slave whose master is one whom others incite to act harshly against the slave and the master is incited to do so, is there a remedy for the slave? Additionally, when R' Yoḥanan reached this verse, he cried: “Behold He puts no trust in His sacred ones” (Job 15:15), saying: If He does not place trust in His sacred ones, in whom does He place trust? "
        },
        {
          "verseLocation": "Job 15:16",
          "verseText": "called loathsome, as it is stated: “What then of one loathsome and foul, man who drinks iniquity like water”",
          "talmudLocation": "Yoma 72b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/72b#section-10",
          "talmudFullText": "Abaye said, and some say it was Rabba bar Ulla who said: Not only is such a person not to be considered a Torah scholar, but he is called loathsome, as it is stated: “What then of one loathsome and foul, man who drinks iniquity like water” (Job 15:16). Although he drinks the Torah like water, since he sins, his Torah is considered iniquitous and this makes him loathsome and foul."
        },
        {
          "verseLocation": "Job 15:18",
          "verseText": "“That wise men told and did not hide from their fathers”",
          "talmudLocation": "Sotah 7b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/7b#section-6",
          "talmudFullText": "§ The Mishnah teaches: And the judge says in her presence matters that are not worthy of being heard by her and all her father’s family in order to encourage her to admit her sin. The Talmud cites a baraita that details what was said. A baraita states in a baraita: The judge says in her presence words of homiletical interpretation and mentions incidents that happened to previous generations that are recorded in the early prophetic writings. For example,  they expound the following verse: “That wise men told and did not hide from their fathers” (Job 15:18); this teaches that even during the time of the forefathers, there were people who admitted their sins despite the shame they incurred."
        },
        {
          "verseLocation": "Job 15:19",
          "verseText": "“To them alone the land was given, and no stranger passed among them”",
          "talmudLocation": "Sotah 7b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/7b#section-7",
          "talmudFullText": "For example, Judah admitted that he sinned with Tamar and was not embarrassed to do so, and what was his end? He inherited the life of the World-to-Come. Reuben admitted that he lay with his father’s concubine Bilhah and was not embarrassed,  and what was his end? He too inherited the life of the World-to-Come.  The Talmud asks: And what is their reward?  The Talmud interjects: What is their reward?  Their reward was clearly as we say,  that they inherited the life of the World-to-Come. The Talmud clarifies: Rather,  the second question was: What is their reward in this world?  The Talmud answers by citing the next verse in the book of Job: “To them alone the land was given, and no stranger passed among them” (Job 15:19). Judah was given the kingship, and Reuben inherited a portion of land in the Transjordan before the other tribes."
        },
        {
          "verseLocation": "Job 15:23",
          "verseText": "for it is stated: “He wanders abroad for bread: Where is it? He knows the day of darkness is ready at his hand”",
          "talmudLocation": "Beitzah 32b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/beitzah/32b#section-5",
          "talmudFullText": "This is another teaching that Rav Natan bar Abba said that Rav said: Whoever looks to the table of others for his sustenance, the world is dark for him.  Everything looks bleak and hopeless to him, for it is stated: “He wanders abroad for bread: Where is it? He knows the day of darkness is ready at his hand” (Job 15:23). Rav Ḥisda said: Even his life is no life,  as he receives no satisfaction from it."
        },
        {
          "verseLocation": "Job 15:34",
          "verseText": "And Rabbi Elazar says: Any congregation in which there is flattery is as repulsive as a menstruating woman, as it is stated: “For a flattering congregation shall be desolate [ galmud ]”",
          "talmudLocation": "Sotah 42a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42a#section-2",
          "talmudFullText": "And R' Elazar says: Any congregation in which there is flattery is as repulsive as a menstruating woman, as it is stated: “For a flattering congregation shall be desolate [galmud]” (Job 15:34), and in the cities overseas they call a menstruating woman galmuda. What is the meaning of the word galmuda?  It means separated [gemula] from her husband [mibbala]. "
        },
        {
          "verseLocation": "Job 15:34",
          "verseText": "And Rabbi Elazar says: Any congregation in which there is flattery is ultimately exiled. It is written here: “For a flattering congregation shall be desolate [ galmud ]”",
          "talmudLocation": "Sotah 42a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42a#section-3",
          "talmudFullText": "And R' Elazar says: Any congregation in which there is flattery is ultimately exiled. It is written here: “For a flattering congregation shall be desolate [galmud]” (Job 15:34), and it is written there: “Then you will say in your heart: Who has begotten me these, seeing I have been bereaved of my children, and am solitary [galmuda], an exile, and wandering? ” (Isaiah 49:21). The verse states: “An exile,” as an appositive to “galmuda,” indicating that they are the same."
        }
      ]
    },
    {
      "chapterNumber": 16,
      "citations": [
        {
          "verseLocation": "Job 16:13",
          "verseText": "“He pours out my gall upon the ground”",
          "talmudLocation": "Chullin 43a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/43a#section-6",
          "talmudFullText": "And R' Yitzḥak ben Yosef, says that R' Yoḥanan says: What did the friends of R' Yosei ben Yehuda, respond to him?  They responded that Job said: “He pours out my gall upon the ground” (Job 16:13), and yet Job was still alive.  Evidently, one with a perforated gallbladder can live. R' Yosei said to them:  Job was kept alive by a miracle, and one does not mention miraculous acts as proof for a general ruling. As, if you do not say so,  then the other phrase in the verse: “He cleaves my kidneys asunder, and does not spare, ” is problematic. Does one with cleaved kidneys live? Rather, a miracle is different, as it is written that God said to Satan with regard to Job: “Only spare his life” (Job 2:6). Under natural circumstances, Job should have died from his injuries, but in this case he was kept alive by a miracle. Here too,  with regard to the gallbladder, one must say that a miracle is different,  and one cannot bring proof from it."
        }
      ]
    },
    {
      "chapterNumber": 18,
      "citations": [
        {
          "verseLocation": "Job 18:4",
          "verseText": "as it is stated: “You who throw your soul in your face, for your sake will the earth be forsaken?",
          "talmudLocation": "Berakhot 5b:25",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/5b#section-25",
          "talmudFullText": "Another of Abba Binyamin’s statements with regard to the laws of prayer was taught in a baraita: Abba Binyamin says: If two people enter a synagogue outside of the city in order to pray, and one began praying before the other and did not wait for the other person to complete his prayer, and left him alone in the synagogue, his prayer is thrown back in his face.  Because he left the other person alone and caused him to be distracted during his prayer, his own prayer is thrown back in his face, as it is stated: “You who throw your soul in your face, for your sake will the earth be forsaken?  The Rock will be moved from its place” (Job 18:4). This verse indicates that one who left the other person alone effectively causes his soul, as prayer is the outpouring of the soul before God, to be thrown in his face. God says to that person: For your sake, do you think because you left, the earth will be forsaken, that God will leave the world and the prayer of the other person will go unheard?"
        },
        {
          "verseLocation": "Job 18:6",
          "verseText": "any man whose wife dies in his days, the world is dark for him, as it is stated: “The light shall be dark in his tent and his lamp over him shall be put out”",
          "talmudLocation": "Sanhedrin 22a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-19",
          "talmudFullText": "R' Alexandri says:  For any man whose wife dies in his days, the world is dark for him, as it is stated: “The light shall be dark in his tent and his lamp over him shall be put out” (Job 18:6), since the word tent is commonly employed as a metonym for a wife. R' Yosei bar Ḥanina says: His steps get shorter, as it is stated: “The steps of his strength shall be constrained” (Job 18:7). R' Abbahu says: His counsel falls, as it is stated: “And his own counsel shall cast him down” (Job 18:7)."
        },
        {
          "verseLocation": "Job 18:7",
          "verseText": "Rabbi Yosei bar Ḥanina says: His steps get shorter, as it is stated: “The steps of his strength shall be constrained”",
          "talmudLocation": "Sanhedrin 22a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-19",
          "talmudFullText": "R' Alexandri says:  For any man whose wife dies in his days, the world is dark for him, as it is stated: “The light shall be dark in his tent and his lamp over him shall be put out” (Job 18:6), since the word tent is commonly employed as a metonym for a wife. R' Yosei bar Ḥanina says: His steps get shorter, as it is stated: “The steps of his strength shall be constrained” (Job 18:7). R' Abbahu says: His counsel falls, as it is stated: “And his own counsel shall cast him down” (Job 18:7)."
        },
        {
          "verseLocation": "Job 18:19",
          "verseText": "in the world? But isn’t it stated: “He shall have neither son nor grandson among his people or any remaining in his dwellings”",
          "talmudLocation": "Chagigah 15b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/15b#section-5",
          "talmudFullText": "The Talmud relates: The daughter of Aḥer came before R' Yehuda HaNasi and said to him: R', provide me with sustenance,  as she was in need of food. He said to her: Whose daughter are you? She said to him: I am the daughter of Aḥer. He said to her,  angrily: Is there still of his seed remaining in the world? But isn’t it stated: “He shall have neither son nor grandson among his people or any remaining in his dwellings” (Job 18:19)? She said to him: Remember his Torah, and do not remember his deeds. Immediately, fire descended and licked R' Yehuda HaNasi’s bench. R' Yehuda HaNasi wept and said: If God protects the honor of those who treat the Torah with contempt in such a manner, as Aḥer despised the Torah and relinquished its teachings, how much more so would He do for those who treat it with honor. "
        }
      ]
    },
    {
      "chapterNumber": 19,
      "citations": [
        {
          "verseLocation": "Job 19:21",
          "verseText": "poverty in a person’s household is more difficult than fifty plagues, as it is stated: “Have pity upon me, have pity upon me, O you my friends; for the hand of God has touched me”",
          "talmudLocation": "Bava Batra 116a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/116a#section-14",
          "talmudFullText": "The Talmud presents the second homiletic interpretation: R' Pineḥas ben Ḥama interpreted a verse homiletically,  and derived that poverty in a person’s household is more difficult than fifty plagues, as it is stated: “Have pity upon me, have pity upon me, O you my friends; for the hand of God has touched me” (Job 19:21), and his friends were saying to him: “Take heed, regard not iniquity; for this have you chosen rather than poverty” (Job 36:21). Job, who suffered many plagues, was told by his friends that his suffering was preferable to poverty."
        },
        {
          "verseLocation": "Job 19:23",
          "verseText": "“Oh, that my words were written now [ eifo ]”",
          "talmudLocation": "Bava Batra 15a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15a#section-11",
          "talmudFullText": "The baraita further states that Moses wrote his own book,  i.e., the Torah, the portion of Balaam, and the book of Job. This supports R' Levi bar Laḥma, as R' Levi bar Laḥma says: Job lived in the time of Moses. It is written here with regard to Job: “Oh, that my words were written now [eifo]” (Job 19:23), and it is written there in Moses’ words to God: “For in what shall it be known here [eifo]” (Exodus 33:16). The unusual use of the word eifo in these two places indicates that Job and Moses lived in the same generation."
        },
        {
          "verseLocation": "Job 19:23",
          "verseText": "were inscribed [ veyuḥaku ] in a book”",
          "talmudLocation": "Bava Batra 15a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15a#section-13",
          "talmudFullText": "The Talmud answers: It could not enter your mind to say this, as it is written in the continuation of the previously mentioned verse: “Oh, that my words were inscribed [veyuḥaku] in a book” (Job 19:23), and it is Moses who is called the inscriber, as it is written with regard to him: “And he provided the first part for himself, for there was the inscriber’s [meḥokek] portion reserved” (Deuteronomy 33:21)."
        },
        {
          "verseLocation": "Job 19:27",
          "verseText": "my eyes have seen it, and not another’s”",
          "talmudLocation": "Shabbat 145a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/145a#section-9",
          "talmudFullText": "He said to him:  You can certainly rely on my version of this statement. To underscore his point, he uttered the oath-like expression: By God! and applied the verse: “Whom I shall see for myself; my eyes have seen it, and not another’s” (Job 19:27). I heard this tradition from the mouth of R' Yirmeya, and R' Yirmeya heard it from R' Zeira, and R' Zeira heard it from Rav Ḥiyya bar Ashi, and Rav Ḥiyya bar Ashi heard it from Rav,  and each transmitter of this tradition is a reliable source."
        }
      ]
    },
    {
      "chapterNumber": 20,
      "citations": [
        {
          "verseLocation": "Job 20:15",
          "verseText": "which is written: “He has swallowed riches and he shall vomit them again; God shall cast them out of his belly”",
          "talmudLocation": "Sanhedrin 106b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106b#section-9",
          "talmudFullText": "And R' Yitzḥak says: What is the meaning of that which is written: “He has swallowed riches and he shall vomit them again; God shall cast them out of his belly” (Job 20:15)? David said before God: God!, Doeg shall die.  God said to him: “He has swallowed riches and he shall vomit them again. ” He is filled with Torah and wisdom; wait until he forgets what he has learned. David said before Him: “God shall cast them out of his belly. ” God can remove his Torah knowledge from him before he will forget it on his own."
        },
        {
          "verseLocation": "Job 20:21",
          "verseText": "And Rabbi Elazar says: Anyone who does not benefit Torah scholars from his property never sees a sign of blessing, as it is stated: “None of his food shall remain [ sarid ]; therefore his prosperity shall not endure”",
          "talmudLocation": "Sanhedrin 92a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92a#section-16",
          "talmudFullText": "And R' Elazar says: Anyone who does not benefit Torah scholars from his property never sees a sign of blessing, as it is stated: “None of his food shall remain [sarid]; therefore his prosperity shall not endure” (Job 20:21). Sarid is referring to no one but Torah scholars, as it is stated: “And among the seridim, those whom YHWH shall call. ” No prosperity will come to one who does not share his food with a Torah scholar."
        },
        {
          "verseLocation": "Job 20:22",
          "verseText": "filled, as Rav Hamnuna says: The Holy One, Blessed be He, does not punish a person until his se’a is filled, as it is stated: “In the fullness of his sufficiency he shall be in straits”",
          "talmudLocation": "Arakhin 15a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/15a#section-9",
          "talmudFullText": "§ The Mishnah teaches: As we found that the sentence imposed on our ancestors in the wilderness was sealed only due to the malicious speech disseminated by the spies. The Talmud asks: From where is known that their punishment was due to the malicious speech of the spies? Perhaps until that time their se’a,  the measure of their sins warranting punishment, was not yet filled, as Rav Hamnuna says: God does not punish a person until his se’a is filled, as it is stated: “In the fullness of his sufficiency he shall be in straits” (Job 20:22). In other words, one is punished only when he has committed a sufficient number of sins, and the malicious speech of the spies was simply the last of a series of transgressions."
        },
        {
          "verseLocation": "Job 20:22",
          "verseText": "is filled, as it is stated: “In the fullness of his sufficiency he shall be in straits;",
          "talmudLocation": "Sotah 9a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9a#section-12",
          "talmudFullText": "Rav Hamnuna says: God does not punish a person until his se’a,  the measure that is suitable for him, is filled, as it is stated: “In the fullness of his sufficiency he shall be in straits;  the hand of every one that is in misery shall come upon him” (Job 20:22). In other words, when the sufficient measure of sin has been reached, then the trouble will overtake him."
        },
        {
          "verseLocation": "Job 20:26",
          "verseText": "to an unworthy student falls into Gehenna, as it is stated: “All darkness is laid up for his treasures; a fire not blown by man shall consume him; it shall go ill with him that remains [ yera sarid ] in his tent”",
          "talmudLocation": "Chullin 133a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/133a#section-15",
          "talmudFullText": "As Rav Yehuda said that Rav said: Anyone who teaches Torah to an unworthy student falls into Gehenna, as it is stated: “All darkness is laid up for his treasures; a fire not blown by man shall consume him; it shall go ill with him that remains [yera sarid] in his tent” (Job 20:26), and sarid means nothing other than a Torah scholar, as it is stated: “And among the remnant [sarid] those whom YHWH shall call” (Joel 3:5). The word yera shares a root with the word ra, evil, and “yera sarid” is therefore understood to be referring to an unworthy student."
        },
        {
          "verseLocation": "Job 20:26",
          "verseText": "consumes it, as it is stated: “All darkness is laid up for his treasures, a fire not fanned shall consume him; it shall go ill with a sarid in his tent”",
          "talmudLocation": "Sanhedrin 92a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92a#section-15",
          "talmudFullText": "And R' Elazar says:  With regard to any house in which there are no matters of Torah heard at night, the fire of Gehenna consumes it, as it is stated: “All darkness is laid up for his treasures, a fire not fanned shall consume him; it shall go ill with a sarid in his tent” (Job 20:26). Sarid is referring to no one but a Torah scholar, as it is stated: “And among the seridim, those whom YHWH shall call” (Joel 3:5). A house that is dark at night and in which no Torah is heard will be consumed by a fire that does not require fanning with a bellows, the fire of Gehenna."
        },
        {
          "verseLocation": "Job 20:26",
          "verseText": "fire would consume it the next day, as it is written: “A fire not blown shall consume him”",
          "talmudLocation": "Zevachim 31a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/31a#section-13",
          "talmudFullText": "R' Ami objects to this: If that is so,  then if one had intent that non-sacred fire would consume it the next day, as it is written: “A fire not blown shall consume him” (Job 20:26), this too should be piggul. And if you would say that this is indeed so, that is difficult: But didn’t we learn in the Mishnah: If his intent was to eat half an olive-bulk and to burn half an olive-bulk not at the appropriate time or in the appropriate area, the offering is fit because eating and burning do not join together? "
        }
      ]
    },
    {
      "chapterNumber": 21,
      "citations": [
        {
          "verseLocation": "Job 21:9",
          "verseText": "“Their houses are safe without fear, nor is the rod of God upon them”",
          "talmudLocation": "Sanhedrin 108a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108a#section-7",
          "talmudFullText": "A baraita states in a baraita (Tosefta, Sota 3:10): The generation of the flood became haughty and sinned due only to the excessive goodness that God bestowed upon them. And what is written concerning them,  indicating that goodness? “Their houses are safe without fear, nor is the rod of God upon them” (Job 21:9). And it is written: “Their bull sires, and will not fall; their cow calves, and does not cast her calf” (Job 21:10). And it is written: “They send forth their little ones like a flock, and their children dance” (Job 21:11). And it is written: “They sing to the timbrel and harp, and rejoice at the sound of the pipe” (Job 21:12). And it is written: “They shall spend their days in prosperity, and their years in pleasures” (Job 36:11). And it is written: “And peacefully they go down to the grave” (Job 21:13)."
        },
        {
          "verseLocation": "Job 21:10",
          "verseText": "And it is written: “Their bull sires, and will not fall; their cow calves, and does not cast her calf”",
          "talmudLocation": "Sanhedrin 108a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108a#section-7",
          "talmudFullText": "A baraita states in a baraita (Tosefta, Sota 3:10): The generation of the flood became haughty and sinned due only to the excessive goodness that God bestowed upon them. And what is written concerning them,  indicating that goodness? “Their houses are safe without fear, nor is the rod of God upon them” (Job 21:9). And it is written: “Their bull sires, and will not fall; their cow calves, and does not cast her calf” (Job 21:10). And it is written: “They send forth their little ones like a flock, and their children dance” (Job 21:11). And it is written: “They sing to the timbrel and harp, and rejoice at the sound of the pipe” (Job 21:12). And it is written: “They shall spend their days in prosperity, and their years in pleasures” (Job 36:11). And it is written: “And peacefully they go down to the grave” (Job 21:13)."
        },
        {
          "verseLocation": "Job 21:11",
          "verseText": "And it is written: “They send forth their little ones like a flock, and their children dance”",
          "talmudLocation": "Sanhedrin 108a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108a#section-7",
          "talmudFullText": "A baraita states in a baraita (Tosefta, Sota 3:10): The generation of the flood became haughty and sinned due only to the excessive goodness that God bestowed upon them. And what is written concerning them,  indicating that goodness? “Their houses are safe without fear, nor is the rod of God upon them” (Job 21:9). And it is written: “Their bull sires, and will not fall; their cow calves, and does not cast her calf” (Job 21:10). And it is written: “They send forth their little ones like a flock, and their children dance” (Job 21:11). And it is written: “They sing to the timbrel and harp, and rejoice at the sound of the pipe” (Job 21:12). And it is written: “They shall spend their days in prosperity, and their years in pleasures” (Job 36:11). And it is written: “And peacefully they go down to the grave” (Job 21:13)."
        },
        {
          "verseLocation": "Job 21:12",
          "verseText": "And it is written: “They sing to the timbrel and harp, and rejoice at the sound of the pipe”",
          "talmudLocation": "Sanhedrin 108a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108a#section-7",
          "talmudFullText": "A baraita states in a baraita (Tosefta, Sota 3:10): The generation of the flood became haughty and sinned due only to the excessive goodness that God bestowed upon them. And what is written concerning them,  indicating that goodness? “Their houses are safe without fear, nor is the rod of God upon them” (Job 21:9). And it is written: “Their bull sires, and will not fall; their cow calves, and does not cast her calf” (Job 21:10). And it is written: “They send forth their little ones like a flock, and their children dance” (Job 21:11). And it is written: “They sing to the timbrel and harp, and rejoice at the sound of the pipe” (Job 21:12). And it is written: “They shall spend their days in prosperity, and their years in pleasures” (Job 36:11). And it is written: “And peacefully they go down to the grave” (Job 21:13)."
        },
        {
          "verseLocation": "Job 21:13",
          "verseText": "And it is written: “And peacefully they go down to the grave”",
          "talmudLocation": "Sanhedrin 108a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108a#section-7",
          "talmudFullText": "A baraita states in a baraita (Tosefta, Sota 3:10): The generation of the flood became haughty and sinned due only to the excessive goodness that God bestowed upon them. And what is written concerning them,  indicating that goodness? “Their houses are safe without fear, nor is the rod of God upon them” (Job 21:9). And it is written: “Their bull sires, and will not fall; their cow calves, and does not cast her calf” (Job 21:10). And it is written: “They send forth their little ones like a flock, and their children dance” (Job 21:11). And it is written: “They sing to the timbrel and harp, and rejoice at the sound of the pipe” (Job 21:12). And it is written: “They shall spend their days in prosperity, and their years in pleasures” (Job 36:11). And it is written: “And peacefully they go down to the grave” (Job 21:13)."
        },
        {
          "verseLocation": "Job 21:32",
          "verseText": "“For he is brought to the grave, and watch is kept over his tomb”",
          "talmudLocation": "Sanhedrin 109a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/109a#section-15",
          "talmudFullText": "The Talmud cites verses that allude to the practices of the people of Sodom: “They lie at night naked without clothing, and they have no covering in the cold” (Job 24:7). And likewise: “They drive away the donkey of the fatherless; they take the widow’s ox as a pledge” (Job 24:3). And likewise: “They trespass; they violently steal flocks and graze them” (Job 24:2). And likewise: “For he is brought to the grave, and watch is kept over his tomb” (Job 21:32)."
        }
      ]
    },
    {
      "chapterNumber": 22,
      "citations": [
        {
          "verseLocation": "Job 22:8",
          "verseText": "has no remedy but burial, as it is stated: “And as a mighty man [ ve’ish zero’a ], who has the earth”",
          "talmudLocation": "Sanhedrin 58b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/58b#section-22",
          "talmudFullText": "R' Elazar says:  Such a violent person has no remedy but burial, as it is stated: “And as a mighty man [ve’ish zero’a], who has the earth” (Job 22:8). The expression ish zero’a literally means: A man of the arm, and the verse is interpreted homiletically to mean that one who habitually strikes others deserves to be buried."
        },
        {
          "verseLocation": "Job 22:16",
          "verseText": "as it is stated: “Who were snatched away before their time, whose foundation was poured out as a stream”",
          "talmudLocation": "Chagigah 13b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/13b#section-14",
          "talmudFullText": "The Talmud asks: From where does this river flow?  The Talmud answers: From the perspiration of the divine creatures. And where does it flow to? Rav Zutra bar Toviya said that Rav said: Upon the heads of the wicked in Gehenna, as it is stated: “Behold, a storm of YHWH has gone forth in fury, a whirling storm; it shall whirl upon the head of the wicked” (Jeremiah 23:19). And Rav Aḥa bar Ya’akov said:  The river flows over those who were snatched away,  i.e., the generations that were never created, as it is stated: “Who were snatched away before their time, whose foundation was poured out as a stream” (Job 22:16), implying that the River Dinur flows over them. It is taught in a baraita: R' Shimon HeḤasid said in explanation of this verse: These people “who were snatched away” are those nine hundred and seventy-four generations that were snatched away;  they were to have been created"
        },
        {
          "verseLocation": "Job 22:16",
          "verseText": "“Who were snatched [ kumtu ]”",
          "talmudLocation": "Chagigah 14a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/14a#section-2",
          "talmudFullText": "And Rav Naḥman bar Yitzḥak said that the verse: “Who were snatched [kumtu]” (Job 22:16), is written for a blessing,  as the verse is not referring to lowly, cursed people, but to the blessed. These are Torah scholars, who shrivel [mekamtin],  i.e., humble, themselves over the words of Torah in this world. God reveals a secret to them in the World-to-Come, as it is stated: “Whose foundation [yesodam] was poured out as a stream” (Job 22:16), implying that He will provide them with an abundant knowledge of secret matters [sod]."
        },
        {
          "verseLocation": "Job 22:25",
          "verseText": "be doubled, as it is stated: “And the Almighty be your treasure, and precious [ toafot ] silver unto you”",
          "talmudLocation": "Berakhot 63a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/63a#section-20",
          "talmudFullText": "Rav Huna bar Berekhya said in the name of R' Elazar HaKappar: Anyone who includes the name of heaven in his distress,  i.e., who turns and prays to God in his time of trouble, his livelihood will ultimately be doubled, as it is stated: “And God be your treasure, and precious [toafot] silver unto you” (Job 22:25). If you include God in your trouble, your silver will be doubled. Eif, which in Aramaic means double, is etymologically similar to toafot."
        },
        {
          "verseLocation": "Job 22:28",
          "verseText": "would have been fulfilled for me: “And you shall decree a matter and it will be established for you,",
          "talmudLocation": "Bava Metzia 106a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/106a#section-2",
          "talmudFullText": "The Talmud poses another question: If the owner said to the tenant farmer: Plant the field with wheat, and he went and planted it with barley, and most of the valley was wind blasted, and these fields with barley of his were also wind blasted, what is the halakha? Do we say that the tenant farmer can say to him:  Even if I had planted it with wheat it would likewise have been wind blasted,  as all the surrounding fields suffered the same fate, or perhaps the owner can say to him: Had you planted it with wheat,  the following verse would have been fulfilled for me: “And you shall decree a matter and it will be established for you,  and the light shall shine upon your ways” (Job 22:28), since you might have merited greater success by following my wishes."
        },
        {
          "verseLocation": "Job 22:28",
          "verseText": "as it is written about the righteous: “You shall also decree a thing, and it shall be established unto you”",
          "talmudLocation": "Ketubot 103b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/103b#section-12",
          "talmudFullText": "And if you wish, say instead that since R' Yehuda HaNasi had said: Ḥanina bar Ḥama will sit at the head of the yeshiva, it is not possible that he will not one day rule the yeshiva. Therefore, it must have been R' Afes who died and R' Ḥanina who took his place, as it is written about the righteous: “You shall also decree a thing, and it shall be established unto you” (Job 22:28)."
        },
        {
          "verseLocation": "Job 22:28",
          "verseText": "And of the righteous it is written: “You will decree a saying and it will be established for you,",
          "talmudLocation": "Shabbat 59b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/59b#section-9",
          "talmudFullText": "The Talmud asks: How did Rav arrive at that particular conclusion? And perhaps R' Ḥanina died and R' Afes remained standing in his position at the head of the yeshiva as he stood previously; and Levi had no one with whom to sit outside the study hall, and that is why he came here?  The Talmud answers that that could not be the case for two reasons. First, if it were so,  that R' Ḥanina died, Levi would have been subject to the authority of R' Afes.  It was only in deference to R' Ḥanina that Levi did not enter the study hall. And furthermore, it could not be that R' Ḥanina died and did not reign as head of the yeshiva, as when R' Yehuda HaNasi died, he said in his dying testament: Ḥanina ben Ḥama, shall sit at the head of the yeshiva. And of the righteous it is written: “You will decree a saying and it will be established for you,  and the light will shine on your ways” (Job 22:28). Since the statement that R' Ḥanina will serve at the head of the yeshiva crossed the lips of a righteous person, R' Yehuda HaNasi, it is inconceivable that it would not have been realized."
        },
        {
          "verseLocation": "Job 22:28",
          "verseText": "“You shall also decree a thing, and it shall be established unto you”",
          "talmudLocation": "Sotah 12a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/12a#section-12",
          "talmudFullText": "Miriam continued: Additionally, concerning Pharaoh the wicked,  it is uncertain whether his decree will be fulfilled,  and it is uncertain if his decree will not be fulfilled. You are a righteous person,  and as such, your decrees will certainly be fulfilled, as it is stated with regard to the righteous: “You shall also decree a thing, and it shall be established unto you” (Job 22:28). Amram accepted his daughter’s words and arose and brought back,  i.e., remarried, his wife,  and all others who saw this followed his example and arose and brought back their wives. "
        }
      ]
    },
    {
      "chapterNumber": 24,
      "citations": [
        {
          "verseLocation": "Job 24:2",
          "verseText": "“They trespass; they violently steal flocks and graze them”",
          "talmudLocation": "Sanhedrin 109a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/109a#section-15",
          "talmudFullText": "The Talmud cites verses that allude to the practices of the people of Sodom: “They lie at night naked without clothing, and they have no covering in the cold” (Job 24:7). And likewise: “They drive away the donkey of the fatherless; they take the widow’s ox as a pledge” (Job 24:3). And likewise: “They trespass; they violently steal flocks and graze them” (Job 24:2). And likewise: “For he is brought to the grave, and watch is kept over his tomb” (Job 21:32)."
        },
        {
          "verseLocation": "Job 24:3",
          "verseText": "“They drive away the donkey of the fatherless; they take the widow’s ox as a pledge”",
          "talmudLocation": "Sanhedrin 109a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/109a#section-15",
          "talmudFullText": "The Talmud cites verses that allude to the practices of the people of Sodom: “They lie at night naked without clothing, and they have no covering in the cold” (Job 24:7). And likewise: “They drive away the donkey of the fatherless; they take the widow’s ox as a pledge” (Job 24:3). And likewise: “They trespass; they violently steal flocks and graze them” (Job 24:2). And likewise: “For he is brought to the grave, and watch is kept over his tomb” (Job 21:32)."
        },
        {
          "verseLocation": "Job 24:7",
          "verseText": "“They lie at night naked without clothing, and they have no covering in the cold”",
          "talmudLocation": "Sanhedrin 109a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/109a#section-15",
          "talmudFullText": "The Talmud cites verses that allude to the practices of the people of Sodom: “They lie at night naked without clothing, and they have no covering in the cold” (Job 24:7). And likewise: “They drive away the donkey of the fatherless; they take the widow’s ox as a pledge” (Job 24:3). And likewise: “They trespass; they violently steal flocks and graze them” (Job 24:2). And likewise: “For he is brought to the grave, and watch is kept over his tomb” (Job 21:32)."
        },
        {
          "verseLocation": "Job 24:14",
          "verseText": "raises an objection: “A murderer rises with the or to kill the poor and needy; and in the night he is as a thief”",
          "talmudLocation": "Pesachim 2a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/2a#section-9",
          "talmudFullText": "The Talmud raises an objection: “A murderer rises with the or to kill the poor and needy; and in the night he is as a thief” (Job 24:14)."
        },
        {
          "verseLocation": "Job 24:15",
          "verseText": "face to her, as it is stated: “The eye of the adulterer waits for the twilight, saying: No eye shall see me;",
          "talmudLocation": "Sotah 9a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9a#section-3",
          "talmudFullText": "She acted in secret;  therefore, God, referred to in the verse “Who dwell in secret, with the Most High” (Psalms 91:1), turns His face to her, as it is stated: “The eye of the adulterer waits for the twilight, saying: No eye shall see me;  and the Hidden Face will turn” (Job 24:15). The adulterer acts in the twilight of the night to act in secrecy, and therefore God, Who is concealed, arranges that the matter is revealed in public."
        },
        {
          "verseLocation": "Job 24:16",
          "verseText": "which is written: “In the dark they dig through houses; by day they shut themselves up; they know not the light”",
          "talmudLocation": "Sanhedrin 109a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/109a#section-14",
          "talmudFullText": "Rava taught: What is the meaning of that which is written: “In the dark they dig through houses; by day they shut themselves up; they know not the light” (Job 24:16)? This teaches that they would set their sights on property owners.  They would take one and they would give him balsam,  whose smell diffuses, and the property owner would place it in his treasury. In the evening,  the people of Sodom would come and sniff it out like a dog and discover the location of the property owner’s treasury, as it is stated: “They return at evening; they howl like a dog, and go round about the city” (Psalms 59:7). And after discovering the location they would come and dig there, and they would take that property. "
        },
        {
          "verseLocation": "Job 24:18",
          "verseText": "which is written: “He is swift upon the face of the waters; their portion is cursed in the earth;",
          "talmudLocation": "Sanhedrin 108a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108a#section-22",
          "talmudFullText": "R' Yosei from Caesarea taught: What is the meaning of that which is written: “He is swift upon the face of the waters; their portion is cursed in the earth;  he turns not by way of the vineyards” (Job 24:18)? This teaches that Noah the righteous would rebuke the people of his generation and say to them: Repent. And if you do not, God will bring a flood upon you and float your corpses on the water like wineskins filled with air that float on water, as it is stated: “He is swift upon the face of the waters. ” Moreover, a curse is taken from them to all who enter the world,  as people will curse others, saying: They shall be like the generation of the flood. As it is stated: “Their portion is cursed in the earth. ”"
        },
        {
          "verseLocation": "Job 24:19",
          "verseText": "as it is stated: “Drought and heat consume the snow waters; so does the netherworld those that have sinned”",
          "talmudLocation": "Shabbat 32b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/32b#section-8",
          "talmudFullText": "They also said: Due to the sin of abrogation of terumot and tithes, the heavens are prevented from pouring down dew and rain, and expense prevails, and profit is lost, and people pursue their livelihood but do not attain it, as it is stated: “Drought and heat consume the snow waters; so does the netherworld those that have sinned” (Job 24:19). The Talmud asks: What is the inference?  How is that concept derived from this verse? The school of R' Yishmael taught that it should be explained as follows: Due to the things that I commanded you during the summer,  separating terumot and tithes from the summer crops, and you did not do them, the snow waters will be robbed from you during the winter. And if people give terumot and tithes, they are blessed, as it is stated: “Bring you the whole tithe into the storehouse, that there may be food in My house, and try Me now with this, says YHWH of Hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall be more than sufficiency [ad bli dai]” (Malachi 3:10). The Talmud asks: What is the meaning of: More than sufficiency [ad bli dai]? Rami bar Rav said that Rav said:  It means that the abundance will be so great that your lips will be worn out [yivlu],  similar to the word beli, from saying enough [dai]. "
        },
        {
          "verseLocation": "Job 24:19",
          "verseText": "as it is stated: “Drought and heat will steal the snow waters; to the grave those who have sinned”",
          "talmudLocation": "Taanit 7b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/7b#section-5",
          "talmudFullText": "R' Tanḥum ben Ḥiyya of the village of Akko, said: The rains are withheld only if the enemies of the Jewish people,  a euphemism for the Jewish people, have been sentenced to destruction for their sins, as it is stated: “Drought and heat will steal the snow waters; to the grave those who have sinned” (Job 24:19). According to this interpretation, snow water will be stolen by drought, i.e., there will be none available, when people have sinned to the point that they deserve the grave. Ze’iri from Dihavat said to Ravina: You learned this idea from here; we learned it from here:  “And the anger of YHWH will be kindled against you, and He will close up the heavens,  and there will be no rain, and the earth will not give its fruit, and you will perish quickly” (Deuteronomy 11:17)."
        },
        {
          "verseLocation": "Job 24:19",
          "verseText": "the nullification of teruma and tithes, as it is stated: “Drought and heat will steal the snow waters”",
          "talmudLocation": "Taanit 7b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/7b#section-6",
          "talmudFullText": "Rav Ḥisda said: The rains are withheld only due to the sin of the nullification of teruma and tithes, as it is stated: “Drought and heat will steal the snow waters” (Job 24:19). The Talmud asks: From where in the verse may this idea be inferred from the verse? The school of R' Yishmael taught: Due to matters that I have commanded you to do in the summer,  e.g., take teruma and tithes from the summer produce, and that you did not do, the snow waters will be stolen from you in the winter. "
        },
        {
          "verseLocation": "Job 24:24",
          "verseText": "homiletically:",
          "talmudLocation": "Sotah 5a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/5a#section-4",
          "talmudFullText": "Rav Avira interpreted the following verse homiletically:  “They are exalted for a little while, and they are gone; yes, they are brought low, they are gathered in as all others, and wither as the tops of the husks” (Job 24:24). There were times when he said this interpretation in the name of Rav Asi and there were times when he said it in the name of Rav Ami: Any person who has arrogance within him will ultimately be diminished in standing, as it is stated in the phrase: “They are exalted for a little while, ” indicating that one who raises himself above others will be exalted only briefly. And lest you say that even if he is diminished he will still exist in this world and live a full life, the verse states: “And they are gone, ” indicating that they die before their time."
        },
        {
          "verseLocation": "Job 24:24",
          "verseText": "at his proper time like Abraham our forefather, as it is stated: “Yes, they are brought low, they are gathered in as all [ kakkol ] others”",
          "talmudLocation": "Sotah 5a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/5a#section-5",
          "talmudFullText": "He continues the interpretation: But if he repents from his arrogance, he is gathered in death at his proper time like Abraham our forefather, as it is stated: “Yes, they are brought low, they are gathered in as all [kakkol] others” (Job 24:24), indicating that when he repents from his arrogance he will die like Abraham, Isaac, and Jacob, as it is written about them that they were blessed with the term “all,” as in the verse above. With regard to Abraham, the verse states: “And YHWH had blessed Abraham in all things [bakkol]” (Genesis 24:1). With regard to Isaac, the verse states: “And I have eaten of all [mikkol]” (Genesis 27:33). With regard to Jacob, the verse states: “And because I have all [khol]” (Genesis 33:11). And if one does not repent, then, the verse in Job continues: “And wither like the tops of the husks. ”"
        }
      ]
    },
    {
      "chapterNumber": 25,
      "citations": [
        {
          "verseLocation": "Job 25:2",
          "verseText": "which is written: “Dominion and fear are with Him, He makes peace in His high places”",
          "talmudLocation": "Rosh Hashanah 23b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/23b#section-14",
          "talmudFullText": "As R' Yoḥanan said: What is the meaning of that which is written: “Dominion and fear are with Him, He makes peace in His high places” (Job 25:2)? It means that the sun has never seen the concave side of the new moon, nor has it ever seen the concave side of a rainbow,  both of which always face away from the sun. It has never seen the concave side of the moon, as the moon would be distressed by a sense of inadequacy if its concave side faced the sun. Therefore the sun sees only the full roundness of its convex side. In this way He makes peace in His high places between the sun and the moon. Furthermore, the sun has never seen the concave side of a rainbow, so that the worshippers of the sun not say,  as though the sun is a god,"
        },
        {
          "verseLocation": "Job 25:3",
          "verseText": "and another verse states: “Is there a number to His troops?”",
          "talmudLocation": "Chagigah 13b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/13b#section-12",
          "talmudFullText": "§ The Talmud continues to address apparent contradictions between verses concerning similar matters: One verse states: “A thousand thousands ministered to Him, and ten thousand times ten thousand stood before him” (Daniel 7:10), and another verse states: “Is there a number to His troops? ” (Job 25:3), implying that they are even more numerous than “ten thousand times ten thousand. ” The Talmud answers: This is not difficult,  for here,  when they are without number, the verse is referring to the time when the Temple is standing; there,  the other verse is referring to the time when the Temple is not standing,  for it is as though the heavenly entourage [pamalya] were diminished. "
        }
      ]
    },
    {
      "chapterNumber": 26,
      "citations": [
        {
          "verseLocation": "Job 26:7",
          "verseText": "The world endures only in the merit of Moses and Aaron. It is written here: “And what are we,” and it written elsewhere: “He hangs the earth upon nothing”",
          "talmudLocation": "Chullin 89a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/89a#section-8",
          "talmudFullText": "The Talmud relates: Rava says, and some say R' Yoḥanan says: Greater is that which is stated with regard to Moses and Aaron than that which is stated with regard to Abraham. As with regard to Abraham it is written: “And I am but dust and ashes, ” while with regard to Moses and Aaron it is written: “And what are we, ” i.e., we are not even dust and ashes. And Rava says, and some say R' Yoḥanan says: The world endures only in the merit of Moses and Aaron. It is written here: “And what are we, ” and it written elsewhere: “He hangs the earth upon nothing” (Job 26:7). That is, the earth endures in the merit of those who said of themselves that they are nothing, i.e., Moses and Aaron."
        },
        {
          "verseLocation": "Job 26:9",
          "verseText": "As it is stated: “He causes him to grasp the front of the throne, and spreads His cloud over it”",
          "talmudLocation": "Shabbat 88b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/88b#section-8",
          "talmudFullText": "God said to Moses: Provide them with an answer as to why the Torah should be given to the people. Moses said before Him: God!, I am afraid lest they burn me with the breath of their mouths.  God said to him: Grasp My throne of glory for strength and protection, and provide them with an answer.  And from where is this derived? As it is stated: “He causes him to grasp the front of the throne, and spreads His cloud over it” (Job 26:9), and R' Naḥum said:  This verse teaches that God spread the radiance of His presence and His cloud over Moses. Moses said before Him: God!, the Torah that You are giving me, what is written in it?  God said to him: “I am YHWH your God Who brought you out of Egypt from the house of bondage” (Exodus 20:2). Moses said to the angels: Did you descend to Egypt? Were you enslaved to Pharaoh? Why should the Torah be yours? Again Moses asked: What else is written in it?  God said to him: “You shall have no other gods before Me” (Exodus 20:3). Moses said to the angels: Do you dwell among the nations who worship"
        },
        {
          "verseLocation": "Job 26:9",
          "verseText": "But isn’t it written: “He grasps the face of the throne, and spreads His cloud upon him”",
          "talmudLocation": "Sukkah 5a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/5a#section-3",
          "talmudFullText": "The Talmud asks: And did Moses and Elijah never ascend to the heavens on high? But isn’t it written: “And Moses went up to God” (Exodus 19:3)? The Talmud answers: Nevertheless, he remained below ten handbreadths adjacent to the ground. The Talmud asks: But isn’t it written: “And Elijah went up by a whirlwind heavenward” (II Kings 2:11)? The Talmud answers: Here, too, it was below ten handbreadths. The Talmud asks: But isn’t it written: “He grasps the face of the throne, and spreads His cloud upon him” (Job 26:9)? And R' Tanḥum said:  This teaches that God spread of the radiance of His Shekhina and of His cloud upon him.  Apparently, Moses was in the cloud with God. The Talmud answers: Here, too, it was below ten handbreadths."
        },
        {
          "verseLocation": "Job 26:11",
          "verseText": "through rebuke, as it is written: “The pillars of heaven tremble and are astonished at His rebuke”",
          "talmudLocation": "Chagigah 12a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12a#section-14",
          "talmudFullText": "Scriptural proof is provided for this statement as follows: It was created through wisdom and through understanding, as it is written: “YHWH founded earth with wisdom, and established the heavens with understanding” (Proverbs 3:19); through knowledge, as it is written: “With His knowledge the depths were broken up” (Proverbs 3:20); through strength and through might, as it is written: “Who by Your strength sets fast the mountains, who is girded about with might” (Psalms 65:7); through rebuke, as it is written: “The pillars of heaven tremble and are astonished at His rebuke” (Job 26:11); through righteousness and justice, as it is written: “Righteousness and justice are the foundation of Your throne” (Psalms 89:15); through kindness and mercy, as it is written: “Remember Your mercies, O Lord, and Your kindnesses, for they are from times of old” (Psalms 25:6)."
        },
        {
          "verseLocation": "Job 26:11",
          "verseText": "until the Holy One, Blessed be He, rebuked it and made it stand still, as it is stated: “The pillars of heaven tremble and are astonished at His rebuke”",
          "talmudLocation": "Chagigah 12a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12a#section-15",
          "talmudFullText": "And Rav Yehuda said that Rav said,  with regard to the same matter: When God created the world, it continued to expand like two balls of a warp,  whose cord lengthens as they unravel, until God rebuked it and made it stand still, as it is stated: “The pillars of heaven tremble and are astonished at His rebuke” (Job 26:11). And this is the same as that which Reish Lakish said: What is the meaning of that which is written: “I am God God [El Shaddai]” (Genesis 17:1)? It means: I am He Who said to the world “enough [dai], ” instructing it to stop expanding. Similarly, Reish Lakish said: When God created the sea, it continued to expand until God rebuked it and made it dry, as it is stated: “He rebukes the sea and makes it dry, and desiccates all the rivers” (Nahum 1:4)."
        },
        {
          "verseLocation": "Job 26:12",
          "verseText": "immediately struck him and killed him; as it is stated: “He stirs up the sea with His power, and by His understanding He smites through Rahab”",
          "talmudLocation": "Bava Batra 74b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/74b#section-9",
          "talmudFullText": "And Rav Yehuda says that Rav says: At the time when God sought to create the world, He said to the minister of the sea: Open your mouth and swallow all the waters of the world,  so that there will be room for land. The minister of the sea said before Him: God!,  it is enough that I will stay within my own waters. God immediately struck him and killed him; as it is stated: “He stirs up the sea with His power, and by His understanding He smites through Rahab” (Job 26:12)."
        }
      ]
    },
    {
      "chapterNumber": 27,
      "citations": [
        {
          "verseLocation": "Job 27:5",
          "verseText": "“Till I die I will not put away my integrity from me”",
          "talmudLocation": "Sotah 27b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/27b#section-13",
          "talmudFullText": "On that same day R' Yehoshua ben Hyrcanus taught: Job served God only out of love, as it is stated: “Though He will slay me, still I will trust in Him” (Job 13:15). And still, the matter is even,  i.e., the verse is ambiguous, as there are two possible interpretations of the verse. Was Job saying: I will await Him,  expressing his yearning for God; or should the verse be interpreted as saying I will not await Him. As the word “lo” can mean either “to him” or “not,” it is unclear which meaning is intended here. This dilemma is resolved elsewhere, where the verse states a clearer indication of Job’s intent: “Till I die I will not put away my integrity from me” (Job 27:5). This teaches that he acted out of love. "
        },
        {
          "verseLocation": "Job 27:8",
          "verseText": "“For what is the hope of the godless, though he profits, when God takes away his soul?”",
          "talmudLocation": "Bava Kamma 119a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/119a#section-9",
          "talmudFullText": "§ The Talmud examines various verses pertaining to robbers. “For what is the hope of the godless, though he profits, when God takes away his soul? ” (Job 27:8). This verse is the subject of a dispute between Rav Huna and Rav Ḥisda. One says that the phrase “God takes away his soul” is referring to the soul of the robbed, and one says that it is referring to the soul of the robber. "
        },
        {
          "verseLocation": "Job 27:12",
          "verseText": "“Behold, all you yourselves have seen it; why then have you become altogether vain?”",
          "talmudLocation": "Bava Batra 15b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-5",
          "talmudFullText": "The Talmud responds: The matter of whether or not Job was Jewish is a dispute between tanna’im, as it is taught in a baraita with regard to the period during which Job lived: R' Elazar says: Job lived in the days of the judging of the Judges, as it is stated in connection with Job: “Behold, all you yourselves have seen it; why then have you become altogether vain? ” (Job 27:12). Which generation was completely vain? You must say it was the generation of the judging of the Judges,  when the people judged the Judges, as will be explained shortly."
        },
        {
          "verseLocation": "Job 27:12",
          "verseText": "Rabbi Yoḥanan says: The generation of Job was awash in licentiousness, as it is stated: “Behold, all of you yourselves have seen [ ḥazitem ] it; why then have you become altogether vain?”",
          "talmudLocation": "Bava Batra 15b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-9",
          "talmudFullText": "R' Yoḥanan says: The generation of Job was awash in licentiousness, as it is stated: “Behold, all of you yourselves have seen [ḥazitem] it; why then have you become altogether vain? ” (Job 27:12), and it is written: “Return, return, O Shulamite; return, return, that we may look [veneḥeze] upon you” (Song of Songs 7:1), which teaches that the phrase “you have seen it” connotes a licentious gaze. The Talmud asks: But say that the phrase “you yourselves have seen it” signifies prophecy, as it is written: “The vision [ḥazon] of Isaiah ben Amoz” (Isaiah 1:1). The Talmud answers: If so, why do I need the words: “Why then have you become altogether vain”?  Rather, the reference must be to inappropriate licentious gazing."
        },
        {
          "verseLocation": "Job 27:17",
          "verseText": "as it is stated: “He may prepare it but the just shall put it on”",
          "talmudLocation": "Pesachim 49b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/49b#section-13",
          "talmudFullText": "The Talmud asks: What is the reasoning of the first tanna,  who holds that one must announce having found the lost article of an am ha'aretz? The Talmud explains: Sometimes upstanding offspring will come from him and will consume the property, as it is stated: “He may prepare it but the just shall put it on” (Job 27:17). It is possible for a wicked person to prepare something for himself that will later be used by a righteous person."
        },
        {
          "verseLocation": "Job 27:22",
          "verseText": "that which is written: “It hurls itself at him, and does not spare; he would fain flee out of its hand”",
          "talmudLocation": "Megillah 16a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-22",
          "talmudFullText": "“And Harbonah,  one of the chamberlains, said before the king, Behold also, the gallows fifty cubits high, which Haman has made for Mordecai, who spoke good for the king, stands in the house of Haman” (Esther 7:9). R' Elazar said: Harbonah was also wicked and involved in that plot,  as he too wanted Mordecai executed. Once he saw that his plot had not succeeded, he immediately fled and joined Mordecai’s side. And this is the meaning of that which is written: “It hurls itself at him, and does not spare; he would fain flee out of its hand” (Job 27:22), indicating that when God sends calamity upon a wicked person, his friends immediately flee from him."
        }
      ]
    },
    {
      "chapterNumber": 28,
      "citations": [
        {
          "verseLocation": "Job 28:4",
          "verseText": "treatment of travelers to be forgotten from our land, as it is stated: “He breaks open a watercourse in a place far from inhabitants, forgotten by pedestrians, they are dried up, they have moved away from men”",
          "talmudLocation": "Sanhedrin 109a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/109a#section-12",
          "talmudFullText": "The people of Sodom said: Since we live in a land from which bread comes and has the dust of gold,  we have everything that we need. Why do we need travelers, as they come only to divest us of our property? Come, let us cause the proper treatment of travelers to be forgotten from our land, as it is stated: “He breaks open a watercourse in a place far from inhabitants, forgotten by pedestrians, they are dried up, they have moved away from men” (Job 28:4)."
        },
        {
          "verseLocation": "Job 28:6",
          "verseText": "“And it has dust of [ afrot ] gold”",
          "talmudLocation": "Chullin 88b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/88b#section-7",
          "talmudFullText": "The Talmud analyzes the baraita: Granted,  it is understood that one may burn his garment and cover the blood with the ashes, since we found a source for the fact that ashes are called earth [afar],  as the Talmud will soon prove; accordingly, the use of ashes is in accordance with the verse: “And cover it with earth. ” But with regard to a gold dinar, from where do we derive that one may grind it into powder and use it to cover the blood? R' Zeira said:  The verse states: “And it has dust of [afrot] gold” (Job 28:6), indicating that gold is referred to as dust."
        },
        {
          "verseLocation": "Job 28:7",
          "verseText": "states: “That path no bird of prey knows, neither has the eye of the ayya seen it”",
          "talmudLocation": "Chullin 63b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/63b#section-5",
          "talmudFullText": "And the opinion that the da’a and ra’a are one species, and that the ayya and dayya are another species, differs from the opinion of R' Abbahu, as R' Abbahu says:  The ra’a is the ayya. And why is it called the ra’a? Since it sees [ro’ah] most vividly. And so the verse states: “That path no bird of prey knows, neither has the eye of the ayya seen it” (Job 28:7). And a Sage taught:  The ra’a can stand in Babylonia and see a carcass in Eretz Yisrael. "
        },
        {
          "verseLocation": "Job 28:9",
          "verseText": "“As for the earth, out of it comes bread, and underneath it is turned up as it were by fire. Its stones are the place of sapphires, and it has dust of gold. That path no bird of prey knows, neither has the falcon’s eye seen it. The proud beasts have not trodden it, nor has the lion passed thereby”",
          "talmudLocation": "Sanhedrin 109a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/109a#section-11",
          "talmudFullText": "A baraita states: The people of Sodom became haughty and sinned due only to the excessive goodness that God bestowed upon them. And what is written concerning them,  indicating that goodness? “As for the earth, out of it comes bread, and underneath it is turned up as it were by fire. Its stones are the place of sapphires, and it has dust of gold. That path no bird of prey knows, neither has the falcon’s eye seen it. The proud beasts have not trodden it, nor has the lion passed thereby” (Job 28:5–8). The reference is to the city of Sodom, which was later overturned, as it is stated thereafter: “He puts forth His hand upon the flinty rock; He overturns the mountains by the roots” (Job 28:9)."
        },
        {
          "verseLocation": "Job 28:12",
          "verseText": "“Wisdom, where can it be found?”",
          "talmudLocation": "Sotah 13b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/13b#section-24",
          "talmudFullText": "And Shmuel says that God was saying the verse: “Who is as the wise man and who knows the interpretation [pesher] of a matter? ” (Ecclesiastes 8:1), referring to the greatness of Moses, who was able to forge compromises, pesharim, between God and the Jewish people. And R' Yoḥanan says that God was saying the verse: “Wisdom, where can it be found? ” (Job 28:12). And Rav Naḥman says that God was saying the verse: “And Moses,  the servant of God, died there” (Deuteronomy 34:5). Semalyon says that God was saying: And Moses, the great scribe of Israel, died there. "
        },
        {
          "verseLocation": "Job 28:12",
          "verseText": "as it is stated: “But wisdom, it can be found in nothingness”",
          "talmudLocation": "Sotah 21b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/21b#section-3",
          "talmudFullText": "The Talmud asks: And the Rabbis who disagree with him, what do they do with this verse: “I, wisdom,  dwell with cunning [orma]”; how do they interpret it? The Talmud responds: He requires that verse for that which R' Yosei ben Ḥanina,  states, interpreting the word “orma” as nakedness rather than cunningness, as R' Yosei ben Ḥanina, says: The matters of Torah do not endure except in one who stands naked for them, as it is stated: “I, wisdom, dwell with nakedness [orma]” (Proverbs 8:12). This means that wisdom dwells only in one who is prepared to give away all of his possessions for the sake of Torah study. R' Yoḥanan says: The matters of Torah do not endure except in one who considers himself as one who does not exist, as it is stated: “But wisdom, it can be found in nothingness” (Job 28:12)."
        },
        {
          "verseLocation": "Job 28:13",
          "verseText": "“Nor shall it be found in the land of the living [ haḥayyim ]”",
          "talmudLocation": "Sanhedrin 111a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/111a#section-5",
          "talmudFullText": "The Talmud relates that Rav saw that Rav Kahana was washing the hair on his head and then arose and sat before Rav.  Rav said to Rav Kahana: “Nor shall it be found in the land of the living [haḥayyim]” (Job 28:13). Rav Kahana thought that Rav addressed that verse to him and he said to Rav: Are you cursing me?  Rav said to him:  It is a verse that I am saying to remind you that Torah will not be found in one who sustains [meḥayye] himself in an indulgent manner in its study; rather, Torah is acquired through suffering and difficulty."
        },
        {
          "verseLocation": "Job 28:13",
          "verseText": "But isn’t it written: “No man knew its value,",
          "talmudLocation": "Shevuot 5a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/5a#section-11",
          "talmudFullText": "Abaye presents another difficulty to Rava: And furthermore,  according to your understanding, you should also make a similar inference with regard to Torah, as it is written: “And it was concealed from the eyes of all living creatures, and from those that soar in the heavens it was hidden” (Job 28:21), which would indicate, by inference, that initially there was someone who was aware of the Torah. But isn’t it written: “No man knew its value,  and it is not known in the land of the living” (Job 28:13)?"
        },
        {
          "verseLocation": "Job 28:14",
          "verseText": "As it is stated: “The depth said: It is not within me, and the sea said: It is not with me”",
          "talmudLocation": "Shabbat 89a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/89a#section-3",
          "talmudFullText": "And R' Yehoshua ben Levi said: When Moses descended from standing before God,  with the Torah, Satan came and said before Him: God!, where is the Torah? He said to him: I have given it to the earth. He went to the earth,  and said to it: Where is the Torah?  It said to him:  I do not know, as only: “God understands its way,  and He knows its place” (Job 28:23). He went to the sea and asked: Where is the Torah? And the sea said to him: “It is not with me. ”He went to the depths and asked: Where is the Torah? And the depths said to him: “It is not within me. ” And from where is it derived that the sea and the depths answered him this way? As it is stated: “The depth said: It is not within me, and the sea said: It is not with me” (Job 28:14). “Destruction and death said: We heard a rumor of it with our ears” (Job 28:22). Satan returned and said before God: God!, I searched for the Torah throughout all the earth and did not find it.  He said to him: Go to Moses, son of Amram. "
        },
        {
          "verseLocation": "Job 28:17",
          "verseText": "which is written: “Gold and glass cannot equal it; neither shall its exchange be vessels of fine gold”",
          "talmudLocation": "Chagigah 15a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/15a#section-11",
          "talmudFullText": "Aḥer asked R' Meir another question, again after he had gone astray. What is the meaning of that which is written: “Gold and glass cannot equal it; neither shall its exchange be vessels of fine gold” (Job 28:17)? If it is referring to the praise and honor of the Torah, it should have compared it only to gold, not to glass. He said to him:  This is referring to words of Torah, which are as difficult to acquire as gilded vessels and vessels of fine gold but are as easy to lose as glass vessels.  Aḥer said to him: R' Akiva, your teacher, did not say so, but taught as follows: Just as golden vessels and glass vessels have a remedy even when they have broken,  as they can be melted down and made into new vessels, so too a Torah scholar, although he has transgressed, has a remedy.  R' Meir said to him:  If so, you too, return from your ways. He said to him: I have already heard the following declaration behind the dividing curtain,  which conceals God from the world: “Return, rebellious children, ” (Jeremiah 3:22) apart from Aḥer. "
        },
        {
          "verseLocation": "Job 28:21",
          "verseText": "with regard to Torah, as it is written: “And it was concealed from the eyes of all living creatures, and from those that soar in the heavens it was hidden”",
          "talmudLocation": "Shevuot 5a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/5a#section-11",
          "talmudFullText": "Abaye presents another difficulty to Rava: And furthermore,  according to your understanding, you should also make a similar inference with regard to Torah, as it is written: “And it was concealed from the eyes of all living creatures, and from those that soar in the heavens it was hidden” (Job 28:21), which would indicate, by inference, that initially there was someone who was aware of the Torah. But isn’t it written: “No man knew its value,  and it is not known in the land of the living” (Job 28:13)?"
        },
        {
          "verseLocation": "Job 28:22",
          "verseText": "“Destruction and death said: We heard a rumor of it with our ears”",
          "talmudLocation": "Shabbat 89a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/89a#section-3",
          "talmudFullText": "And R' Yehoshua ben Levi said: When Moses descended from standing before God,  with the Torah, Satan came and said before Him: God!, where is the Torah? He said to him: I have given it to the earth. He went to the earth,  and said to it: Where is the Torah?  It said to him:  I do not know, as only: “God understands its way,  and He knows its place” (Job 28:23). He went to the sea and asked: Where is the Torah? And the sea said to him: “It is not with me. ”He went to the depths and asked: Where is the Torah? And the depths said to him: “It is not within me. ” And from where is it derived that the sea and the depths answered him this way? As it is stated: “The depth said: It is not within me, and the sea said: It is not with me” (Job 28:14). “Destruction and death said: We heard a rumor of it with our ears” (Job 28:22). Satan returned and said before God: God!, I searched for the Torah throughout all the earth and did not find it.  He said to him: Go to Moses, son of Amram. "
        },
        {
          "verseLocation": "Job 28:23",
          "verseText": "which is written: “God understands its way and He knows its place”",
          "talmudLocation": "Gittin 17a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/17a#section-2",
          "talmudFullText": "The Talmud asks: Is this to say that the Romans are preferable to the Persians? But didn’t R' Ḥiyya teach: What is the meaning of that which is written: “God understands its way and He knows its place” (Job 28:23)? This means that God knows with regard to the Jewish people that they are unable to accept and live under Roman decrees,  and therefore He arose and exiled them to Babylonia.  This indicates that living under Babylonian rule is preferable to living under Roman rule."
        },
        {
          "verseLocation": "Job 28:23",
          "verseText": "which is written: “God understands its ways and He knows its place”",
          "talmudLocation": "Pesachim 87b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-20",
          "talmudFullText": "R' Ḥiyya teaches: What is the meaning of that which is written: “God understands its ways and He knows its place” (Job 28:23)? God knows the Jewish people, who are unable to withstand the harsh decrees of the Romans. Therefore, He exiled them to Babylonia,  whose people are less cruel. And R' Elazar said: God exiled Israel to Babylonia only due to the fact it is a land as deep as the netherworld,  i.e., it is a land of plains and valleys, which alludes to that which is stated: “I shall ransom them from the power of the netherworld, I shall redeem them from death” (Hosea 13:14). R' Ḥanina said: It is due to the fact that their language,  Aramaic, is similar to the language of the Torah,  which enables the Jews who live there to study Torah."
        },
        {
          "verseLocation": "Job 28:23",
          "verseText": "“God understands its way,",
          "talmudLocation": "Shabbat 89a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/89a#section-3",
          "talmudFullText": "And R' Yehoshua ben Levi said: When Moses descended from standing before God,  with the Torah, Satan came and said before Him: God!, where is the Torah? He said to him: I have given it to the earth. He went to the earth,  and said to it: Where is the Torah?  It said to him:  I do not know, as only: “God understands its way,  and He knows its place” (Job 28:23). He went to the sea and asked: Where is the Torah? And the sea said to him: “It is not with me. ”He went to the depths and asked: Where is the Torah? And the depths said to him: “It is not within me. ” And from where is it derived that the sea and the depths answered him this way? As it is stated: “The depth said: It is not within me, and the sea said: It is not with me” (Job 28:14). “Destruction and death said: We heard a rumor of it with our ears” (Job 28:22). Satan returned and said before God: God!, I searched for the Torah throughout all the earth and did not find it.  He said to him: Go to Moses, son of Amram. "
        },
        {
          "verseLocation": "Job 28:28",
          "verseText": "And it is written: “And unto man He said: Behold [ hen ], the fear of the Lord, that is wisdom;",
          "talmudLocation": "Shabbat 31b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/31b#section-3",
          "talmudFullText": "The Talmud remarks: Conclude that R' Elazar is the one who said that he is praiseworthy because he is a man who fears sin,  as elsewhere he also spoke in praise of fear. As R' Yoḥanan said in the name of R' Elazar: God has in His world only fear of Heaven alone, as it is stated: “And now, Israel, what does YHWH your God ask of you, but to fear YHWH your God” (Deuteronomy 10:12). And it is written: “And unto man He said: Behold [hen], the fear of YHWH, that is wisdom;  and to depart from evil is understanding” (Job 28:28), as in the Greek language they call one hen.  Apparently, fear of God is of primary importance. The Talmud concludes: Indeed, conclude that R' Elazar is the one who said so."
        }
      ]
    },
    {
      "chapterNumber": 29,
      "citations": [
        {
          "verseLocation": "Job 29:2",
          "verseText": "“If only I were as in the months of old, as in the days when God watched over me”",
          "talmudLocation": "Niddah 30b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/30b#section-20",
          "talmudFullText": "And there are no days when a person is in a more blissful state than those days when he is a fetus in his mother’s womb, as it is stated in the previous verse: “If only I were as in the months of old, as in the days when God watched over me” (Job 29:2). And the proof that this verse is referring to gestation is as follows: Which are the days that have months but do not have years? You must say that these are the months of gestation. "
        },
        {
          "verseLocation": "Job 29:3",
          "verseText": "And a candle is lit for it above its head, and it gazes from one end of the world to the other, as it is stated: “When His lamp shined above my head, and by His light I walked through darkness”",
          "talmudLocation": "Niddah 30b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/30b#section-19",
          "talmudFullText": "And a candle is lit for it above its head, and it gazes from one end of the world to the other, as it is stated: “When His lamp shined above my head, and by His light I walked through darkness” (Job 29:3). And do not wonder how one can see from one end of the world to the other, as a person can sleep here,  in this location, and see a dream that takes place in a place as distant as Spain [beAspamya]. "
        },
        {
          "verseLocation": "Job 29:4",
          "verseText": "when the converse of God was upon my tent”",
          "talmudLocation": "Niddah 30b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/30b#section-21",
          "talmudFullText": "And a fetus is taught the entire Torah while in the womb, as it is stated: “And He taught me and said to me: Let your heart hold fast My words; keep My commandments, and live” (Proverbs 4:4). And it also states:  “As I was in the days of my youth, when the converse of God was upon my tent” (Job 29:4)."
        },
        {
          "verseLocation": "Job 29:9",
          "verseText": "about Shmuel’s father: “The princes refrained from talking and laid a hand upon their mouths”",
          "talmudLocation": "Ketubot 51b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/51b#section-10",
          "talmudFullText": "Rav recited the following verse about Shmuel’s father: “The princes refrained from talking and laid a hand upon their mouths” (Job 29:9). The Talmud comments: The application of this verse to Shmuel’s father indicates that he refrained from responding despite the fact that an answer was available. But what is there for him to say in reply? The Talmud answers: He could have said that in the case of a captive woman they were lenient.  Since it is uncertain whether she was in fact raped during her captivity, the rabbis were lenient. However, it is possible that they were more stringent in the case of a woman who was definitely raped."
        },
        {
          "verseLocation": "Job 29:13",
          "verseText": "“The blessing of him that was lost came upon me, and I caused the widow’s heart to sing for joy”",
          "talmudLocation": "Bava Batra 16a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-14",
          "talmudFullText": "Rava interpreted a verse homiletically: What is the meaning of that which is written,  Job saying about himself: “The blessing of him that was lost came upon me, and I caused the widow’s heart to sing for joy” (Job 29:13). “The blessing of him that was lost came upon me” teaches that Job used to steal a field from orphans,  cultivate it, improve it, and then return it to them;  consequently, they would bless him for the field they had lost. “I caused the widow’s heart to sing for joy” teaches that anywhere that there was a widow whom no one would marry, he would go and cast his name upon her,  i.e., he would start a rumor that she was related to him, and then somebody would come forward and marry her. "
        },
        {
          "verseLocation": "Job 29:18",
          "verseText": "as it is stated: “And I said, I shall die in my nest, and I shall multiply my days as the phoenix”",
          "talmudLocation": "Sanhedrin 108b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108b#section-20",
          "talmudFullText": "With regard to the lion, a fever sustained it,  since when it suffered from a fever, it did not need to eat; as Rav said:  For no fewer than six days and no more than twelve days, fever sustains a person; he need not eat and is sustained from his own fats. Shem continued: With regard to the phoenix [avarshina], my father found it lying in its compartment on the side of the ark. He said to the bird: Do you not want food?  The bird said to him: I saw that you were busy,  and I said I would not trouble you by requesting food. Noah said to the bird: May it be God’s will that you shall not die,  and through that bird the verse was fulfilled, as it is stated: “And I said, I shall die in my nest, and I shall multiply my days as the phoenix” (Job 29:18)."
        },
        {
          "verseLocation": "Job 29:25",
          "verseText": "that a mourner sits at the head? As it is stated: “I chose out their way, and sat as chief, and dwelt as a king in the army, as one that would comfort [ yenaḥem ] the mourners”",
          "talmudLocation": "Ketubot 69b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/69b#section-2",
          "talmudFullText": "R' Abbahu said concerning the same topic: From where is it derived that a mourner sits at the head? As it is stated: “I chose out their way, and sat as chief, and dwelt as a king in the army, as one that would comfort [yenaḥem] the mourners” (Job 29:25). The Talmud challenges the proof: The word yenaḥem implies one comforting others and not the mourner being comforted. Rav Naḥman bar Yitzḥak said:  Since it is written without vowels, the word can be read as if it were written “would be comforted [yinnaḥem], ” which describes the mourner who is being comforted."
        },
        {
          "verseLocation": "Job 29:25",
          "verseText": "As it is stated: “I chose out their way, and sat as chief [ rosh ], and dwelt as a king in the army, as one that comforts [ yenaḥem ] the mourners”",
          "talmudLocation": "Moed Katan 28b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/28b#section-24",
          "talmudFullText": "R' Abbahu said: From where is it derived that the mourner reclines at the head [rosh] of the table? As it is stated: “I chose out their way, and sat as chief [rosh], and dwelt as a king in the army, as one that comforts [yenaḥem] the mourners” (Job 29:25). This indicates that the mourner sits at the head of the table, as the chief."
        }
      ]
    },
    {
      "chapterNumber": 30,
      "citations": [
        {
          "verseLocation": "Job 30:4",
          "verseText": "fed with the coals of the broom tree, as it is stated: “They pluck salt-wort from wormwood, and the roots of the broom are their food”",
          "talmudLocation": "Avodah Zarah 3b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/3b#section-14",
          "talmudFullText": "§ R' Levi says: Anyone who interrupts his study of words of Torah to occupy himself with mundane matters will be fed with the coals of the broom tree, as it is stated: “They pluck salt-wort from wormwood, and the roots of the broom are their food” (Job 30:4). Reish Lakish says:  With regard to anyone who occupies himself with Torah at night, God extends a thread of kindness over him by day, as it is stated: “By day, YHWH will command His kindness, and in the night His song shall be with me” (Psalms 42:9). The verse is understood as follows: What is the reason that by day, YHWH will command His kindness to extend over him? It is due to the fact that in the night His song is with me,  i.e., he occupies himself at night with Torah, which is referred to as a song."
        },
        {
          "verseLocation": "Job 30:4",
          "verseText": "Rabbi Levi said: Anyone who pauses from words of Torah to occupy himself with mundane conversation will be fed with the coals of the broom tree, as it is stated: “They pluck saltwort [ maluaḥ ] with wormwood [ alei siaḥ ], and the roots of the broom tree [ retamim ] are their food”",
          "talmudLocation": "Chagigah 12b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12b#section-9",
          "talmudFullText": "With regard to the same matter, R' Levi said: Anyone who pauses from words of Torah to occupy himself with mundane conversation will be fed with the coals of the broom tree, as it is stated: “They pluck saltwort [maluaḥ] with wormwood [alei siaḥ], and the roots of the broom tree [retamim] are their food” (Job 30:4). The exposition is as follows: Those who pluck, i.e., pause, from learning Torah, which was given upon two tablets, luḥot, which sounds similar to maluaḥ, for the purpose of siaḥ, idle chatter, are punished by having to eat coals made from “the roots of the broom tree. ” And from where do we derive that Ma’on is called heaven? As it is stated: “Look forth from Your holy Ma’on, from heaven” (Deuteronomy 26:15)."
        },
        {
          "verseLocation": "Job 30:24",
          "verseText": "which is written: “Surely none shall put forth his hand to a ruinous heap, neither because of these things shall help come in one’s calamity [ befido ]”",
          "talmudLocation": "Avodah Zarah 4a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-7",
          "talmudFullText": "And this is the same as that which Rava says: What is the meaning of that which is written: “Surely none shall put forth his hand to a ruinous heap, neither because of these things shall help come in one’s calamity [befido]” (Job 30:24)? God says to the Jewish people: When I judge the Jewish people, I do not judge them as I judge the nations of the world.  When judging the nations of the world, I punish them for all of their transgressions together, as it is written: “A ruin, a ruin, a ruin, will I make it,  this also shall be no more” (Ezekiel 21:32). Rather, I punish the Jewish people like the pecking [kefid] of a hen,  which picks up only a tiny amount each time it pecks."
        },
        {
          "verseLocation": "Job 30:24",
          "verseText": "“they will be saved [ lahen shua ]”",
          "talmudLocation": "Avodah Zarah 4a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-8",
          "talmudFullText": "Alternatively, even if the Jewish people perform but a few mitzvot before Me, like the pecking of hens that peck in a dunghill, I will combine them to a large reckoning, as it is stated: “Though they peck [befido], ” i.e., perform mitzvot a little at a time, “they will be saved [lahen shua]” (Job 30:24). Alternatively, in reward for the manner in which they cry out [shua] and pray before Me, I will save [moshia] them.  In other words, God punishes the Jewish people for each individual infraction, but He does not destroy them entirely in a moment of fury."
        }
      ]
    },
    {
      "chapterNumber": 31,
      "citations": [
        {
          "verseLocation": "Job 31:1",
          "verseText": "“I have made a covenant with my eyes; why then should I look upon a virgin?”",
          "talmudLocation": "Bava Batra 16a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-15",
          "talmudFullText": "Job further said: “O that my vexation were thoroughly weighed, and my calamity laid in the balances” (Job 6:2). Rav says: Dust should be put in the mouth of Job,  meaning, he should not have spoken in such a manner, as if he were weighing his deeds against those of God; may one act as if he is in a friendship with Heaven?  And similarly, Job said: “There is no arbiter between us, who may lay his hand upon us both” (Job 9:33). Rav says: Dust should be put in the mouth of Job for saying this; is there a servant who rebukes his master?  Job also said: “I have made a covenant with my eyes; why then should I look upon a virgin? ” (Job 31:1). Rava says: Dust should be put in the mouth of Job for saying this; he did not look at other women, but Abraham did not even look at his own wife, as it is written: “Now I know that you are a beautiful woman” (Genesis 12:11). One may learn by inference that initially he did not know how beautiful she was because he had not gazed at her."
        },
        {
          "verseLocation": "Job 31:9",
          "verseText": "anyone who commits adultery, his wife commits adultery against him, as it is stated: “If my heart has been enticed unto a woman, and I have lain in wait at my neighbor’s door”",
          "talmudLocation": "Sotah 10a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-7",
          "talmudFullText": "And R' Yoḥanan says:  With regard to anyone who commits adultery, his wife commits adultery against him, as it is stated: “If my heart has been enticed unto a woman, and I have lain in wait at my neighbor’s door” (Job 31:9), and it is written: “Then let my wife grind unto another man and may strangers kneel over her” (Job 31:10). And this explains the folk saying that people say: He is found among the pumpkins [karei] and his wife among the zucchinis [butzinei],  which are similar types of vegetables. In other words, she acts the same way that he does."
        },
        {
          "verseLocation": "Job 31:10",
          "verseText": "says: “Then let my wife grind unto another man”",
          "talmudLocation": "Sotah 10a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-6",
          "talmudFullText": "With regard to Samson’s capture, the verse states: “And the Philistines laid hold on him, and put out his eyes; and they brought him down to Gaza, and bound him with fetters of brass; and he did grind in the prison-house” (Judges 16:21). R' Yoḥanan says: Grinding is nothing other than a language of a transgression of sex, and so the verse says: “Then let my wife grind unto another man” (Job 31:10). This teaches that each and every Philistine man brought his wife to the prison in order that she should be impregnated by Samson. Rav Pappa said: This is an example of the folk saying that people say: Before a wine drinker,  bring wine; before one who digs in the ground,  bring figs.  So too, Samson, who married Philistine women, was brought more Philistine women while in prison."
        },
        {
          "verseLocation": "Job 31:10",
          "verseText": "and it is written: “Then let my wife grind unto another man and may strangers kneel over her”",
          "talmudLocation": "Sotah 10a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-7",
          "talmudFullText": "And R' Yoḥanan says:  With regard to anyone who commits adultery, his wife commits adultery against him, as it is stated: “If my heart has been enticed unto a woman, and I have lain in wait at my neighbor’s door” (Job 31:9), and it is written: “Then let my wife grind unto another man and may strangers kneel over her” (Job 31:10). And this explains the folk saying that people say: He is found among the pumpkins [karei] and his wife among the zucchinis [butzinei],  which are similar types of vegetables. In other words, she acts the same way that he does."
        },
        {
          "verseLocation": "Job 31:20",
          "verseText": "warmed with the fleece of my sheep”",
          "talmudLocation": "Bekhorot 17a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/17a#section-6",
          "talmudFullText": "Rather,  R' Meir’s ruling was with regard to the obligation of giving the first shearing of wool to the priest. The Talmud asks: But if so, doesn’t R' Meir agree with that which the school of R' Yishmael taught: Lambs whose fleece is tough are exempt from,  i.e., not subject to giving, the first shearing of wool to the priest, as it is stated: “And if he were not warmed with the fleece of my sheep” (Job 31:20)? It is derived from this verse that only a fleece which is fit to warm a person, i.e., fleece that is soft, is classified as wool that must be given to the priest. Since the fleece of the goat-like offspring of a ewe is tough, it should be excluded from the mitzva of the first shearing."
        },
        {
          "verseLocation": "Job 31:20",
          "verseText": "exempt from the first sheared wool, as it is stated: “And he was warmed with the shearing of my sheep”",
          "talmudLocation": "Chullin 137a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/137a#section-10",
          "talmudFullText": "The Talmud asks: But if so, for what purpose does the verbal analogy between shearing mentioned with regard to the first sheared wool and shearing mentioned with regard to the flock come?  The Talmud answers: It is necessary for that which was taught in the school of R' Yishmael. As the school of R' Yishmael taught:  In the case of sheep whose wool is hard,  the owner is exempt from the first sheared wool, as it is stated: “And he was warmed with the shearing of my sheep” (Job 31:20). Since hard wool does not provide warmth, the mitzva of the first sheared wool does not apply to this wool."
        },
        {
          "verseLocation": "Job 31:20",
          "verseText": "“And he was warmed with the shearing of my sheep [ kevasai ]”",
          "talmudLocation": "Chullin 137a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/137a#section-3",
          "talmudFullText": "§ The Mishnah states: The first sheared wool is in effect only with regard to sheep.  The Talmud asks: From where are these matters derived? Rav Ḥisda said:  It is derived by means of a verbal analogy between shearing mentioned in this context and shearing mentioned elsewhere. It is written here: “The first sheared wool of your flock [tzonekha], shall you give him” (Deuteronomy 18:4), and it is written there that Job says concerning the needy: “And he was warmed with the shearing of my sheep [kevasai]” (Job 31:20). Just as there,  the verse is referring specifically to the shearing of sheep,  as the term keves is used only with regard to a sheep, so too here,  with regard to the first sheared wool, the verse is referring to sheep,  despite the fact that the term tzon can be interpreted as referring also to goats."
        }
      ]
    },
    {
      "chapterNumber": 32,
      "citations": [
        {
          "verseLocation": "Job 32:2",
          "verseText": "written: “Of the family of Ram”",
          "talmudLocation": "Bava Batra 15b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-2",
          "talmudFullText": "The Talmud raises an objection from another baraita against the notion that Job was a Jew: Seven prophets prophesied to the nations of the world, and they are: Balaam and his father Beor, and Job, Eliphaz the Temanite, and Bildad the Shuhite, and Zophar the Naamathite, and Elihu ben Barachel the Buzite,  which indicates that Job was not Jewish. He said to him: And according to your reasoning that Job could not have been Jewish because he prophesied to the nations of the world, was Elihu ben Barachel not a Jew? Is it not written: “Of the family of Ram” (Job 32:2), meaning Abraham?"
        },
        {
          "verseLocation": "Job 32:6",
          "verseText": "zaḥalti",
          "talmudLocation": "Eruvin 63a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/63a#section-20",
          "talmudFullText": "The Talmud continues to discuss the same topic. R' Ḥiyya bar Abba said that R' Yoḥanan said: Whoever issues a halakhic ruling in his teacher’s presence is deserving of being bitten by a snake, as it is stated: “And Elihu, son of Barachel the Buzite answered and said, I am young,  and you are very old; therefore I held back [zaḥalti] and I was afraid, and did not declare my opinion to you” (Job 32:6), and it is written: “With the venom of the crawling things of [zoḥalei] the dust” (Deuteronomy 32:24), which refers to snakes. Elihu’s statement is understood as follows: I must apologize for speaking in my teacher’s presence, for one who does so is liable to be punished with the bite of a snake."
        },
        {
          "verseLocation": "Job 32:16",
          "verseText": "silence, as it is stated: “And shall I wait, because they do not speak, because they stand still, and answer no more?”",
          "talmudLocation": "Sotah 39a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/39a#section-2",
          "talmudFullText": "§ Rava bar Rav Huna says: Once a Torah scroll has been opened, it is prohibited to converse, even about a matter of halakha. As it is stated:  “And Ezra opened the book in the sight of all the people, for he was above all the people, and when he opened it, all the people stood up” (Nehemiah 8:5), and standing is referring to nothing other than silence, as it is stated: “And shall I wait, because they do not speak, because they stand still, and answer no more? ” (Job 32:16). R' Zeira said that Rav Ḥisda said:  The prohibition against conversing is derived from here: “And the ears of all the people were attentive to the book of the law” (Nehemiah 8:3). They were not listening to any other voice."
        }
      ]
    },
    {
      "chapterNumber": 33,
      "citations": [
        {
          "verseLocation": "Job 33:3",
          "verseText": "and that which my lips know they shall speak sincerely”",
          "talmudLocation": "Pesachim 3a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/3a#section-12",
          "talmudFullText": "Likewise, a baraita was taught in the school of R' Yishmael: A person should always converse euphemistically, as one finds in the following verses. The first: “And whichever saddle that the zav rides upon shall be ritually impure” (Leviticus 15:9), which discusses the impurity imparted by a zav to an object on which he sits, calls this action riding. And the verse: “And anyone who touches anything on which she sat” (Leviticus 15:22), which discusses the parallel ritual impurity of a woman,  a zava, calls the action sitting.  Since riding is slightly demeaning for a woman, as it involves an immodest splaying of the legs, the verse avoids the term riding and opts to convey the more modest image of sitting. And it says in another verse: “And you choose the language of the crafty” (Job 15:5), meaning that one should be clever when speaking and avoid inappropriate phrases. And it says in another verse: “My words shall utter the uprightness of my heart; and that which my lips know they shall speak sincerely” (Job 33:3)."
        },
        {
          "verseLocation": "Job 33:25",
          "verseText": "“His flesh is tenderer than a child’s; he returns to the days of his youth”",
          "talmudLocation": "Nedarim 41a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/41a#section-3",
          "talmudFullText": "§ R' Alexandri said that R' Ḥiyya bar Abba said: The sick person recovers from his illness only when the heavenly court forgives him for all his sins, as it is stated: “Who forgives all your iniquity; Who heals all your diseases” (Psalms 103:3). Rav Hamnuna said:  When he recovers, he returns to the days of his youth, as it is stated in a verse with regard to one recovering from illness: “His flesh is tenderer than a child’s; he returns to the days of his youth” (Job 33:25). Interpreting the verse: “YHWH will support him upon the bed of suffering; You overturned all his lying down in his illness” (Psalms 41:4), Rav Yosef said:  That is to say that the sick person forgets his studies,  as everything that is organized is overturned."
        },
        {
          "verseLocation": "Job 33:27",
          "verseText": "with three rows of three people, as it is stated: “He comes [ yashor ] before men, and says: I have sinned, and perverted that which was right, and it profited me not”",
          "talmudLocation": "Yoma 87a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/87a#section-12",
          "talmudFullText": "Rav Ḥisda said: And one must appease the one he has insulted with three rows of three people, as it is stated: “He comes [yashor] before men, and says: I have sinned, and perverted that which was right, and it profited me not” (Job 33:27). Rav Ḥisda interprets the word yashor as related to the word shura, row. The verse mentions sin three times: I have sinned, and perverted, and it profited me not. This implies that one should make three rows before the person from whom he is asking forgiveness."
        },
        {
          "verseLocation": "Job 33:29",
          "verseText": "And it says: “All these things does God do twice or three times with a man”",
          "talmudLocation": "Yoma 86b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/86b#section-10",
          "talmudFullText": "§ It was taught in a baraita that R' Yosei bar Yehuda says:  When a person commits a transgression the first time, he is forgiven; a second time, he is forgiven; a 3rd time, he is forgiven;  but the 4th time, he is not forgiven, as it is stated: “Thus said YHWH: For three transgressions of Israel, but for four I will not reverse it” (Amos 2:6). And it says: “All these things does God do twice or three times with a man” (Job 33:29)."
        }
      ]
    },
    {
      "chapterNumber": 34,
      "citations": [
        {
          "verseLocation": "Job 34:33",
          "verseText": "And they paid it no heed. A Divine Voice emerged and said: “Shall His recompense be as you will it? For you loathe it, so that you must choose, and not I?",
          "talmudLocation": "Sanhedrin 104b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-14",
          "talmudFullText": "A bat kol emerged and said to the members of the Great Assembly: “Do you see a man diligent in his business? He shall stand before kings; he shall stand not before obscure men” (Proverbs 22:29). See the greatness of Solomon, who preceded construction of My House,  the Temple, to the construction of his house. Moreover, My House he built quickly, in just seven years, and his house he constructed in thirteen years.  Therefore, “he shall stand before kings; he shall stand not before obscure men, ” and it is inappropriate to enumerate him among the wicked. And they paid it no heed. A bat kol emerged and said: “Shall His recompense be as you will it? For you loathe it, so that you must choose, and not I?  Therefore, speak what you know” (Job 34:33). Only God, and not the people, determines who has a share in the World-to-Come."
        },
        {
          "verseLocation": "Job 34:35",
          "verseText": "“Job has spoken without knowledge, and his words were without wisdom”",
          "talmudLocation": "Bava Batra 16b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16b#section-3",
          "talmudFullText": "The Talmud comments: On the one hand, the text states: “Job has spoken without knowledge, and his words were without wisdom” (Job 34:35). But on the other hand, it is written with regard to Job’s friends: “You have not spoken of Me the thing that is right, like my servant Job” (Job 42:8). Rava said: From here it may be inferred that a person is not held responsible for what he says when he is in distress.  Although Job uttered certain words that were wrong and inappropriate, he was not punished for them because he said them at a time of pain and hardship."
        }
      ]
    },
    {
      "chapterNumber": 35,
      "citations": [
        {
          "verseLocation": "Job 35:10",
          "verseText": "said: Any house in which the words of Torah are heard at night will never be destroyed, as it is stated: “But none says: Where is God my Maker, Who gives songs in the night”",
          "talmudLocation": "Eruvin 18b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/18b#section-16",
          "talmudFullText": "And R' Yirmeya ben Elazar also said: Any house in which the words of Torah are heard at night will never be destroyed, as it is stated: “But none says: Where is God my Maker, Who gives songs in the night” (Job 35:10). The verse implies that one who sings songs of Torah in his house at night will not need to lament the destruction of his home."
        },
        {
          "verseLocation": "Job 35:11",
          "verseText": "that which is written: “Who teaches us by the beasts of the earth, and makes us wiser by the birds of the sky”",
          "talmudLocation": "Eruvin 100b:28",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/100b#section-28",
          "talmudFullText": "As R' Ḥiyya said: What is the meaning of that which is written: “Who teaches us by the beasts of the earth, and makes us wiser by the birds of the sky” (Job 35:11)? He explains: “Who teaches us by the beasts of the earth”; this is the female mule, which crouches and urinates and from which we learn modesty. “And makes us wiser by the birds of the sky”; this is the rooster, which first cajoles the hen and then mates with it."
        }
      ]
    },
    {
      "chapterNumber": 36,
      "citations": [
        {
          "verseLocation": "Job 36:5",
          "verseText": "from here: “Behold, God is mighty, He despises no one”",
          "talmudLocation": "Berakhot 8a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/8a#section-3",
          "talmudFullText": "R' Aḥa ben Ḥanina, said that it is derived from here: “Behold, God is mighty, He despises no one” (Job 36:5). He adopts an alternative reading of the verse: “Behold, God will not despise” the prayer of “the mighty,” i.e., the community. And it is written: “He has redeemed my soul in peace so that none came upon me; for there were many with me.  God shall hear and answer them…” (Psalms 55:19–20). This verse teaches that the prayer was answered because there were many with me when it was offered."
        },
        {
          "verseLocation": "Job 36:7",
          "verseText": "“He withdraws not His eyes from the righteous;",
          "talmudLocation": "Megillah 13b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-1",
          "talmudFullText": "“He withdraws not His eyes from the righteous;  but with kings upon the throne He establishes them forever, and they are exalted” (Job 36:7)? This teaches that in reward for the modesty shown by Rachel she merited that Saul,  who was also modest, should descend from her, and in reward for the modesty shown by Saul, he merited that Esther should descend from him. "
        },
        {
          "verseLocation": "Job 36:7",
          "verseText": "He establishes them forever, and they are exalted”",
          "talmudLocation": "Megillah 13b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-6",
          "talmudFullText": "And what was the modesty shown by Saul? As it is written: “But of the matter of the kingdom, of which Samuel spoke, he did not tell him” (I Samuel 10:16). Saul expressed his modesty by not revealing Samuel’s promise that he would be king, and thereby merited that Esther would descend from him.  Similarly, R' Elazar said: When God assigns greatness to a person, He assigns it to his sons and to his son’s sons for all generations, as it is stated:  “He withdraws not his eyes from the righteous; but with kings upon the throne He establishes them forever, and they are exalted” (Job 36:7). And if he becomes arrogant due to this, God lowers him in order to humble him, as it is stated in the next verse: “And if they are bound in chains,  and are held in cords of affliction, then He declares unto them their work, and their transgressions, that they have behaved proudly” (Job 36:8–9)."
        },
        {
          "verseLocation": "Job 36:7",
          "verseText": "is apportioned to him and to his descendants until the end of all generations, as it is stated: “He withdraws not His eyes from the righteous; but with kings upon the throne",
          "talmudLocation": "Zevachim 102a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/102a#section-18",
          "talmudFullText": "The second response is in accordance with that which R' Elazar says that R' Ḥanina says: When greatness is apportioned to a person in Heaven, it is apportioned to him and to his descendants until the end of all generations, as it is stated: “He withdraws not His eyes from the righteous; but with kings upon the throne He sets them forever, and they are exalted” (Job 36:7). But if he then became arrogant, God humiliates him, as is stated in the next verse: “And if they be bound in fetters, and be held in cords of affliction” (Job 36:8). This was the case with Saul."
        },
        {
          "verseLocation": "Job 36:8",
          "verseText": "“And if they be bound in fetters, and be held in cords of affliction”",
          "talmudLocation": "Zevachim 102a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/102a#section-18",
          "talmudFullText": "The second response is in accordance with that which R' Elazar says that R' Ḥanina says: When greatness is apportioned to a person in Heaven, it is apportioned to him and to his descendants until the end of all generations, as it is stated: “He withdraws not His eyes from the righteous; but with kings upon the throne He sets them forever, and they are exalted” (Job 36:7). But if he then became arrogant, God humiliates him, as is stated in the next verse: “And if they be bound in fetters, and be held in cords of affliction” (Job 36:8). This was the case with Saul."
        },
        {
          "verseLocation": "Job 36:11",
          "verseText": "And it is written: “They shall spend their days in prosperity, and their years in pleasures”",
          "talmudLocation": "Sanhedrin 108a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108a#section-7",
          "talmudFullText": "A baraita states in a baraita (Tosefta, Sota 3:10): The generation of the flood became haughty and sinned due only to the excessive goodness that God bestowed upon them. And what is written concerning them,  indicating that goodness? “Their houses are safe without fear, nor is the rod of God upon them” (Job 21:9). And it is written: “Their bull sires, and will not fall; their cow calves, and does not cast her calf” (Job 21:10). And it is written: “They send forth their little ones like a flock, and their children dance” (Job 21:11). And it is written: “They sing to the timbrel and harp, and rejoice at the sound of the pipe” (Job 21:12). And it is written: “They shall spend their days in prosperity, and their years in pleasures” (Job 36:11). And it is written: “And peacefully they go down to the grave” (Job 21:13)."
        },
        {
          "verseLocation": "Job 36:13",
          "verseText": "Rabbi Elazar says: Any person who has flattery in him brings wrath to the world, as it is stated: “But those with flattery in their hearts bring about wrath”",
          "talmudLocation": "Sotah 41b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/41b#section-11",
          "talmudFullText": "R' Elazar says: Any person who has flattery in him brings wrath to the world, as it is stated: “But those with flattery in their hearts bring about wrath” (Job 36:13). And moreover, his prayer is not heard, as it is stated in that same verse: “They do not cry for help when He binds them. ”"
        },
        {
          "verseLocation": "Job 36:15",
          "verseText": "But isn’t it written: “He delivers [ yeḥaletz ] the afflicted by His affliction [ be’onyo ]”",
          "talmudLocation": "Yevamot 102b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/102b#section-10",
          "talmudFullText": "The Talmud challenges: But isn’t it written: “He delivers [yeḥaletz] the afflicted by His affliction [be’onyo]” (Job 36:15)? This indicates that the afflicted one becomes stronger due to his affliction, as, if the intention was to deliver him from his affliction, it should have said: From His affliction, rather than “by His affliction. ” The Talmud answers that the verse should be interpreted as follows: Be’onyo, in other words, as reward for his suffering from affliction, He shall deliver him from the judgment of Gehenna,  as is understood from the term be’onyo, through the reward due to his affliction."
        },
        {
          "verseLocation": "Job 36:16",
          "verseText": "the verse states: “And that which is set on your table is full of fatness”",
          "talmudLocation": "Menachot 100a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/100a#section-2",
          "talmudFullText": "And lest you say that Gehenna is prepared only for ordinary people, but it is not prepared for important individuals such as a king, the verse states: “It has been prepared even for the king. ” And lest you say there is no wood in Gehenna, the verse states: “Its pile is fire and much wood. ” And lest you say that this,  i.e., escaping Gehenna, is the only reward for Torah study, the verse states: “And that which is set on your table is full of fatness” (Job 36:16). This indicates that one who obeys God and turns from the paths of death to the paths of life is not only saved from Gehenna, he also attains tranquility and prosperity."
        },
        {
          "verseLocation": "Job 36:19",
          "verseText": "“Had you prepared your prayers, before your troubles came”",
          "talmudLocation": "Sanhedrin 44b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44b#section-7",
          "talmudFullText": "The verse states: “Had you prepared your prayers, before your troubles came” (Job 36:19). R' Elazar says: A person should always offer up prayer before trouble actually arrives, as had the patriarch Abraham not anticipated the trouble at Ai with the prayer he offered between Bethel and Ai, there would have been no remnant or refugee remaining among the enemies of Israel,  a euphemism for Israel itself, as Israel suffered a defeat at Ai from which there is ordinarily no recovery. Reish Lakish says:  The verse should be understood as follows: Anyone who concentrates himself and his energy in prayer in the world below will have no enemies in Heaven above causing him trouble. R' Yoḥanan says:  The verse should be understood in a slightly different manner: A person should always pray for mercy that all heavenly beings should strengthen his power of prayer, and that he should have no enemies causing him trouble in Heaven above. "
        },
        {
          "verseLocation": "Job 36:21",
          "verseText": "and his friends were saying to him: “Take heed, regard not iniquity; for this have you chosen rather than poverty”",
          "talmudLocation": "Bava Batra 116a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/116a#section-14",
          "talmudFullText": "The Talmud presents the second homiletic interpretation: R' Pineḥas ben Ḥama interpreted a verse homiletically,  and derived that poverty in a person’s household is more difficult than fifty plagues, as it is stated: “Have pity upon me, have pity upon me, O you my friends; for the hand of God has touched me” (Job 19:21), and his friends were saying to him: “Take heed, regard not iniquity; for this have you chosen rather than poverty” (Job 36:21). Job, who suffered many plagues, was told by his friends that his suffering was preferable to poverty."
        },
        {
          "verseLocation": "Job 36:24",
          "verseText": "With regard to a good guest, what does he say? “Remember that you magnify his work, whereof men have sung”",
          "talmudLocation": "Berakhot 58a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58a#section-6",
          "talmudFullText": "With regard to a good guest, what does he say? “Remember that you magnify his work, whereof men have sung” (Job 36:24); he praises and acknowledges those who helped him. With regard to a bad guest it is written: “Men do therefore fear him;  he regards not any who are wise of heart” (Job 37:24)."
        },
        {
          "verseLocation": "Job 36:27",
          "verseText": "which distill rain from His vapor”",
          "talmudLocation": "Taanit 9b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/9b#section-11",
          "talmudFullText": "In contrast, R' Yehoshua says: The entire world drinks from the upper waters, as it is stated: “And it drinks water as the rain of heaven comes down” (Deuteronomy 11:11). The baraita asks: But according to the opinion of R' Yehoshua, how do I uphold the verse: “And there went up a mist from the earth”?  R' Yehoshua could answer that this verse teaches that the clouds grow stronger, and rise to the firmament, and open their mouths like a leather bottle, and receive the rain waters from above, as it is stated:  “For He draws away the drops of water, which distill rain from His vapor” (Job 36:27)."
        },
        {
          "verseLocation": "Job 36:32",
          "verseText": "Rabbi Ami said: The rains are withheld only due to the sin of robbery, as it is stated: “He covers His hands with the light,",
          "talmudLocation": "Taanit 7b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/7b#section-12",
          "talmudFullText": "R' Ami said: The rains are withheld only due to the sin of robbery, as it is stated: “He covers His hands with the light,  and He has commanded it due to imploring” (Job 36:32). This means that due to the sin of stealing hands,  God has covered the light and no rain will fall. And R' Ami adds that the term “hand” means nothing other than a sin of violence, as it is stated: “And from the violence that is in their hands” (Jonah 3:8). And “light” means nothing other than rain, as it is stated: “He spreads abroad the cloud of His light” (Job 37:11)."
        },
        {
          "verseLocation": "Job 36:32",
          "verseText": "“And He has commanded it due to imploring”",
          "talmudLocation": "Taanit 7b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/7b#section-13",
          "talmudFullText": "What is the remedy of one who has caused the rain to be withheld? He should increase his prayers, as it is stated in the same chapter: “And He has commanded it due to imploring” (Job 36:32), and “imploring” means nothing other than prayer, as it is stated: “Therefore, do not pray you for this nation,  neither lift up cry nor prayer for them, neither implore Me” (Jeremiah 7:16)."
        },
        {
          "verseLocation": "Job 36:32",
          "verseText": "“And He has commanded it due to imploring”",
          "talmudLocation": "Taanit 8a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/8a#section-8",
          "talmudFullText": "And if he whispered his prayers and yet was not answered, what is his remedy?  He should go to the most pious individual of the generation, and this pious individual will increase his prayers on his behalf, as it is stated one verse earlier: “And He has commanded it due to imploring” (Job 36:32). And “imploring” means nothing other than prayer, as it is stated: “Therefore, do not pray you for this nation, neither lift up cry nor prayer for them, neither implore Me” (Jeremiah 7:16)."
        },
        {
          "verseLocation": "Job 36:33",
          "verseText": "“Its neighbor tells about him”",
          "talmudLocation": "Bava Batra 19a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/19a#section-12",
          "talmudFullText": "Rather, Abaye said that the tanna follows the biblical aphorism in the verse that states: “Its neighbor tells about him” (Job 36:33), i.e., one example is mentioned and the same applies to the other case. He taught the halakha in the case of rocks here and the same is true of sand; he taught the halakha in the case of sand there and the same is true of rocks. Rava said to Abaye: If this is correct, that “its neighbor tells about him, ” let him teach the halakha of all of these examples in one case, and let him teach the halakha of just one in the other case, and it can be said that the same is true with regard to the others. "
        },
        {
          "verseLocation": "Job 36:33",
          "verseText": "as it is written: “Its noise tells concerning it”",
          "talmudLocation": "Taanit 8a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/8a#section-7",
          "talmudFullText": "What is their remedy?  They should go to one who knows how to whisper prayers in the proper manner, as it is written: “Its noise tells concerning it” (Job 36:33). As for the phrase: “Then the charmer has no advantage, ” this is referring to one who is able to whisper his prayers correctly and yet does not whisper them correctly. In this case, of what benefit to him is his ability to pray?"
        },
        {
          "verseLocation": "Job 36:33",
          "verseText": "he brings anger into the world, as it is stated: “The cattle [ mikne ] also [ af ] concerning the rising storm [ al oleh ]”",
          "talmudLocation": "Taanit 8a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/8a#section-9",
          "talmudFullText": "And if he whispered his prayers for rain, and his prayers were successful,  i.e., rain fell as he requested, and he becomes prideful as a result, he brings anger into the world, as it is stated: “The cattle [mikne] also [af ] concerning the rising storm [al oleh]” (Job 36:33). This verse can be read homiletically as: Anger [af ] is acquired [mikne] by one who raises [al oleh] his pride."
        },
        {
          "verseLocation": "Job 36:33",
          "verseText": "“His fellow speaks of him”",
          "talmudLocation": "Yevamot 31b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/31b#section-2",
          "talmudFullText": "Rather,  Rabba’s understanding of the Mishnah must be rejected, and Abaye said:  The Mishnah should be understood according to that which is written: “His fellow speaks of him” (Job 36:33). This principle teaches that a related case can be inferred from the single case cited. The Mishnah teaches the case where it is uncertain whether the item is closer to him or closer to her with regard to betrothal, and the same is true with regard to divorce if it is uncertain whether the bill of divorce fell closer to him or closer to her. Similarly, the Mishnah teaches the case of bills that were written in a questionable manner with regard to divorce, and the same is true with regard to betrothal. "
        }
      ]
    },
    {
      "chapterNumber": 37,
      "citations": [
        {
          "verseLocation": "Job 37:6",
          "verseText": "as it is stated: “For He says to the snow: Fall on the earth, likewise to the shower of rain, and to the showers of His mighty rain”",
          "talmudLocation": "Taanit 3b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/3b#section-12",
          "talmudFullText": "On a related note, Rava said: Snow is as beneficial to the mountains as five rainfalls to the earth of the plains, as it is stated: “For He says to the snow: Fall on the earth, likewise to the shower of rain, and to the showers of His mighty rain” (Job 37:6). This verse compares snow to rain by means of five allusions to types of rainfall: The word “rain,” which appears twice; the word “shower”; and the plural “showers,” which indicates two rainfalls. This teaches that snow is as beneficial as five rainfalls."
        },
        {
          "verseLocation": "Job 37:6",
          "verseText": "world was created from the sides, as it is stated: “For He said to the snow: Become the earth, likewise to the shower of rain, and to the showers of His mighty rain”",
          "talmudLocation": "Yoma 54b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54b#section-3",
          "talmudFullText": "R' Yehoshua says:  The world was created from the sides, as it is stated: “For He said to the snow: Become the earth, likewise to the shower of rain, and to the showers of His mighty rain” (Job 37:6). This verse indicates that the rains fell from all sides, which led to the creation of the earth. R' Yitzḥak Nappaḥa said: God cast a stone into the sea, from which the world was created, as it is stated: “Upon what were its foundations fastened; or who laid its cornerstone? ” (Job 38:6)."
        },
        {
          "verseLocation": "Job 37:7",
          "verseText": "as it is stated: “He makes the hand of every man sign”",
          "talmudLocation": "Taanit 11a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/11a#section-13",
          "talmudFullText": "With regard to the 3rd section of the verse: “He is just and righteous, ” the rabbis said: At the hour of a person’s departure to his eternal home, all his deeds are enumerated before him and are rendered visible to him once again, and the deeds themselves say to him: You did such and such, in such and such a place, on such and such a day, and he says: Yes,  that is exactly what happened. And they say to him: Sign a statement that this is correct, and he signs it, as it is stated: “He makes the hand of every man sign” (Job 37:7). And not only that,  but after one has been shown all his deeds, he justifies the judgment upon himself, and says to them: You have judged me well.  This response serves to fulfill that which is stated: “That You may be justified when You speak and be right when You judge” (Psalms 51:6)."
        },
        {
          "verseLocation": "Job 37:9",
          "verseText": "“And cold out of the dispersed parts”",
          "talmudLocation": "Bava Batra 25b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/25b#section-3",
          "talmudFullText": "The baraita continues: He would say.  Before continuing its citation, the Talmud interjects: In this statement, we arrive at the opinion of R' Eliezer that the world is like a partially enclosed veranda. The Talmud resumes its citation of the baraita: There is proof from a verse that the north side is open: “Out of the chamber comes the storm”; this is the southern side that forms a room with the other two sides. “And cold out of the dispersed parts” (Job 37:9); this is the northern side,  which is open, and from which a cold wind comes. “By the breath of God ice is given”; this is the western side. “And the breadth of the waters is straitened” (Job 37:10); this is the eastern side,  from which the rains come."
        },
        {
          "verseLocation": "Job 37:10",
          "verseText": "“By the breath of God ice is given”; this is the western side. “And the breadth of the waters is straitened”",
          "talmudLocation": "Bava Batra 25b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/25b#section-3",
          "talmudFullText": "The baraita continues: He would say.  Before continuing its citation, the Talmud interjects: In this statement, we arrive at the opinion of R' Eliezer that the world is like a partially enclosed veranda. The Talmud resumes its citation of the baraita: There is proof from a verse that the north side is open: “Out of the chamber comes the storm”; this is the southern side that forms a room with the other two sides. “And cold out of the dispersed parts” (Job 37:9); this is the northern side,  which is open, and from which a cold wind comes. “By the breath of God ice is given”; this is the western side. “And the breadth of the waters is straitened” (Job 37:10); this is the eastern side,  from which the rains come."
        },
        {
          "verseLocation": "Job 37:11",
          "verseText": "rain, as it is stated: “He spreads abroad the cloud of His light”",
          "talmudLocation": "Taanit 7b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/7b#section-12",
          "talmudFullText": "R' Ami said: The rains are withheld only due to the sin of robbery, as it is stated: “He covers His hands with the light,  and He has commanded it due to imploring” (Job 36:32). This means that due to the sin of stealing hands,  God has covered the light and no rain will fall. And R' Ami adds that the term “hand” means nothing other than a sin of violence, as it is stated: “And from the violence that is in their hands” (Jonah 3:8). And “light” means nothing other than rain, as it is stated: “He spreads abroad the cloud of His light” (Job 37:11)."
        },
        {
          "verseLocation": "Job 37:17",
          "verseText": "And this is as it is written: “You whose garments are hot, when the earth is still by reason of the south wind”",
          "talmudLocation": "Gittin 31b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/31b#section-9",
          "talmudFullText": "Rabba said to him: If that is so,  then that which is written in the continuation of the verse: “And the sun beat upon the head of Jonah and he fainted” (Jonah 4:8), is difficult; it seems from the continuation of the verse that the wind was extremely hot, not strong. Rather, Rabba says: At the time that it blows, it silences all the winds before it.  Therefore, it is called ḥarishit, because all other winds are silent [maḥarishot] before it. Since only this wind was blowing, it became very hot. And this is as it is written: “You whose garments are hot, when the earth is still by reason of the south wind” (Job 37:17). R' Taḥalifa bar Rav Ḥisda says that Rav Ḥisda says in explanation of this verse: When are your garments hot,  i.e., when is there the greatest heat? It is when the earth is still by reason of the south wind, as at the time that the southern wind blows, it silences all the winds before it. "
        },
        {
          "verseLocation": "Job 37:20",
          "verseText": "he would be swallowed up”",
          "talmudLocation": "Megillah 18a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/18a#section-10",
          "talmudFullText": "Rabba bar bar Ḥana said that R' Yoḥanan said:  With regard to one who excessively declares the praises of God,  his fate is to be uprooted from the world,  as it appears as if he had exhausted all of God’s praises. As it is stated: “Shall it be told to Him when I speak? If a man says it, he would be swallowed up” (Job 37:20). The Talmud interprets the verse as saying: Can all of God’s praises be expressed when I speak? If a man would say such a thing, he would be “swallowed up” as punishment."
        },
        {
          "verseLocation": "Job 37:21",
          "verseText": "from here: “And now that men do not see the light, it is bright in the skies, but the wind passes and cleanses them”",
          "talmudLocation": "Taanit 7b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/7b#section-11",
          "talmudFullText": "Rav Yosef said that this idea is derived from here: “And now that men do not see the light, it is bright in the skies, but the wind passes and cleanses them” (Job 37:21). And “light” means nothing other than Torah, as it is stated: “For a mitzva is a lamp and Torah is a light” (Proverbs 6:23). According to this interpretation, the verse means that when “men do not see the light,” i.e., when they are not occupied with Torah, “it is bright in the skies, ” as there are no rainclouds. With regard to this verse, the school of R' Yishmael taught: Even when the sky is comprised of bright clouds that serve to bring down dew and rain,  no rain will fall, as “the wind passes and cleanses them. ”"
        },
        {
          "verseLocation": "Job 37:22",
          "verseText": "which is written: “Out of the north comes gold”",
          "talmudLocation": "Bava Batra 25b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/25b#section-5",
          "talmudFullText": "Rav Ḥisda said: What is the meaning of that which is written: “Out of the north comes gold” (Job 37:22)? This is the northern wind, which devalues gold by causing a drought that raises the price of grain. And, in addition, it says: “You who lavish gold out of the bag” (Isaiah 46:6)."
        },
        {
          "verseLocation": "Job 37:23",
          "verseText": "It is written: “The Almighty, Whom we have not found out His excellent power”",
          "talmudLocation": "Avodah Zarah 4a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-4",
          "talmudFullText": "§ Rav Ḥinnana bar Pappa raises a contradiction between the following verses. It is written: “God, Whom we have not found out His excellent power” (Job 37:23), which indicates that His power has not been seen. And it is written elsewhere: “Great is our Lord, and mighty in power” (Psalms 147:5), and it is also written: “Your right hand, O Lord, glorious in power” (Exodus 15:6), from which it may be inferred that His power is discernable. The Talmud answers: This is not difficult; here,  in the first verse, God’s strength is not seen at a time of judgment,  where He acts mercifully, whereas there,  in the other verses, they are referring to a time of war,  when He wages war against His enemies and His power is seen."
        },
        {
          "verseLocation": "Job 37:24",
          "verseText": "With regard to a bad guest it is written: “Men do therefore fear him;",
          "talmudLocation": "Berakhot 58a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58a#section-6",
          "talmudFullText": "With regard to a good guest, what does he say? “Remember that you magnify his work, whereof men have sung” (Job 36:24); he praises and acknowledges those who helped him. With regard to a bad guest it is written: “Men do therefore fear him;  he regards not any who are wise of heart” (Job 37:24)."
        },
        {
          "verseLocation": "Job 37:24",
          "verseText": "not see any Torah scholar among his sons, as it is stated: “Men do therefore fear him; he sees not any who are wise of heart”",
          "talmudLocation": "Rosh Hashanah 17a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-11",
          "talmudFullText": "And those who cast their fear over the land of the living,  who are they? Rav Ḥisda said: This is referring to a communal leader [parnas] who casts excessive fear on the community not for the sake of Heaven. Rav Yehuda said that Rav said: Any community leader who casts excessive fear on the community not for the sake of Heaven will be punished and not see any Torah scholar among his sons, as it is stated: “Men do therefore fear him; he sees not any who are wise of heart” (Job 37:24). One who brings others to fear him will not merit having wise-hearted people in his family."
        }
      ]
    },
    {
      "chapterNumber": 38,
      "citations": [
        {
          "verseLocation": "Job 38:6",
          "verseText": "Rabbi Yitzḥak Nappaḥa said: The Holy One, Blessed be He, cast a stone into the sea, from which the world was created, as it is stated: “Upon what were its foundations fastened; or who laid its cornerstone?”",
          "talmudLocation": "Yoma 54b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54b#section-3",
          "talmudFullText": "R' Yehoshua says:  The world was created from the sides, as it is stated: “For He said to the snow: Become the earth, likewise to the shower of rain, and to the showers of His mighty rain” (Job 37:6). This verse indicates that the rains fell from all sides, which led to the creation of the earth. R' Yitzḥak Nappaḥa said: God cast a stone into the sea, from which the world was created, as it is stated: “Upon what were its foundations fastened; or who laid its cornerstone? ” (Job 38:6)."
        },
        {
          "verseLocation": "Job 38:7",
          "verseText": "as it is stated: “When the morning stars sang together”",
          "talmudLocation": "Chullin 91b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/91b#section-17",
          "talmudFullText": "And the ministering angels do not recite their song above until the Jewish people recite their song below,  on earth, as it is stated: “When the morning stars sang together” (Job 38:7), referring to the Jewish people, who are compared to stars; and only then does the verse state: “And all the sons of God shouted for joy, ” which is a reference to the angels. This baraita teaches that the angels mention the name of God only after three words, i.e., after saying the word “holy” three times, whereas according to what Rav Ḥananel stated that Rav said, the 3rd group of angels says the word “holy” once and then immediately mentions the name of God."
        },
        {
          "verseLocation": "Job 38:14",
          "verseText": "similar to another. As it is stated: “It is changed like clay under the seal and they stand as a garment”",
          "talmudLocation": "Sanhedrin 38a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/38a#section-10",
          "talmudFullText": "The Mishnah teaches: And this serves to tell of the greatness of God as when a person stamps several coins with one seal, they are all similar to each other. But the supreme King of kings, God stamped all people with the seal of Adam the first man, as all are his offspring, and not one of them is similar to another. A baraita states in a baraita (Tosefta 8:5): The fact that Adam the first man was created alone serves to declare the greatness of the supreme King of kings, God as a person stamps several coins with one seal, and they are all similar to each other. But God stamps all people with the seal of Adam the first man, and not one of them is similar to another. As it is stated: “It is changed like clay under the seal and they stand as a garment” (Job 38:14). The verse describes people as being created “under the seal,” but their external appearance is different, just as garments can differ in appearance."
        },
        {
          "verseLocation": "Job 38:15",
          "verseText": "He arose and concealed it from them, as it is stated: “And from the wicked their light is withheld”",
          "talmudLocation": "Chagigah 12a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12a#section-9",
          "talmudFullText": "The Talmud answers: This should be understood in accordance with R' Elazar, as R' Elazar said:  The light that God created on the first day was not that of the sun but a different kind of light, through which man could observe from one end of the world to the other. But when God looked upon the generation of the Flood and the generation of the Dispersion and saw that their ways were corrupt and that they might misuse this light for evil, He arose and concealed it from them, as it is stated: “And from the wicked their light is withheld” (Job 38:15)."
        },
        {
          "verseLocation": "Job 38:15",
          "verseText": "which is written: “And He will withhold their light from the wicked [ resha’im ], and the high arm shall be broken”",
          "talmudLocation": "Sanhedrin 103b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-2",
          "talmudFullText": "R' Shimon ben Lakish says: What is the meaning of that which is written: “And He will withhold their light from the wicked [resha’im], and the high arm shall be broken” (Job 38:15)? For what reason is the letter ayin of the word resha’im suspended slightly above the rest of the letters? It is suspended so that the word will be read rashim, meaning poor people. It means: Once a person becomes poor on earth below and the number of his enemies grows, he becomes poor in Heaven above,  as he is certainly a sinner and that is why he is hated."
        },
        {
          "verseLocation": "Job 38:15",
          "verseText": "“And from the wicked their light is withheld and the high arm shall be broken”",
          "talmudLocation": "Sanhedrin 38a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/38a#section-11",
          "talmudFullText": "The baraita asks: And for what reason are their faces not similar to one another?  The baraita answers: It is so that a man will not see a beautiful home or a beautiful woman and say: She is mine.  If all people looked the same, no one could contradict him. As it is stated in the following verse: “And from the wicked their light is withheld and the high arm shall be broken” (Job 38:15), indicating that the reason people look different from one another is to prevent the wicked from succeeding in their plans."
        },
        {
          "verseLocation": "Job 38:15",
          "verseText": "Rav Huna says: His hand should be cut off, as it is stated: “And the high arm shall be broken”",
          "talmudLocation": "Sanhedrin 58b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/58b#section-21",
          "talmudFullText": "Rav Huna says: His hand should be cut off, as it is stated: “And the high arm shall be broken” (Job 38:15). If one habitually lifts his arm to strike others, it is better that it be broken. The Talmud relates that Rav Huna cut off the hand of a person who would habitually hit others."
        },
        {
          "verseLocation": "Job 38:25",
          "verseText": "“Who has divided a channel [ te’ala ] for the torrent",
          "talmudLocation": "Bava Batra 16a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-19",
          "talmudFullText": "God further said to Job: “Who has divided a channel [te’ala] for the torrent of rain, or a path for the lightning of thunder”? (Job 38:25). I have created many drops of water in the clouds, and for each drop I created its own channel, so that two drops should not emerge from the same channel. As were two drops to emerge from the same channel they would destroy the earth and it would not yield produce.  Now, if I do not confuse one drop with another, would I confuse Iyov with oyev?  Incidentally, the Talmud asks: From where may it be inferred that this term te’ala means a channel? Rabba bar Sheila said: As it is written with regard to Elijah the prophet: “And he fashioned a channel [te’ala] about the altar, as great as would contain two se’a of seed” (I Kings 18:32)."
        },
        {
          "verseLocation": "Job 38:31",
          "verseText": "“Can you bind the chains of the Pleiades or loosen the bands of Orion?”",
          "talmudLocation": "Berakhot 58b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58b#section-13",
          "talmudFullText": "And we learned a tradition that if the tail of the constellation Scorpio did not rest in the River of Fire, anyone stung by a scorpion would not survive. And that is what the All-Merciful said to Job of the relationship between heat and cold among the stars: “Can you bind the chains of the Pleiades or loosen the bands of Orion? ” (Job 38:31); God alternates intensifying the power of different constellations in order to raise or lower the temperature."
        },
        {
          "verseLocation": "Job 38:32",
          "verseText": "with her sons?”",
          "talmudLocation": "Berakhot 58b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58b#section-15",
          "talmudFullText": "With regard to the verse: “Who makes Ursa Major, Orion, and Pleiades” (Job 9:9), the Talmud asks: What is Ursa Major [Ash]? Rav Yehuda said:  It is the star called Yota.  This name was unfamiliar as well, so the Talmud asks: What is Yota?  There is disagreement; some say that Yota is the group of stars comprising the tail of Aries, while others say that Yota belongs to the head of Taurus.  The Talmud concludes: And it stands to reason in accordance with the opinion of the one who said that Yota is the group of stars comprising the tail of Aries, as it is written: “Or can you guide Ursa Major with her sons? ” (Job 38:32); apparently it was incomplete and the tail appears"
        },
        {
          "verseLocation": "Job 38:32",
          "verseText": "with her sons?”",
          "talmudLocation": "Berakhot 59a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/59a#section-3",
          "talmudFullText": "The Talmud argues: Then God should have created two other new stars for Pleiades. The Talmud responds: “There is nothing new under the sun” (Ecclesiastes 1:9). Rav Naḥman said:  In the future, God will restore those same stars to Ursa Major, as it is stated: “Or can you guide [tanḥem] Ursa Major with her sons? ” (Job 38:32), which is interpreted homiletically in the sense of consolation [tanḥumim] apparently due to the restoration of those stars."
        },
        {
          "verseLocation": "Job 38:35",
          "verseText": "which they are sent, as it is stated “Can you send forth lightnings, that they may go out and say to you: Here we are?”",
          "talmudLocation": "Bava Batra 25a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/25a#section-8",
          "talmudFullText": "The Talmud comments: And R' Oshaya holds that the Shekhina is found in every place, as R' Oshaya says: What is the meaning of that which is written: “You are YHWH, even You alone, You have made heaven…You preserve them all alive and the hosts of heaven bow down to You” (Nehemiah 9:6)? This indicates that Your messengers are not like the messengers of flesh and blood. The messengers of flesh and blood return to the place from where they were sent to report on their mission. But Your messengers return and report on their mission from the very same place to which they are sent, as it is stated “Can you send forth lightnings, that they may go out and say to you: Here we are? ” (Job 38:35). The verse does not state: They will come and say,  i.e., they do not return to their point of departure, but: “They may go out and say, ” which teaches that the Shekhina is found in every place. "
        },
        {
          "verseLocation": "Job 38:36",
          "verseText": "“Who has put wisdom in the inward parts? Or who has given understanding to the sekhvi ”",
          "talmudLocation": "Rosh Hashanah 26a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/26a#section-20",
          "talmudFullText": "R' Shimon ben Lakish said: When I went to the district of Kan Nishrayya,  I heard that they called a bride ninfi and a rooster sekhvi.  The Talmud explains how this information serves to clarify the meanings of biblical verses: A bride is called ninfi; what is the verse that uses a similar term? “Beautiful view [nof], the joy of the whole earth,  Mount Zion” (Psalms 48:3), which therefore means beautiful like a bride. And a rooster is called sekhvi; Rav Yehuda said that Rav said: And if you wish,  you can say that R' Yehoshua ben Levi said this: What is the verse that employs this term? “Who has put wisdom in the inward parts? Or who has given understanding to the sekhvi” (Job 38:36), which should be understood as follows: “Who has put wisdom in the inward parts”: These are the kidneys that are hidden in the body; “or who has given understanding to the sekhvi”: This is a rooster,  who knows to crow at fixed times during the night."
        },
        {
          "verseLocation": "Job 38:38",
          "verseText": "Rabbi Eliezer says: The world was created from its center, as it is stated: “When the dust runs into a mass, and the clods cleave fast together”",
          "talmudLocation": "Yoma 54b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54b#section-2",
          "talmudFullText": "§ The Mishnah taught that a stone sat in the Holy of Holies and it was called the foundation [shetiyya] rock. A Sage taught in the Tosefta: Why was it called shetiyya? It is because the world was created [hushtat] from it.  The Talmud comments: We learned the Mishnah in accordance with the opinion of the one who said that the world was created from Zion. As it was taught in a baraita that R' Eliezer says: The world was created from its center, as it is stated: “When the dust runs into a mass, and the clods cleave fast together” (Job 38:38). The world was created by adding matter to the center, like the formation of clumps of earth."
        }
      ]
    },
    {
      "chapterNumber": 39,
      "citations": [
        {
          "verseLocation": "Job 39:1",
          "verseText": "“Do you know when the wild goats of the rock give birth? Can you mark when the hinds do calve?”",
          "talmudLocation": "Bava Batra 16a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16a#section-21",
          "talmudFullText": "It is further stated there: “Do you know when the wild goats of the rock give birth? Can you mark when the hinds do calve? ” (Job 39:1). This goat is cruel to her young and shows them no pity; when she squats"
        },
        {
          "verseLocation": "Job 39:1",
          "verseText": "“Can you mark when the hinds do calve?”",
          "talmudLocation": "Bava Batra 16b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16b#section-2",
          "talmudFullText": "Similarly: “Can you mark when the hinds do calve? ” (Job 39:1). The womb of this hind is narrow,  which makes for a difficult delivery. When she squats to give birth, I summon her a snake [derakon] that bites her at the opening of the womb, which then becomes loose, and she gives birth, and if the snake reached her one moment early or was one moment late, she would immediately die.  Now, if I do not confuse one moment with another moment, would I confuse Iyov with oyev? "
        },
        {
          "verseLocation": "Job 39:13",
          "verseText": "“The wing of the ostrich beats joyously [ ne’elasa ]”",
          "talmudLocation": "Menachot 66b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/66b#section-5",
          "talmudFullText": "The baraita provides an example of a similar shortened word: “The wing of the ostrich beats joyously [ne’elasa]” (Job 39:13). The word ne’elasa is a combination of the words: Carries [noseh], goes up [oleh], and places down [venitḥata].  This bird carries its egg, flies upward, and places it in its nest."
        },
        {
          "verseLocation": "Job 39:26",
          "verseText": "world, as it is stated: “Does the hawk [ netz ] soar by your wisdom, and stretch her wings toward the south?”",
          "talmudLocation": "Bava Batra 25a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/25a#section-5",
          "talmudFullText": "§ With regard to the last statement of the baraita, Rava said to Rav Naḥman: What does frequent mean in this context? If we say it means frequent among the winds,  i.e., this wind blows all the time, that is difficult. But doesn’t Rav Ḥanan bar Abba say that Rav says: Four winds blow every day from different directions, and the northern wind blows with each of the other three; as, if this were not so,  i.e., if it did not blow, the world would not exist for even one hour,  as the northern wind is pleasant and tempers the bitter effects of the other winds. And the southern wind is harsher than all of them, and were it not for the angel named Ben Netz,  who stops it from blowing even harder, it would destroy the entire world, as it is stated: “Does the hawk [netz] soar by your wisdom, and stretch her wings toward the south? ” (Job 39:26). This indicates that the northern wind is the most constant, not the western wind."
        },
        {
          "verseLocation": "Job 39:26",
          "verseText": "destroy the entire world before it, as it is stated: “Does the hawk [ netz ] soar by your wisdom, and stretch her wings toward the south?”",
          "talmudLocation": "Gittin 31b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/31b#section-11",
          "talmudFullText": "He said to them: This is what Rav Ḥanan bar Rava says that Rav says: Four winds blow on each day, and the north wind blows together with each of the other three; as, if this were not so and the northern wind did not blow, then the world would not survive for even one hour. And the south wind is harsher than all of them, and were it not for the angel called Ben Netz,  who stops it from blowing even harder, then it would destroy the entire world before it, as it is stated: “Does the hawk [netz] soar by your wisdom, and stretch her wings toward the south? ” (Job 39:26)."
        },
        {
          "verseLocation": "Job 39:30",
          "verseText": "“Its fledglings will suck up [ ye’alu ] blood”",
          "talmudLocation": "Chullin 22b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/22b#section-6",
          "talmudFullText": "Ya’akov Korḥa taught a baraita: From when are pigeons fit?  It is from when ye’alu. He teaches the baraita and he states its explanation: The reference is to that which is stated: “Its fledglings will suck up [ye’alu] blood” (Job 39:30). When is that? Abaye said:  It is from the stage when one plucks a feather from it and blood emerges. "
        }
      ]
    },
    {
      "chapterNumber": 40,
      "citations": [
        {
          "verseLocation": "Job 40:16",
          "verseText": "“Lo now, his strength is in his loins”",
          "talmudLocation": "Bava Batra 74b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/74b#section-7",
          "talmudFullText": "And He created even the beasts on the thousand hills (see Psalms 50:10) male and female. And they were so enormous that if they would have coupled and produced offspring, they would have destroyed the entire world. What did God do? He castrated the male and cooled the sexual desire of the female and preserved it for the righteous in the future. As it is stated about the beasts: “Lo now, his strength is in his loins” (Job 40:16); this is referring to the male.  The continuation of the verse: “And his force is in the stays of his body”; this is the female,  alluding to the idea that they did not use their genitals for the purpose of procreation."
        },
        {
          "verseLocation": "Job 40:19",
          "verseText": "it, as it is stated: “Only He Who made him can use His sword to approach him”",
          "talmudLocation": "Bava Batra 75a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75a#section-1",
          "talmudFullText": "a hunt of the leviathan, as it is stated: “Can you draw out leviathan with a fish hook? Or press down his tongue with a cord? ” (Job 40:25). And were God not assisting Gabriel, he would not be able to hunt it, as it is stated: “Only He Who made him can use His sword to approach him” (Job 40:19)."
        },
        {
          "verseLocation": "Job 40:23",
          "verseText": "and rolls down to the Great Sea, and rolls down until it reaches the mouth of the leviathan. As it is stated: “He is confident, though the Jordan rush forth to his mouth”",
          "talmudLocation": "Bava Batra 74b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/74b#section-11",
          "talmudFullText": "And Rav Yehuda says that Rav says: The Jordan issues forth from the cave of Pamyas. That is also taught in a baraita: The Jordan issues forth from the cave of Pamyas, and travels in the Sea of Sivkhi,  i.e., the Hula Lake, and in the Sea of Tiberias,  the Sea of Galilee, and rolls down to the Great Sea, and rolls down until it reaches the mouth of the leviathan. As it is stated: “He is confident, though the Jordan rush forth to his mouth” (Job 40:23). Rava bar Ulla strongly objects to this explanation of the verse, stating: But this verse is written about the beasts on the thousand hills. Rather, Rava bar Ulla said that this is the meaning of the verse: When are the beasts on the thousand hills confident? When the Jordan rushes forth into the mouth of the leviathan. "
        },
        {
          "verseLocation": "Job 40:25",
          "verseText": "a hunt of the leviathan, as it is stated: “Can you draw out leviathan with a fish hook? Or press down his tongue with a cord?”",
          "talmudLocation": "Bava Batra 75a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75a#section-1",
          "talmudFullText": "a hunt of the leviathan, as it is stated: “Can you draw out leviathan with a fish hook? Or press down his tongue with a cord? ” (Job 40:25). And were God not assisting Gabriel, he would not be able to hunt it, as it is stated: “Only He Who made him can use His sword to approach him” (Job 40:19)."
        },
        {
          "verseLocation": "Job 40:29",
          "verseText": "as it is stated: “Or will you bind him for your maidens”",
          "talmudLocation": "Bava Batra 75a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75a#section-7",
          "talmudFullText": "If one is deserving at least of this reward, a covering is prepared for him,  and if one is not deserving, a necklace is prepared for him, as it is stated: “And necklaces about your neck” (Proverbs 1:9). If one is somewhat deserving, a necklace is prepared for him,  and if one is not deserving even of this, only an amulet is prepared for him from the skin of the leviathan, as it is stated: “Or will you bind him for your maidens” (Job 40:29), i.e., a small amulet is prepared for him, like the amulets tied on children’s necks."
        },
        {
          "verseLocation": "Job 40:30",
          "verseText": "future, the Holy One, Blessed be He, will make a feast for the righteous from the flesh of the leviathan, as it is stated: “The ḥabbarim will make a feast [ yikhru ] of him”",
          "talmudLocation": "Bava Batra 75a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75a#section-4",
          "talmudFullText": "Rabba says that R' Yoḥanan says:  In the future, God will make a feast for the righteous from the flesh of the leviathan, as it is stated: “The ḥabbarim will make a feast [yikhru] of him” (Job 40:30). And kera means nothing other than a feast, as it is stated: “And he prepared [va’yikhreh] for them a great feast [kera]; and they ate and drank” (II Kings 6:23). And ḥabbarim means nothing other than Torah scholars, as it is stated: “You that dwell in the gardens, the companions [ḥaverim] hearken for your voice: Cause me to hear it” (Song of Songs 8:13). This verse is interpreted as referring to Torah scholars, who listen to God’s voice."
        },
        {
          "verseLocation": "Job 40:30",
          "verseText": "divide it and use it for commerce in the markets of Jerusalem, as it is stated: “They will part him among the kena’anim ”",
          "talmudLocation": "Bava Batra 75a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75a#section-5",
          "talmudFullText": "And with regard to the remainder of the leviathan, they will divide it and use it for commerce in the markets of Jerusalem, as it is stated: “They will part him among the kena’anim” (Job 40:30). And kena’anim means nothing other than merchants, as it is stated: “As for the merchant [kena’an], the balances of deceit are in his hand. He loves to oppress” (Hosea 12:8). And if you wish, say that the proof is from here: “Whose merchants are princes, whose traffickers [kinaneha] are the honorable of the earth” (Isaiah 23:8)."
        },
        {
          "verseLocation": "Job 40:31",
          "verseText": "leviathan, as it is stated: “Can you fill his skin with barbed irons [ besukkot ]”",
          "talmudLocation": "Bava Batra 75a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75a#section-6",
          "talmudFullText": "And Rabba says that R' Yoḥanan says:  In the future, God will prepare a sukka for the righteous from the skin of the leviathan, as it is stated: “Can you fill his skin with barbed irons [besukkot]” (Job 40:31). If one is deserving of being called righteous, an entire sukka is prepared for him from the skin of the leviathan; if one is not deserving of this honor, a covering is prepared for his head, as it is stated: “Or his head with fish-spears” (Job 40:31)."
        }
      ]
    },
    {
      "chapterNumber": 41,
      "citations": [
        {
          "verseLocation": "Job 41:7",
          "verseText": "is a kosher fish, as it is stated: “His armor is his pride”",
          "talmudLocation": "Chullin 67b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/67b#section-15",
          "talmudFullText": "It is taught in a baraita: R' Yosei ben Durmaskit says:  The leviathan mentioned in the Bible is a kosher fish, as it is stated: “His armor is his pride” (Job 41:7), and: “Sharpest potsherds are under him” (Job 41:22). The phrase “his armor” is referring to his scales,  which protect him like armor. The phrase “sharpest potsherds are under him” is referring to fins with which he swims,  which are sharp and project from his underside."
        },
        {
          "verseLocation": "Job 41:7",
          "verseText": "troubles will be closed and sealed from him, as it is stated: “The channels of [ afikei ] his scales are his pride, closed together as with a tight [ tzar ] seal”",
          "talmudLocation": "Eruvin 65a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/65a#section-5",
          "talmudFullText": "R' Ḥanina said: Whoever passes a shield over himself at a time of arrogance,  i.e., whoever suppresses his evil inclination as though it were covered with a shield when he is arrogant, e.g., when he is intoxicated or the like (Rabbeinu Ḥananel), troubles will be closed and sealed from him, as it is stated: “The channels of [afikei] his scales are his pride, closed together as with a tight [tzar] seal” (Job 41:7). The verse is interpreted homiletically: When at a time of arrogance a person passes a shield [mapik] over his evil inclination, his troubles [tzarot] will be closed and sealed before him."
        },
        {
          "verseLocation": "Job 41:10",
          "verseText": "said to him: Perhaps you saw the eyes of the leviathan, as it is written: “And his eyes are like the eyelids of the morning”",
          "talmudLocation": "Bava Batra 74b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/74b#section-3",
          "talmudFullText": "§ Apropos the stories of large sea creatures, the Talmud discusses the large sea creatures mentioned in the Bible. A baraita states:  There was an incident involving R' Eliezer and R' Yehoshua, who were traveling on a ship, and R' Eliezer was sleeping and R' Yehoshua was awake. R' Yehoshua trembled, and R' Eliezer awoke.  R' Eliezer said to him: What is this, Yehoshua; for what reason did you tremble?  R' Yehoshua said to him: I saw a great light in the sea.  R' Eliezer said to him: Perhaps you saw the eyes of the leviathan, as it is written: “And his eyes are like the eyelids of the morning” (Job 41:10)."
        },
        {
          "verseLocation": "Job 41:10",
          "verseText": "Sneezing, as it is written: “His sneezes flash forth light”",
          "talmudLocation": "Berakhot 57b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/57b#section-14",
          "talmudFullText": "Similarly: Six matters are good omens for the sick: Sneezing, sweating, diarrhea, a seminal emission, sleep, and a dream.  These are all alluded to in Scripture: Sneezing, as it is written: “His sneezes flash forth light” (Job 41:10), indicating that by means of a sneeze one comes to see the light of the world. Sweat, as it is written: “In the sweat of your face shall you eat bread” (Genesis 3:19). Diarrhea, as it is written: “He that is bent down shall speedily be loosed; and he shall not go down dying into the pit” (Isaiah 51:14). A seminal emission, as it is written: “That he might see his seed, prolong his days” (Isaiah 53:10). Sleep, as it is written: “I should have slept; then had I been at rest” (Job 3:13). A dream, as it is written: “Wherefore You recover me [vataḥalimeni], and make me to live” (Isaiah 38:16); vataḥalimeni is interpreted as etymologically similar to ḥalom, dream."
        },
        {
          "verseLocation": "Job 41:22",
          "verseText": "“Sharpest potsherds are under him”",
          "talmudLocation": "Chullin 67b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/67b#section-15",
          "talmudFullText": "It is taught in a baraita: R' Yosei ben Durmaskit says:  The leviathan mentioned in the Bible is a kosher fish, as it is stated: “His armor is his pride” (Job 41:7), and: “Sharpest potsherds are under him” (Job 41:22). The phrase “his armor” is referring to his scales,  which protect him like armor. The phrase “sharpest potsherds are under him” is referring to fins with which he swims,  which are sharp and project from his underside."
        },
        {
          "verseLocation": "Job 41:23",
          "verseText": "As it is stated: “He makes the deep boil like a pot”",
          "talmudLocation": "Bava Batra 75a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75a#section-2",
          "talmudFullText": "When Rav Dimi came from Eretz Yisrael to Babylonia, he said that R' Yoḥanan said: When the leviathan is hungry, he produces breath from his mouth and thereby boils all of the waters in the depths of the sea. As it is stated: “He makes the deep boil like a pot” (Job 41:23). And if the leviathan did not place its head in the Garden of Eden, no creature could withstand his foul smell, as it is stated: “He makes the sea like a seething mixture [merkaḥa]” (Job 41:23), and the term merkaḥa is also used to describe something with a smell (see Exodus 30:25)."
        },
        {
          "verseLocation": "Job 41:24",
          "verseText": "And when he is thirsty, he makes many furrows in the sea, as it is stated: “He makes a path to shine after him”",
          "talmudLocation": "Bava Batra 75a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75a#section-3",
          "talmudFullText": "And when he is thirsty, he makes many furrows in the sea, as it is stated: “He makes a path to shine after him” (Job 41:24). Rav Aḥa bar Yaakov says:  After the leviathan drinks from the sea, the depth of the sea does not return to its normal condition until seventy years have passed, as it is stated: “One would think the deep to be hoary” (Job 41:24), and hoary indicates a person who is no less than seventy years old."
        }
      ]
    },
    {
      "chapterNumber": 42,
      "citations": [
        {
          "verseLocation": "Job 42:8",
          "verseText": "“You have not spoken of Me the thing that is right, like my servant Job”",
          "talmudLocation": "Bava Batra 16b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/16b#section-3",
          "talmudFullText": "The Talmud comments: On the one hand, the text states: “Job has spoken without knowledge, and his words were without wisdom” (Job 34:35). But on the other hand, it is written with regard to Job’s friends: “You have not spoken of Me the thing that is right, like my servant Job” (Job 42:8). Rava said: From here it may be inferred that a person is not held responsible for what he says when he is in distress.  Although Job uttered certain words that were wrong and inappropriate, he was not punished for them because he said them at a time of pain and hardship."
        },
        {
          "verseLocation": "Job 42:10",
          "verseText": "as it is written: “And the Lord changed the fortune of Job, when he prayed for his friends”",
          "talmudLocation": "Bava Kamma 92a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/92a#section-15",
          "talmudFullText": "§ The Talmud cites a series of questions that Rava asked Rabba bar Mari, the first one being related to the previous topic of discussion. Rava said to Rabba bar Mari: From where is this matter derived whereby the rabbis stated: Anyone who asks for compassion from Heaven on behalf of another, and he requires compassion from Heaven concerning that same matter, he is answered first?  Rabba bar Mari said to him that the source for this is as it is written: “And YHWH changed the fortune of Job, when he prayed for his friends” (Job 42:10)."
        },
        {
          "verseLocation": "Job 42:15",
          "verseText": "in the days of Ahasuerus, as it is stated: “And in all the world were no women found so beautiful as the daughters of Job”",
          "talmudLocation": "Bava Batra 15b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-6",
          "talmudFullText": "R' Yehoshua ben Korḥa says: Job lived in the days of Ahasuerus, as it is stated: “And in all the world were no women found so beautiful as the daughters of Job” (Job 42:15). In which generation were beautiful women sought? You must say it was the generation of Ahasuerus (Esther, chapter 2). The Talmud asks: But why not say it was in the days of David, as it is written: “And they sought a beautiful maiden” (I Kings 1:3)? The Talmud answers: There,  in the time of David, they searched “throughout the territory of Israel” (I Kings 1:3), whereas here,  in the time of Ahasuerus,  they searched throughout the world,  as is similarly stated with regard to Job’s daughters."
        }
      ]
    }
  ]
}