{
  "bookName": "Joel",
  "totalEntries": 16,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Joel 1:4",
          "verseText": "And it is written: “That which the palmerworm has left the locust has eaten; and that which the locust has left the cankerworm has eaten; and that which the cankerworm has left the caterpillar has eaten”",
          "talmudLocation": "Shabbat 33a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/33a#section-1",
          "talmudFullText": "<b>who eat and do nothing</b> to support themselves, and cause their husbands to commit the sin of theft. <b>And it is written: “I have smitten you with blight and mildew; the multitude of your gardens and your vineyards and your fig trees and your olive trees has the palmerworm devoured”</b> (Amos 4:9). <b>And it is written: “That which the palmerworm has left the locust has eaten; and that which the locust has left the cankerworm has eaten; and that which the cankerworm has left the caterpillar has eaten”</b> (Joel 1:4). <b>And it is written: “And one snatches on the right hand, and is hungry; and he eats on the left hand, and is not satisfied; they eat every man the flesh of his own arm [<i>besar zero</i>’<i>o</i>]”</b> (Isaiah 9:19). <b>Do not read</b> it: <b>The flesh of his own arm [<i>besar zero</i>’<i>o</i>]; rather, the flesh of his own offspring [<i>besar zaro</i>]. </b> All the punishments for theft listed above were explicitly mentioned in the verses."
        },
        {
          "verseLocation": "Joel 1:4",
          "verseText": "it is written: “That which the palmer-worm has left, the locust has eaten",
          "talmudLocation": "Taanit 5a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/5a#section-4",
          "talmudFullText": "<strong>Talmud: </strong> <b>Rav Naḥman said to R' Yitzḥak: </b> Is the <b>first rain in Nisan? </b> The <b>first rain is in Marḥeshvan, as we learned</b> in a <i>baraita</i>: <b>The first rain</b> is <b>in Marḥeshvan and the last rain</b> is <b>in Nisan. </b> R' Yitzḥak <b>said to</b> Rav Naḥman that <b>R' Yoḥanan said as follows: This verse was fulfilled in the days of</b> the prophet <b>Joel, son of Pethuel, </b> in a year <b>concerning</b> which <b>it is written: “That which the palmer-worm has left, the locust has eaten</b> and that which the locust has left, the canker-worm has eaten; and that which the canker-worm has left, the caterpillar has eaten” (Joel 1:4), when no crops remained. In <b>that year, </b> the month of <b>Adar ended and</b> still <b>no rain had fallen. </b> The rain of the <b>first winter fell for them on the first of Nisan. </b>"
        },
        {
          "verseLocation": "Joel 1:8",
          "verseText": "like a woman who cries over the husband of her youth, as it is stated: “Lament like a virgin girded with sackcloth for the husband of her youth”",
          "talmudLocation": "Sanhedrin 104b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-7",
          "talmudFullText": "With regard to the verse: <b>“And her tears are on her cheeks”</b> (Lamentations 1:2), <b>Rava says</b> that <b>R' Yoḥanan says: </b> This is <b>like a woman who cries over the husband of her youth, as it is stated: “Lament like a virgin girded with sackcloth for the husband of her youth”</b> (Joel 1:8). With regard to the verse: <b>“Her adversaries have become the head”</b> (Lamentations 1:5), <b>Rava says</b> that <b>R' Yoḥanan says: </b> This indicates that <b>anyone who torments the Jewish people becomes a leader, as it is stated: “For there is no weariness to him that is set against her; at the first He lightly afflicted the land of Zebulun, and the land of Naphtali and afterward He afflicted her more grievously by the way of the sea, beyond the Jordan and the Galilee of the nations”</b> (Isaiah 8:23). <b>Rava says</b> that <b>R' Yoḥanan says: </b> From this verse one derives that <b>anyone who harasses Israel does not</b> grow <b>weary. </b>"
        },
        {
          "verseLocation": "Joel 1:14",
          "verseText": "the verse states: “Sanctify a fast, call a solemn assembly, gather the elders”",
          "talmudLocation": "Taanit 12b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/12b#section-12",
          "talmudFullText": "<strong>Talmud: </strong> The Talmud discusses the activities that are prohibited on a communal fast day: <b>Granted, all of</b> the other actions are prohibited, <b>as they</b> provide <b>pleasure, </b> namely, <b>bathing, smearing, and marital sex. However, working is</b> a cause of <b>suffering. </b> Why was it decreed that one must refrain from working? <b>Rav Ḥisda said</b> that <b>Rav Yirmeya bar Abba said</b> as that <b>the verse states: “Sanctify a fast, call a solemn assembly, gather the elders”</b> (Joel 1:14), this indicates that a fast day is <b>like</b> a day of <b>assembly. Just as</b> on a day of <b>assembly, </b> i.e., a Festival, it <b>is prohibited</b> to engage <b>in working, so too, </b> on <b>a fast</b> it <b>is prohibited</b> to engage <b>in working. </b>"
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Joel 2:13",
          "verseText": "an allusion to this matter, as it is stated: “And rend your hearts, and not your garments”",
          "talmudLocation": "Moed Katan 26b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26b#section-11",
          "talmudFullText": "It was taught in a <i>baraita</i>: <b>Until where</b> may <b>he rend</b> his garment, if he continues to rend the same garment for additional relatives? He may continue rending <b>until</b> the point where the garment covers <b>his navel. Some say: Until</b> the point where the garment covers <b>his heart. Although there is no</b> absolute <b>proof for the matter</b> that one may rend the garment until this point, there is <b>an allusion to this matter, as it is stated: “And rend your hearts, and not your garments”</b> (Joel 2:13), thereby intimating that one may extend the rent in his garment only until he reaches the point where the garment covers his heart."
        },
        {
          "verseLocation": "Joel 2:13",
          "verseText": "And in the Prophets it says: “And rend your hearts and not your garments,",
          "talmudLocation": "Taanit 15a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/15a#section-5",
          "talmudFullText": "<b>The eldest</b> member <b>of the</b> community <b>says to</b> the congregation <b>statements of reproof, </b> for example: <b>Our brothers, it is not stated with regard to the people of Nineveh: And God saw their sackcloth and their fasting. Rather, </b> the verse says: <b>“And God saw their deeds, that they had turned from their evil way”</b> (Jonah 3:10). <b>And in the Prophets it says: “And rend your hearts and not your garments, </b> and return to YHWH your God” (Joel 2:13). This teaches that prayer and fasting are insufficient, as one must also repent and amend his ways in practice."
        },
        {
          "verseLocation": "Joel 2:18",
          "verseText": "a term of forewarning, and so it says: “Then the Lord warned [ vayekanneh ] concerning His land",
          "talmudLocation": "Sotah 3a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/3a#section-2",
          "talmudFullText": "The Talmud asks: <b>And</b> according to <b>the one who says</b> that it is <b>permitted</b> for him <b>to issue a warning, what is</b> the meaning of the <b>term <i>kinnui</i>? Rav Naḥman bar Yitzḥak says: </b> The term <b><i>kinnui</i></b> means <b>nothing other</b> than <b>a term of forewarning, and so it says: “Then YHWH warned [<i>vayekanneh</i>] concerning His land</b> and had pity for His people” (Joel 2:18). As detailed in that passage, YHWH ordered the locusts to stop destroying Eretz Yisrael."
        },
        {
          "verseLocation": "Joel 2:20",
          "verseText": "“And will drive it to a land barren and desolate”",
          "talmudLocation": "Sukkah 52a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52a#section-10",
          "talmudFullText": "The <i>baraita</i> continues interpreting the verse in the book of Joel. <b>“And will drive it to a land barren and desolate”</b> (Joel 2:20), <b>where there are no people for</b> the evil inclination <b>to incite. </b> And what damage does the evil inclination cause? <b>“With its face toward the eastern [<i>hakadmoni</i>] sea”</b> (Joel 2:20), <b>as it set its eyes on the First</b> [<b><i>mukdam</i></b>] <b>Temple and destroyed it, and killed the Torah scholars that</b> were <b>in it; “and its end toward the western [<i>ha’aḥaron</i>] sea”</b> (Joel 2:20), <b>as it set its eyes on the Second</b> [<b><i>aḥaron</i></b>] <b>Temple and destroyed it, and killed the Torah scholars that</b> were <b>in it; “its foulness may come up, and its ill odor may come up”</b> (Joel 2:20), <b>as it forsakes the nations of the world and incites the enemies of</b> the <b>Jewish people: </b> In this context, the term the nations is a euphemism for the Jewish people. The evil inclination seeks to corrupt the Jews more than it does the members of any other nation. <b>“Because it has done greatly”</b> (Joel 2:20): <b>Abaye said: And</b> it provokes <b>Torah scholars more than</b> it provokes <b>everyone</b> else."
        },
        {
          "verseLocation": "Joel 2:20",
          "verseText": "Joel called it hidden one, as it says: “But I will remove the northern one [ hatzefoni ] far off from you”",
          "talmudLocation": "Sukkah 52a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52a#section-9",
          "talmudFullText": "<b>Isaiah called it a stumbling block, as it is stated: “And He will say: Cast you up, cast you up, clear the way, take up the stumbling block out of the way of My people”</b> (Isaiah 57:14). <b>Ezekiel called it stone, as it is stated: “And I will take away the stony heart out of your flesh, and I will give you a heart of flesh”</b> (Ezekiel 36:26). <b>Joel called it hidden one, as it says: “But I will remove the northern one [<i>hatzefoni</i>] far off from you”</b> (Joel 2:20). <b>A baraita states</b> concerning the verse: <b>“But I will remove the northern one [<i>hatzefoni</i>] far off from you, ”</b> that <b>this is</b> referring to <b>the evil inclination. </b> And why is the evil inclination referred to as <i>tzefoni</i>? It is due to the fact <b>that it is always hidden [<i>tzafun</i>] in the heart of man. </b>"
        },
        {
          "verseLocation": "Joel 2:22",
          "verseText": "Rav said: In the future all barren trees in Eretz Yisrael will bear fruit, as it is stated: “For the tree bears its fruit, the fig tree and the vine yield their strength”",
          "talmudLocation": "Ketubot 112b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/112b#section-3",
          "talmudFullText": "<b>Rav Ḥiyya bar Ashi said</b> that <b>Rav said: In the future all barren trees in Eretz Yisrael will bear fruit, as it is stated: “For the tree bears its fruit, the fig tree and the vine yield their strength”</b> (Joel 2:22). This verse indicates that every tree, not just the fig and vine, will produce fruit."
        },
        {
          "verseLocation": "Joel 2:23",
          "verseText": "last rain, in the first",
          "talmudLocation": "Taanit 5a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/5a#section-3",
          "talmudFullText": "<strong>Mishnah: </strong> <b>Until when does one request rain? R' Yehuda says: </b> We request rain <b>until Passover has passed. R' Meir says: Until</b> the month of <b>Nisan has ended, as it is stated: “And He causes to come down for you the rain, </b> the <b>first rain and</b> the <b>last rain, in the first</b> month” (Joel 2:23). Since the verse states that it rains in Nisan, the first month, this indicates that the entire month is considered part of the winter."
        },
        {
          "verseLocation": "Joel 2:23",
          "verseText": "last rain [ malkosh ], in the first",
          "talmudLocation": "Taanit 6a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/6a#section-4",
          "talmudFullText": "<b>And</b> with regard to <b><i>yoreh</i> itself, from where do we</b> derive that it is referring to rain that falls for a blessing? <b>As it is written: “You children of Zion, be glad and rejoice in YHWH your God, for He has given you the first rain [<i>moreh</i>] in His kindness, and He caused to come down for you the rain, </b> the <b>first rain [<i>moreh</i>] and</b> the <b>last rain [<i>malkosh</i>], in the first</b> month” (Joel 2:23). This verse clearly states that <i>yoreh</i>, also referred to as <i>moreh</i>, fall due to God’s kindness, for a blessing."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Joel 3:5",
          "verseText": "nothing other than a Torah scholar, as it is stated: “And among the remnant [ sarid ] those whom the Lord shall call”",
          "talmudLocation": "Chullin 133a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/133a#section-15",
          "talmudFullText": "<b>As Rav Yehuda said</b> that <b>Rav said: Anyone who teaches</b> Torah <b>to an unworthy student falls into Gehenna, as it is stated: “All darkness is laid up for his treasures; a fire not blown by man shall consume him; it shall go ill with him that remains [<i>yera sarid</i>] in his tent”</b> (Job 20:26), <b>and <i>sarid</i></b> means <b>nothing other than a Torah scholar, as it is stated: “And among the remnant [<i>sarid</i>] those whom YHWH shall call”</b> (Joel 3:5). The word <i>yera</i> shares a root with the word <i>ra</i>, evil, and “<i>yera sarid</i>” is therefore understood to be referring to an unworthy student."
        },
        {
          "verseLocation": "Joel 3:5",
          "verseText": "but a Torah scholar, as it is stated: “And among the seridim , those whom the Lord shall call”",
          "talmudLocation": "Sanhedrin 92a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92a#section-15",
          "talmudFullText": "<b>And R' Elazar says: </b> With regard to <b>any house in which there are no matters of Torah heard at night, the fire</b> of Gehenna <b>consumes it, as it is stated: “All darkness is laid up for his treasures, a fire not fanned shall consume him; it shall go ill with a <i>sarid</i> in his tent”</b> (Job 20:26). <b><i>Sarid</i></b> is referring to <b>no</b> one <b>but a Torah scholar, as it is stated: “And among the <i>seridim</i>, those whom YHWH shall call”</b> (Joel 3:5). A house that is dark at night and in which no Torah is heard will be consumed by a fire that does not require fanning with a bellows, the fire of Gehenna."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Joel 4:3",
          "verseText": "“And they have given a boy for a prostitute, and sold a girl for wine, and have drunk”",
          "talmudLocation": "Gittin 6b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/6b#section-8",
          "talmudFullText": "<b>Rav Yosef said: Who will tell us</b> that <b>R' Evyatar is a reliable</b> authority? <b>And furthermore, </b> there is good reason to question his statement: <b>He</b> is <b>the one who sent</b> a letter <b>to Rav Yehuda, </b> and wrote: <b>People who ascend from there, </b> Babylonia, <b>to here, </b> Eretz Yisrael, <b>fulfill by themselves</b> the verse: <b>“And they have given a boy for a prostitute, and sold a girl for wine, and have drunk”</b> (Joel 4:3), i.e., these people abandon their families. <b>And</b> R' Evyatar <b>wrote him</b> this verse <b>without scoring, </b> i.e., etching lines into, the parchment upon which he wrote the letter."
        },
        {
          "verseLocation": "Joel 4:19",
          "verseText": "for the extortion of the children of Judah, because they have shed innocent blood in their land”",
          "talmudLocation": "Bava Kamma 119a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/119a#section-14",
          "talmudFullText": "<b>And it states: </b> “Egypt shall be a desolation, and Edom shall be a desolate wilderness, <b>for the extortion of the children of Judah, because they have shed innocent blood in their land”</b> (Joel 4:19). The verse here considers extortion like the shedding of innocent blood. <b>And it states</b> with regard to a famine: “And YHWH said: <b>It is for Saul, and for his bloody house, because he put to death the Gibeonites”</b> (II Samuel 21:1)."
        }
      ]
    }
  ]
}