{
  "bookName": "Joshua",
  "totalEntries": 154,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Joshua 1:1",
          "verseText": "And it is written: “Now it came to pass after the death of Moses, the servant of the Lord”",
          "talmudLocation": "Kiddushin 38a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/38a#section-5",
          "talmudFullText": "<b>It is taught</b> in <b>another</b> <i>baraita</i>: <b>Moses died on the 7th of Adar, and he was</b> likewise <b>born on the 7th of Adar. From where</b> is it derived <b>that</b> Moses <b>died on the 7th of Adar? As it is stated: “So Moses, the servant of YHWH, died there”</b> (Deuteronomy 34:5), <b>and it is written: “And the children of Israel wept for Moses in the plains of Moab thirty days”</b> (Deuteronomy 34:8). <b>And it is written: “Now it came to pass after the death of Moses, the servant of YHWH”</b> (Joshua 1:1), <b>and it is written: “Moses, My servant, is dead; now arise, cross</b> this Jordan” (Joshua 1:2)."
        },
        {
          "verseLocation": "Joshua 1:2",
          "verseText": "and it is written: “Moses, My servant, is dead; now arise, cross",
          "talmudLocation": "Kiddushin 38a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/38a#section-5",
          "talmudFullText": "<b>It is taught</b> in <b>another</b> <i>baraita</i>: <b>Moses died on the 7th of Adar, and he was</b> likewise <b>born on the 7th of Adar. From where</b> is it derived <b>that</b> Moses <b>died on the 7th of Adar? As it is stated: “So Moses, the servant of YHWH, died there”</b> (Deuteronomy 34:5), <b>and it is written: “And the children of Israel wept for Moses in the plains of Moab thirty days”</b> (Deuteronomy 34:8). <b>And it is written: “Now it came to pass after the death of Moses, the servant of YHWH”</b> (Joshua 1:1), <b>and it is written: “Moses, My servant, is dead; now arise, cross</b> this Jordan” (Joshua 1:2)."
        },
        {
          "verseLocation": "Joshua 1:7",
          "verseText": "“Only be strong and be extremely courageous, observe and do all of the Torah",
          "talmudLocation": "Berakhot 32b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/32b#section-12",
          "talmudFullText": "For each of these, a biblical proof is cited: <b>From where</b> is it derived that <b>Torah and good deeds</b> require bolstering? <b>As it is stated</b> in the instruction to Joshua: <b>“Only be strong and be extremely courageous, observe and do all of the Torah</b> that Moses My servant commanded you; do not deviate to the right or to the left, that you may succeed wherever you go” (Joshua 1:7). In this verse, observe refers to Torah study and do refers to good deeds (Maharsha); the apparently repetitive language is not extraneous. The Talmud derives: <b>Be strong in Torah and be courageous in good deeds. </b>"
        },
        {
          "verseLocation": "Joshua 1:8",
          "verseText": "It is repeated in the Prophets, as it is written: “This book of the Torah shall not depart out of your mouth, but you shall meditate on it day and night, that you may observe to do according to all that is written in it; for then you shall make your ways prosperous, and then you shall have good success”",
          "talmudLocation": "Avodah Zarah 19b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/19b#section-8",
          "talmudFullText": "<b>It is repeated in the Prophets, as it is written: “This book of the Torah shall not depart out of your mouth, but you shall meditate on it day and night, that you may observe to do according to all that is written in it; for then you shall make your ways prosperous, and then you shall have good success”</b> (Joshua 1:8). <b>It is stated a 3rd time in the Writings, as it is written: “But his delight is in the Torah of YHWH; and in His Torah he meditates day and night. And he shall be like a tree planted by streams of water, that brings forth its fruit in its season, and whose leaf does not wither; and in whatsoever he does he shall prosper”</b> (Psalms 1:2–3)."
        },
        {
          "verseLocation": "Joshua 1:8",
          "verseText": "the verse states: “And you shall gather your grain”? Because it is stated: “This Torah shall not depart from your mouths,",
          "talmudLocation": "Berakhot 35b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/35b#section-6",
          "talmudFullText": "<b>A baraita states: What</b> is the meaning of that which <b>the verse states: “And you shall gather your grain”? Because it is stated: “This Torah shall not depart from your mouths, </b> and you shall contemplate in it day and night” (Joshua 1:8), <b>I might</b> have thought <b>that these matters are</b> to be understood <b>as they are written; </b> one is to literally spend his days immersed exclusively in Torah study. Therefore, <b>the verse states: “And you shall gather your grain, </b> your wine and your oil,” <b>assume in their</b> regard, <b>the way of the world; </b> set aside time not only for Torah, but also for work. This is <b>the statement of R' Yishmael. </b>"
        },
        {
          "verseLocation": "Joshua 1:8",
          "verseText": "fulfilled the mitzva of: “This Torah scroll shall not depart from your mouth,",
          "talmudLocation": "Menachot 99b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/99b#section-16",
          "talmudFullText": "The <i>baraita</i> teaches that according to R' Yosei, even if the old shewbread remained on the Table for a short while in the morning, and the new shewbread was placed on the Table toward evening, and even though it did not reside constantly on the Table, this fulfills the requirement that the shewbread should always be on the Table. <b>R' Ami says: From R' Yosei’s statement we may learn</b> that <b>even</b> if <b>a person learned only one chapter</b> of the Mishnah in <b>the morning and one chapter</b> of the Mishnah in <b>the evening, he has</b> thereby <b>fulfilled the mitzva of: “This Torah scroll shall not depart from your mouth, </b> and you shall contemplate in it day and night, that you may take heed to do according to all that is written in it, for then you shall make your ways prosperous, and then you shall have good success” (Joshua 1:8)."
        },
        {
          "verseLocation": "Joshua 1:8",
          "verseText": "states: “This Torah scroll shall not depart from your mouth”",
          "talmudLocation": "Sanhedrin 99b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/99b#section-2",
          "talmudFullText": "<b>R' Elazar says: Every man was created for labor, as it is stated: “Man is born for toil”</b> (Job 5:7). Based on this verse, <b>I do not know whether he was created for toil of the mouth, </b> speech, or <b>whether he was created for the toil of labor. When</b> the verse <b>states: “For his mouth presses upon him”</b> (Proverbs 16:26), <b>you must say</b> that <b>he was created for toil of the mouth. And still I do not know</b> with regard to the toil of the mouth <b>whether it is for the toil of Torah or for the toil of conversation. When</b> the verse <b>states: “This Torah scroll shall not depart from your mouth”</b> (Joshua 1:8), <b>you must say</b> that <b>he was created for the toil of Torah. And that is</b> the meaning of <b>what Rava said: All bodies are like receptacles</b> to store items until use. <b>Happy is one who is privileged, who is a receptacle for Torah. </b>"
        },
        {
          "verseLocation": "Joshua 1:11",
          "verseText": "And it is written: “Pass through the midst of the camp and command the people, saying: Prepare your victuals, for within three days you are to cross the Jordan”",
          "talmudLocation": "Kiddushin 38a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/38a#section-6",
          "talmudFullText": "The <i>baraita</i> continues: <b>And it is written: “Pass through the midst of the camp and command the people, saying: Prepare your victuals, for within three days you are to cross the Jordan”</b> (Joshua 1:11). <b>And it is written: “And the people came up out of the Jordan on the 10th day of the first month”</b> (Joshua 4:19). <b>Subtract retroactively from</b> that date, the 10th of Nisan, <b>the last thirty-three days, </b> i.e., the thirty days of mourning for Moses and the three days of preparation before crossing the Jordan, and you <b>learn</b> from here <b>that Moses died on the 7th of Adar. </b>"
        },
        {
          "verseLocation": "Joshua 1:18",
          "verseText": "It is written: “Any man who rebels against your commandment, and will not listen to your words in all that you command him, he shall be put to death”",
          "talmudLocation": "Sanhedrin 49a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/49a#section-6",
          "talmudFullText": "How so? Amasa <b>found</b> the men of Judah <b>starting to</b> study a new <b>tractate. He said</b> to himself: <b>It is written: “Any man who rebels against your commandment, and will not listen to your words in all that you command him, he shall be put to death”</b> (Joshua 1:18), indicating that the king of Israel has unlimited power. Based on these words alone, one <b>might</b> have thought that the king must be obeyed <b>even</b> when that would lead <b>to</b> abstention from the study of <b>the words of Torah. </b> Therefore, that same <b>verse states: “Only [<i>rak</i>] be strong and of a good courage. ”</b> The word “<i>rak</i>” is a restrictive term that serves to limit the king’s authority in a situation where obeying his command will minimalize the study of Torah. Consequently, Amasa was justified when he did not muster the men of Judah at the appointed time, and you had no right to kill him."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Joshua 2:6",
          "verseText": "“She had taken them up to the roof and hidden them under the trees of flax”",
          "talmudLocation": "Berakhot 43b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/43b#section-1",
          "talmudFullText": "<b>Rav Giddel said</b> that <b>Rav said: Over this jasmine [<i>simlak</i>], one recites: Who creates fragrant trees. Rav Ḥananel said</b> that <b>Rav said: Over these spikenards, </b> which grow next to <b>the sea, one recites: Who creates fragrant trees. Mar Zutra said: What is the verse</b> from which we derive that even a plant with soft stalks can be called a tree? From the verse: <b>“She had taken them up to the roof and hidden them under the trees of flax”</b> (Joshua 2:6); evidently, even stalks of flax are called “trees. ”"
        },
        {
          "verseLocation": "Joshua 2:6",
          "verseText": "verse said: “And she had taken them up to the roof and hidden them under the trees of flax”",
          "talmudLocation": "Shabbat 27b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/27b#section-8",
          "talmudFullText": "<strong>Talmud: </strong> The Mishnah mentioned flax as a material that comes from a tree. The Talmud asks: <b>From where do we</b> derive that <b>flax is called a tree? </b> Based on appearance, it does not resemble a tree at all. <b>Mar Zutra said: </b> It is derived from that which the <b>verse said: “And she had taken them up to the roof and hidden them under the trees of flax”</b> (Joshua 2:6)."
        },
        {
          "verseLocation": "Joshua 2:10",
          "verseText": "And even Rahab the prostitute said to Joshua’s messengers: “For we have heard how the Lord dried up the water of the Red Sea before you”",
          "talmudLocation": "Sotah 34a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/34a#section-4",
          "talmudFullText": "<b>And even Rahab the prostitute said to Joshua’s messengers: “For we have heard how YHWH dried up the water of the Red Sea before you”</b> (Joshua 2:10). <b>And it is written: “And as soon as we had heard it, our hearts melted, neither did there remain any more</b> spirit in any man, because of you” (Joshua 2:11). Evidently, the Canaanites were still terrified due to the splitting of the Red Sea, although that had taken place years earlier and in a distant location. It is understood from here how terrified they became when a similar miracle occurred close to where they lived."
        },
        {
          "verseLocation": "Joshua 2:10",
          "verseText": "And even Rahab the prostitute said to Joshua’s messengers: “For we have heard how the Lord dried up the water of the Red Sea",
          "talmudLocation": "Zevachim 116a:26",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/116a#section-26",
          "talmudFullText": "The Talmud offers another explanation of what Yitro heard: <b>R' Eliezer says: He heard</b> about <b>the splitting of the Red Sea and came, as it is stated</b> in a similar context with regard to the splitting of the Jordan in the days of Joshua: <b>“And it came to pass, when all the kings of the Amorites, </b> that were beyond the Jordan westward, and all the kings of the Canaanites, that were by the sea, <b>heard</b> how that YHWH had dried up the waters of the Jordan from before the children of Israel, until they were passed over, that their heart melted, neither was there spirit in them anymore, because of the children of Israel” (Joshua 5:1). <b>And even Rahab the prostitute said to Joshua’s messengers: “For we have heard how YHWH dried up the water of the Red Sea</b> before you” (Joshua 2:10)."
        },
        {
          "verseLocation": "Joshua 2:11",
          "verseText": "And it is written: “And as soon as we had heard it, our hearts melted, neither did there remain any more",
          "talmudLocation": "Sotah 34a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/34a#section-4",
          "talmudFullText": "<b>And even Rahab the prostitute said to Joshua’s messengers: “For we have heard how YHWH dried up the water of the Red Sea before you”</b> (Joshua 2:10). <b>And it is written: “And as soon as we had heard it, our hearts melted, neither did there remain any more</b> spirit in any man, because of you” (Joshua 2:11). Evidently, the Canaanites were still terrified due to the splitting of the Red Sea, although that had taken place years earlier and in a distant location. It is understood from here how terrified they became when a similar miracle occurred close to where they lived."
        },
        {
          "verseLocation": "Joshua 2:11",
          "verseText": "states: “Neither did there remain [ kama ] any more spirit in any man”",
          "talmudLocation": "Zevachim 116a:27",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/116a#section-27",
          "talmudFullText": "The Talmud asks: <b>What is different there, </b> i.e., with regard to the splitting of the Jordan, <b>where</b> the verse <b>states: “Neither was there spirit in them anymore, ” and what is different here, </b> i.e., in the statement of Rahab, <b>where</b> the verse <b>states: “Neither did there remain [<i>kama</i>] any more spirit in any man”</b> (Joshua 2:11)?"
        },
        {
          "verseLocation": "Joshua 2:15",
          "verseText": "from one verse: “Then she let them down by a cord through the window; for her house was upon the side of the wall; and she dwelt upon the wall”",
          "talmudLocation": "Arakhin 32a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/32a#section-9",
          "talmudFullText": "§ The Mishnah teaches: With regard to <b>a house that is built in the wall</b> itself, <b>R' Yehuda says: </b> Its halakhic status <b>is not like</b> that <b>of the houses of walled cities, </b> and R' Shimon says: The outer wall of the house is considered the city wall. <b>R' Yoḥanan says: And both of them derived</b> their opinions <b>from one verse: “Then she let them down by a cord through the window; for her house was upon the side of the wall; and she dwelt upon the wall”</b> (Joshua 2:15). <b>R' Shimon holds</b> that the last phrase should be understood <b>in accordance with the simple meaning of the verse, </b> that her house was attached to the outer wall and it was considered inside the walled city; <b>and R' Yehuda holds</b> that <b>“she dwelt upon the wall”</b> means she was a resident of the wall itself, <b>but not</b> a resident <b>of the city</b> enclosed within the <b>wall. </b>"
        },
        {
          "verseLocation": "Joshua 2:18",
          "verseText": "“This cord of [ tikvat ] scarlet thread”",
          "talmudLocation": "Megillah 14b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-12",
          "talmudFullText": "<b>Rav Eina the Elder raised an objection</b> from a <i>baraita</i> <b>to Rav Naḥman’s</b> teaching. The <i>baraita</i> indicates that Huldah was in fact a descendant of Rahab, and seemingly not of Joshua: <b>Eight prophets, who were</b> also <b>priests, descended from Rahab the prostitute, and they are: Neriah; </b> his son <b>Baruch; Seraiah; Mahseiah; Jeremiah; </b> his father, <b>Hilkiah; </b> Jeremiah’s cousin <b>Hanamel; and</b> Hanamel’s father, <b>Shallum. R' Yehuda said: So too, Huldah the prophetess was a descendant of Rahab the prostitute, </b> as <b>it is written here</b> with regard to Huldah: <b>“The son of Tikvah, ” and it is written elsewhere</b> in reference to Rahab’s escape from the destruction of Jericho: <b>“This cord of [<i>tikvat</i>] scarlet thread”</b> (Joshua 2:18)."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Joshua 3:7",
          "verseText": "and it is written there, with regard to Joshua: “I will begin to magnify you”",
          "talmudLocation": "Avodah Zarah 25a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/25a#section-7",
          "talmudFullText": "<b>It is taught: Just as the sun stood</b> still <b>for Joshua, so</b> too <b>the sun stood</b> still <b>for Moses and for Nakdimon ben Guryon. </b> It is known that it stood still for <b>Joshua</b> from <b>a verse, </b> and it is known that it stood still for <b>Nakdimon ben Guryon</b> by <b>tradition. From where do we</b> derive that it stood still <b>for Moses</b> as well? The Talmud answers: It is <b>derived</b> by means of a verbal analogy between the terms <b>“I will begin”</b> and <b>“I will begin. ”</b> The Talmud elaborates: <b>It is written here, </b> with regard to Moses: <b>“I will begin to deliver the dread of you</b> and the fear of you upon the peoples” (Deuteronomy 2:25), <b>and it is written there, with regard to Joshua: “I will begin to magnify you”</b> (Joshua 3:7)."
        },
        {
          "verseLocation": "Joshua 3:7",
          "verseText": "I will begin to magnify you",
          "talmudLocation": "Taanit 20a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/20a#section-6",
          "talmudFullText": "<b>R' Elazar said: </b> It is <b>derived</b> by verbal analogy between <b>“I will begin”</b> and <b>“I will begin. ” Here, </b> with regard to Moses, <b>it is written: </b> “This day <b>I will begin to put the dread of you</b> and the fear of you upon the peoples that are under all the whole heaven” (Deuteronomy 2:25). <b>And there, </b> with regard to Joshua, <b>it is written: </b> “On this day <b>I will begin to magnify you</b> in the sight of all Israel, that they may know that just as I was with Moses, so I will be with you” (Joshua 3:7). The repeated use of the phrase “I will begin” indicates that all the miracles performed for Joshua were also performed for Moses."
        },
        {
          "verseLocation": "Joshua 3:11",
          "verseText": "traveled in front, as it is stated: “Behold, the Ark of the Covenant of the Lord of all the earth is passing before you”",
          "talmudLocation": "Sotah 33b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/33b#section-11",
          "talmudFullText": "§ <b>A baraita states</b> (<i>Tosefta</i> 8:1): <b>How did the Jewish people cross the Jordan? Every day the Ark would travel behind</b> the <b>two flags</b> of Judah and Reuben, <b>but</b> on <b>that day</b> the Ark <b>traveled in front, as it is stated: “Behold, the Ark of the Covenant of YHWH of all the earth is passing before you”</b> (Joshua 3:11). <b>On every</b> other <b>day, the Levites would carry the Ark, but on this day the priests carried it, as is stated: “And when the soles of the feet of the priests that bear the Ark of YHWH, </b> YHWH of all the earth, <b>shall rest”</b> (Joshua 3:13)."
        },
        {
          "verseLocation": "Joshua 3:13",
          "verseText": "shall rest”",
          "talmudLocation": "Sotah 33b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/33b#section-11",
          "talmudFullText": "§ <b>A baraita states</b> (<i>Tosefta</i> 8:1): <b>How did the Jewish people cross the Jordan? Every day the Ark would travel behind</b> the <b>two flags</b> of Judah and Reuben, <b>but</b> on <b>that day</b> the Ark <b>traveled in front, as it is stated: “Behold, the Ark of the Covenant of YHWH of all the earth is passing before you”</b> (Joshua 3:11). <b>On every</b> other <b>day, the Levites would carry the Ark, but on this day the priests carried it, as is stated: “And when the soles of the feet of the priests that bear the Ark of YHWH, </b> YHWH of all the earth, <b>shall rest”</b> (Joshua 3:13)."
        },
        {
          "verseLocation": "Joshua 3:16",
          "verseText": "came to an end [ tamu ]”",
          "talmudLocation": "Shabbat 98b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/98b#section-2",
          "talmudFullText": "<b>A baraita states: </b> The Tabernacle <b>beams were one cubit thick at the bottom, </b> and <b>they narrowed to a fingerbreadth as they reached the top, as it is stated: </b> “And they shall match at the bottom, and together <b>they will be ended [<i>tamim</i>] at the top</b> toward a single ring; so shall it be for them both, they shall form the two corners” (Exodus 26:24). <b>And below, </b> when the children of Israel crossed the Jordan River, <b>it says: </b> “And those who went down toward the Sea of Arava at the Dead Sea <b>came to an end [<i>tamu</i>]”</b> (Joshua 3:16). <i>Tam</i> means finished or terminated. Here, too, the beams narrowed as they reached the top until they were virtually terminated; this is <b>the statement of R' Yehuda. R' Neḥemya says: Just as they were one cubit thick at the bottom, so too, they were one cubit thick at the top, as it is stated: Together. </b>"
        },
        {
          "verseLocation": "Joshua 3:17",
          "verseText": "the crossings of the Jordan, as it is stated: “The priests who bore the ark of God’s covenant stood on dry land within the Jordan, while all Israel crossed on dry land until the entire nation finished crossing the Jordan”",
          "talmudLocation": "Berakhot 54a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/54a#section-15",
          "talmudFullText": "The Talmud elaborates: <b>Granted, </b> the miracles at <b>the crossings of the sea</b> are recorded explicitly in the Torah, <b>as it is stated: “And the Israelites went into the sea on dry ground</b> and the water was a wall for them on their right and on their left” (Exodus 14:22). So too, the miracle at <b>the crossings of the Jordan, as it is stated: “The priests who bore the ark of God’s covenant stood on dry land within the Jordan, while all Israel crossed on dry land until the entire nation finished crossing the Jordan”</b> (Joshua 3:17)."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Joshua 4:3",
          "verseText": "they were still in the Jordan, Joshua said to them: “Take out of the midst of the Jordan, out of the place where the priests’ feet stood, twelve stones made ready, and carry them over with you, and lay them down in the lodging place, where you shall lodge this night”",
          "talmudLocation": "Sotah 34a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/34a#section-7",
          "talmudFullText": "While <b>they were still in the Jordan, Joshua said to them: “Take out of the midst of the Jordan, out of the place where the priests’ feet stood, twelve stones made ready, and carry them over with you, and lay them down in the lodging place, where you shall lodge this night”</b> (Joshua 4:3). One <b>might</b> have thought that they were required to place these stones <b>at each and every lodging place</b> where they stayed. Therefore, <b>the verse states: “Where you shall lodge this night, ”</b> meaning only on that night."
        },
        {
          "verseLocation": "Joshua 4:3",
          "verseText": "and they arrived and slept in Gilgal, as it is stated: “And carry them over with you, and lay them down in the lodging place,",
          "talmudLocation": "Sotah 36a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/36a#section-6",
          "talmudFullText": "<b>And they sacrificed burnt-offerings and peace-offerings, and they ate and drank and celebrated, and they uttered</b> the <b>blessings, and they uttered</b> the <b>curses, and they took [<i>kippelu</i>] the stones</b> with them, <b>and they arrived and slept in Gilgal, as it is stated: “And carry them over with you, and lay them down in the lodging place, </b> where you shall lodge this night” (Joshua 4:3)."
        },
        {
          "verseLocation": "Joshua 4:5",
          "verseText": "they were still in the Jordan, Joshua said to them: “Pick up every man of you a stone upon his shoulder, according to the number of the tribes of the children of Israel”",
          "talmudLocation": "Sotah 34a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/34a#section-6",
          "talmudFullText": "While <b>they were still in the Jordan, Joshua said to them: “Pick up every man of you a stone upon his shoulder, according to the number of the tribes of the children of Israel”</b> (Joshua 4:5). <b>And it is written: “That this may be a sign among you, that when your children ask in time to come, saying: What do you mean by these stones? ”</b> (Joshua 4:6). This will be <b>a sign for the children that</b> their <b>ancestors crossed the Jordan. </b>"
        },
        {
          "verseLocation": "Joshua 4:6",
          "verseText": "And it is written: “That this may be a sign among you, that when your children ask in time to come, saying: What do you mean by these stones?”",
          "talmudLocation": "Sotah 34a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/34a#section-6",
          "talmudFullText": "While <b>they were still in the Jordan, Joshua said to them: “Pick up every man of you a stone upon his shoulder, according to the number of the tribes of the children of Israel”</b> (Joshua 4:5). <b>And it is written: “That this may be a sign among you, that when your children ask in time to come, saying: What do you mean by these stones? ”</b> (Joshua 4:6). This will be <b>a sign for the children that</b> their <b>ancestors crossed the Jordan. </b>"
        },
        {
          "verseLocation": "Joshua 4:9",
          "verseText": "that Joshua erected in the Jordan, as it is stated: “Joshua also set up twelve stones in the midst of the Jordan,",
          "talmudLocation": "Sotah 35b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35b#section-7",
          "talmudFullText": "<b>And</b> there is <b>one</b> set <b>that Joshua erected in the Jordan, as it is stated: “Joshua also set up twelve stones in the midst of the Jordan, </b> in the place where the feet of the priests that bore the Ark of the Covenant stood, and they are there to this day” (Joshua 4:9). <b>And</b> there is <b>one</b> set <b>that</b> Joshua <b>erected in Gilgal, as it is stated: “And these twelve stones, which they took</b> out of the Jordan, Joshua set up in Gilgal” (Joshua 4:20)."
        },
        {
          "verseLocation": "Joshua 4:11",
          "verseText": "as it is stated: “When all the people were completely passed over, the Ark of the Lord passed on, and the priests, before the people”",
          "talmudLocation": "Sotah 35a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35a#section-15",
          "talmudFullText": "<b>It follows</b> that <b>the Ark and its bearers and the priests</b> were <b>on one side</b> of the Jordan, the east side, <b>and</b> the rest of <b>the Jewish people</b> were <b>on the other side, </b> the west side. Subsequently, <b>the Ark carried its bearers</b> in the air <b>and crossed</b> the Jordan, <b>as it is stated: “When all the people were completely passed over, the Ark of YHWH passed on, and the priests, before the people”</b> (Joshua 4:11)."
        },
        {
          "verseLocation": "Joshua 4:18",
          "verseText": "And once the last one of the Jewish people ascended out of the Jordan, the water returned to its place, as it is stated: “And it came to pass, as the priests that bore the Ark of the Covenant of the Lord came up out of the midst of the Jordan, as soon as the soles of the priests’ feet were drawn up unto the dry ground, that the waters of the Jordan returned to their place, and went over all its banks, as it had before”",
          "talmudLocation": "Sotah 35a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35a#section-14",
          "talmudFullText": "§ The Talmud returns to discuss the entry of the Jewish people into Eretz Yisrael. <b>And once the last one of the Jewish people ascended out of the Jordan, the water returned to its place, as it is stated: “And it came to pass, as the priests that bore the Ark of the Covenant of YHWH came up out of the midst of the Jordan, as soon as the soles of the priests’ feet were drawn up unto the dry ground, that the waters of the Jordan returned to their place, and went over all its banks, as it had before”</b> (Joshua 4:18). The Talmud understands that the priests who carried the Ark stood in the water until all of the Jewish people passed through the Jordan. Once all the Jewish people had reached the other side of the Jordan, the priests stepped back from the water and the Jordan returned to its natural state."
        },
        {
          "verseLocation": "Joshua 4:19",
          "verseText": "And it is written: “And the people came up out of the Jordan on the tenth day of the first month”",
          "talmudLocation": "Kiddushin 38a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/38a#section-6",
          "talmudFullText": "The <i>baraita</i> continues: <b>And it is written: “Pass through the midst of the camp and command the people, saying: Prepare your victuals, for within three days you are to cross the Jordan”</b> (Joshua 1:11). <b>And it is written: “And the people came up out of the Jordan on the 10th day of the first month”</b> (Joshua 4:19). <b>Subtract retroactively from</b> that date, the 10th of Nisan, <b>the last thirty-three days, </b> i.e., the thirty days of mourning for Moses and the three days of preparation before crossing the Jordan, and you <b>learn</b> from here <b>that Moses died on the 7th of Adar. </b>"
        },
        {
          "verseLocation": "Joshua 4:19",
          "verseText": "month”",
          "talmudLocation": "Rosh Hashanah 13a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/13a#section-12",
          "talmudFullText": "The Talmud answers: <b>It should not enter your mind</b> to say this, <b>as it is written: “And the people came up from the Jordan on the 10th day of the</b> first <b>month”</b> (Joshua 4:19). <b>And if</b> it <b>enters your mind</b> to say <b>that</b> the grain <b>had not grown at all</b> before the Jewish people entered the land, <b>could it have reached full growth in</b> just <b>five days? </b>"
        },
        {
          "verseLocation": "Joshua 4:19",
          "verseText": "sprinkling when they were uncircumcised, as it is stated: “And the people came up out of the Jordan on the tenth day of the first month”",
          "talmudLocation": "Yevamot 71b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/71b#section-10",
          "talmudFullText": "§ <b>R' Yoḥanan said in the name of R' Bena’a: An uncircumcised</b> man <b>may receive</b> the <b>sprinkling</b> of the water mixed with the ashes of a red heifer in order to purify himself from ritual impurity imparted by a human corpse, as we do not say that this sprinkling is ineffective as long as he is uncircumcised. <b>As we found that our forefathers received</b> the <b>sprinkling when they were uncircumcised, as it is stated: “And the people came up out of the Jordan on the 10th day of the first month”</b> (Joshua 4:19), and the verses go on to relate that the men were all later circumcised before sacrificing the Paschal lamb on the fourteenth (see Joshua 5:10)."
        },
        {
          "verseLocation": "Joshua 4:20",
          "verseText": "erected in Gilgal, as it is stated: “And these twelve stones, which they took",
          "talmudLocation": "Sotah 35b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35b#section-7",
          "talmudFullText": "<b>And</b> there is <b>one</b> set <b>that Joshua erected in the Jordan, as it is stated: “Joshua also set up twelve stones in the midst of the Jordan, </b> in the place where the feet of the priests that bore the Ark of the Covenant stood, and they are there to this day” (Joshua 4:9). <b>And</b> there is <b>one</b> set <b>that</b> Joshua <b>erected in Gilgal, as it is stated: “And these twelve stones, which they took</b> out of the Jordan, Joshua set up in Gilgal” (Joshua 4:20)."
        },
        {
          "verseLocation": "Joshua 4:20",
          "verseText": "And it is written: “And those twelve stones, which they took",
          "talmudLocation": "Sotah 36a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/36a#section-7",
          "talmudFullText": "One <b>might</b> have thought that they were required to place these stones <b>at each and every lodging place</b> where they stayed. Therefore, <b>the verse states: “Where you shall lodge this night, ”</b> meaning only on that night. <b>And it is written: “And those twelve stones, which they took</b> out of the Jordan, Joshua set up in Gilgal” (Joshua 4:20)."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Joshua 5:1",
          "verseText": "more than three hundred mil , until all the kings of the East and West saw it, as it is stated: “And it came to pass, when all the kings of the Amorites, that were beyond the Jordan westward, and all the kings of the Canaanites, that were by the sea, heard that the Lord had dried up the waters of the Jordan from before the children of Israel, until they were passed over, that their heart melted, neither was there spirit in them anymore, because of the children of Israel”",
          "talmudLocation": "Sotah 34a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/34a#section-3",
          "talmudFullText": "<b>Rather, </b> this <b>teaches that the water gathered and rose in heaps upon heaps</b> to a height of <b>more than three hundred <i>mil</i>, until all the kings of the East and West saw it, as it is stated: “And it came to pass, when all the kings of the Amorites, that were beyond the Jordan westward, and all the kings of the Canaanites, that were by the sea, heard that YHWH had dried up the waters of the Jordan from before the children of Israel, until they were passed over, that their heart melted, neither was there spirit in them anymore, because of the children of Israel”</b> (Joshua 5:1)."
        },
        {
          "verseLocation": "Joshua 5:1",
          "verseText": "heard",
          "talmudLocation": "Zevachim 116a:26",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/116a#section-26",
          "talmudFullText": "The Talmud offers another explanation of what Yitro heard: <b>R' Eliezer says: He heard</b> about <b>the splitting of the Red Sea and came, as it is stated</b> in a similar context with regard to the splitting of the Jordan in the days of Joshua: <b>“And it came to pass, when all the kings of the Amorites, </b> that were beyond the Jordan westward, and all the kings of the Canaanites, that were by the sea, <b>heard</b> how that YHWH had dried up the waters of the Jordan from before the children of Israel, until they were passed over, that their heart melted, neither was there spirit in them anymore, because of the children of Israel” (Joshua 5:1). <b>And even Rahab the prostitute said to Joshua’s messengers: “For we have heard how YHWH dried up the water of the Red Sea</b> before you” (Joshua 2:10)."
        },
        {
          "verseLocation": "Joshua 5:2",
          "verseText": "As it is stated: “At that time the Lord said to Joshua: Make yourself knives of flint,",
          "talmudLocation": "Yevamot 71b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/71b#section-14",
          "talmudFullText": "<b>Rabba bar Yitzḥak said</b> that <b>Rav said: The</b> mitzva of <b>uncovering</b> the corona during <b>circumcision was not given to our Patriarch Abraham. </b> The command given to Avraham included only the mitzva of circumcision itself, i.e., the removal of the foreskin, but not the uncovering of the corona, i.e., the folding back of the thin membrane that lies under the foreskin. <b>As it is stated: “At that time YHWH said to Joshua: Make yourself knives of flint, </b> and circumcise again the children of Israel a second time” (Joshua 5:2). Why was it necessary to circumcise them? Apparently, it is because before the Torah was given on Mount Sinai, some of them had been circumcised in the manner of Abraham, without uncovering the corona, and therefore they needed to be circumcised a second time in accordance with the Torah law that requires uncovering the corona."
        },
        {
          "verseLocation": "Joshua 5:5",
          "verseText": "was circumcised”",
          "talmudLocation": "Keritot 9a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/9a#section-8",
          "talmudFullText": "The Talmud returns to the main part of R' Yehuda HaNasi’s statement. <b>The Master said: Just as your ancestors entered the covenant only</b> through circumcision, immersion in a ritual bath, and the sprinkling of blood, converts must do the same. The Talmud objects: <b>Granted, </b> they underwent <b>circumcision</b> prior to entering the covenant, <b>as it is written: “For all the nation that left</b> Egypt <b>was circumcised”</b> (Joshua 5:5). <b>Alternatively, </b> it may be derived <b>from here, </b> a verse describing the redemption from Egypt: <b>“And when I passed by you, and saw you wallowing in your blood, I said unto you: In your blood, live; </b> and I said unto you: In your blood, live” (Ezekiel 16:6). The rabbis interpret the double mention of blood in this verse as referring to the blood of the Paschal offering and the blood of circumcision."
        },
        {
          "verseLocation": "Joshua 5:5",
          "verseText": "those who had not been circumcised at all, as it is written: “For all the people who came out were circumcised; but all the people who were born",
          "talmudLocation": "Yevamot 71b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/71b#section-15",
          "talmudFullText": "The Talmud asks: How may it be inferred that those who were already circumcised required a second circumcision? <b>Perhaps</b> the verse is referring to <b>those who had not been circumcised at all, as it is written: “For all the people who came out were circumcised; but all the people who were born</b> in the wilderness…had not been circumcised” (Joshua 5:5)?"
        },
        {
          "verseLocation": "Joshua 5:10",
          "verseText": "This cannot enter your mind, as it is written: “And they kept the Passover”",
          "talmudLocation": "Yevamot 71b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/71b#section-12",
          "talmudFullText": "The Talmud counters: <b>But perhaps they did not sacrifice</b> the <b>Paschal lamb at all. </b> The Talmud answers: <b>This cannot enter your mind, as it is written: “And they kept the Passover”</b> (Joshua 5:10), meaning they brought the Paschal lamb."
        },
        {
          "verseLocation": "Joshua 5:10",
          "verseText": "they kept the Passover",
          "talmudLocation": "Zevachim 118a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/118a#section-7",
          "talmudFullText": "§ <b>The Master said</b> in the <i>baraita</i>: <b>R' Shimon says</b> that even the public did not sacrifice all offerings in the Tent of Meeting in Gilgal; they sacrificed only Paschal offerings and compulsory public offerings that have a set time. The Talmud asks: <b>What is the reason</b> for the opinion <b>of R' Shimon? As it is written: “And the children of Israel</b> encamped <b>in Gilgal; </b> and <b>they kept the Passover</b> on the fourteenth day of the month at evening in the plains of Jericho” (Joshua 5:10)."
        },
        {
          "verseLocation": "Joshua 5:11",
          "verseText": "“And they ate the produce of the land on the morrow after the Passover”",
          "talmudLocation": "Kiddushin 37b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/37b#section-14",
          "talmudFullText": "The Talmud asks about the term dwelling, written in connection to the prohibition of the new crop. <b>Granted, according to the one who says</b> that the term <b>dwelling indicates wherever you dwell, this</b> explains the fact <b>that it is written</b> with regard to the Jewish people immediately after they entered Eretz Yisrael: <b>“And they ate the produce of the land on the morrow after the Passover”</b> (Joshua 5:11). This means that <b>on the day after the Passover</b> they <b>ate</b> the produce of Eretz Yisrael, but <b>initially, </b> before that date, they <b>did not eat</b> it. <b>Apparently, </b>"
        },
        {
          "verseLocation": "Joshua 5:11",
          "verseText": "as it is written: “And they did eat of the produce of the land on the next day after Passover”",
          "talmudLocation": "Rosh Hashanah 13a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/13a#section-8",
          "talmudFullText": "The Talmud first questions the assumption of Rav Kahana’s colleagues: <b>From where</b> is it known <b>that</b> the Jewish people actually <b>brought</b> an <i>omer</i> offering that year? <b>Perhaps they did not offer</b> it at all. The Talmud rejects this argument: <b>It should not enter your mind</b> to say this, <b>as it is written: “And they did eat of the produce of the land on the next day after Passover”</b> (Joshua 5:11), which teaches: Only <b>on the next day after Passover did they eat</b> from the new grain, but <b>initially they did not eat</b> from it. Why? It is <b>because they</b> first <b>brought the <i>omer</i></b> offering on the sixteenth of Nisan as is required, <b>and</b> only <b>afterward did they eat</b> from the new grain. Therefore the question remains: <b>From where did they bring</b> the <i>omer</i> offering?"
        },
        {
          "verseLocation": "Joshua 5:13",
          "verseText": "As it is stated: “And it came to pass when Joshua was by Jericho that he lifted up his eyes and looked,",
          "talmudLocation": "Eruvin 63b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/63b#section-3",
          "talmudFullText": "<b>As it is stated: “And it came to pass when Joshua was by Jericho that he lifted up his eyes and looked, </b> and, behold, a man stood over against him with his sword drawn in his hand” (Joshua 5:13), <b>and it is written</b> further: <b>“And he said: No, but I am captain of the host of YHWH, I am now come”</b> (Joshua 5:14). The man, an angel, came to demand something of Joshua and to rebuke him."
        },
        {
          "verseLocation": "Joshua 5:13",
          "verseText": "“And it came to pass, when Joshua was by Jericho”",
          "talmudLocation": "Megillah 10b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-6",
          "talmudFullText": "<b>“And it came to pass [<i>vayhi</i>] as they journeyed from the east”</b> (Genesis 11:2) is followed by: <b>“Come, let us build us a city”</b> (Genesis 11:4), which led to the sin of the Tower of Babel. The Talmud cites further examples: <b>“And it came to pass in the days of Amraphel”</b> (Genesis 14:1), about whom it is stated: <b>“These made war”</b> (Genesis 14:2). Another verse states: <b>“And it came to pass, when Joshua was by Jericho”</b> (Joshua 5:13), it was there that he saw an angel <b>“with his sword drawn in his hand”</b> as a warning. It is written: <b>“And YHWH was [<i>vayhi</i>] with Joshua”</b> (Joshua 6:27), and immediately afterward: <b>“But the children of Israel committed a trespass”</b> (Joshua 7:1). It states: <b>“And it came to pass that there was a certain man of Ramathaim”</b> (I Samuel 1:1), and it mentions shortly afterward Hannah’s inability to conceive: <b>“For he loved Hannah, but YHWH had closed up her womb”</b> (I Samuel 1:5)."
        },
        {
          "verseLocation": "Joshua 5:13",
          "verseText": "as the verse states: “And it came to pass when Joshua was in Jericho,",
          "talmudLocation": "Nedarim 56b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/56b#section-7",
          "talmudFullText": "<strong>Talmud: </strong> The Talmud asks: <b>From where do we</b> derive <b>that the</b> legal status of <b>the outskirts of a city are like that of the city</b> itself? <b>R' Yoḥanan said</b> that it is <b>as the verse states: “And it came to pass when Joshua was in Jericho, </b> that he lifted up his eyes and looked” (Joshua 5:13). <b>What</b> is the meaning of <b>“in Jericho”? If we say</b> that it means <b>in Jericho proper, isn’t it written: “And Jericho was completely shut”</b> (Joshua 6:1)? <b>Rather, learn from here</b> that Joshua was <b>in the outskirts</b> of the city. And although he was in the outskirts, the verse states that he was in Jericho."
        },
        {
          "verseLocation": "Joshua 5:14",
          "verseText": "“And he said: No, but I am captain of the host of the Lord, I am now come”",
          "talmudLocation": "Eruvin 63b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/63b#section-3",
          "talmudFullText": "<b>As it is stated: “And it came to pass when Joshua was by Jericho that he lifted up his eyes and looked, </b> and, behold, a man stood over against him with his sword drawn in his hand” (Joshua 5:13), <b>and it is written</b> further: <b>“And he said: No, but I am captain of the host of YHWH, I am now come”</b> (Joshua 5:14). The man, an angel, came to demand something of Joshua and to rebuke him."
        },
        {
          "verseLocation": "Joshua 5:14",
          "verseText": "And Rav Shmuel bar Unya said: Torah study is greater than sacrificing the daily offerings, as it is stated: “I have come now”",
          "talmudLocation": "Megillah 3b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/3b#section-1",
          "talmudFullText": "This <b>teaches that he spent the night in the depths</b> [<b><i>be’umeka</i></b>] <b>of <i>halakha</i>, </b> i.e., that he spent the night studying Torah with the Jewish people. <b>And Rav Shmuel bar Unya said: Torah study is greater than sacrificing the daily offerings, as it is stated: “I have come now”</b> (Joshua 5:14), indicating that the angel came to rebuke Joshua for neglecting Torah study and not for neglecting the daily offering. Consequently, how did the rabbis of the house of R' Yehuda HaNasi determine that the Temple service is more important than Torah study?"
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "Joshua 6:1",
          "verseText": "in Jericho proper, isn’t it written: “And Jericho was completely shut”",
          "talmudLocation": "Nedarim 56b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/56b#section-7",
          "talmudFullText": "<strong>Talmud: </strong> The Talmud asks: <b>From where do we</b> derive <b>that the</b> legal status of <b>the outskirts of a city are like that of the city</b> itself? <b>R' Yoḥanan said</b> that it is <b>as the verse states: “And it came to pass when Joshua was in Jericho, </b> that he lifted up his eyes and looked” (Joshua 5:13). <b>What</b> is the meaning of <b>“in Jericho”? If we say</b> that it means <b>in Jericho proper, isn’t it written: “And Jericho was completely shut”</b> (Joshua 6:1)? <b>Rather, learn from here</b> that Joshua was <b>in the outskirts</b> of the city. And although he was in the outskirts, the verse states that he was in Jericho."
        },
        {
          "verseLocation": "Joshua 6:5",
          "verseText": "that when they sound a long blast with the horn [ keren ] of a ram [ yovel ]”",
          "talmudLocation": "Rosh Hashanah 26a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/26a#section-3",
          "talmudFullText": "<strong>Mishnah: </strong> The Mishnah begins to discuss the primary mitzva of Rosh HaShana, sounding the <i>shofar</i>. <b>All <i>shofarot</i> are fit</b> for blowing <b>except for</b> the horn <b>of a cow, because it is a horn [<i>keren</i>]</b> and not a <i>shofar</i>. <b>R' Yosei said: But aren’t all <i>shofarot</i> called horn, as it is stated: </b> “And it shall come to pass, <b>that when they sound a long blast with the horn [<i>keren</i>] of a ram [<i>yovel</i>]”</b> (Joshua 6:5), and a ram’s horn is a <i>shofar</i> fit for sounding on Rosh HaShana?"
        },
        {
          "verseLocation": "Joshua 6:6",
          "verseText": "crossed the Jordan, and when they surrounded Jericho",
          "talmudLocation": "Sotah 33b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/33b#section-12",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> (<i>Tosefta</i> 8:2) that <b>R' Yosei says: In three</b> different <b>places the priests carried the Ark. </b> They carried it <b>when</b> the Jewish people <b>crossed the Jordan, and when they surrounded Jericho</b> (Joshua 6:6), <b>and when they returned it to its</b> proper <b>place</b> in the Holy of Holies during the reign of King Solomon (I Kings 8:6)."
        },
        {
          "verseLocation": "Joshua 6:17",
          "verseText": "as it is written: “And the city shall be a curse [ ḥerem ]”",
          "talmudLocation": "Moed Katan 17a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/17a#section-23",
          "talmudFullText": "The following allusion is offered in support of the opinion of Reish Lakish: <b>When it enters, </b> it enters all the organs, <b>as it is written: “And the city shall be a curse [<i>ḥerem</i>]”</b> (Joshua 6:17), <b>and the numerical value [<i>gimatriyya</i>]</b> of the word <b><i>ḥerem</i>, </b> a concept similar to ostracism, <b>is two hundred and forty-eight. </b> Therefore, the verse alludes to the fact that a decree of ostracism penetrates one’s two hundred and forty-eight organs. <b>When it leaves, </b> it leaves all the organs, <b>as it is written: “In wrath remember mercy [<i>raḥem</i>]”</b> (Habakkuk 3:2), <b>and the numerical value</b> of the word <b><i>raḥem</i> is also</b> two hundred and forty-eight, thereby teaching that when the decree of ostracism is revoked, it disappears entirely."
        },
        {
          "verseLocation": "Joshua 6:20",
          "verseText": "Didn’t they fall, as it is stated: “And it came to pass, when the people heard the sound of the shofar , that the people shouted with a great shout, and the wall fell down flat”",
          "talmudLocation": "Berakhot 54b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/54b#section-11",
          "talmudFullText": "The <i>baraita</i> also taught that we recite a blessing for <b>the wall of Jericho that was swallowed</b> up in its place. The Talmud asks: <b>Were the walls of Jericho swallowed up</b> into the ground? <b>Didn’t they fall, as it is stated: “And it came to pass, when the people heard the sound of the <i>shofar</i>, that the people shouted with a great shout, and the wall fell down flat”</b> (Joshua 6:20)? The Talmud explains: <b>Since the width and height</b> of the walls <b>were equal to one another, therefore, they were swallowed. </b> Had they merely fallen it would have had no effect, as their width was equal to their height."
        },
        {
          "verseLocation": "Joshua 6:20",
          "verseText": "And the wall of Jericho that was swallowed, as it is written: “And the wall fell down flat”",
          "talmudLocation": "Berakhot 54b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/54b#section-8",
          "talmudFullText": "<b>And</b> one must recite a blessing upon seeing <b>Lot’s wife, as it is stated: “But his wife looked back from behind him, and she became a pillar of salt”</b> (Genesis 19:26). <b>And the wall of Jericho that was swallowed, as it is written: “And the wall fell down flat”</b> (Joshua 6:20)."
        },
        {
          "verseLocation": "Joshua 6:26",
          "verseText": "oath within it, as it is written: “And Joshua administered an oath at that time saying: Arur be the man before God",
          "talmudLocation": "Shevuot 36a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/36a#section-6",
          "talmudFullText": "There is an element of <b>oath within it, as it is written: “And Joshua administered an oath at that time saying: <i>Arur</i> be the man before God</b> who shall arise and rebuild this city, Jericho” (Joshua 6:26). The Talmud challenges: <b>But perhaps</b> Joshua <b>performed two</b> actions <b>to</b> the people; <b>he administered an oath to them and he cursed them, </b> and the term <i>arur</i> relates to the curse, not to the oath."
        },
        {
          "verseLocation": "Joshua 6:27",
          "verseText": "“And the Lord was [ vayhi ] with Joshua”",
          "talmudLocation": "Megillah 10b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-6",
          "talmudFullText": "<b>“And it came to pass [<i>vayhi</i>] as they journeyed from the east”</b> (Genesis 11:2) is followed by: <b>“Come, let us build us a city”</b> (Genesis 11:4), which led to the sin of the Tower of Babel. The Talmud cites further examples: <b>“And it came to pass in the days of Amraphel”</b> (Genesis 14:1), about whom it is stated: <b>“These made war”</b> (Genesis 14:2). Another verse states: <b>“And it came to pass, when Joshua was by Jericho”</b> (Joshua 5:13), it was there that he saw an angel <b>“with his sword drawn in his hand”</b> as a warning. It is written: <b>“And YHWH was [<i>vayhi</i>] with Joshua”</b> (Joshua 6:27), and immediately afterward: <b>“But the children of Israel committed a trespass”</b> (Joshua 7:1). It states: <b>“And it came to pass that there was a certain man of Ramathaim”</b> (I Samuel 1:1), and it mentions shortly afterward Hannah’s inability to conceive: <b>“For he loved Hannah, but YHWH had closed up her womb”</b> (I Samuel 1:5)."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Joshua 7:1",
          "verseText": "“But the children of Israel committed a trespass”",
          "talmudLocation": "Megillah 10b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-6",
          "talmudFullText": "<b>“And it came to pass [<i>vayhi</i>] as they journeyed from the east”</b> (Genesis 11:2) is followed by: <b>“Come, let us build us a city”</b> (Genesis 11:4), which led to the sin of the Tower of Babel. The Talmud cites further examples: <b>“And it came to pass in the days of Amraphel”</b> (Genesis 14:1), about whom it is stated: <b>“These made war”</b> (Genesis 14:2). Another verse states: <b>“And it came to pass, when Joshua was by Jericho”</b> (Joshua 5:13), it was there that he saw an angel <b>“with his sword drawn in his hand”</b> as a warning. It is written: <b>“And YHWH was [<i>vayhi</i>] with Joshua”</b> (Joshua 6:27), and immediately afterward: <b>“But the children of Israel committed a trespass”</b> (Joshua 7:1). It states: <b>“And it came to pass that there was a certain man of Ramathaim”</b> (I Samuel 1:1), and it mentions shortly afterward Hannah’s inability to conceive: <b>“For he loved Hannah, but YHWH had closed up her womb”</b> (I Samuel 1:5)."
        },
        {
          "verseLocation": "Joshua 7:5",
          "verseText": "Yair, son of Manasseh, and Machir, son of Manasseh, were born in the days of Jacob, and they did not die until the Jewish people entered Eretz Yisrael, as it is stated: “And the men of Ai killed of them about thirty-six men”",
          "talmudLocation": "Bava Batra 121b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/121b#section-9",
          "talmudFullText": "The Talmud asks: <b>And</b> is it true that <b>no</b> one <b>from the other tribes entered</b> Eretz Yisrael? <b>But isn’t it taught</b> in a <i>baraita</i>: <b>Yair, son of Manasseh, and Machir, son of Manasseh, were born in the days of Jacob, and they did not die until the Jewish people entered Eretz Yisrael, as it is stated: “And the men of Ai killed of them about thirty-six men”</b> (Joshua 7:5). <b>And</b> concerning this verse, <b>it is taught: Literally thirty-six</b> people were killed, this is <b>the statement of R' Yehuda. </b>"
        },
        {
          "verseLocation": "Joshua 7:5",
          "verseText": "the majority of the Sanhedrin were killed? As it is written: “And the men of Ai smote of them about thirty-six men”",
          "talmudLocation": "Sanhedrin 44a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44a#section-12",
          "talmudFullText": "With regard to the spoils that Achan took for himself, the verse states: <b>“And they laid them out before YHWH”</b> (Joshua 7:23). <b>Rav Naḥman says: </b> Joshua <b>came and cast down</b> the spoils <b>before God. </b> Joshua <b>said to Him: God!, </b> was it <b>because of these</b> small items that <b>the majority of the Sanhedrin were killed? As it is written: “And the men of Ai smote of them about thirty-six men”</b> (Joshua 7:5), <b>and it is taught</b> in a <i>baraita</i>: <b>Thirty-six</b> men, <b>literally, </b> were killed; this is <b>the statement of R' Yehuda. R' Neḥemya said to</b> R' Yehuda: <b>But were they</b> precisely <b>thirty-six</b> men? <b>Didn’t it state only: “About thirty-six men”? Rather, this is</b> a reference to <b>Yair, son of Manasseh, </b> who was killed, and <b>who was</b> himself <b>equivalent</b> in importance <b>to the majority of the Sanhedrin, </b> i.e., thirty-six men."
        },
        {
          "verseLocation": "Joshua 7:7",
          "verseText": "“Why have You brought this people over the Jordan”",
          "talmudLocation": "Sanhedrin 44a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44a#section-15",
          "talmudFullText": "<b>Rather, </b> Joshua’s belligerence is seen <b>from this</b> verse: <b>“Why have You brought this people over the Jordan”</b> (Joshua 7:7), as if he were complaining about God’s treatment of Israel. This too is difficult, as <b>Moses also said</b> a similar statement: <b>“Why have You dealt ill with this people? </b> Why is it that You have sent me? ” (Exodus 5:22). <b>Rather, </b> Joshua’s belligerence is seen <b>from here, </b> from the continuation of the previously cited verse in Joshua: <b>“Would that we had been content and had remained in the Transjordan”</b> (Joshua 7:7)."
        },
        {
          "verseLocation": "Joshua 7:10",
          "verseText": "as it is written: “And the Lord said to Joshua: Get up;",
          "talmudLocation": "Megillah 22b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/22b#section-15",
          "talmudFullText": "<b>And if you wish, say</b> a different reason as to why Rav did not fall on his face: <b>An important person is different, in accordance with</b> the opinion of <b>R' Elazar, as R' Elazar said: An important person is not permitted to fall on his face</b> in public <b>unless</b> he knows that <b>he will be answered like Joshua bin Nun</b> in his time, <b>as it is written: “And YHWH said to Joshua: Get up; </b> why do you lie upon your face? ” (Joshua 7:10). It is a disgrace for a distinguished person to fall on his face and have his prayers unanswered. Consequently, Rav did not prostrate himself in public."
        },
        {
          "verseLocation": "Joshua 7:10",
          "verseText": "“And the Lord said to Joshua: Get you up;",
          "talmudLocation": "Sanhedrin 44a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44a#section-16",
          "talmudFullText": "§ With regard to the verse that states: <b>“And YHWH said to Joshua: Get you up; </b> why do you lie this way on your face? ” (Joshua 7:10), <b>R' Sheila taught</b> in a public lecture: <b>God said to</b> Joshua: <b>Your</b> own sin <b>is</b> even <b>worse than</b> that of the other Jews who sinned, as <b>I said</b> to the Jewish people: <b>“And it shall be when you have gone over the Jordan, that you shall set up</b> these stones” (Deuteronomy 27:4), <b>and you have</b> already <b>distanced yourselves sixty <i>mil</i></b> from the Jordan River, and you have yet to fulfill the mitzva."
        },
        {
          "verseLocation": "Joshua 7:10",
          "verseText": "will be answered like Joshua, son of Nun, as it is stated: “And the Lord said to Joshua, Get you up, why are you fallen upon your face?”",
          "talmudLocation": "Taanit 14b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/14b#section-11",
          "talmudFullText": "<b>R' Elazar said: An important person is permitted to fall on his face</b> and humiliate himself in front of the community <b>only if he</b> is certain that he <b>will be answered like Joshua, son of Nun, as it is stated: “And YHWH said to Joshua, Get you up, why are you fallen upon your face? ”</b> (Joshua 7:10). One who is not absolutely certain that he will be answered may not fall on his face in public, as if he is unanswered he will become an object of derision."
        },
        {
          "verseLocation": "Joshua 7:11",
          "verseText": "When the Holy One, Blessed be He, said to Joshua: “Israel has sinned”",
          "talmudLocation": "Sanhedrin 43b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/43b#section-6",
          "talmudFullText": "The <i>baraita</i> explains: <b>When God said to Joshua: “Israel has sinned”</b> (Joshua 7:11), Joshua <b>said to Him: God!, who</b> is the one who has <b>sinned? </b> God <b>said to him: Am I an informer [<i>deilator</i>]? Go cast lots</b> and find out for yourself. Joshua then <b>went and cast lots, and the lot fell upon Achan. </b> Achan <b>said to him: Joshua, do you come to</b> execute <b>me</b> merely <b>based on a lot, </b> without any corroborating evidence? <b>You and Elazar the priest are the two</b> most <b>distinguished</b> leaders <b>of the generation, </b> but <b>if I cast a lot upon</b> the two of <b>you, it will</b> perforce <b>fall upon one of you. </b> What then can you prove from a lottery? Joshua <b>said to him: I ask of you, do not spread slander about the lots, as Eretz Yisrael will</b> one day <b>be divided by lots, as it is stated: “Nevertheless, the land shall be divided by lot”</b> (Numbers 26:55). Due to you the results of that lottery may be challenged. Therefore, Joshua used the word “<i>na</i>,” pleading with Achan to confess."
        },
        {
          "verseLocation": "Joshua 7:11",
          "verseText": "“Israel has sinned”",
          "talmudLocation": "Sanhedrin 44a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44a#section-2",
          "talmudFullText": "§ When God explained to Joshua the reason for the Jewish people’s defeat at the city of Ai, He said: <b>“Israel has sinned”</b> (Joshua 7:11). <b>R' Abba bar Zavda says: </b> From here it may be inferred that <b>even when</b> the Jewish people <b>have sinned, they are</b> still called <b>“Israel. ” R' Abba says: This</b> is in accordance with the adage <b>that people say: </b> Even when <b>a myrtle is found among thorns, its name is myrtle and</b> people <b>call it myrtle. </b>"
        },
        {
          "verseLocation": "Joshua 7:15",
          "verseText": "“And because he has committed a wanton deed in Israel”",
          "talmudLocation": "Sanhedrin 44a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44a#section-6",
          "talmudFullText": "With regard to Achan, the verse states: <b>“And because he has committed a wanton deed in Israel”</b> (Joshua 7:15). <b>R' Abba bar Zavda says: </b> This <b>teaches that</b> Achan <b>had sex with a betrothed young woman. </b> This offense is also alluded to by the wording of the verse. <b>Here, </b> with regard to Achan, <b>it is written: “And because he has committed a wanton deed, ” and there, </b> with regard to a betrothed young woman who committed adultery, <b>it is written: “Because she has committed a wanton deed in Israel, </b> to play the harlot in her father’s house” (Deuteronomy 22:21)."
        },
        {
          "verseLocation": "Joshua 7:19",
          "verseText": "has a portion in the World-to-Come. For so we find with regard to Achan, that Joshua said to him: “My son, please give glory to the Lord, God of Israel, and make confession to Him”",
          "talmudLocation": "Sanhedrin 43b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/43b#section-3",
          "talmudFullText": "<strong>Mishnah: </strong> <b>When</b> the condemned man <b>is at a distance of about ten cubits from the place of stoning, they say to him: Confess</b> your transgressions, <b>as the way of all who are being executed is to confess. As whoever confesses</b> and regrets his transgressions <b>has a portion in the World-to-Come. For so we find with regard to Achan, that Joshua said to him: “My son, please give glory to YHWH, God of Israel, and make confession to Him”</b> (Joshua 7:19). And the next verse states: <b>“And Achan answered Joshua, and said: Indeed I have sinned against YHWH, God of Israel, and like this and like that</b> have I done. ” <b>And from where</b> is it derived <b>that</b> Achan’s <b>confession achieved atonement for him? </b> It is derived from here, <b>as it is stated: “And Joshua said: Why have you brought trouble on us? YHWH shall trouble you this day”</b> (Joshua 7:25). Joshua said to Achan as follows: <b>On this day</b> of your judgment <b>you are troubled, but you will not be troubled in the World-to-Come. </b>"
        },
        {
          "verseLocation": "Joshua 7:20",
          "verseText": "“And Achan answered Joshua, and said: Indeed I have sinned against the Lord, God of Israel, and like this and like that have I done”",
          "talmudLocation": "Sanhedrin 43b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/43b#section-7",
          "talmudFullText": "Joshua said to Achan: “Please give glory to YHWH, God of Israel, and <b>make confession</b> to Him. ” <b>Ravina says: </b> Joshua <b>won over</b> Achan <b>with</b> his <b>words, </b> saying: <b>Do we ask anything of you but a confession? Make confession to Him and be discharged. </b> Thinking that if he confessed, he would be pardoned, Achan <b>immediately</b> responded: <b>“And Achan answered Joshua, and said: Indeed I have sinned against YHWH, God of Israel, and like this and like that have I done”</b> (Joshua 7:20)."
        },
        {
          "verseLocation": "Joshua 7:21",
          "verseText": "“And I saw among the spoil a fine mantle of Shinar, and two hundred shekels of silver”",
          "talmudLocation": "Sanhedrin 44a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44a#section-11",
          "talmudFullText": "§ In his confession, Achan states: <b>“And I saw among the spoil a fine mantle of Shinar, and two hundred shekels of silver”</b> (Joshua 7:21). <b>Rav says: </b> A mantle of Shinar is <b>a cloak [<i>itztela</i>] of</b> choice <b>wool [<i>demeilta</i>], and Shmuel says: </b> It is <b>a garment [<i>sarbela</i>] dyed with alum. </b>"
        },
        {
          "verseLocation": "Joshua 7:23",
          "verseText": "“And they laid them out before the Lord”",
          "talmudLocation": "Sanhedrin 44a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44a#section-12",
          "talmudFullText": "With regard to the spoils that Achan took for himself, the verse states: <b>“And they laid them out before YHWH”</b> (Joshua 7:23). <b>Rav Naḥman says: </b> Joshua <b>came and cast down</b> the spoils <b>before God. </b> Joshua <b>said to Him: God!, </b> was it <b>because of these</b> small items that <b>the majority of the Sanhedrin were killed? As it is written: “And the men of Ai smote of them about thirty-six men”</b> (Joshua 7:5), <b>and it is taught</b> in a <i>baraita</i>: <b>Thirty-six</b> men, <b>literally, </b> were killed; this is <b>the statement of R' Yehuda. R' Neḥemya said to</b> R' Yehuda: <b>But were they</b> precisely <b>thirty-six</b> men? <b>Didn’t it state only: “About thirty-six men”? Rather, this is</b> a reference to <b>Yair, son of Manasseh, </b> who was killed, and <b>who was</b> himself <b>equivalent</b> in importance <b>to the majority of the Sanhedrin, </b> i.e., thirty-six men."
        },
        {
          "verseLocation": "Joshua 7:24",
          "verseText": "Achan,",
          "talmudLocation": "Sanhedrin 44b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44b#section-9",
          "talmudFullText": "In one place, among the five sons of Zerah, <b>it is written: “Zimri, ”</b> without any mention of Achan (I Chronicles 2:6), <b>and</b> in another place <b>it is written: </b> “And Joshua took <b>Achan, </b> son of Zerah” (Joshua 7:24). <b>Rav and Shmuel</b> both say that Zimri and Achan are one and the same, but they disagree about his real name. <b>One</b> of them <b>says: His</b> real <b>name was Achan. Why</b> then <b>was he called Zimri? </b> He was called Zimri <b>because he acted like Zimri, </b> i.e., just as Zimri had sex with a Midianite woman, Achan had sex with a betrothed young woman. <b>And</b> the other <b>one says: His</b> real <b>name was Zimri. Why</b> then <b>was he called Achan? </b> He was called Achan <b>because he acted like a snake [<i>she’iken</i>]</b> and caused the punishment <b>of the sins of the Jewish people. </b>"
        },
        {
          "verseLocation": "Joshua 7:25",
          "verseText": "as it is stated: “And Joshua said: Why have you brought trouble on us? The Lord shall trouble you this day”",
          "talmudLocation": "Sanhedrin 43b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/43b#section-3",
          "talmudFullText": "<strong>Mishnah: </strong> <b>When</b> the condemned man <b>is at a distance of about ten cubits from the place of stoning, they say to him: Confess</b> your transgressions, <b>as the way of all who are being executed is to confess. As whoever confesses</b> and regrets his transgressions <b>has a portion in the World-to-Come. For so we find with regard to Achan, that Joshua said to him: “My son, please give glory to YHWH, God of Israel, and make confession to Him”</b> (Joshua 7:19). And the next verse states: <b>“And Achan answered Joshua, and said: Indeed I have sinned against YHWH, God of Israel, and like this and like that</b> have I done. ” <b>And from where</b> is it derived <b>that</b> Achan’s <b>confession achieved atonement for him? </b> It is derived from here, <b>as it is stated: “And Joshua said: Why have you brought trouble on us? YHWH shall trouble you this day”</b> (Joshua 7:25). Joshua said to Achan as follows: <b>On this day</b> of your judgment <b>you are troubled, but you will not be troubled in the World-to-Come. </b>"
        },
        {
          "verseLocation": "Joshua 7:25",
          "verseText": "As it is stated: “And Joshua said: Why have you brought trouble on us? The Lord shall trouble you this day”",
          "talmudLocation": "Sanhedrin 44b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44b#section-8",
          "talmudFullText": "§ The Mishnah teaches: <b>From where</b> is it derived <b>that</b> Achan’s <b>confession achieved atonement for him? A baraita states</b> likewise in a <i>baraita</i>: <b>From where</b> is it derived <b>that</b> Achan’s <b>confession achieved atonement</b> for him? <b>As it is stated: “And Joshua said: Why have you brought trouble on us? YHWH shall trouble you this day”</b> (Joshua 7:25). Joshua said to Achan: <b>On this day</b> of your judgment <b>you are troubled, but you will not be troubled in the World-to-Come. And</b> elsewhere <b>it is written: “And the sons of Zerah were Zimri and Ethan and Heman and Calcol and Dara, five of them in all”</b> (I Chronicles 2:6). <b>What</b> do the words <b>“five of them in all”</b> serve to teach? <b>All five</b> sons <b>are</b> destined <b>to</b> receive a share in <b>the World-to-Come. </b> According to the rabbis, Zimri is Achan, son of Zerah, as will be explained. Since Achan has a share in the World-to-Come, his confession must have achieved atonement for him."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "Joshua 8:2",
          "verseText": "said to him at Ai: “And you shall do to Ai and her king as you did to Jericho and her king;",
          "talmudLocation": "Sanhedrin 44a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44a#section-18",
          "talmudFullText": "<b>If so, what</b> is the meaning when <b>the verse states: “Get you up, ”</b> hinting that Joshua was in fact responsible for some transgression? The matter should be understood as follows: God <b>said to</b> Joshua: <b>You caused</b> the Jewish people to sin, as had you not dedicated all the spoils of Jericho to the Tabernacle treasury, the entire incident of Achan taking the spoils improperly would not have occurred. <b>And this is what</b> God <b>said to him at Ai: “And you shall do to Ai and her king as you did to Jericho and her king; </b> only its spoil and its cattle shall you take for a prey to yourselves” (Joshua 8:2), instructing Joshua that the Jewish people should keep the spoils."
        },
        {
          "verseLocation": "Joshua 8:9",
          "verseText": "“And Joshua lodged that night”",
          "talmudLocation": "Megillah 3a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/3a#section-21",
          "talmudFullText": "As for the angel’s mission, the Talmud explains that the angel <b>said to</b> Joshua: <b>Yesterday, </b> i.e., during the afternoon, <b>you neglected the afternoon daily offering</b> due to the impending battle, <b>and now, </b> at night, <b>you have neglected Torah study, </b> and I have come to rebuke you. Joshua <b>said to him: For which of these</b> sins <b>have you come? He said to him: I have come now, </b> indicating that neglecting Torah study is more severe than neglecting to sacrifice the daily offering. Joshua <b>immediately</b> determined to rectify the matter, as the verses states: <b>“And Joshua lodged that night”</b> (Joshua 8:9) <b>“in the midst of the valley</b> [<b><i>ha’emek</i></b>]” (Joshua 8:13), and <b>R' Yoḥanan said: </b>"
        },
        {
          "verseLocation": "Joshua 8:9",
          "verseText": "“And Joshua lodged that night”",
          "talmudLocation": "Sanhedrin 44b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44b#section-2",
          "talmudFullText": "Joshua <b>immediately</b> acted to rectify the matter by deciding that he must devote more time to Torah study, as it is stated: <b>“And Joshua lodged that night”</b> (Joshua 8:9) <b>“into the midst of the valley [<i>ha’emek</i>]”</b> (Joshua 8:13). <b>And R' Yoḥanan says: </b> This <b>teaches that he lodged</b> all night <b>in the depth [<i>be’omekah</i>] of <i>halakha</i>, </b> thereby atoning for his previous neglect of Torah study."
        },
        {
          "verseLocation": "Joshua 8:13",
          "verseText": "“And Joshua walked that night in the midst of the valley [ ha’emek ]”",
          "talmudLocation": "Eruvin 63b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/63b#section-5",
          "talmudFullText": "Joshua <b>immediately</b> acted to rectify the matter by deciding that he must devote more time to learning Torah, as it is stated: <b>“And Joshua walked that night in the midst of the valley [<i>ha’emek</i>]”</b> (Joshua 8:13). <b>And R' Yoḥanan said: </b> This <b>teaches that he walked</b> all night <b>in the depth [<i>be’omeka</i>] of <i>halakha</i>, </b> thereby atoning for his previous neglect of Torah study."
        },
        {
          "verseLocation": "Joshua 8:13",
          "verseText": "ha’emek",
          "talmudLocation": "Megillah 3a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/3a#section-21",
          "talmudFullText": "As for the angel’s mission, the Talmud explains that the angel <b>said to</b> Joshua: <b>Yesterday, </b> i.e., during the afternoon, <b>you neglected the afternoon daily offering</b> due to the impending battle, <b>and now, </b> at night, <b>you have neglected Torah study, </b> and I have come to rebuke you. Joshua <b>said to him: For which of these</b> sins <b>have you come? He said to him: I have come now, </b> indicating that neglecting Torah study is more severe than neglecting to sacrifice the daily offering. Joshua <b>immediately</b> determined to rectify the matter, as the verses states: <b>“And Joshua lodged that night”</b> (Joshua 8:9) <b>“in the midst of the valley</b> [<b><i>ha’emek</i></b>]” (Joshua 8:13), and <b>R' Yoḥanan said: </b>"
        },
        {
          "verseLocation": "Joshua 8:13",
          "verseText": "“into the midst of the valley [ ha’emek ]”",
          "talmudLocation": "Sanhedrin 44b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44b#section-2",
          "talmudFullText": "Joshua <b>immediately</b> acted to rectify the matter by deciding that he must devote more time to Torah study, as it is stated: <b>“And Joshua lodged that night”</b> (Joshua 8:9) <b>“into the midst of the valley [<i>ha’emek</i>]”</b> (Joshua 8:13). <b>And R' Yoḥanan says: </b> This <b>teaches that he lodged</b> all night <b>in the depth [<i>be’omekah</i>] of <i>halakha</i>, </b> thereby atoning for his previous neglect of Torah study."
        },
        {
          "verseLocation": "Joshua 8:30",
          "verseText": "say: “Then Joshua will build an altar to the Lord",
          "talmudLocation": "Sanhedrin 91b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/91b#section-14",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> that <b>R' Meir said: From where</b> is <b>resurrection of the dead</b> derived <b>from the Torah? </b> It is derived from a verse, <b>as it is stated: “Then Moses and the children of Israel will sing this song to YHWH”</b> (Exodus 15:1). It <b>is not stated: Sang, </b> in the verse; <b>rather, </b> the term <b>“they will sing”</b> is stated, indicating that Moses will come back to life and sing the song in the future. <b>From here</b> it is proved that <b>resurrection of the dead</b> is derived <b>from the Torah. On a similar note, you</b> can <b>say: “Then Joshua will build an altar to YHWH</b> God of Israel on Mount Ebal” (Joshua 8:30). It <b>is not stated: Built, </b> in the verse; <b>rather, </b> the term <b>“will build”</b> is stated. <b>From here, resurrection of the dead</b> is derived <b>from the Torah. </b>"
        },
        {
          "verseLocation": "Joshua 8:30",
          "verseText": "“Then did Joshua build [ yivne ] an altar to the Lord God",
          "talmudLocation": "Shabbat 56b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56b#section-8",
          "talmudFullText": "The Talmud objects: <b>But now</b> if that is the way to understand the future tense verb form <i>yivne</i>, what of another instance where the same form is employed: <b>“Then did Joshua build [<i>yivne</i>] an altar to YHWH God</b> of Israel in Mount Eival” (Joshua 8:30)? There too, would you say that Joshua <b>sought to build</b> an altar <b>but did not build</b> one? <b>Rather, </b> there, in the case of Joshua, it means that <b>he</b> actually <b>built it. Here too, </b> with regard to Solomon, it means that <b>he</b> actually <b>built</b> the altar."
        },
        {
          "verseLocation": "Joshua 8:33",
          "verseText": "on this side and on that side, as it is stated: “And all Israel, and their elders and officers, and their judges, stood on this side of the Ark and on that side",
          "talmudLocation": "Sotah 32a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/32a#section-11",
          "talmudFullText": "<b>Six tribes ascended to the top of Mount Gerizim and six tribes ascended to the top of Mount Ebal, and the priests and the Levites and the Ark were standing at the bottom in the middle, </b> between the two mountains. <b>The priests were surrounding the Ark and the Levites</b> were surrounding <b>the priests, and all</b> the rest <b>of the Jewish people</b> were standing on the mountains <b>on this side and on that side, as it is stated: “And all Israel, and their elders and officers, and their judges, stood on this side of the Ark and on that side</b> before the priests the Levites that bore the Ark of the Covenant of YHWH” (Joshua 8:33)."
        },
        {
          "verseLocation": "Joshua 8:33",
          "verseText": "Six tribes ascended to the top of Mount Gerizim,",
          "talmudLocation": "Sotah 36a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/36a#section-11",
          "talmudFullText": "§ It is stated in the Mishnah: <b>Six tribes ascended to the top of Mount Gerizim, </b> as it is stated: “Half of them in front of Mount Gerizim and the half of them in front of Mount Ebal” (Joshua 8:33). The Talmud asks: <b>What</b> is the meaning of the term <b>“and the half of them”? </b> It seems to be referring to a division that already existed. <b>Rav Kahana says: The same way that</b> the tribes <b>were divided up here</b> on the mountains, <b>so</b> too <b>were they divided on the stones of the ephod, </b> a garment of the High Priest."
        },
        {
          "verseLocation": "Joshua 8:33",
          "verseText": "“And the half of them",
          "talmudLocation": "Sotah 36b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/36b#section-4",
          "talmudFullText": "The Talmud asks: <b>Rather, what</b> is meant by the phrase: <b>“And the half of them</b> facing Mount Ebal” (Joshua 8:33)? It is <b>taught</b> in a <i>baraita</i>: The use of the definitive article in the verse indicates that the smaller half of the Jewish people was on Mount Ebal. <b>The half that was facing Mount Gerizim was larger than the half on Mount Ebal, because</b> the tribe of <b>Levi</b> was included in the group that was facing Mount Gerizim, and they remained <b>on the bottom</b> between the two mountains."
        },
        {
          "verseLocation": "Joshua 8:33",
          "verseText": "because it is already stated:",
          "talmudLocation": "Sotah 37a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/37a#section-7",
          "talmudFullText": "§ The Talmud returns to discussing the blessing and curses. <b>It is taught</b> in a <i>baraita</i> (<i>Tosefta</i> 8:9) that <b>R' Eliezer ben Ya’akov says: It is impossible to say</b> that the tribe of <b>Levi</b> stood <b>below, </b> between the two mountains, <b>as it is already stated</b> that they were <b>above, </b> in the verse: “These shall stand on Mount Gerizim to bless the people when you have passed over the Jordan: Simeon and Levi and Judah” (Deuteronomy 27:12). <b>And it is impossible to say</b> that they stood <b>above</b> on the mountain <b>because it is already stated: </b> “And all of Israel, and their elders and officers, and their judges, stood on this side of the Ark and on that side before the priests the Levites” (Joshua 8:33). This shows that the Levites stood <b>below, </b> between the mountains, with the Ark."
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "Joshua 9:6",
          "verseText": "said to them: “We came from a far country”",
          "talmudLocation": "Gittin 46a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/46a#section-7",
          "talmudFullText": "<b>And the Rabbis, </b> who hold that such a vow can also be dissolved, respond to this claim in the following manner: <b>There, did the oath take effect with regard to them at all? Since</b> the people of Gibeon <b>said to them: “We came from a far country”</b> (Joshua 9:6), <b>and they did not come</b> from a far country, <b>the oath did not take effect with regard to</b> the Jewish people <b>at all, </b> as it was taken under false pretenses. <b>And this, that</b> the Jewish people <b>did not kill</b> the Gibeonites, like they did to the other nations who resided in the land of Canaan, despite the fact that the vow did not take effect, was <b>due to the sanctity of God’s name. </b> If they would have killed them, they would have desecrated God’s name by not fulfilling their word, although this vow did not take effect."
        },
        {
          "verseLocation": "Joshua 9:18",
          "verseText": "“And the children of Israel did not strike them, for the leaders of the congregation swore to them”",
          "talmudLocation": "Gittin 46a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/46a#section-6",
          "talmudFullText": "§ The Mishnah taught that <b>R' Yehuda says: </b> If he divorced her due to <b>any vow that the public was aware of, he may not remarry</b> her, <b>but</b> if he divorced her due to a vow <b>that the public was not aware of, he may remarry</b> her. <b>R' Yehoshua ben Levi said: What is the reason of R' Yehuda? </b> Based on what does he make the distinction of whether the public is aware of the vow or not? <b>As it is written</b> in the Torah portion describing the interaction of the Jews with the people of Gibeon: <b>“And the children of Israel did not strike them, for the leaders of the congregation swore to them”</b> (Joshua 9:18). This teaches that a vow taken in the presence of the public cannot be dissolved. In this case as well, if she took an oath that is known by the public, it cannot be dissolved."
        },
        {
          "verseLocation": "Joshua 9:18",
          "verseText": "“And the children of Israel did not smite them, for the princes of the assembly had sworn to them”",
          "talmudLocation": "Ketubot 75a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/75a#section-1",
          "talmudFullText": "<b>“And the children of Israel did not smite them, for the princes of the assembly had sworn to them”</b> (Joshua 9:18), and since this oath was uttered in the presence of many people, it could not be rescinded, although it was undertaken in error because the Gibeonites had deceived the people of Israel. The Talmud poses a question: <b>And how many</b> people are considered <b>many</b> for the purposes of this law? <b>Rav Naḥman bar Yitzḥak said: Three, </b> as can be learned from the laws of a woman who experiences a discharge of uterine blood after her menstrual period [<i>zava</i>]: <b>“Days”</b> indicates <b>two, </b> which is the minimal number justifying use of the plural noun. The term <b>“many</b> days” (Leviticus 15:25) therefore indicates a total of <b>three. R' Yitzḥak said: Ten, as</b> the term <b>“assembly” is written in relation to the</b> Gibeonites, and it is taught elsewhere that an assembly is comprised of at least ten members."
        },
        {
          "verseLocation": "Joshua 9:27",
          "verseText": "as it is written: “And Joshua made them that day hewers of wood and drawers of water, for the congregation and for the altar of the Lord”",
          "talmudLocation": "Yevamot 79a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/79a#section-13",
          "talmudFullText": "The Talmud raises another difficulty: <b>But still, </b> it was <b>Joshua</b> who <b>issued a decree against</b> the Gibeonites, <b>as it is written: “And Joshua made them that day hewers of wood and drawers of water, for the congregation and for the altar of YHWH”</b> (Joshua 9:27). The Talmud answers: <b>Joshua issued a decree for the period when the Temple is standing, </b> as indicated by the phrase “for the altar of YHWH,” whereas <b>David issued a decree</b> even <b>for the period when the Temple is not standing. </b>"
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "Joshua 10:11",
          "verseText": "as it is written: “And it came to pass, as they fled from before the children of Israel, while they were in the descent of Beth Horon, that the Lord cast down great stones from heaven upon them into Azeka and they died”",
          "talmudLocation": "Avodah Zarah 25a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/25a#section-10",
          "talmudFullText": "The Talmud <b>raises an objection: </b> After the sun stood still, the verse states: <b>“And there was no day like that before it or after it”</b> (Joshua 10:14). If there was no day comparable to it, how can it be asserted that the sun stood still for Moses as well? The Talmud answers: <b>If you wish, say</b> that the number of <b>hours</b> the sun stood still for Moses <b>were not as many</b> as in the case of Joshua. <b>And if you wish, say</b> instead: When the sun stood still for Moses <b>there were no hailstones, </b> whereas in the case of Joshua there were hailstones, <b>as it is written: “And it came to pass, as they fled from before the children of Israel, while they were in the descent of Beth Horon, that YHWH cast down great stones from heaven upon them into Azeka and they died”</b> (Joshua 10:11)."
        },
        {
          "verseLocation": "Joshua 10:11",
          "verseText": "“As they fled from before Israel, while they were at the descent of Beit Ḥoron, that the Lord cast down great stones",
          "talmudLocation": "Berakhot 54b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/54b#section-3",
          "talmudFullText": "<b>It is taught</b> in the midrash: They are the <b>stones that</b> remained <b>suspended</b> in the air and did not fall <b>because of [<i>al gav</i>] a man [<i>ish</i>] and they fell down because of [<i>al gav</i>] a man [<i>ish</i>]. </b> The Talmud explains: <b>They</b> remained <b>suspended because of a man; that is Moses, </b> whom the verse refers to as a man, <b>as it is written: “And the man Moses was very modest”</b> (Numbers 12:3), <b>and it is written: </b> “And Moses went out of the city from Pharaoh, and spread forth his hands unto YHWH; <b>the thunders and hail ceased, and the rain was not poured upon the earth”</b> (Exodus 9:33). Moses’ hailstones remained suspended. And the stones <b>descended because of a man; that is Joshua, </b> who was also called man, <b>as it is written: “Take Joshua the son of Nun, a man in whom is spirit”</b> (Numbers 27:18). <b>And it is written</b> that when Joshua and his people waged war against the army of the Emorite kings, God told him not to fear them because God would deliver them into his hands; and indeed, they died by means of these stones: <b>“As they fled from before Israel, while they were at the descent of Beit Ḥoron, that YHWH cast down great stones</b> from heaven upon them unto Azeka, and they died; they were more who died with the hailstones than they whom the children of Israel slew by sword” (Joshua 10:11)."
        },
        {
          "verseLocation": "Joshua 10:12",
          "verseText": "with regard to Joshua: “In the day when the Lord delivered up the Amorites",
          "talmudLocation": "Avodah Zarah 25a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/25a#section-8",
          "talmudFullText": "<b>And R' Yoḥanan says: </b> It is <b>derived</b> from a verbal analogy between the words <b>“delivered”</b> and <b>“delivered. ” It is written here, </b> with regard to Moses: <b>“I will begin to deliver the dread of you, ” and it is written</b> there, <b>with regard to Joshua: “In the day when YHWH delivered up the Amorites</b> before the children of Israel” (Joshua 10:12)."
        },
        {
          "verseLocation": "Joshua 10:12",
          "verseText": "on the day when the Lord put the Amorites",
          "talmudLocation": "Taanit 20a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/20a#section-7",
          "talmudFullText": "<b>R' Shmuel bar Naḥmani said: </b> The fact that the sun stood still for Moses is <b>derived</b> by a different verbal analogy, between the terms <b>“put”</b> and <b>“put. ” Here, </b> with regard to Moses, <b>it is written: “I will begin to put the dread of you”</b> (Deuteronomy 2:25). <b>And there, </b> with regard to Joshua, <b>is it written: </b> “Then Joshua spoke to YHWH, <b>on the day when YHWH put the Amorites</b> before the children of Israel, and he said in the sight of Israel: Sun, stand still upon Gibeon, and you, moon, in the valley of Aijalon” (Joshua 10:12)."
        },
        {
          "verseLocation": "Joshua 10:13",
          "verseText": "“And the sun stood still, and the moon stayed, until the nation had avenged themselves of their enemies. Is this not written in the book of Yashar”?",
          "talmudLocation": "Avodah Zarah 25a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/25a#section-1",
          "talmudFullText": "§ The Talmud cites a series of expositions with regard to what is called the book of Yashar. The verse states: <b>“And the sun stood still, and the moon stayed, until the nation had avenged themselves of their enemies. Is this not written in the book of Yashar”? </b> (Joshua 10:13). The Talmud asks: <b>What</b> is <b>the book of Yashar? R' Ḥiyya bar Abba says</b> that <b>R' Yoḥanan says: This</b> is Genesis, which is <b>the book of Abraham, Isaac, and Jacob, who were called righteous [<i>yesharim</i>], as it is stated: “Let me die the death of the righteous [<i>yesharim</i>]”</b> (Numbers 23:10)."
        },
        {
          "verseLocation": "Joshua 10:13",
          "verseText": "“And the sun stayed in the midst of heaven, and hastened not to go down for an entire day”",
          "talmudLocation": "Avodah Zarah 25a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/25a#section-2",
          "talmudFullText": "The Talmud asks: <b>And where is it alluded</b> to in Genesis that the sun would stand still for Joshua? The verse states in reference to Ephraim, who was Joshua’s ancestor: <b>“And his seed shall become a multitude of nations”</b> (Genesis 48:19). The Talmud asks: <b>When will he become a multitude of nations? </b> He became a multitude of nations <b>at the time when the sun stood</b> in place <b>for Joshua, </b> as it is written: <b>“And the sun stayed in the midst of heaven, and hastened not to go down for an entire day”</b> (Joshua 10:13)."
        },
        {
          "verseLocation": "Joshua 10:13",
          "verseText": "And the glory; that is the sun and the moon that stood still for Joshua, as it is stated: “And the sun stood still, and the moon stayed,",
          "talmudLocation": "Berakhot 58a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58a#section-16",
          "talmudFullText": "R' Sheila <b>said: Since a miracle was performed on my behalf with this verse</b> that I cited, <b>I will interpret it homiletically: Yours, O Lord, is the greatness; that is the act of creation, and so it says: “Who does great things past finding out”</b> (Job 9:10); <b><b>And the power; that is the exodus from Egypt, as it is stated: “And Israel saw the great work</b> which YHWH did to the <b>Egyptians”</b> (Exodus 14:31); <b><b>And the glory; that is the sun and the moon that stood still for Joshua, as it is stated: “And the sun stood still, and the moon stayed, </b> until the nation had avenged themselves of their enemies” (Joshua 10:13); <b><b>And the triumph; that is the downfall of Rome, and so it says</b> describing the downfall of Edom, whom the rabbis identified as the forefather of Rome: <b>“Their lifeblood is dashed against My garments</b> and I have stained all My raiment” (Isaiah 63:3); <b><b>And the majesty; this is the war of the valleys of Arnon, as it is stated: “Wherefore it is said in the book of the Wars of YHWH: Vahev in Sufa, </b> and the valleys of Arnon” (Numbers 21:14); <b><b>For all that is in the heaven and in the earth is Yours; this is the war of Sisera, as it is stated: “They fought from heaven, the stars in their courses</b> fought against Sisera” (Judges 5:20). <b><b>Yours is the kingdom, O Lord; this is the war of Amalek, and so it says: </b> “And he said: <b>The hand upon the throne of YHWH: </b> YHWH will have war with Amalek from generation to generation” (Exodus 17:16), as then God will sit on His throne. <b><b>And you are exalted; this is the war of Gog and Magog, and so it says: “I am against you, O Gog, the chief prince of Meshekh and Tubal”</b> (Ezekiel 38:3); and:<br><b>As head above all; Rav Ḥanan bar Rava said</b> that <b>R' Yoḥanan said: </b> All leadership and authority, <b>even</b> the most insignificant, the <b>one responsible for distributing water, is appointed by heaven. </b>"
        },
        {
          "verseLocation": "Joshua 10:13",
          "verseText": "a verse, as it is written: “And the sun stood still, and the moon stayed",
          "talmudLocation": "Taanit 20a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/20a#section-5",
          "talmudFullText": "<b>A baraita states: </b> With regard to <b>three</b> people, <b>the sun broke through</b> and shone at an irregular time <b>for their sake: Moses, Joshua, and Nakdimon ben Guryon. </b> The Talmud asks: <b>Granted, </b> the case of <b>Nakdimon ben Guryon</b> is known by the aforementioned <b>tradition. The case of Joshua too</b> is derived from <b>a verse, as it is written: “And the sun stood still, and the moon stayed</b> until the people had avenged themselves upon their enemies” (Joshua 10:13). <b>However, from where do we</b> derive that the sun shined in a supernatural way for <b>Moses? </b>"
        },
        {
          "verseLocation": "Joshua 10:14",
          "verseText": "“And there was no day like that before it or after it”",
          "talmudLocation": "Avodah Zarah 25a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/25a#section-10",
          "talmudFullText": "The Talmud <b>raises an objection: </b> After the sun stood still, the verse states: <b>“And there was no day like that before it or after it”</b> (Joshua 10:14). If there was no day comparable to it, how can it be asserted that the sun stood still for Moses as well? The Talmud answers: <b>If you wish, say</b> that the number of <b>hours</b> the sun stood still for Moses <b>were not as many</b> as in the case of Joshua. <b>And if you wish, say</b> instead: When the sun stood still for Moses <b>there were no hailstones, </b> whereas in the case of Joshua there were hailstones, <b>as it is written: “And it came to pass, as they fled from before the children of Israel, while they were in the descent of Beth Horon, that YHWH cast down great stones from heaven upon them into Azeka and they died”</b> (Joshua 10:11)."
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "Joshua 11:6",
          "verseText": "“You shall destroy their horses”",
          "talmudLocation": "Avodah Zarah 13a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/13a#section-15",
          "talmudFullText": "§ The Talmud returns to discuss the <i>baraita</i> that cited the opinion of R' Natan. <b>The Master said</b> above: Any <b>animal</b> that one bought there <b>should be destroyed. </b> The Talmud asks: <b>But isn’t there</b> a requirement to prevent <b>suffering to animals? Abaye said: </b> Although there is an enjoinder against causing suffering to a living creature, it is permitted when necessary, as <b>God states</b> to Joshua: <b>“You shall destroy their horses”</b> (Joshua 11:6)."
        },
        {
          "verseLocation": "Joshua 11:15",
          "verseText": "“As the Lord commanded Moses His servant, so did Moses command Joshua, and so did Joshua; he left nothing undone of all that the Lord had commanded Moses”",
          "talmudLocation": "Sanhedrin 44a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44a#section-17",
          "talmudFullText": "<b>After</b> Rav Sheila finished his lecture and <b>went out, Rav, </b> who had been present but remained silent, <b>placed an interpreter alongside him, </b> who would repeat his lecture in a loud voice so that the public could hear it, <b>and he taught: </b> The verse states: <b>“As YHWH commanded Moses His servant, so did Moses command Joshua, and so did Joshua; he left nothing undone of all that YHWH had commanded Moses”</b> (Joshua 11:15). This indicates that Joshua could not have been guilty of a grave offense such as delaying in setting up the stones."
        },
        {
          "verseLocation": "Joshua 11:15",
          "verseText": "“As God commanded His servant Moses, so did Moses command Joshua, and so did Joshua, he left nothing undone of all that the Lord commanded Moses”",
          "talmudLocation": "Yevamot 96b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/96b#section-17",
          "talmudFullText": "<b>R' Ya’akov bar Idi visited</b> R' Yoḥanan and <b>said to him: </b> The verse states: <b>“As God commanded His servant Moses, so did Moses command Joshua, and so did Joshua, he left nothing undone of all that YHWH commanded Moses”</b> (Joshua 11:15). <b>Now did Joshua, with regard to every matter that he said, say to</b> the Jews: <b>Thus Moses said to me? Rather, Joshua</b> would <b>sit and teach</b> Torah <b>without attributing</b> his statements, <b>and everyone would know that it was</b> from <b>the Torah of Moses. So too, your disciple R' Elazar sits and teaches without attribution, and everyone knows that</b> his teaching <b>is</b> from <b>your</b> instruction. Hearing this, R' Yoḥanan was appeased."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "Joshua 13:3",
          "verseText": "“The five lords of the Philistines: The Gazite, and the Ashdodite, the Ashkelonite, the Gittite, and the Ekronite; also the Avvim”",
          "talmudLocation": "Chullin 60b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/60b#section-9",
          "talmudFullText": "The Talmud relates another statement. The verse states: <b>“The five lords of the Philistines: The Gazite, and the Ashdodite, the Ashkelonite, the Gittite, and the Ekronite; also the Avvim”</b> (Joshua 13:3). The verse is difficult, since it first <b>said</b> there are <b>five</b> lords of the Philistines, <b>but it</b> then <b>lists six. R' Yonatan said: </b> There were in fact six lords, but <b>the greatest of them</b> were only <b>five. Rav Ḥisda said to Rav Taḥlifa bar Avina: Write</b> this statement about <b>the greatest [<i>arunekei</i>] in your</b> book of <b><i>aggada</i>, and explain</b> that word. The Talmud notes: <b>And</b> this statement <b>disagrees</b> with the opinion <b>of Rav, as Rav says: </b> The <b>Avvim</b> were not Philistines; rather, they <b>came from Teiman. </b>"
        },
        {
          "verseLocation": "Joshua 13:22",
          "verseText": "“And Balaam, son of Beor, the diviner,",
          "talmudLocation": "Sanhedrin 106a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106a#section-17",
          "talmudFullText": "It is stated: <b>“And Balaam, son of Beor, the diviner, </b> did the children of Israel slay with the sword among the rest of their slain” (Joshua 13:22). The Talmud asks: Was he <b>a diviner? He is a prophet. R' Yoḥanan says: Initially</b> he was <b>a prophet, but ultimately, </b> he lost his capacity for prophecy and remained merely <b>a diviner. Rav Pappa says</b> that <b>this</b> is in accordance with the adage <b>that people say: </b> This woman <b>was</b> descended <b>from princes and rulers, </b> and <b>was licentious with carpenters. </b>"
        },
        {
          "verseLocation": "Joshua 13:22",
          "verseText": "did the children of Israel slay with the sword among the rest of their slain”",
          "talmudLocation": "Sanhedrin 106b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106b#section-1",
          "talmudFullText": "With regard to the latter part of the verse: “And Balaam, son of Beor, the diviner, <b>did the children of Israel slay with the sword among the rest of their slain”</b> (Joshua 13:22), <b>Rav says: </b> It means <b>that they accomplished in him</b> all <b>four</b> means of court-imposed <b>executions: Stoning, and burning, beheading, and strangulation. </b>"
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "Joshua 14:6",
          "verseText": "the Kenizzite",
          "talmudLocation": "Sotah 12a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/12a#section-1",
          "talmudFullText": "The Talmud comments: The language of another verse <b>is also precise</b> based on this explanation, <b>as it is written: </b> “And Caleb the son of Jephunneh <b>the Kenizzite</b> said unto him” (Joshua 14:6). Although his father was Jephunneh, he is known as “the Kenizzite,” although he was not actually a son of Kenaz. The Talmud accepts this proof and states: <b>Conclude from it</b> that Rava’s explanation is correct."
        },
        {
          "verseLocation": "Joshua 14:7",
          "verseText": "“I was forty years old when Moses the servant of the Lord sent",
          "talmudLocation": "Sanhedrin 69b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/69b#section-19",
          "talmudFullText": "<b>And it is written</b> that Caleb, Bezalel’s great-grandfather, said to Joshua: <b>“I was forty years old when Moses the servant of YHWH sent</b> me from Kadesh Barnea to spy out the land” (Joshua 14:7). And he added: <b>“And now, behold, I am this day eighty-five years old”</b> (Joshua 14:10). <b>How many</b> years old <b>was</b> Caleb when he was sent off with the spies? He was <b>forty. Subtract fourteen</b> years, <b>as Bezalel was</b> at least fourteen years old when Caleb was sent to spy out the land. This is known because that mission took place a year after the Tabernacle was erected. This <b>leaves twenty-six</b> years. <b>Subtract two</b> more <b>years for three pregnancies, </b> one preceding the birth of Hur, son of Caleb, one preceding the birth of Uri, son of Hur, and one preceding the birth of Bezalel, son of Uri. <b>It turns out</b> that three generations were born in twenty-four years, and <b>that each and every</b> parent <b>begot</b> a child <b>at</b> the age of <b>eight. </b>"
        },
        {
          "verseLocation": "Joshua 14:7",
          "verseText": "“Forty years old was I when Moses, the servant of the Lord, sent me from Kadesh Barnea to spy out the land; and I brought him back word as it was in my heart”",
          "talmudLocation": "Zevachim 118b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/118b#section-15",
          "talmudFullText": "<b>From where do we</b> derive <b>that</b> the Tabernacle remained <b>in Gilgal</b> for <b>fourteen</b> years, <b>seven</b> years during <b>which</b> the Jews <b>conquered</b> the land <b>and seven</b> years during <b>which they divided</b> it? <b>As Caleb, </b> son of Jephunneh, <b>said</b> to Joshua at the conclusion of the period of conquest before the land was divided: <b>“Forty years old was I when Moses, the servant of YHWH, sent me from Kadesh Barnea to spy out the land; and I brought him back word as it was in my heart”</b> (Joshua 14:7), <b>and it is written: “And now, I am this day eighty and five years old”</b> (Joshua 14:10)."
        },
        {
          "verseLocation": "Joshua 14:10",
          "verseText": "“And now, behold, I am this day eighty-five years old”",
          "talmudLocation": "Sanhedrin 69b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/69b#section-19",
          "talmudFullText": "<b>And it is written</b> that Caleb, Bezalel’s great-grandfather, said to Joshua: <b>“I was forty years old when Moses the servant of YHWH sent</b> me from Kadesh Barnea to spy out the land” (Joshua 14:7). And he added: <b>“And now, behold, I am this day eighty-five years old”</b> (Joshua 14:10). <b>How many</b> years old <b>was</b> Caleb when he was sent off with the spies? He was <b>forty. Subtract fourteen</b> years, <b>as Bezalel was</b> at least fourteen years old when Caleb was sent to spy out the land. This is known because that mission took place a year after the Tabernacle was erected. This <b>leaves twenty-six</b> years. <b>Subtract two</b> more <b>years for three pregnancies, </b> one preceding the birth of Hur, son of Caleb, one preceding the birth of Uri, son of Hur, and one preceding the birth of Bezalel, son of Uri. <b>It turns out</b> that three generations were born in twenty-four years, and <b>that each and every</b> parent <b>begot</b> a child <b>at</b> the age of <b>eight. </b>"
        },
        {
          "verseLocation": "Joshua 14:10",
          "verseText": "and it is written: “And now, I am this day eighty and five years old”",
          "talmudLocation": "Zevachim 118b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/118b#section-15",
          "talmudFullText": "<b>From where do we</b> derive <b>that</b> the Tabernacle remained <b>in Gilgal</b> for <b>fourteen</b> years, <b>seven</b> years during <b>which</b> the Jews <b>conquered</b> the land <b>and seven</b> years during <b>which they divided</b> it? <b>As Caleb, </b> son of Jephunneh, <b>said</b> to Joshua at the conclusion of the period of conquest before the land was divided: <b>“Forty years old was I when Moses, the servant of YHWH, sent me from Kadesh Barnea to spy out the land; and I brought him back word as it was in my heart”</b> (Joshua 14:7), <b>and it is written: “And now, I am this day eighty and five years old”</b> (Joshua 14:10)."
        }
      ]
    },
    {
      "chapterNumber": 15,
      "citations": [
        {
          "verseLocation": "Joshua 15:6",
          "verseText": "“And the border went up",
          "talmudLocation": "Zevachim 54b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/54b#section-5",
          "talmudFullText": "<b>They brought the book of Joshua. With regard to all of</b> the borders of the tribes <b>it is written: “And went down”</b> (see Joshua 15:10, 16:3, 17:9), and it is written: <b>“And the border went up</b> to Beth Hoglah. ” (Joshua 15:6), and: <b>“And the border was drawn</b> from the top of the mountain to the fountain of the waters of Nephtoah” (Joshua 15:9). The verse uses different terms to describe the borders of the portion of each tribe. And <b>with regard to</b> the borders of <b>the tribe of Benjamin it is written</b> only: <b>“And went up”</b> (Joshua 18:11), but it <b>is not written: “And went down. ” They said: Conclude from</b> the verses that the Temple’s <b>place is here, </b> in the portion of Benjamin."
        },
        {
          "verseLocation": "Joshua 15:9",
          "verseText": "“And the border was drawn",
          "talmudLocation": "Zevachim 54b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/54b#section-5",
          "talmudFullText": "<b>They brought the book of Joshua. With regard to all of</b> the borders of the tribes <b>it is written: “And went down”</b> (see Joshua 15:10, 16:3, 17:9), and it is written: <b>“And the border went up</b> to Beth Hoglah. ” (Joshua 15:6), and: <b>“And the border was drawn</b> from the top of the mountain to the fountain of the waters of Nephtoah” (Joshua 15:9). The verse uses different terms to describe the borders of the portion of each tribe. And <b>with regard to</b> the borders of <b>the tribe of Benjamin it is written</b> only: <b>“And went up”</b> (Joshua 18:11), but it <b>is not written: “And went down. ” They said: Conclude from</b> the verses that the Temple’s <b>place is here, </b> in the portion of Benjamin."
        },
        {
          "verseLocation": "Joshua 15:13",
          "verseText": "he the son of Kenaz? Wasn’t he Caleb, son of Jephunneh",
          "talmudLocation": "Temurah 16a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/16a#section-12",
          "talmudFullText": "The Talmud asks: <b>And Caleb, </b> was <b>he the son of Kenaz? Wasn’t he Caleb, son of Jephunneh</b> (Joshua 15:13)? The Talmud explains that Jephunneh was not the name of his father, but a description of Caleb. <b>What</b> does the word <b>Jephunneh</b> mean? It means <b>that he turned [<i>sheppana</i>] from the advice of the spies</b> and did not join with them in their negative report about Eretz Yisrael."
        },
        {
          "verseLocation": "Joshua 15:18",
          "verseText": "“And it came to pass, when she came to him, that she persuaded him to ask of her father a field; and she alighted from off her donkey;",
          "talmudLocation": "Temurah 16a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/16a#section-10",
          "talmudFullText": "The Talmud relates another incident involving Achsah. The verse states: <b>“And it came to pass, when she came to him, that she persuaded him to ask of her father a field; and she alighted from off her donkey; </b> and Caleb said to her: What do you want? ” (Joshua 15:18). The Talmud asks: <b>What</b> is the meaning of: <b>“And she alighted [<i>vatitznaḥ</i>], ”</b> which can also be understood as crying out? <b>Rava says</b> that <b>R' Yitzḥak says: </b> Achsah <b>said to</b> Caleb: <b>Just as</b> in the case of <b>this donkey, when it has no food in its trough it immediately cries out, so too</b> in the case of <b>a woman, when she has no produce in her house she immediately cries out. </b>"
        },
        {
          "verseLocation": "Joshua 15:19",
          "verseText": "“And she said: Give me a blessing; for that you have set me in the land of the South [ negev ],",
          "talmudLocation": "Temurah 16a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/16a#section-11",
          "talmudFullText": "The Talmud cites yet another verse involving Achsah: <b>“And she said: Give me a blessing; for that you have set me in the land of the South [<i>negev</i>], </b> and you have given me springs of water. And he gave her the upper springs and the lower springs” (Joshua 15:19). She said to her father: You have given me <b>a home dried [<i>menugav</i>] of all goodness. “And you have given me springs of water”; </b> this is referring to <b>a man who has nothing other than Torah, </b> which is metaphorically called water. But as he is unable to provide me with food, how can I live? <b>“And gave her the upper springs and the lower springs. ”</b> Caleb <b>said to her: </b> Does someone learned in Torah, <b>who dwells in the upper</b> worlds <b>and the lower</b> worlds, <b>require</b> that <b>sustenance be requested for him? </b> He certainly does not need it, as God will provide for him in merit of his Torah studies."
        },
        {
          "verseLocation": "Joshua 15:22",
          "verseText": "which is written: “Kina, and Dimonah, and Adadah”",
          "talmudLocation": "Gittin 7a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/7a#section-10",
          "talmudFullText": "In connection to the incident in which Mar Ukva was instructed not to take revenge against his tormentors, the Talmud relates similar discussions. <b>Rav Huna bar Natan said to Rav Ashi: What</b> is the meaning of that <b>which is written: “Kina, and Dimonah, and Adadah”</b> (Joshua 15:22)? <b>He said to him: </b> The verse <b>is listing the cities of Eretz Yisrael. </b>"
        },
        {
          "verseLocation": "Joshua 15:24",
          "verseText": "after its place, as it is written: “Ziph and Telem and Bealoth”",
          "talmudLocation": "Sotah 48b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/48b#section-17",
          "talmudFullText": "<b>We learned</b> in a Mishnah <b>there</b> (<i>Makhshirin</i> 5:9): <b>Anything that is poured</b> remains <b>ritually pure. </b> In other words, even if a liquid is poured into a ritually impure utensil, the stream of the liquid does not defile the contents that remain in the ritually pure utensil from which they were poured, <b>apart from <i>zifim</i> honey and wafer</b> batter. These substances are too viscous to be considered liquids. The Talmud asks: <b>What</b> is the meaning of <b><i>zifim</i>? R' Yoḥanan says: Honey</b> of such rare quality that <b>they</b> could <b>falsify [<i>mezayyefin</i>] it, </b> by diluting it with other substances, and it would not be noticed. <b>And Reish Lakish says: </b> It is named <b>after its place, as it is written: “Ziph and Telem and Bealoth”</b> (Joshua 15:24)."
        },
        {
          "verseLocation": "Joshua 15:31",
          "verseText": "“Ziklag, and Madmannah, and Sansannah”",
          "talmudLocation": "Gittin 7a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/7a#section-12",
          "talmudFullText": "Rav Ashi <b>said to him: If that is so, </b> you should <b>also</b> expound the verse: <b>“Ziklag, and Madmannah, and Sansannah”</b> (Joshua 15:31), in a similar manner. Rav Huna <b>said to him: If Rav Geviha from Bei Argiza was here, he would say an explanation for it. </b> The Talmud relates: <b>Rav Aḥa from Bei Ḥoza’a said this about that</b> verse: <b>Anyone who has a complaint against another over a sip [<i>tza’akat legima</i>], </b> i.e., he has a claim that someone did not give him food, <b>and</b> remains <b>silent [<i>domem</i>], the One who dwells in the</b> burning <b>bush [<i>seneh</i>] performs judgment on his behalf. </b>"
        },
        {
          "verseLocation": "Joshua 15:34",
          "verseText": "“Tappuah and Enam”",
          "talmudLocation": "Sotah 10a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-19",
          "talmudFullText": "The verse states with regard to Tamar: “And she put off from her the garments of her widowhood, and covered herself with her veil, and wrapped herself, <b>and sat in the entrance of Enaim [<i>befetaḥ einayim</i>], </b> which is by the way to Timnah; for she saw that Shelah was grown up, and she was not given unto him to wife” (Genesis 38:14). The <i>amora’im</i> dispute the meaning of the word <i>einayim</i>. <b>R' Alexandri says: </b> This <b>teaches that she went and she sat at the entrance</b> of the home <b>of Abraham our forefather, a place that all eyes hope to see it, </b> as she was certain that Judah would pass there. <b>R' Ḥanin</b> says that <b>Rav says: </b> It is <b>a place called Enaim, and similarly</b> the verse <b>states</b> in the list of cities in Eretz Yisrael in the portion of Judah: <b>“Tappuah and Enam”</b> (Joshua 15:34)."
        }
      ]
    },
    {
      "chapterNumber": 16,
      "citations": [
        {
          "verseLocation": "Joshua 16:6",
          "verseText": "Taanath Shiloh”",
          "talmudLocation": "Zevachim 118b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/118b#section-1",
          "talmudFullText": "<b>“And</b> the border turned about eastward to <b>Taanath Shiloh”</b> (Joshua 16:6), a place adjacent to Shiloh. Why did it bear the name of Taanath Shiloh? It is because it was the <b>place</b> from <b>which whoever saw</b> the Tabernacle in Shiloh after its destruction would <b>moan [<i>mitane’aḥ</i>] for it with regard to the consumption of sacrificial</b> animals from offerings of lesser sanctity that had been previously permitted there, but was now no longer permitted."
        },
        {
          "verseLocation": "Joshua 16:6",
          "verseText": "Taanath Shiloh”",
          "talmudLocation": "Zevachim 118b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/118b#section-10",
          "talmudFullText": "<b>Here too, </b> with regard to the Tabernacle in Shiloh, <b>a strip</b> of land <b>protruded from the portion of Joseph</b> and entered <b>into the portion of Benjamin, </b> which connected Shiloh to the portion of Benjamin, and it was upon that strip, which had the status of Benjamin’s portion, that the Tabernacle stood. <b>And that is</b> what it means concerning that <b>which is written</b> with regard to the boundary of Joseph: “And the border turned about eastward to <b>Taanath Shiloh”</b> (Joshua 16:6), which in this context, is interpreted as meaning that the tribe of Benjamin would bemoan the fact that the Tabernacle in Shiloh was not located entirely in its portion."
        }
      ]
    },
    {
      "chapterNumber": 17,
      "citations": [
        {
          "verseLocation": "Joshua 17:2",
          "verseText": "of the six fathers’ houses",
          "talmudLocation": "Bava Batra 118b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/118b#section-8",
          "talmudFullText": "The Talmud returns to the <i>baraita</i> and presents the 5th question. <b>And Rav Pappa said to Abaye: Granted, according to the one who says</b> that <b>Eretz</b> Yisrael <b>was divided among those who left Egypt, this is as it is written</b> with regard to the inheritance of the tribe of Manasseh: <b>“And ten parts fell to Manasseh, </b> beside the land of Gilead and Bashan, which is beyond the Jordan; because the daughters of Manasseh had an inheritance among his sons” (Joshua 17:5–6). <b>Six</b> were the portions <b>of the six fathers’ houses</b> of Manasseh listed in a previous verse (Joshua 17:2), <b>and four</b> parts <b>of</b> the daughters of Zelophehad; <b>that</b> is <b>ten</b> parts."
        },
        {
          "verseLocation": "Joshua 17:5",
          "verseText": "daughters of Zelophehad took four parts, as it is stated: “And ten parts fell to Manasseh”",
          "talmudLocation": "Bava Batra 119a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/119a#section-5",
          "talmudFullText": "<b>Rabba raises an objection</b> from a <i>baraita</i>: <b>R' Yehuda says: </b> The <b>daughters of Zelophehad took four parts, as it is stated: “And ten parts fell to Manasseh”</b> (Joshua 17:5). Clearly, this is referring to portions of land, and not simply movable property. <b>Rather, Rabba says: Eretz Yisrael is</b> considered already <b>in possession</b> of one who was entitled to his portion of inheritance land, even before the land was assigned."
        },
        {
          "verseLocation": "Joshua 17:14",
          "verseText": "As it is written: “And the children of Joseph spoke",
          "talmudLocation": "Bava Batra 118a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/118a#section-4",
          "talmudFullText": "The Talmud presents Rav Pappa’s 3rd question: <b>Granted, according to the one who says</b> that Eretz Yisrael was divided <b>among those who left Egypt, this is</b> why <b>the descendants of Joseph cried out</b> in protest of the fact that they would receive an inadequate portion of land due to the fact that they had proliferated greatly in the wilderness. <b>As it is written: “And the children of Joseph spoke</b> to Joshua, saying: Why have you given me but one lot and one part for an inheritance, seeing I am a great people, because YHWH has blessed me thus” (Joshua 17:14). <b>But according to the one who says</b> that Eretz Yisrael was divided <b>among those who entered Eretz</b> Yisrael, <b>what</b> is the reason <b>they were crying out? They</b> were <b>all</b> entitled to <b>take</b> their own portion of land and should have had no cause for complaint."
        },
        {
          "verseLocation": "Joshua 17:15",
          "verseText": "good advice: That a person should be wary of the evil eye. And this is what Joshua said to them, as it is written: “And Joshua said unto them: If you be a great people, go up to the forest,",
          "talmudLocation": "Bava Batra 118a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/118a#section-7",
          "talmudFullText": "The Talmud rejects Abaye’s inference: Generally, the verse would not record an instance where one cried out if his protest was not effective, and <b>there, </b> the verse includes the protest of Joseph’s descendants in order to <b>teach us</b> a measure of <b>good advice: That a person should be wary of the evil eye. And this is what Joshua said to them, as it is written: “And Joshua said unto them: If you be a great people, go up to the forest, </b> and cut down for yourself there in the land of the Perizzites and of the Rephaim” (Joshua 17:15). Joshua <b>said to them: Go and conceal yourselves in the forests so that the evil eye will not have dominion over you. </b>"
        }
      ]
    },
    {
      "chapterNumber": 18,
      "citations": [
        {
          "verseLocation": "Joshua 18:10",
          "verseText": "for them, and he cast a lot for them in Shiloh according to the Lord”",
          "talmudLocation": "Zevachim 119b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/119b#section-2",
          "talmudFullText": "The Talmud comments: <b>Granted, according to the one, </b> i.e., R' Shimon ben Yoḥai, <b>who says this and that</b> are references to <b>Shiloh, </b> each of the designations may be explained: It is called <b>“rest” because</b> during the period of Shiloh they <b>rested from</b> the <b>conquest</b> in the time of Joshua, and it is called <b>“inheritance” because</b> they <b>divided</b> the <b>portions</b> of land among the tribes <b>there, as it is written: “And Joshua divided</b> the land <b>for them, and he cast a lot for them in Shiloh according to YHWH”</b> (Joshua 18:10)."
        },
        {
          "verseLocation": "Joshua 18:11",
          "verseText": "“And went up”",
          "talmudLocation": "Zevachim 54b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/54b#section-5",
          "talmudFullText": "<b>They brought the book of Joshua. With regard to all of</b> the borders of the tribes <b>it is written: “And went down”</b> (see Joshua 15:10, 16:3, 17:9), and it is written: <b>“And the border went up</b> to Beth Hoglah. ” (Joshua 15:6), and: <b>“And the border was drawn</b> from the top of the mountain to the fountain of the waters of Nephtoah” (Joshua 15:9). The verse uses different terms to describe the borders of the portion of each tribe. And <b>with regard to</b> the borders of <b>the tribe of Benjamin it is written</b> only: <b>“And went up”</b> (Joshua 18:11), but it <b>is not written: “And went down. ” They said: Conclude from</b> the verses that the Temple’s <b>place is here, </b> in the portion of Benjamin."
        },
        {
          "verseLocation": "Joshua 18:12",
          "verseText": "“And the border went up",
          "talmudLocation": "Bekhorot 55a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/55a#section-9",
          "talmudFullText": "The Talmud raises a difficulty: But <b>if that is so, </b> should one say that the demarcation of the land allotted to each tribe has the status of a border? Consider the verse: <b>“And the border was drawn</b> and turned about on the west side southward, from the mountain that lies before Beit Horon southward; and its goings out were at Kiriath Ba’al, which is Kiriath Jearim, a city of the children of Judah; this was the west side” (Joshua 18:14). And consider the verse: <b>“And the border went up</b> to the side of Jericho on the north, and went up through the hill country westward; and its goings out were at the wilderness of Beit Aven” (Joshua 18:12). Here <b>also, the verse</b> apparently <b>renders</b> each of these places <b>a border by itself. </b> If so, flocks on either side should not combine for purposes of tithing."
        },
        {
          "verseLocation": "Joshua 18:12",
          "verseText": "“ midbara ”",
          "talmudLocation": "Yevamot 13b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/13b#section-6",
          "talmudFullText": "<b>As it is taught</b> in a <i>baraita</i>: <b>R' Neḥemya says</b> that with regard to <b>any word that requires</b> the letter <b><i>lamed</i> at its beginning, </b> meaning: To, <b>the verse</b> at times <b>placed</b> a letter <b><i>heh</i> at its end, </b> but the meaning is the same. <b>And the school of R' Yishmael taught: For example, </b> the term: To <b>“Elim”</b> (Exodus 16:1) can be rendered as <b>“<i>Elima</i>”</b> (Exodus 15:27) instead of <i>le’Elim</i>; <b>“Maḥanaim”</b> (I Kings 2:8) becomes <b>“<i>Maḥanaima</i>”</b> (II Samuel 17:24); <b>“<i>Mitzraim</i>”</b> (e.g., Genesis 13:1) into <b>“<i>Mitzraima</i>”</b> (Genesis 12:10); Divlatayim is <b>“<i>Divlataima</i>”</b> (Numbers 33:46); to <i>Yerushalaim</i> is <b>“<i>Yerushalaima</i>”</b> (Ezekiel 8:3); and <b>“<i>midbara</i>”</b> (Joshua 18:12) means: To the wilderness [<i>midbar</i>]. All these words that contain the letter <i>heh</i> at the end mean the same as if there were a <i>lamed</i> at the beginning."
        },
        {
          "verseLocation": "Joshua 18:14",
          "verseText": "“And the border was drawn",
          "talmudLocation": "Bekhorot 55a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/55a#section-9",
          "talmudFullText": "The Talmud raises a difficulty: But <b>if that is so, </b> should one say that the demarcation of the land allotted to each tribe has the status of a border? Consider the verse: <b>“And the border was drawn</b> and turned about on the west side southward, from the mountain that lies before Beit Horon southward; and its goings out were at Kiriath Ba’al, which is Kiriath Jearim, a city of the children of Judah; this was the west side” (Joshua 18:14). And consider the verse: <b>“And the border went up</b> to the side of Jericho on the north, and went up through the hill country westward; and its goings out were at the wilderness of Beit Aven” (Joshua 18:12). Here <b>also, the verse</b> apparently <b>renders</b> each of these places <b>a border by itself. </b> If so, flocks on either side should not combine for purposes of tithing."
        },
        {
          "verseLocation": "Joshua 18:20",
          "verseText": "of Rabbi Meir: As the verse states: “And the Jordan was to be its border on the east side.",
          "talmudLocation": "Bekhorot 55a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/55a#section-8",
          "talmudFullText": "<b>Rather, </b> the Talmud retracts its previous explanation. <b>R' Ḥiyya bar Abba says</b> that <b>R' Yoḥanan says: This is the reason</b> for the opinion <b>of R' Meir: As the verse states: “And the Jordan was to be its border on the east side. </b> This was the inheritance of the children of Benjamin, by its borders round about, according to their families” (Joshua 18:20). Here, <b>the verse renders</b> the Jordan River as <b>a border in and of itself. </b>"
        }
      ]
    },
    {
      "chapterNumber": 19,
      "citations": [
        {
          "verseLocation": "Joshua 19:35",
          "verseText": "uncertain about the matter of Tiberias? Isn’t it written: “And the fortified cities were Ziddim-zer, and Hammath, Rakkath, and Chinnereth”",
          "talmudLocation": "Megillah 5b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/5b#section-14",
          "talmudFullText": "§ The Talmud examines <b>the</b> matter <b>itself</b> cited in the previous discussion. <b>Hezekiah read</b> the Megilla <b>in Tiberias</b> both <b>on the fourteenth and on the fifteenth</b> of Adar, because <b>he was uncertain if it</b> had been <b>surrounded by a wall since the days of Joshua, son of Nun, or not. </b> The Talmud asks: <b>Was he</b> really <b>uncertain about the matter of Tiberias? Isn’t it written: “And the fortified cities were Ziddim-zer, and Hammath, Rakkath, and Chinnereth”</b> (Joshua 19:35)<b>, and we maintain</b> that <b>Rakkath is Tiberias? </b> The Talmud answers: <b>This is the reason that he was uncertain: </b> Although Tiberias was surrounded by a wall in the time of Joshua, Hezekiah was uncertain about the <i>halakha</i> <b>due to</b> the fact <b>that</b> on <b>one side, there was a wall of the sea, </b> i.e., there was no physical wall, but the city was protected due to the fact that it adjoined the sea."
        },
        {
          "verseLocation": "Joshua 19:47",
          "verseText": "and called Leshem: Dan, after the name of Dan their father”",
          "talmudLocation": "Bekhorot 55a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/55a#section-17",
          "talmudFullText": "<b>R' Ḥiyya bar Abba says</b> that <b>R' Yoḥanan says: Why is</b> the river <b>called Jordan? Because it descends [<i>yored</i>] from</b> the city of <b>Dan. R' Abba said to Rav Ashi: You learned</b> that the Jordan River emerges from the territory of Dan <b>from there, </b> i.e., from its name. <b>We learn it from here: </b> “And the border of the children of Dan went out from them; and the children of Dan went up and fought against Leshem, and took it, and smote it with the edge of the sword, and possessed it, and dwelt there, <b>and called Leshem: Dan, after the name of Dan their father”</b> (Joshua 19:47). <b>And R' Yitzḥak says</b> that <b>this Leshem</b> is a city that was known in the talmudic period as <b>Pamyas. And it is taught</b> in a <i>baraita</i> that <b>the Jordan</b> River <b>emerges from the Cave of Pamyas. </b>"
        },
        {
          "verseLocation": "Joshua 19:47",
          "verseText": "Leshem”",
          "talmudLocation": "Megillah 6a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/6a#section-15",
          "talmudFullText": "<b>R' Yitzḥak said: </b> “And the children of Dan went up and fought against <b>Leshem”</b> (Joshua 19:47); <b>this is</b> referring to the city that was known in the Talmudic period as <b>Pamyas. “Ekron shall be uprooted”</b> (Zephaniah 2:4); <b>this is</b> referring to <b>Caesarea, the daughter of Edom, which was a metropolis [<i>metropolin</i>], </b> i.e., a capital city, <b>of kings. There are</b> those <b>who say</b> this means <b>that kings were raised there, and there are</b> those <b>who say</b> it means <b>that kings were appointed from there, </b> meaning the kings of Edom were appointed from among the residents of this city."
        },
        {
          "verseLocation": "Joshua 19:50",
          "verseText": "as it is written: “According to the commandment of the Lord they gave him the city that he asked, even Timnath Serah in the hill-country of Ephraim”",
          "talmudLocation": "Bava Batra 122a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/122a#section-12",
          "talmudFullText": "The <i>baraita</i> also states: <b>And</b> the land was <b>divided only by a lottery, as it is stated: “Only by lot</b> shall the land be divided” (Numbers 26:55). The rabbis <b>taught: </b> In the phrase <b>“only by lot, ”</b> the term “only” indicates that <b>Joshua and Caleb</b> are <b>excluded</b> from this proviso. The Talmud asks: With regard <b>to what</b> were they excluded? <b>If we say that</b> they did <b>not take</b> portions <b>at all, now</b> that it has already been taught that they <b>took</b> the portions of the spies (118b) <b>that</b> were <b>not their</b> own, <b>is</b> it <b>necessary</b> to teach that they took <b>their own</b> portions? It goes without saying that they did collect their portions. <b>Rather, </b> the exclusion teaches <b>that</b> they <b>did not take</b> portions <b>by a lottery but according to</b> explicit designation by <b>YHWH. </b> With regard to <b>Joshua, </b> this is <b>as it is written: “According to the commandment of YHWH they gave him the city that he asked, even Timnath Serah in the hill-country of Ephraim”</b> (Joshua 19:50)."
        },
        {
          "verseLocation": "Joshua 19:51",
          "verseText": "distributed for inheritance”",
          "talmudLocation": "Gittin 36b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/36b#section-4",
          "talmudFullText": "<b>R' Eliezer said: </b> The <i>halakha</i> that property declared ownerless by the court is ownerless is derived <b>from here: </b> The verse states: <b>“These are the inheritances, which Eleazar the priest, and Joshua the son of Nun, and the heads of the fathers’ houses</b> of the tribes of the children of Israel <b>distributed for inheritance”</b> (Joshua 19:51). The Talmud asks: <b>What do the heads have to do with the fathers? </b> It comes <b>to tell you: Just as fathers transmit anything that they wish to their children, so too, heads</b> of the nation <b>transmit to the people anything that they wish. </b> This demonstrates that the court has the authority to take property from one person and to give it to another; therefore, the rabbis have the authority to decide that all debts are canceled."
        },
        {
          "verseLocation": "Joshua 19:51",
          "verseText": "from here: “These are the inheritances that Elazar the priest, and Joshua, son of Nun, and the heads of the fathers’ houses of the tribes of the children of Israel distributed for inheritance”",
          "talmudLocation": "Yevamot 89b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/89b#section-12",
          "talmudFullText": "<b>R' Elazar says</b> that the proof that the court can declare property ownerless is <b>from here: “These are the inheritances that Elazar the priest, and Joshua, son of Nun, and the heads of the fathers’ houses of the tribes of the children of Israel distributed for inheritance”</b> (Joshua 19:51). <b>What do heads have to do with fathers? </b> The expression “the heads of the fathers’ houses of the tribes” is unusual and vague. <b>Rather, </b> this comes <b>to tell you: Just as fathers bequeath to their sons anything they want</b> to, <b>so too, </b> the <b>heads, </b> i.e., the leaders and judges of the people, <b>bequeath to the people anything they want</b> to. This shows that the leaders can take property from one individual and give it to another."
        }
      ]
    },
    {
      "chapterNumber": 20,
      "citations": [
        {
          "verseLocation": "Joshua 20:4",
          "verseText": "“And he shall speak his matters in the ears of the elders of that city”",
          "talmudLocation": "Makkot 10b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/10b#section-16",
          "talmudFullText": "§ <b>R' Elazar says: </b> An unintentional murderer <b>is not admitted to a city</b> of refuge <b>whose majority</b> consists of unintentional <b>murderers, as it is stated</b> with regard to an unintentional murderer who fled to a city of refuge: <b>“And he shall speak his matters in the ears of the elders of that city”</b> (Joshua 20:4), indicating that there is some novel element in the matters that he seeks to convey to the elders of the town, <b>but not when their matters are equal to his matters, </b> as those elders made the same statements when they arrived at the city of refuge as unintentional murderers."
        },
        {
          "verseLocation": "Joshua 20:4",
          "verseText": "the elders of the city”",
          "talmudLocation": "Makkot 10b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/10b#section-17",
          "talmudFullText": "<b>And R' Elazar says: </b> An unintentional murderer <b>is not admitted to a city in which there are no elders, as we require</b> the fulfillment of the verse: “And he shall speak in the ears of <b>the elders of the city”</b> (Joshua 20:4), <b>and there are none. It was stated: A city in which there are no elders</b> is the subject of a dispute between <b>R' Ami and R' Asi. One says: </b> An unintentional murderer <b>is admitted</b> there, <b>and one says: </b> An unintentional murderer <b>is not admitted</b> there. The Talmud explains: <b>According to the one who says</b> that an unintentional murderer <b>is not admitted to a city in which there are no elders, </b> his reasoning is due to the fact that <b>we require</b> the presence of <b>the elders of the city and there are none. According to the one who says</b> that an unintentional murderer <b>is admitted</b> there, his reasoning is that he holds that speaking to the elders is <b>merely a mitzva</b> <i>ab initio</i>, but it does not affect the city’s status as a city of refuge."
        }
      ]
    },
    {
      "chapterNumber": 21,
      "citations": [
        {
          "verseLocation": "Joshua 21:12",
          "verseText": "As it is written: “But the fields of the city, and the villages thereof, they gave to Caleb the son of Jephunneh for his possession”",
          "talmudLocation": "Bava Batra 122b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/122b#section-2",
          "talmudFullText": "<b>Caleb</b> also received his portion directly from God and not through the lottery, <b>as it is written: “And they gave Hebron to Caleb, as Moses had spoken; and he drove out from there the three sons of the giant”</b> (Judges 1:20). The Talmud asks about this verse: But <b>Hebron was a city of refuge</b> that belonged to the priests, as described in the book of Joshua (21:13); how could it have been given to Caleb? <b>Abaye said: Its outskirts [<i>parvaraha</i>], </b> i.e., only the fields and vineyards lying beyond the city limits, were given to Caleb. <b>As it is written: “But the fields of the city, and the villages thereof, they gave to Caleb the son of Jephunneh for his possession”</b> (Joshua 21:12)."
        },
        {
          "verseLocation": "Joshua 21:16",
          "verseText": "“Nine cities from those two tribes”",
          "talmudLocation": "Sanhedrin 111b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/111b#section-18",
          "talmudFullText": "R' Yoḥanan <b>raised an objection to</b> the opinion of Reish Lakish from a verse written with regard to the cities designated for the Levites: <b>“Nine cities from those two tribes”</b> (Joshua 21:16). <b>What, is it not</b> that those nine cities were equally divided; <b>four-and-a-half from this</b> tribe, <b>and four-and-a-half from that</b> tribe, <b>and conclude from it</b> that <b>one divides one city into</b> the tribal territory of <b>two tribes? </b> The Talmud rejects that proof: <b>No, </b> those nine cities were divided in this manner: <b>Four</b> cities <b>from this</b> tribe <b>and five</b> cities <b>from that</b> tribe."
        }
      ]
    },
    {
      "chapterNumber": 22,
      "citations": [
        {
          "verseLocation": "Joshua 22:30",
          "verseText": "heard",
          "talmudLocation": "Zevachim 101b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/101b#section-11",
          "talmudFullText": "<b>Rav Ashi said: </b> Pinehas did not become a priest <b>until he made peace among the tribes</b> at the time of the conquest of Eretz Yisrael, when the tribes east of the Jordan River built their own altar and nearly provoked a civil war. Before this, Pinehas was always referred to as: Son of Elazar the priest, but during this incident he is himself referred to as a priest for the first time, <b>as it is stated: “And Pinehas the priest, and the princes of the congregation, and the heads of the thousands of Israel</b> that were with him, <b>heard</b> the words that the children of Reuben and the children of Gad and the children of Manasseh spoke, and it pleased them well” (Joshua 22:30)."
        }
      ]
    },
    {
      "chapterNumber": 24,
      "citations": [
        {
          "verseLocation": "Joshua 24:26",
          "verseText": "“And Joshua wrote these matters in the scroll of the Torah of God”",
          "talmudLocation": "Makkot 11a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/11a#section-5",
          "talmudFullText": "The Talmud cites an additional dispute with regard to the portion of the cities of refuge in the book of Joshua. It is written: <b>“And Joshua wrote these matters in the scroll of the Torah of God”</b> (Joshua 24:26). <b>R' Yehuda and R' Neḥemya disagree with regard to this</b> matter. <b>One says: </b> The reference is to the final <b>eight verses</b> in the Torah that record the death of Moses and were recorded by Joshua in the scroll of the Torah, in addition to the rest of the Torah that was written by Moses (see <i>Bava Batra</i> 15a). <b>And one says: </b> The reference is to the portion of the <b>cities of refuge</b> that appears in the book of Joshua."
        },
        {
          "verseLocation": "Joshua 24:29",
          "verseText": "“And Joshua, son of Nun, the servant of the Lord, died”",
          "talmudLocation": "Bava Batra 15a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15a#section-7",
          "talmudFullText": "It is stated in the <i>baraita</i> that <b>Joshua wrote his own book. </b> The Talmud asks: <b>But isn’t it written</b> toward the end of the book: <b>“And Joshua, son of Nun, the servant of YHWH, died”</b> (Joshua 24:29)? Is it possible that Joshua wrote this? The Talmud answers: Aaron’s son <b>Eleazar completed it. </b> The Talmud asks: <b>But isn’t it</b> also <b>written: “And Eleazar, son of Aaron, died”</b> (Joshua 24:33)? The Talmud answers: <b>Pinehas completed it. </b>"
        },
        {
          "verseLocation": "Joshua 24:30",
          "verseText": "Serah”",
          "talmudLocation": "Bava Batra 122b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/122b#section-1",
          "talmudFullText": "The Talmud interjects: <b>It is written</b> concerning Joshua’s burial: “And they buried him in the border of his inheritance in Timnath <b>Serah”</b> (Joshua 24:30), <b>and it is written: </b> “And they buried him in the border of his inheritance in Timnath <b>Heres”</b> (Judges 2:9). Why is the name changed? <b>R' Elazar says: Initially, its fruits</b> were as dry <b>as clay [<i>keḥeres</i>], and ultimately, its fruits</b> were so plump that they were <b>spoiling [<i>masriḥin</i>]. And there are</b> those <b>who say</b> the opposite: <b>Initially, </b> the fruits were <b>spoiling</b> prematurely, <b>and ultimately, </b> they lasted as long <b>as clay</b> without spoiling."
        },
        {
          "verseLocation": "Joshua 24:30",
          "verseText": "scholar, it is fitting to bury him alive, as it is stated: “And they buried him in the border of his inheritance in Timnat-seraḥ, which is in the hill-country of Ephraim, on the north of the mountain of Ga’ash”",
          "talmudLocation": "Shabbat 105b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/105b#section-10",
          "talmudFullText": "Apropos the laws of mourning for an upright person and a Torah scholar, the Talmud cites that which <b>R' Shimon ben Pazi said</b> that <b>R' Yehoshua ben Levi said in the name of Bar Kappara: Anyone who sheds tears over an upright person, God counts</b> his tears <b>and places them in His treasury, as it is stated: “You have counted my wanderings, put my tears into your bottle, are they not in your book? ”</b> (Psalms 56:9). <b>Rav Yehuda said</b> that <b>Rav said: Anyone who is lazy in eulogizing a</b> Torah <b>scholar, it is fitting to bury him alive, as it is stated: “And they buried him in the border of his inheritance in Timnat-seraḥ, which is in the hill-country of Ephraim, on the north of the mountain of Ga’ash”</b> (Joshua 24:30). This <b>teaches that the mountain raged against them to kill them</b> because they did not eulogize him appropriately. <b>R' Ḥiyya bar Abba said</b> that <b>R' Yoḥanan said: Whoever is lazy in eulogizing a Sage does not live</b> a <b>long</b> life, and his punishment is <b>measure for measure. </b> Since he was unconcerned with the death of the Sage, in the heavens they will be unconcerned with his death. God conducts Himself in this manner, <b>as it is stated: “In full measure [<i>besase’a</i>], when You send her away You contend with her”</b> (Isaiah 27:8), and the rabbis derived that God punishes from the words: “You contend with her,” and He does so measure for measure, <i>se’a</i> for <i>se’a</i>, from the word <i>sase’a</i> in the verse above."
        },
        {
          "verseLocation": "Joshua 24:32",
          "verseText": "“And the bones of Joseph, which the children of Israel brought up out of Egypt, they buried in Shechem”",
          "talmudLocation": "Sotah 13b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/13b#section-2",
          "talmudFullText": "The Talmud asks: <b>And if Moses had not dealt with</b> the burial of Joseph, <b>would the Jewish people not have dealt with it? But isn’t it written</b> that after Moses died: <b>“And the bones of Joseph, which the children of Israel brought up out of Egypt, they buried in Shechem”</b> (Joshua 24:32), which indicates that the Jewish people completed the burial of Joseph? <b>And furthermore, if the Jewish people had not dealt with</b> Joseph’s burial, <b>would his children not have dealt with it? But isn’t it written</b> in that same verse: <b>“And they became the inheritance of the children of Joseph, ”</b> as Joseph was buried in Shechem, which was then given to his descendants? Therefore, the question arises: Why did Joseph’s descendants initially leave the task of his burial to the Jewish people and Moses?"
        },
        {
          "verseLocation": "Joshua 24:32",
          "verseText": "they buried in Shechem,",
          "talmudLocation": "Sotah 13b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/13b#section-4",
          "talmudFullText": "In the aforementioned verse it states: “And the bones of Joseph, which the children of Israel brought up out of Egypt, <b>they buried in Shechem, </b> in the parcel of ground that Jacob bought from the sons of Hamor the father of Shechem for a hundred pieces of money” (Joshua 24:32). The Talmud asks: <b>What is different about Shechem</b> that they specifically chose to bury Joseph there? <b>R' Ḥama ben Ḥanina, says</b> that the Jewish people said: His brothers <b>kidnapped him from Shechem</b> (see Genesis 37:12–28), <b>and to Shechem we should return his lost</b> body."
        },
        {
          "verseLocation": "Joshua 24:32",
          "verseText": "“And the bones of Joseph, which the children of Israel brought up",
          "talmudLocation": "Sotah 13b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/13b#section-5",
          "talmudFullText": "The Talmud comments: <b>The verses contradict each other, </b> as <b>it is written: “And Moses took the bones of Joseph with him”</b> (Exodus 13:19), <b>and it is written</b> elsewhere: <b>“And the bones of Joseph, which the children of Israel brought up</b> out of Egypt” (Joshua 24:32). Who in fact took Joseph’s bones?"
        },
        {
          "verseLocation": "Joshua 24:33",
          "verseText": "states: “And Elazar, the son of Aaron, died; and they buried him in the Hill of Pinehas his son,",
          "talmudLocation": "Bava Batra 111b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/111b#section-14",
          "talmudFullText": "R' Yishmael continues: <b>And</b> the verse in the Prophets <b>states: “And Elazar, the son of Aaron, died; and they buried him in the Hill of Pinehas his son, </b> which was given him in Mount Ephraim” (Joshua 24:33). <b>And from where</b> did <b>Pinehas have</b> land <b>that</b> his father, <b>Elazar, did not have? Rather, </b> this <b>teaches that Pinehas married a woman</b> who inherited her father’s land, <b>and she died and he inherited</b> from <b>her</b> so that he had his own land. This also indicates that a husband inherits from his wife."
        },
        {
          "verseLocation": "Joshua 24:33",
          "verseText": "“And Elazar, the son of Aaron, died”",
          "talmudLocation": "Bava Batra 112a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/112a#section-4",
          "talmudFullText": "<b>And if you would say</b> that this verse is also concerned with the transfer of the inheritance by means of the son, and that the seemingly superfluous verse is stated for another purpose, i.e., in order to establish that a woman who inherited land from her father and marries a man from another tribe <b>violates for that</b> act <b>two prohibitions and a positive mitzva; </b> therefore, <b>come</b> and <b>hear</b> another proof that a husband inherits from his wife, from the verse: <b>“And Elazar, the son of Aaron, died”</b> (Joshua 24:33)."
        },
        {
          "verseLocation": "Joshua 24:33",
          "verseText": "And it is stated: “And Elazar, the son of Aaron, died; and they buried",
          "talmudLocation": "Bava Batra 113a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/113a#section-7",
          "talmudFullText": "<b>And it is stated: “And Elazar, the son of Aaron, died; and they buried</b> him in the Hill of Pinehas his son” (Joshua 24:33). <b>From where</b> did <b>Pinehas have</b> land <b>that</b> his father, <b>Elazar, did not have? </b> Rather, this <b>teaches that Elazar married a woman and she died in the lifetime of her</b> potential <b>legators, and her legators</b> then <b>died, and Pinehas</b> her son, not Elazar her husband, <b>inherited</b> the property from <b>her. </b>"
        },
        {
          "verseLocation": "Joshua 24:33",
          "verseText": "the verse states: “And Elazar, the son of Aaron, died;",
          "talmudLocation": "Bava Batra 113a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/113a#section-8",
          "talmudFullText": "<b>And what</b> is the meaning of: <b>And it is stated? </b> Why is it necessary to provide an additional proof beyond the first verse? The Talmud explains. <b>And if you would say: </b> In the verse concerning Seguv and Yair, it is <b>Yair, </b> not Seguv, <b>who married a woman and she died and he inherited</b> from <b>her, </b> and he did not inherit from his mother, <b>the verse states: “And Elazar, the son of Aaron, died; </b> and they buried him in the Hill of Pinehas his son” (Joshua 24:33), teaching that Pinehas inherited the land of those from whom his mother inherited, and Elazar did not. <b>And if you would say that</b> this land <b>came into</b> the possession of Pinehas <b>as a dedicated field, </b> as he was a priest, and he did not inherit it from his mother, <b>the verse states: “His son, ”</b> indicating that it was <b>an inheritance that was fitting for him, </b> i.e., Elazar, had his wife not predeceased her legators, <b>and his son inherited it. </b>"
        },
        {
          "verseLocation": "Joshua 24:33",
          "verseText": "written: “And Eleazar, son of Aaron, died”",
          "talmudLocation": "Bava Batra 15a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15a#section-7",
          "talmudFullText": "It is stated in the <i>baraita</i> that <b>Joshua wrote his own book. </b> The Talmud asks: <b>But isn’t it written</b> toward the end of the book: <b>“And Joshua, son of Nun, the servant of YHWH, died”</b> (Joshua 24:29)? Is it possible that Joshua wrote this? The Talmud answers: Aaron’s son <b>Eleazar completed it. </b> The Talmud asks: <b>But isn’t it</b> also <b>written: “And Eleazar, son of Aaron, died”</b> (Joshua 24:33)? The Talmud answers: <b>Pinehas completed it. </b>"
        }
      ]
    }
  ]
}