{
  "bookName": "Judges",
  "totalEntries": 146,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Judges 1:5",
          "verseText": "as it is written: “And they found Adoni-bezek",
          "talmudLocation": "Yoma 22b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-3",
          "talmudFullText": "<b>Rav Ashi strongly objects to this</b> interpretation of the verse: <b>From where</b> do you derive <b>that this</b> word <b><i>bezek</i> is a term</b> related to the verb meaning <b>to break apart, </b> so that it means shards? <b>Perhaps it is the name of a town, </b> and it means that Saul counted them in Bezek, <b>as it is written: “And they found Adoni-bezek</b> in Bezek” (Judges 1:5), which shows that Bezek is the name of a place. The Talmud answers: Indeed, the proof is not from that verse <b>but from here, </b> where it says: <b>“And Saul summoned the people and numbered them by sheep”</b> (I Samuel 15:4), meaning that Saul tallied his soldiers by having each one take a sheep and put it aside to represent him in the count."
        },
        {
          "verseLocation": "Judges 1:11",
          "verseText": "from here: “Now the name of Debir [ devir ] beforehand was Kiriath Sefer”",
          "talmudLocation": "Avodah Zarah 24b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/24b#section-19",
          "talmudFullText": "§ Apropos the mention of the term <i>devir</i>, the Talmud discusses its etymology. <b>Rav said: On what</b> basis <b>do the Persians call a book [<i>sifra</i>]</b> by the term <b><i>devir</i>? </b> They derive it <b>from here: “Now the name of Debir [<i>devir</i>] beforehand was Kiriath Sefer”</b> (Judges 1:11). Since the name <i>devir</i> was changed to Kiriath Sefer, the Persians referred to a <i>sifra</i>, i.e., a book, as <i>devir</i>."
        },
        {
          "verseLocation": "Judges 1:13",
          "verseText": "brother, took it”",
          "talmudLocation": "Sotah 11b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11b#section-24",
          "talmudFullText": "The Talmud asks: <b>But</b> it is <b>still</b> difficult. Hezron could not be his father, as Caleb <b>was</b> the <b>son of Kenaz, as it is written: “And Othniel, the son of Kenaz, Caleb’s</b> younger <b>brother, took it”</b> (Judges 1:13). This would mean that Caleb was also a son of Kenaz. <b>Rava said: </b> Caleb <b>was the stepson of Kenaz, </b> as he and Othniel shared a mother but had different fathers."
        },
        {
          "verseLocation": "Judges 1:16",
          "verseText": "“And the children of the Kenite, Moses’ father-in-law, went up from the city of the palm trees with the children of Judah into the wilderness of Judah, which is in the south of Arad; and they went and dwelt with the people”",
          "talmudLocation": "Sanhedrin 104a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104a#section-2",
          "talmudFullText": "<b>And</b> the fact that it <b>draws near the distant</b> is derived <b>from Yitro, as R' Yoḥanan says: In reward</b> for Yitro telling his daughters: <b>“Call him, that he may eat bread”</b> (Exodus 2:20), inviting Moses to join them for a meal, Yitro’s <b>descendants were privileged and sat</b> as scribes in session with the Sanhedrin <b>in the Chamber of Hewn Stone. As it is stated: “And the families of the scribes who dwelt in Jabez; the Tirathites, the Shimeathites, the Sucathites. These were the Kenites who came of Hammath, father of the house of Rechab”</b> (I Chronicles 2:55). <b>And it is written there</b> with regard to the identity of the Kenites: <b>“And the children of the Kenite, Moses’ father-in-law, went up from the city of the palm trees with the children of Judah into the wilderness of Judah, which is in the south of Arad; and they went and dwelt with the people”</b> (Judges 1:16)."
        },
        {
          "verseLocation": "Judges 1:16",
          "verseText": "“And the children of the Kenite, Moses’ father-in-law, went up from the city of the palm trees”",
          "talmudLocation": "Sanhedrin 106a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106a#section-4",
          "talmudFullText": "The Talmud comments: <b>And that is what R' Ḥiyya bar Abba says</b> that <b>R' Simai says: Three were</b> associates <b>in that counsel, and they are: Balaam, Job, and Yitro. Balaam, who advised</b> to drown the newborn males, <b>was killed. Job, who was silent</b> and was reluctant to express his opinion, <b>was sentenced to</b> suffer <b>afflictions. And Yitro, who fled</b> after he disagreed with that counsel and Pharaoh sought to kill him, <b>his descendants were privileged to sit</b> as scribes in session with the Sanhedrin <b>in the Chamber of Hewn Stone, as it is stated: “And the families of the scribes who dwelt in Jabez; the Tirathites, the Shimeathites, the Sucathites. These were the Kenites who came of Hammath the father of the house of Rechab”</b> (I Chronicles 2:55). <b>And it is written there</b> with regard to the identity of the Kenites: <b>“And the children of the Kenite, Moses’ father-in-law, went up from the city of the palm trees”</b> (Judges 1:16)."
        },
        {
          "verseLocation": "Judges 1:16",
          "verseText": "And it is written: “The children of the Kenite, Moses’ father-in-law”",
          "talmudLocation": "Sotah 11a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11a#section-13",
          "talmudFullText": "R' Ḥiyya bar Abba teaches what occurred to each of them: <b>Balaam, who advised</b> Pharaoh to kill all sons born to the Jewish people, <b>was</b> punished by being <b>killed</b> in the war with Midian (see Numbers 31:8). <b>Job, who was silent</b> and neither advised nor protested, <b>was punished by suffering, </b> as detailed in the eponymous book in the Bible. <b>Yitro, who ran away</b> as a sign of protest, <b>merited that</b> some <b>of his children’s children sat</b> in the Sanhedrin <b>in the Chamber of Hewn Stone, as it is stated: “And the families of scribes who dwelt at Jabez, Tirathites, Shimeathites, and Sucathites, these were the Kenites who descended from Hammath, the father of the house of Rechab”</b> (I Chronicles 2:55). <b>And it is written: “The children of the Kenite, Moses’ father-in-law”</b> (Judges 1:16). This teaches that the Kenites, descendants of Yitro, the father-in-law of Moses, dwelt at Jabez [Yabetz], referring to the place where the Jewish people go for advice [<i>eitza</i>], i.e., the Chamber of Hewn Stone."
        },
        {
          "verseLocation": "Judges 1:20",
          "verseText": "as it is written: “And they gave Hebron to Caleb, as Moses had spoken; and he drove out from there the three sons of the giant”",
          "talmudLocation": "Bava Batra 122b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/122b#section-2",
          "talmudFullText": "<b>Caleb</b> also received his portion directly from God and not through the lottery, <b>as it is written: “And they gave Hebron to Caleb, as Moses had spoken; and he drove out from there the three sons of the giant”</b> (Judges 1:20). The Talmud asks about this verse: But <b>Hebron was a city of refuge</b> that belonged to the priests, as described in the book of Joshua (21:13); how could it have been given to Caleb? <b>Abaye said: Its outskirts [<i>parvaraha</i>], </b> i.e., only the fields and vineyards lying beyond the city limits, were given to Caleb. <b>As it is written: “But the fields of the city, and the villages thereof, they gave to Caleb the son of Jephunneh for his possession”</b> (Joshua 21:12)."
        },
        {
          "verseLocation": "Judges 1:20",
          "verseText": "And is Hebron a city of refuge? But isn’t it written: “And they gave Hebron to Caleb, as Moses had spoken”",
          "talmudLocation": "Makkot 10a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/10a#section-5",
          "talmudFullText": "The Talmud asks: <b>And is Hebron a city of refuge? But isn’t it written: “And they gave Hebron to Caleb, as Moses had spoken”</b> (Judges 1:20)? This indicates that Hebron belonged to Caleb from the tribe of Judah, and it was not a Levite city. <b>Abaye said: Its suburbs [<i>parvadaha</i>]</b> were given to Caleb; the city itself was a city of priests, <b>as it is written</b> in the context of the distribution of the Levite cities: “And they gave them Kiryat Arba…which is Hebron…<b>and the field of the city and its courtyards they gave to Caleb, son of Jephunneh”</b> (Joshua 21:11–12)."
        },
        {
          "verseLocation": "Judges 1:21",
          "verseText": "But isn’t it written: “And the children of Benjamin did not drive out the Jebusites who inhabited Jerusalem; but the Jebusites dwelt with the children of Benjamin in Jerusalem, to this day”",
          "talmudLocation": "Yoma 54a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54a#section-2",
          "talmudFullText": "<b>Rabba said to Ulla: From where</b> in this verse may it <b>be inferred</b> that the Ark was buried in its place? Ulla replied that the source is <b>as it is written: “And they are there to this day, ”</b> which is referring to any day when one might read this sentence, i.e., forever. Rabba objected to this explanation: <b>And</b> is it the case that <b>anywhere that it is written “to this day” it</b> means <b>forever, </b> as opposed to the time when the verse was written? <b>But isn’t it written: “And the children of Benjamin did not drive out the Jebusites who inhabited Jerusalem; but the Jebusites dwelt with the children of Benjamin in Jerusalem, to this day”</b> (Judges 1:21)? <b>So too here, </b> let us say <b>that</b> the Jebusites <b>were not exiled</b> from Jerusalem."
        },
        {
          "verseLocation": "Judges 1:24",
          "verseText": "“And the watchers saw a man come out of the city, and they said to him: Show us, please, the entrance into the city, and we will deal kindly with you”",
          "talmudLocation": "Sotah 46b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/46b#section-10",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i>: <b>R' Meir would say: There is coercion with regard to accompaniment, </b> i.e., one who does not want to accompany another is nevertheless required to do so, <b>as the reward for accompaniment is without measure. </b> The proof of the importance of accompaniment is from a verse, <b>as it is stated</b> with regard to when the Jewish people laid siege to the city of Bethel: <b>“And the watchers saw a man come out of the city, and they said to him: Show us, please, the entrance into the city, and we will deal kindly with you”</b> (Judges 1:24), <b>and it is written: “And he showed them the entrance to the city”</b> (Judges 1:25). <b>And what kindness did they perform with him? </b> It is <b>that they killed the entire city by the sword, but that man and his family they sent</b> free."
        },
        {
          "verseLocation": "Judges 1:25",
          "verseText": "and it is written: “And he showed them the entrance to the city”",
          "talmudLocation": "Sotah 46b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/46b#section-10",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i>: <b>R' Meir would say: There is coercion with regard to accompaniment, </b> i.e., one who does not want to accompany another is nevertheless required to do so, <b>as the reward for accompaniment is without measure. </b> The proof of the importance of accompaniment is from a verse, <b>as it is stated</b> with regard to when the Jewish people laid siege to the city of Bethel: <b>“And the watchers saw a man come out of the city, and they said to him: Show us, please, the entrance into the city, and we will deal kindly with you”</b> (Judges 1:24), <b>and it is written: “And he showed them the entrance to the city”</b> (Judges 1:25). <b>And what kindness did they perform with him? </b> It is <b>that they killed the entire city by the sword, but that man and his family they sent</b> free."
        },
        {
          "verseLocation": "Judges 1:26",
          "verseText": "“And the man went to the land of the Hittites, and he built a city, and he called its name Luz; that is its name to this day”",
          "talmudLocation": "Sotah 46b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/46b#section-11",
          "talmudFullText": "The Talmud elaborates on the reward received in that story. The next verse states: <b>“And the man went to the land of the Hittites, and he built a city, and he called its name Luz; that is its name to this day”</b> (Judges 1:26). <b>It is taught</b> in a <i>baraita</i>: This <b>is</b> the city <b>Luz where sky blue</b> wool <b>is dyed. </b> It <b>is</b> the same city <b>Luz where, </b> although <b>Sennacherib came</b> and exiled many nations from place to place, he <b>did not disarrange</b> and exile <b>its</b> inhabitants; <b>Nebuchadnezzar, </b> who conquered many lands, <b>did not destroy it; and even the angel of death has no permission to pass through it. Rather, its Elders, when they have decided that they have reached the end</b> of life, <b>go outside the</b> city <b>wall and die. </b>"
        },
        {
          "verseLocation": "Judges 1:27",
          "verseText": "of Eretz Yisrael? But isn’t it written: “And Manasseh did not drive out the inhabitants of Beth She’an and its towns, nor of Taanach and its towns”",
          "talmudLocation": "Chullin 7a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/7a#section-4",
          "talmudFullText": "<b>Yehuda ben Shimon ben Pazi, objects to</b> the basic <i>halakha</i>: <b>And is there anyone who says that Beit She’an is not</b> part <b>of Eretz Yisrael? But isn’t it written: “And Manasseh did not drive out the inhabitants of Beth She’an and its towns, nor of Taanach and its towns”</b> (Judges 1:27)."
        },
        {
          "verseLocation": "Judges 1:30",
          "verseText": "territory of Zebulun, as it is written: “Neither did Zebulun drive out the inhabitants of Kitron, nor the inhabitants of Nahalol”",
          "talmudLocation": "Megillah 6a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/6a#section-6",
          "talmudFullText": "The Talmud asks: <b>Is Kitron</b> really <b>Tzippori? Wasn’t Kitron in the</b> tribal <b>territory of Zebulun, as it is written: “Neither did Zebulun drive out the inhabitants of Kitron, nor the inhabitants of Nahalol”</b> (Judges 1:30)? <b>And</b> the tribe of <b>Zebulun was resentful of its portion, as it is stated: “Zebulun was a people that jeopardized their lives to the death”</b> (Judges 5:18). <b>What is the reason</b> for their resentfulness? <b>Because “Naphtali was on the high places of the field”</b> (Judges 5:18)."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Judges 2:7",
          "verseText": "“And the nation worshipped the Lord all the days of Joshua and all the days of the Elders, who lived many days after Joshua”",
          "talmudLocation": "Shabbat 105b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/105b#section-11",
          "talmudFullText": "<b>R' Ḥiyya bar Abba raised an objection to R' Yoḥanan: </b> It is stated: <b>“And the nation worshipped YHWH all the days of Joshua and all the days of the Elders, who lived many days after Joshua”</b> (Judges 2:7), indicating that the Elders lived long lives even though they did not eulogize Joshua properly. R' Yoḥanan <b>said to him: Babylonian, </b> you should be more precise in your reading. They indeed lived <b>many days; </b> however, they did <b>not</b> live <b>many years. </b> In fact, they did not live to the end of that year. Again he asked: <b>But then</b> with regard to the verse <b>“So that your days and the days of your children will multiply</b> on the land which YHWH your God swore to give to your fathers, as the days of the heavens over the earth” (Deuteronomy 11:21), would you also say that here the reward is to live many <b>days but not years? </b> He answered him: <b>A blessing is different</b> and should be interpreted in its most expansive sense."
        },
        {
          "verseLocation": "Judges 2:9",
          "verseText": "Heres”",
          "talmudLocation": "Bava Batra 122b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/122b#section-1",
          "talmudFullText": "The Talmud interjects: <b>It is written</b> concerning Joshua’s burial: “And they buried him in the border of his inheritance in Timnath <b>Serah”</b> (Joshua 24:30), <b>and it is written: </b> “And they buried him in the border of his inheritance in Timnath <b>Heres”</b> (Judges 2:9). Why is the name changed? <b>R' Elazar says: Initially, its fruits</b> were as dry <b>as clay [<i>keḥeres</i>], and ultimately, its fruits</b> were so plump that they were <b>spoiling [<i>masriḥin</i>]. And there are</b> those <b>who say</b> the opposite: <b>Initially, </b> the fruits were <b>spoiling</b> prematurely, <b>and ultimately, </b> they lasted as long <b>as clay</b> without spoiling."
        },
        {
          "verseLocation": "Judges 2:9",
          "verseText": "in Timnath-heres [ ḥeres ]”",
          "talmudLocation": "Megillah 14b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-11",
          "talmudFullText": "Furthermore, <b>Rav Naḥman said: Huldah was a descendant of Joshua. </b> An allusion to this <b>is written here: </b> “Huldah the prophetess, the wife of Shallum, the son of Tikvah, <b>the son of Harhas [<i>ḥarḥas</i>]”</b> (II Kings 22:14), <b>and it says elsewhere</b> with regard to Joshua: “And they buried him in the border of his inheritance <b>in Timnath-heres [<i>ḥeres</i>]”</b> (Judges 2:9), therefore intimating that there is a certain connection between them."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Judges 3:2",
          "verseText": "“Only that the generations of the children of Israel might know, to teach them war”",
          "talmudLocation": "Avodah Zarah 25a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/25a#section-14",
          "talmudFullText": "The Talmud provides yet another explanation: <b>R' Shmuel bar Naḥmani says</b> that the book of Yashar <b>is the book of Judges. And why did they call it the book of Yashar? As it is written: “In those days there was no king in Israel; every man did that which was right [<i>yashar</i>] in his own eyes”</b> (Judges 17:6). <b>And where is it alluded</b> to in Judges that Judah must be taught to use the bow? The verse states: <b>“Only that the generations of the children of Israel might know, to teach them war”</b> (Judges 3:2). <b>What is</b> the form of <b>warfare that requires teaching? You must say</b> that <b>this is</b> referring to the use of <b>a bow. </b> This is the referent of the verse in Samuel."
        },
        {
          "verseLocation": "Judges 3:20",
          "verseText": "“And Ehud came to him, and he was sitting by himself alone in his cool upper chamber. And Ehud said: I have a message from God [ Elohim ] to you. And he arose out of his seat”",
          "talmudLocation": "Sanhedrin 60a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/60a#section-12",
          "talmudFullText": "The Talmud asks: <b>From where do we</b> derive that the judges must <b>stand? R' Yitzḥak bar Ami says: </b> It is derived from that <b>which the verse states</b> about Eglon: <b>“And Ehud came to him, and he was sitting by himself alone in his cool upper chamber. And Ehud said: I have a message from God [<i>Elohim</i>] to you. And he arose out of his seat”</b> (Judges 3:20). <b>And are</b> these <b>matters not</b> inferred <b><i>a fortiori</i>? And if Eglon, king of Moab, who was a non-Jew and knew</b> the name of God <b>only by an appellation, stood</b> in honor, <b>all the more so</b> must <b>a Jew</b> stand if he hears <b>the ineffable name. </b>"
        },
        {
          "verseLocation": "Judges 3:24",
          "verseText": "“Surely he is covering his feet [ raglav ] in the cabinet of the cool chamber”",
          "talmudLocation": "Yevamot 103a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/103a#section-16",
          "talmudFullText": "<b>Come</b> and <b>hear</b> the meaning of: His feet, from the following verse regarding the Moabite king, Eglon, which states: <b>“Surely he is covering his feet [<i>raglav</i>] in the cabinet of the cool chamber”</b> (Judges 3:24). The Talmud answers: This is <b>a euphemism. </b> The Talmud attempts another proof from a verse regarding Sisera’s encounter with Yael: <b>“At her feet [<i>ragleha</i>]</b> he sunk, he fell” (Judges 5:27), which indicates that they had sex, and implies that <i>regel</i> includes the thigh. The Talmud answers: This is also <b>a euphemism. </b>"
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Judges 4:4",
          "verseText": "“And Deborah, a prophetess, the wife of Lappidoth”",
          "talmudLocation": "Megillah 14a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14a#section-16",
          "talmudFullText": "<b>Deborah</b> was a prophetess, <b>as it is written</b> explicitly: <b>“And Deborah, a prophetess, the wife of Lappidoth”</b> (Judges 4:4). The Talmud asks: <b>What is</b> the meaning of <b>“the wife of Lappidoth”? </b> The Talmud answers: <b>For she used to make wicks for the Sanctuary, </b> and due to the flames [<i>lappidot</i>] on these wicks she was called the wife of Lappidoth, literally, a woman of flames."
        },
        {
          "verseLocation": "Judges 4:5",
          "verseText": "“And she sat under a palm tree”",
          "talmudLocation": "Megillah 14a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14a#section-17",
          "talmudFullText": "With regard to Deborah, it says: <b>“And she sat under a palm tree”</b> (Judges 4:5). The Talmud asks: <b>What is different</b> and unique with regard to her sitting <b>“under a palm tree”</b> that there is a need for it to be written? <b>R' Shimon ben Avshalom said: </b> It is <b>due to</b> the prohibition against <b>being alone together</b> with a man. Since men would come before her for judgment, she established for herself a place out in the open and visible to all, in order to avoid a situation in which she would be secluded with a man behind closed doors. <b>Alternatively, </b> the verse means: <b>Just as a palm tree has only one heart, </b> as a palm tree does not send out separate branches, but rather has only one main trunk, <b>so too, the Jewish people in that generation had only one heart, </b> directed <b>to their Father in Heaven. </b>"
        },
        {
          "verseLocation": "Judges 4:6",
          "verseText": "the hornet, it is written: “And she sent and called Barak”",
          "talmudLocation": "Megillah 14b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-10",
          "talmudFullText": "An additional point is mentioned with regard to the prophetesses. <b>Rav Naḥman said: Haughtiness is not befitting a woman. </b> And a proof to this is that <b>there were two haughty women, whose names were</b> identical to the names of <b>loathsome</b> creatures. <b>One, </b> Deborah, <b>was called a hornet, </b> as her Hebrew name, Devorah, means hornet; <b>and one, </b> Huldah, <b>was called a marten, </b> as her name is the Hebrew term for that creature. From where is it known that they were haughty? <b>With regard to</b> Deborah, <b>the hornet, it is written: “And she sent and called Barak”</b> (Judges 4:6), <b>but she herself did not go to him. </b> And <b>with regard to</b> Huldah, <b>the marten, it is written: “Say to the man</b> that sent you to me” (II Kings 22:15), <b>but she did not say: Say to the king. </b>"
        },
        {
          "verseLocation": "Judges 4:8",
          "verseText": "“And Barak said to her: If you will go with me, then I will go; but if you will not go with me, I will not go”",
          "talmudLocation": "Bava Kamma 92b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/92b#section-16",
          "talmudFullText": "<b>Rava said to Rabba bar Mari: From where is this matter</b> derived <b>whereby people say: If you lift the load</b> with me <b>I will lift</b> it, <b>and if</b> you will <b>not</b> lift it with me <b>I won’t lift</b> it? Rabba bar Mari <b>said to him</b> that the source is <b>as it is written</b> with regard to Barak and Deborah concerning the war of Sisera: <b>“And Barak said to her: If you will go with me, then I will go; but if you will not go with me, I will not go”</b> (Judges 4:8)."
        },
        {
          "verseLocation": "Judges 4:13",
          "verseText": "whereas, with regard to Sisera, it is written: “Nine hundred iron chariots”",
          "talmudLocation": "Pesachim 118b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/118b#section-5",
          "talmudFullText": "The Talmud asks: <b>What is</b> this <b>one and a half</b> times <b>their</b> number? How was God’s promise fulfilled? The Talmud answers: <b>While, with regard to Pharaoh, it is written: “Six hundred chosen chariots”</b> (Exodus 14:7), <b>whereas, with regard to Sisera, it is written: “Nine hundred iron chariots”</b> (Judges 4:13)."
        },
        {
          "verseLocation": "Judges 4:19",
          "verseText": "as it is written: “And she opened the bottle of milk, and gave him to drink”",
          "talmudLocation": "Niddah 55b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/55b#section-21",
          "talmudFullText": "The <i>baraita</i> teaches that in the case of a <i>zav</i> or <i>zava</i>, the tears of their eyes and the blood from their wounds, as well as the milk of a <i>zava</i>, all transmit the ritual impurity of liquids. The Talmud cites the source for these cases of impurity: <b>The tears of his eye</b> are classified as a liquid, <b>as it is written: </b> “You have fed them with the bread of tears, <b>and given them tears to drink in great measure”</b> (Psalms 80:6). <b>And</b> the <b>blood from his wound</b> is classified as a liquid, <b>as it is written: “And he shall drink the blood of the slain”</b> (Numbers 23:24). Although the verse is referring to the blood of a dead person, and not to the blood of a wound, <b>what</b> difference does it make <b>to me</b> if one <b>killed all of him, </b> and <b>what</b> difference does it make <b>to me</b> if one <b>killed part of him, </b> i.e., wounded him? With regard to the <b>milk of a woman, </b> it too is classified as a liquid, <b>as it is written: “And she opened the bottle of milk, and gave him to drink”</b> (Judges 4:19)."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Judges 5:2",
          "verseText": "rip his sentence, as it is stated: “When punishments are annulled in Israel, when the people offer themselves, bless the Lord”",
          "talmudLocation": "Shabbat 119b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/119b#section-5",
          "talmudFullText": "Apropos the reward for honoring Shabbat, the Talmud cites statements about the reward for answering amen. <b>R' Yehoshua ben Levi said</b> that <b>anyone who answers: Amen, may His great name be blessed, </b> wholeheartedly, <b>with all his might, </b> they <b>rip his sentence, as it is stated: “When punishments are annulled in Israel, when the people offer themselves, bless YHWH”</b> (Judges 5:2). <b>What is the reason for when punishments are annulled? Because</b> the Jewish people <b>blessed God. </b> When one recites: Amen, may His great name be blessed, and blesses God, his punishment is annulled. <b>R' Ḥiyya bar Abba</b> said that <b>R' Yoḥanan said: Even</b> if <b>one has within him a trace of idolatry, </b> when he answers amen <b>he is forgiven. It is written here, </b> in the verse above: <b>“When punishments [<i>pera’ot</i>] are annulled. ” And it is written there, </b> with regard to the sin of the Golden Calf: “And Moses saw <b>that</b> the nation <b>was wild [<i>paru’a</i>], </b> for Aaron had let them loose for anyone who might rise against them” (Exodus 32:25). Even one with the wildness of idolatry is forgiven. <b>Reish Lakish said: One who answers amen with all his strength, they open the gates of the Garden of Eden before him, as it is stated: “Open the gates, and a righteous nation shall come who keeps the faith”</b> (Isaiah 26:2). <b>Do not read: Who keeps [<i>shomer</i>] the faith [<i>emunim</i>], but rather: Who say [<i>she’omerim</i>] amen. What</b> is the allusion of the word <b><i>amen</i>? R' Ḥanina said: </b> It is an acronym of the words: <b>God, faithful King [<i>El Melekh ne’eman</i>]. </b>"
        },
        {
          "verseLocation": "Judges 5:7",
          "verseText": "from Deborah, as it is written: “The villagers ceased, they ceased in Israel, until I, Deborah, arose, I arose a mother in Israel”",
          "talmudLocation": "Pesachim 66b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/66b#section-6",
          "talmudFullText": "With regard to the incident with Hillel, <b>Rav Yehuda said that Rav said: Anyone who acts haughtily, if he is a</b> Torah <b>scholar, his wisdom departs from him; </b> and <b>if he is a prophet, his prophecy departs from him. </b> The Talmud explains: That <b>if he is a</b> Torah <b>scholar, his wisdom departs from him</b> is learned <b>from Hillel, for the Master said</b> in this <i>baraita</i>: Hillel <b>began to rebuke them with words. </b> Because he acted haughtily, he ended up <b>saying to them: I</b> once <b>heard this <i>halakha</i>, but I have forgotten</b> it, as he was punished for his haughtiness by forgetting the law. That <b>if he is a prophet his prophecy departs from him</b> is learned <b>from Deborah, as it is written: “The villagers ceased, they ceased in Israel, until I, Deborah, arose, I arose a mother in Israel”</b> (Judges 5:7). For these words of self-glorification, Deborah was punished with a loss of her prophetic spirit, <b>as it is written</b> later that it was necessary to say to her: <b>“Awake, awake, Deborah; awake, awake, utter a song”</b> (Judges 5:12), because her prophecy had left her."
        },
        {
          "verseLocation": "Judges 5:10",
          "verseText": "that which is written: “You that ride on white donkeys, you that sit on rich cloths, and you that walk by the way, tell of it”",
          "talmudLocation": "Eruvin 54b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/54b#section-5",
          "talmudFullText": "In further praise of the Torah and those who study it, a Sage <b>of the school of Rav Anan taught: What is</b> the meaning of <b>that which is written: “You that ride on white donkeys, you that sit on rich cloths, and you that walk by the way, tell of it”</b> (Judges 5:10)? <b>“You that ride on white donkeys”; these are Torah scholars, who travel from city to city and from province to province to study Torah. “White [<i>tzeḥorot</i>]”</b> are those <b>who make it</b> clear <b>as noon</b> [<b><i>tzahorayim</i></b>], i.e., who make the Torah comprehensible. <b>“You that sit on couches [<i>midin</i>]”</b> refers to those <b>who judge [<i>danin</i>] an absolutely true judgment. “And you that walk”; these are the masters of Bible, </b> who are the least important of the scholars. <b>“By the way”; these are the</b> more important <b>masters of Mishnah. “Tell of it”; these are the masters of Talmud, </b> the most important of all, <b>as all their conversation is</b> about <b>matters of Torah. </b>"
        },
        {
          "verseLocation": "Judges 5:11",
          "verseText": "which is written: “The righteous acts of His rulers [ pirzono ] in Israel”",
          "talmudLocation": "Pesachim 87b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-18",
          "talmudFullText": "<b>R' Oshaya said: What is</b> the meaning of that <b>which is written: “The righteous acts of His rulers [<i>pirzono</i>] in Israel”</b> (Judges 5:11)? <b>God performed a charitable deed toward Israel</b> in <b>that He scattered them [<i>pizran</i>] among the nations; </b> had He exiled them to one place, they could have all been destroyed at once. <b>And this</b> concept <b>is that which a certain apostate said to R' Ḥanina: We</b> non-Jews <b>are superior to you</b> Jews in that we have patience. <b>It is written of you: “For</b> Joab and all Israel <b>remained there six months</b> until he had cut off every male in Edom” (I Kings 11:16), <b>whereas we, </b> although <b>you have been with us for several years, are not doing anything to you. He said to him: </b> With <b>your consent, let one student deal with your</b> assertion and answer you."
        },
        {
          "verseLocation": "Judges 5:12",
          "verseText": "“Awake, awake, Deborah; awake, awake, utter a song”",
          "talmudLocation": "Pesachim 66b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/66b#section-6",
          "talmudFullText": "With regard to the incident with Hillel, <b>Rav Yehuda said that Rav said: Anyone who acts haughtily, if he is a</b> Torah <b>scholar, his wisdom departs from him; </b> and <b>if he is a prophet, his prophecy departs from him. </b> The Talmud explains: That <b>if he is a</b> Torah <b>scholar, his wisdom departs from him</b> is learned <b>from Hillel, for the Master said</b> in this <i>baraita</i>: Hillel <b>began to rebuke them with words. </b> Because he acted haughtily, he ended up <b>saying to them: I</b> once <b>heard this <i>halakha</i>, but I have forgotten</b> it, as he was punished for his haughtiness by forgetting the law. That <b>if he is a prophet his prophecy departs from him</b> is learned <b>from Deborah, as it is written: “The villagers ceased, they ceased in Israel, until I, Deborah, arose, I arose a mother in Israel”</b> (Judges 5:7). For these words of self-glorification, Deborah was punished with a loss of her prophetic spirit, <b>as it is written</b> later that it was necessary to say to her: <b>“Awake, awake, Deborah; awake, awake, utter a song”</b> (Judges 5:12), because her prophecy had left her."
        },
        {
          "verseLocation": "Judges 5:14",
          "verseText": "and it is written: “Out of Machir came down governors”",
          "talmudLocation": "Yevamot 62b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/62b#section-7",
          "talmudFullText": "<b>Rather, </b> the proof is <b>from here: “And afterward Hezron went in to the daughter of Machir, the father of Gilead…and she bore him Segub”</b> (I Chronicles 2:21), <b>and it is written: “Out of Machir came down governors”</b> (Judges 5:14), <b>and it is written: “Judah is my governor”</b> (Psalms 60:9). Consequently, the governors, who were from the tribe of Judah, were also called the sons of Machir, who was from the tribe of Manasseh. This must be because they were the children of Machir’s daughter and Hezron, indicating that grandchildren are considered like children."
        },
        {
          "verseLocation": "Judges 5:16",
          "verseText": "as it is stated: “Among the divisions of Reuben there were major resolves of heart”",
          "talmudLocation": "Gittin 89b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/89b#section-2",
          "talmudFullText": "<b>A rumor circulated that a certain woman was betrothed to a minor boy who looked like an adult, </b> as his body was developed like an adult. <b>Rav Mordekhai said to Rav Ashi: There was a precedent in which</b> the rabbis <b>said</b> that there is no concern that people will think that the woman is betrothed, since the boy <b>did not yet reach the divisions of Reuben, </b> i.e., the competence of adulthood, <b>as it is stated: “Among the divisions of Reuben there were major resolves of heart”</b> (Judges 5:16). Therefore, the betrothal is rendered entirely invalid, and there is no concern of slander."
        },
        {
          "verseLocation": "Judges 5:18",
          "verseText": "Zebulun was resentful of its portion, as it is stated: “Zebulun was a people that jeopardized their lives to the death”",
          "talmudLocation": "Megillah 6a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/6a#section-6",
          "talmudFullText": "The Talmud asks: <b>Is Kitron</b> really <b>Tzippori? Wasn’t Kitron in the</b> tribal <b>territory of Zebulun, as it is written: “Neither did Zebulun drive out the inhabitants of Kitron, nor the inhabitants of Nahalol”</b> (Judges 1:30)? <b>And</b> the tribe of <b>Zebulun was resentful of its portion, as it is stated: “Zebulun was a people that jeopardized their lives to the death”</b> (Judges 5:18). <b>What is the reason</b> for their resentfulness? <b>Because “Naphtali was on the high places of the field”</b> (Judges 5:18)."
        },
        {
          "verseLocation": "Judges 5:20",
          "verseText": "For all that is in the heaven and in the earth is Yours; this is the war of Sisera, as it is stated: “They fought from heaven, the stars in their courses",
          "talmudLocation": "Berakhot 58a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58a#section-16",
          "talmudFullText": "R' Sheila <b>said: Since a miracle was performed on my behalf with this verse</b> that I cited, <b>I will interpret it homiletically: Yours, O Lord, is the greatness; that is the act of creation, and so it says: “Who does great things past finding out”</b> (Job 9:10); <b><b>And the power; that is the exodus from Egypt, as it is stated: “And Israel saw the great work</b> which YHWH did to the <b>Egyptians”</b> (Exodus 14:31); <b><b>And the glory; that is the sun and the moon that stood still for Joshua, as it is stated: “And the sun stood still, and the moon stayed, </b> until the nation had avenged themselves of their enemies” (Joshua 10:13); <b><b>And the triumph; that is the downfall of Rome, and so it says</b> describing the downfall of Edom, whom the rabbis identified as the forefather of Rome: <b>“Their lifeblood is dashed against My garments</b> and I have stained all My raiment” (Isaiah 63:3); <b><b>And the majesty; this is the war of the valleys of Arnon, as it is stated: “Wherefore it is said in the book of the Wars of YHWH: Vahev in Sufa, </b> and the valleys of Arnon” (Numbers 21:14); <b><b>For all that is in the heaven and in the earth is Yours; this is the war of Sisera, as it is stated: “They fought from heaven, the stars in their courses</b> fought against Sisera” (Judges 5:20). <b><b>Yours is the kingdom, O Lord; this is the war of Amalek, and so it says: </b> “And he said: <b>The hand upon the throne of YHWH: </b> YHWH will have war with Amalek from generation to generation” (Exodus 17:16), as then God will sit on His throne. <b><b>And you are exalted; this is the war of Gog and Magog, and so it says: “I am against you, O Gog, the chief prince of Meshekh and Tubal”</b> (Ezekiel 38:3); and:<br><b>As head above all; Rav Ḥanan bar Rava said</b> that <b>R' Yoḥanan said: </b> All leadership and authority, <b>even</b> the most insignificant, the <b>one responsible for distributing water, is appointed by heaven. </b>"
        },
        {
          "verseLocation": "Judges 5:20",
          "verseText": "as it is stated: “The stars fought from heaven;",
          "talmudLocation": "Moed Katan 16a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16a#section-8",
          "talmudFullText": "<b>And Ulla said: Barak ostracized Meroz with</b> the blowing of <b>four hundred <i>shofarot</i></b> due to his failure to come. As for the identification of Meroz, <b>some say</b> that <b>he was a great man</b> and that he was ostracized because he did not join in the war effort. <b>And others say</b> that the reference is to <b>a star</b> and not a human being, and that it did not aid the Jewish people in their battle, <b>as it is stated: “The stars fought from heaven; </b> in their courses they fought against Sisera,” (Judges 5:20). This star, which did not help the Jewish people, was cursed."
        },
        {
          "verseLocation": "Judges 5:20",
          "verseText": "as it is written: “They fought from heaven, the stars",
          "talmudLocation": "Pesachim 118b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/118b#section-6",
          "talmudFullText": "The Talmud relates: <b>When Sisera came</b> to fight Israel, <b>he came upon them with iron spears, </b> whereupon <b>God removed the stars from their orbits</b> to fight <b>against</b> Sisera’s army, <b>as it is written: “They fought from heaven, the stars</b> in their courses fought against Sisera” (Judges 5:20). <b>Since the stars fell on them, these iron spears heated up</b> and <b>they went to cool them and wash themselves in the Kishon River. </b>"
        },
        {
          "verseLocation": "Judges 5:20",
          "verseText": "as it is stated: “They fought from heaven; the stars in their courses fought against Sisera”",
          "talmudLocation": "Sanhedrin 96a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/96a#section-4",
          "talmudFullText": "§ Apropos the war between the kings and Abraham mentioned above, the Talmud explains a verse: “And he pursued as far as Dan. <b>And he divided himself against them by night [<i>laila</i>], he and his servants, and smote them”</b> (Genesis 14:14–15). The term “by night” [<i>laila</i>] appears out of place in this verse. <b>R' Yoḥanan says: That angel that happened to</b> come and assist <b>Abraham</b> in that war, <b>Laila is his name, as it is stated: “And Laila said: A man-child is brought forth”</b> (Job 3:3), indicating that there is an angel named Laila. <b>And R' Yitzḥak Nappaḥa says: </b> God <b>performed for him an act of night, </b> i.e., the stars in heaven waged war on his behalf, <b>as it is stated: “They fought from heaven; the stars in their courses fought against Sisera”</b> (Judges 5:20). <b>Reish Lakish said: </b> The statement of R' Yitzḥak Nappaḥa, <b>the smith, is preferable to</b> the statement <b>of the son of the smith, </b> R' Yoḥanan."
        },
        {
          "verseLocation": "Judges 5:21",
          "verseText": "Immediately, the Kishon River swept them away and cast them into the sea, as it is stated: “The Kishon River swept them away, that ancient river”",
          "talmudLocation": "Pesachim 118b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/118b#section-7",
          "talmudFullText": "At this point, <b>God said to the Kishon River: Go and pay your guarantee</b> that you issued to the ministering angel of the sea. <b>Immediately, the Kishon River swept them away and cast them into the sea, as it is stated: “The Kishon River swept them away, that ancient river”</b> (Judges 5:21). <b>What is</b> the meaning of the expression: <b>“ancient river”? </b> The Talmud explains: This is referring to <b>the river that was appointed a guarantor from ancient</b> times. <b>At that time, the fish of the sea began</b> praising God <b>and recited: “And the truth of YHWH endures forever, ”</b> in reference to God’s fulfillment of the promise He issued centuries earlier."
        },
        {
          "verseLocation": "Judges 5:23",
          "verseText": "As it is written: “Curse Meroz”",
          "talmudLocation": "Moed Katan 16a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16a#section-6",
          "talmudFullText": "<b>And from where do we</b> derive <b>that we ostracize</b> one who does not obey a court summons? <b>As it is written: “Curse Meroz”</b> (Judges 5:23), who was ostracized for not coming to battle after having been summoned. From where is it derived that the ostracized person must be told <b>that it</b> was <b>the decision of a great man</b> to ostracized him? <b>As it is written: </b> “Curse Meroz, <b>said the messenger of YHWH”</b> (Judges 5:23). <b>And from where do we</b> derive <b>that, </b> if he fails to mend his ways, <b>we excommunicate</b> such a person more harshly, putting him under the most severe form of excommunication? <b>As it is written: </b> “Curse Meroz…<b>curse bitterly</b> its inhabitants” (Judges 5:23), implying that one curse is followed by another, i.e., lesser ostracism is followed by harsh excommunication."
        },
        {
          "verseLocation": "Judges 5:23",
          "verseText": "its inhabitants”",
          "talmudLocation": "Moed Katan 16a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16a#section-7",
          "talmudFullText": "From where is it derived <b>that</b> the curse applies to anyone who <b>eats or drinks with, or stands within, four cubits of</b> the ostracized person? <b>As it is written: </b> “Curse bitterly <b>its inhabitants”</b> (Judges 5:23), in reference to all those sitting together with Meroz. <b>And from where do we</b> derive <b>that we detail his sin in public? As it is written: </b> “Curse bitterly its inhabitants, <b>because they did not come to the help of YHWH”</b> (Judges 5:23)."
        },
        {
          "verseLocation": "Judges 5:23",
          "verseText": "“Curse [ oru ] Meroz, said the angel of God; cursed with a curse [ oru aror ] are its inhabitants”",
          "talmudLocation": "Shevuot 36a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/36a#section-4",
          "talmudFullText": "The Talmud elaborates: There is an element of <b>ostracism within it, as it is written</b> in the song of Deborah: <b>“Curse [<i>oru</i>] Meroz, said the angel of God; cursed with a curse [<i>oru aror</i>] are its inhabitants”</b> (Judges 5:23). <b>And Ulla says: With</b> blasts from <b>four hundred <i>shofarot</i>, Barak ostracized</b> the city of <b>Meroz, </b> indicating that the term <i>arur</i> has the connotation of ostracism."
        },
        {
          "verseLocation": "Judges 5:24",
          "verseText": "not for its own sake, as it is stated: “Blessed above women shall be Yael, the wife of Heber the Kenite, above women in the tent shall she be blessed”",
          "talmudLocation": "Horayot 10b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/10b#section-15",
          "talmudFullText": "§ <b>And Ulla says: Tamar engaged in licentiousness</b> with Judah (see Genesis, chapter 38), <b>and Zimri engaged in licentiousness</b> with Cozbi (see Numbers 25:6–9). <b>Tamar engaged in licentiousness, </b> and <b>kings and prophets emerged from her. Zimri engaged in licentiousness, </b> and <b>tens of thousands from the Jewish people fell. Rav Naḥman bar Yitzḥak says: A transgression</b> performed <b>for the sake of</b> Heaven <b>is greater than a mitzva</b> performed <b>not for its own sake, as it is stated: “Blessed above women shall be Yael, the wife of Heber the Kenite, above women in the tent shall she be blessed”</b> (Judges 5:24). <b>Who are</b> these <b>“women in the tent”? </b> They are <b>Sarah, Rebecca, Rachel, and Leah, </b> and Yael is more blessed than they are. Apparently, a mitzva performed not for its own sake is a negative phenomenon."
        },
        {
          "verseLocation": "Judges 5:24",
          "verseText": "as it is written: “Blessed above women shall Yael be, the wife of Hever the Kenite, above women in the tent she shall be blessed”",
          "talmudLocation": "Nazir 23b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/23b#section-6",
          "talmudFullText": "<b>Rather, </b> one must emend the above statement and <b>say</b> as follows: A transgression for the sake of Heaven is <b>equivalent to a mitzva not for its own sake. </b> The proof is <b>as it is written: “Blessed above women shall Yael be, the wife of Hever the Kenite, above women in the tent she shall be blessed”</b> (Judges 5:24), and it is taught: <b>Who are</b> these <b>“women in the tent? ”</b> They are <b>Sarah, Rebecca, Rachel, and Leah. </b> Yael’s forbidden sex with Sisera for the sake of Heaven is compared to the sex in which the Matriarchs engaged."
        },
        {
          "verseLocation": "Judges 5:24",
          "verseText": "“Blessed above women Jael, wife of Heber the Kenite; blessed is she more than the women [ minashim ] in the tent”",
          "talmudLocation": "Sanhedrin 105b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105b#section-14",
          "talmudFullText": "He explains: <b>As if you do not say so</b> and do not explain it in this manner, then the verse: <b>“Blessed above women Jael, wife of Heber the Kenite; blessed is she more than the women [<i>minashim</i>] in the tent”</b> (Judges 5:24), is difficult. <b>“The women in the tent, ” who are they? </b> They are <b>Sarah, Rebecca, Rachel, and Leah. Is it proper conduct to speak in that manner</b> about the Matriarchs? <b>Rather, of the nature</b> of the Matriarchs is what the verse <b>says, </b> not greater. <b>So too</b> in the case of David’s servants: <b>Of the nature</b> of his throne, is what the verse <b>says. </b>"
        },
        {
          "verseLocation": "Judges 5:26",
          "verseText": "states: “Her hand [ yadah ] she put to the tent pin, and her right hand [ viminah ] to the workmen’s hammer”",
          "talmudLocation": "Menachot 36b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/36b#section-11",
          "talmudFullText": "§ <b>A baraita states</b> with regard to the verse: “And it shall be for a sign for you on <b>your arm [<i>yadkha</i>]”</b> (Exodus 13:9), that <b>this</b> is referring to the <b>left</b> arm. <b>Do you say</b> it means the <b>left</b> arm, <b>or is it only</b> the <b>right</b> arm? <b>The verse states: “Even My hand [<i>yadi</i>] has laid the foundation of the earth, and My right hand [<i>vimini</i>] has spread out the heavens”</b> (Isaiah 48:13). <b>And</b> another verse <b>states: “Her hand [<i>yadah</i>] she put to the tent pin, and her right hand [<i>viminah</i>] to the workmen’s hammer”</b> (Judges 5:26), <b>and</b> another verse <b>states: “Why do You withdraw Your hand [<i>yadkha</i>], even Your right hand [<i>viminekha</i>]? Draw it out of Your bosom and consume them”</b> (Psalms 74:11). All these verses employ the term <i>yad</i> with regard to the left hand, and use the term <i>yamin</i>, literally, right, without the term <i>yad</i>, to indicate the right hand."
        },
        {
          "verseLocation": "Judges 5:27",
          "verseText": "at that time, as it is stated: “Between her legs he crouched, he fell, he lay;",
          "talmudLocation": "Horayot 10b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/10b#section-17",
          "talmudFullText": "Apropos Yael, <b>R' Yoḥanan says: That wicked</b> man Sisera <b>performed seven</b> acts of <b>sex</b> with Yael <b>at that time, as it is stated: “Between her legs he crouched, he fell, he lay; </b> between her legs he crouched, he fell; where he crouched, there he fell dead” (Judges 5:27). Each of the seven verbs is a euphemism for sex. The Talmud asks: <b>But didn’t she experience pleasure from</b> the <b>transgression</b> of having sex with Sisera? Why does the verse praise her? <b>R' Yoḥanan says in the name of R' Shimon ben Yoḥai: Even the good</b> provided <b>by the wicked is bad for the righteous, </b> so Yael did not experience any pleasure from her sex with Sisera."
        },
        {
          "verseLocation": "Judges 5:27",
          "verseText": "at that time, as it is stated: “Between her feet he sunk, he fell, he lay;",
          "talmudLocation": "Nazir 23b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/23b#section-7",
          "talmudFullText": "The Talmud asks: How is it derived that Yael had sex with Sisera? As <b>R' Yoḥanan said: That wicked one, </b> Sisera, <b>engaged in seven acts of sex</b> with Yael <b>at that time, as it is stated: “Between her feet he sunk, he fell, he lay; </b> between her feet he sunk, he fell; where he sunk, there he fell down dead” (Judges 5:27). Each mention of falling is referring to another act of sex."
        },
        {
          "verseLocation": "Judges 5:27",
          "verseText": "he sunk, he fell, he lay”",
          "talmudLocation": "Sanhedrin 105b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105b#section-1",
          "talmudFullText": "<b>he sunk, he fell, he lay”</b> (Judges 5:27), which is interpreted as a reference to sex between Sisera and Jael."
        },
        {
          "verseLocation": "Judges 5:27",
          "verseText": "“At her feet [ ragleha ]",
          "talmudLocation": "Yevamot 103a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/103a#section-16",
          "talmudFullText": "<b>Come</b> and <b>hear</b> the meaning of: His feet, from the following verse regarding the Moabite king, Eglon, which states: <b>“Surely he is covering his feet [<i>raglav</i>] in the cabinet of the cool chamber”</b> (Judges 3:24). The Talmud answers: This is <b>a euphemism. </b> The Talmud attempts another proof from a verse regarding Sisera’s encounter with Yael: <b>“At her feet [<i>ragleha</i>]</b> he sunk, he fell” (Judges 5:27), which indicates that they had sex, and implies that <i>regel</i> includes the thigh. The Talmud answers: This is also <b>a euphemism. </b>"
        },
        {
          "verseLocation": "Judges 5:27",
          "verseText": "seven times that day, as it is stated: “At her feet he sunk, he fell, he lay; at her feet he sunk, he fell; where he sunk, there he fell down dead”",
          "talmudLocation": "Yevamot 103a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/103a#section-17",
          "talmudFullText": "The Talmud elaborates on what happened when Sisera was in Yael’s tent. <b>R' Yoḥanan said: That wicked</b> man, Sisera, <b>had</b> sexual <b>sex</b> with Yael <b>seven times that day, as it is stated: “At her feet he sunk, he fell, he lay; at her feet he sunk, he fell; where he sunk, there he fell down dead”</b> (Judges 5:27). Each instance of the terms “sunk,” “fell,” or “lay” in the verse indicates an act of sex, as Yael sought to tire and weaken Sisera to enable her to kill him. The Talmud asks: <b>But</b> how could Yael do this even for the noble purpose of killing the wicked Sisera, as <b>she derived pleasure from</b> the <b>transgression</b> of licentious sexual sex with a non-Jew? <b>R' Yoḥanan said in the name of R' Shimon ben Yoḥai: Every</b> act that is a <b>benefit for the wicked</b>"
        },
        {
          "verseLocation": "Judges 5:28",
          "verseText": "is written about the mother of Sisera: “Through the window she looked forth and wailed [ vateyabev ], the mother of Sisera”",
          "talmudLocation": "Rosh Hashanah 33b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/33b#section-10",
          "talmudFullText": "<b>Abaye said: In this</b> matter, the <i>tanna’im</i> <b>certainly disagree. </b> Although the first <i>baraita</i> can be reconciled with the Mishnah, this second <i>baraita</i> clearly reflects a dispute. <b>As it is written: “It is a day of sounding [<i>terua</i>]</b> the <i>shofar</i> <b>to you”</b> (Numbers 29:1), <b>and we translate</b> this verse in Aramaic as: <b>It is a day of <i>yevava</i> to you. And</b> to define a <i>yevava</i>, the Talmud quotes a verse that <b>is written about the mother of Sisera: “Through the window she looked forth and wailed [<i>vateyabev</i>], the mother of Sisera”</b> (Judges 5:28). One <b>Sage, </b> the <i>tanna</i> of the <i>baraita</i>, <b>holds</b> that this means <b>moanings, </b> broken sighs, as in the blasts called <i>shevarim</i>. <b>And</b> one <b>Sage, </b> the <i>tanna</i> of the Mishnah, <b>holds</b> that it means <b>whimpers, </b> as in the short blasts called <i>teruot</i>."
        },
        {
          "verseLocation": "Judges 5:31",
          "verseText": "“But let them that love Him be as the sun when it comes out in its might”",
          "talmudLocation": "Bava Batra 8b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/8b#section-15",
          "talmudFullText": "In light of the praises heaped upon judges, tax collectors, and schoolteachers, the Talmud asks: <b>And what</b> was said about <b>the rabbis? Ravina said</b> that about them it is stated: <b>“But let them that love Him be as the sun when it comes out in its might”</b> (Judges 5:31)."
        },
        {
          "verseLocation": "Judges 5:31",
          "verseText": "suffering, about them the verse states: “And they that love Him are as the sun going forth in its might”",
          "talmudLocation": "Gittin 36b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/36b#section-13",
          "talmudFullText": "The Talmud continues discussing the meaning of the word <i>ulbena</i>. <b>A baraita states: Those who are insulted [<i>ne’elavin</i>] but do not insult</b> others, <b>who hear their shame but do not respond, who act out of love and are joyful in</b> their <b>suffering, about them the verse states: “And they that love Him are as the sun going forth in its might”</b> (Judges 5:31)."
        },
        {
          "verseLocation": "Judges 5:31",
          "verseText": "are insulted and do not insult, who hear their shame and do not respond, who act out of love and are joyful in suffering, the verse says: “And they that love Him are as the sun going forth in its might”",
          "talmudLocation": "Shabbat 88b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/88b#section-2",
          "talmudFullText": "<b>R' Shmuel bar Naḥamani said</b> that <b>R' Yonatan said: What is</b> the meaning of that <b>which is written: “You have ravished my heart, my sister, my bride; you have ravished my heart with one of your eyes, </b> with one bead of your necklace” (Song of Songs 4:9)? <b>At first</b> when you, the Jewish people, merely accepted the Torah upon yourselves it was <b>with one of your eyes; </b> however, <b>when you</b> actually <b>perform</b> the mitzvot it will be <b>with both of your eyes. Ulla said</b> with regard to the sin of the Golden Calf: <b>Insolent is the bride who is promiscuous under her wedding canopy. Rav Mari, son of the daughter of Shmuel, said: What verse</b> alludes to this? <b>“While the king was still at his table my spikenard</b> gave off its fragrance” (Song of Songs 1:12). Its pleasant odor dissipated, leaving only an offensive odor. <b>Rav said: </b> Nevertheless, it is apparent from the verse that <b>the affection</b> of God, <b>is still upon us, as it is written</b> euphemistically as “<b>gave off</b> its fragrance,” <b>and</b> the verse <b>did not write, it reeked. </b> And <b>A baraita states: About</b> those who <b>are insulted and do not insult, who hear their shame and do not respond, who act out of love and are joyful in suffering, the verse says: “And they that love Him are as the sun going forth in its might”</b> (Judges 5:31)."
        },
        {
          "verseLocation": "Judges 5:31",
          "verseText": "suffering, about them the verse states: “They that love Him be as the sun when it goes forth in its might”",
          "talmudLocation": "Yoma 23a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/23a#section-3",
          "talmudFullText": "The Talmud asks: <b>But</b> does the prohibition against vengeance really <b>not</b> relate also to matters of <b>personal anguish</b> suffered by someone? <b>Wasn’t</b> it <b>taught</b> in a <i>baraita</i>: <b>Those who are insulted but do not insult</b> others, <b>who hear themselves</b> being <b>shamed but do not respond, who act out of love</b> for God, <b>and who</b> remain <b>happy in</b> their <b>suffering, about them the verse states: “They that love Him be as the sun when it goes forth in its might”</b> (Judges 5:31). This <i>baraita</i> shows that one should forgive personal insults as well as wrongs in monetary matters."
        },
        {
          "verseLocation": "Judges 5:31",
          "verseText": "he should follow it down and kill it? He said to them: “So may all your enemies perish, Lord”",
          "talmudLocation": "Yoma 66b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/66b#section-8",
          "talmudFullText": "The students continued to question R' Eliezer: <b>If he pushed</b> the goat <b>and it did not die</b> upon its fall, <b>what is</b> the <i>halakha</i> with regard to whether <b>he should follow it down and kill it? He said to them: “So may all your enemies perish, Lord”</b> (Judges 5:31). In other words, the goat will certainly die on its own. R' Eliezer did not wish to answer these questions, as will be explained below. However, <b>the rabbis say: </b> If the goat <b>became ill, </b> the escort <b>carries it on his shoulder. If the one sending out</b> the goat <b>became ill, he sends</b> the goat <b>with someone else. If he pushes it and it does not die, he follows it down and kills it. </b>"
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "Judges 6:3",
          "verseText": "grain inside his house, as the Jewish people were characterized as poor only over matters of grain, as it is stated: “And it was, if Israel sowed,",
          "talmudLocation": "Bava Metzia 59a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/59a#section-10",
          "talmudFullText": "<b>And Rav Ḥinnana bar Pappa says: A person must always be careful about</b> ensuring that there is <b>grain inside his house, as the Jewish people were characterized as poor only over matters of grain, as it is stated: “And it was, if Israel sowed, </b> and Midian and the children of the east ascended” (Judges 6:3); <b>and it is written: “And they encamped against them</b> and they destroyed the crops of the land” (Judges 6:4); <b>and it is</b> further <b>written: “And Israel was greatly impoverished due to Midian”</b> (Judges 6:6)."
        },
        {
          "verseLocation": "Judges 6:4",
          "verseText": "and it is written: “And they encamped against them",
          "talmudLocation": "Bava Metzia 59a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/59a#section-10",
          "talmudFullText": "<b>And Rav Ḥinnana bar Pappa says: A person must always be careful about</b> ensuring that there is <b>grain inside his house, as the Jewish people were characterized as poor only over matters of grain, as it is stated: “And it was, if Israel sowed, </b> and Midian and the children of the east ascended” (Judges 6:3); <b>and it is written: “And they encamped against them</b> and they destroyed the crops of the land” (Judges 6:4); <b>and it is</b> further <b>written: “And Israel was greatly impoverished due to Midian”</b> (Judges 6:6)."
        },
        {
          "verseLocation": "Judges 6:6",
          "verseText": "written: “And Israel was greatly impoverished due to Midian”",
          "talmudLocation": "Bava Metzia 59a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/59a#section-10",
          "talmudFullText": "<b>And Rav Ḥinnana bar Pappa says: A person must always be careful about</b> ensuring that there is <b>grain inside his house, as the Jewish people were characterized as poor only over matters of grain, as it is stated: “And it was, if Israel sowed, </b> and Midian and the children of the east ascended” (Judges 6:3); <b>and it is written: “And they encamped against them</b> and they destroyed the crops of the land” (Judges 6:4); <b>and it is</b> further <b>written: “And Israel was greatly impoverished due to Midian”</b> (Judges 6:6)."
        },
        {
          "verseLocation": "Judges 6:12",
          "verseText": "and said to him, God is with you, mighty man of valor”",
          "talmudLocation": "Berakhot 54a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/54a#section-9",
          "talmudFullText": "The rabbis also <b>instituted that one should greet another in the name</b> of God, i.e., one should mention God’s name in his greeting, <b>as it is stated: “And presently Boaz came from Bethlehem and said to the harvesters, YHWH is with you, and they said to him, May YHWH bless you”</b> (Ruth 2:4). <b>And it says: </b> “And the angel of God appeared to him <b>and said to him, God is with you, mighty man of valor”</b> (Judges 6:12). <b>And it says: “And despise not your mother when she is old”</b> (Proverbs 23:22), i.e., one must not neglect customs which he inherits. <b>And</b> lest you say that mentioning God’s name is prohibited, <b>it says: “It is time to work for YHWH; they have made void Your Torah”</b> (Psalms 119:126), i.e., it is occasionally necessary to negate biblical precepts in order to perform God’s will, and greeting another is certainly God’s will. <b>R' Natan says</b> another interpretation of the verse: <b>“Make void Your Torah” because “it is the time to work for YHWH, ”</b> i.e., occasionally it is necessary to negate biblical precepts in order to bolster the Torah."
        },
        {
          "verseLocation": "Judges 6:12",
          "verseText": "“The Lord is with you, mighty man of valor”",
          "talmudLocation": "Berakhot 63a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/63a#section-7",
          "talmudFullText": "The Talmud explains: <b>And if you say: Boaz said this on his own, </b> and it proves nothing with regard to normative practice, <b>come and hear</b> a proof from the verse: <b>“YHWH is with you, mighty man of valor”</b> (Judges 6:12). <b>And if you say</b> that <b>it was an angel who said</b> this <b>to Gideon, </b> that perhaps this verse was the angel informing Gideon that YHWH is with him, but it is not the standard formula of a greeting, <b>come</b> and <b>hear</b> proof from the verse: <b>“And despise not your mother when she is old”</b> (Proverbs 23:22); the customs of the nation’s elders are an adequate source from which to derive <i>halakha</i>."
        },
        {
          "verseLocation": "Judges 6:12",
          "verseText": "The Lord is with you, mighty man of valor”",
          "talmudLocation": "Makkot 23b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/23b#section-10",
          "talmudFullText": "<b>And greeting</b> another with the name of God is derived from a verse, <b>as it is written: “And presently Boaz came from Bethlehem and said to the harvesters: YHWH is with you, and they said to him: May YHWH bless you”</b> (Ruth 2:4). <b>And it states: </b> “And the angel of YHWH appeared to him and said to him: <b>YHWH is with you, mighty man of valor”</b> (Judges 6:12). The Talmud asks: <b>What</b> is the reason that the Talmud cites the additional source about Gideon, introduced with the phrase: <b>And it states? </b> Why was the proof from Boaz’s statement to the harvesters insufficient? The Talmud explains: <b>And if you would say: It is Boaz who did</b> so <b>on his own, and from Heaven they did not agree with him; come</b> and <b>hear</b> proof, <b>and it says: “YHWH is with you, mighty man of valor. ”</b> The angel greeted Gideon with the name of God, indicating that there is agreement in Heaven that this is an acceptable form of greeting."
        },
        {
          "verseLocation": "Judges 6:23",
          "verseText": "“To him”; as it is written: “And the Lord said to him: Peace",
          "talmudLocation": "Sotah 11a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11a#section-5",
          "talmudFullText": "With regard to Miriam’s deed the verse states: <b>“And his sister stood afar off, </b> to know what would be done to him” (Exodus 2:4). <b>R' Yitzḥak says: This entire verse is stated in reference to the Shekhina, </b> i.e., each phrase alludes to the Shekhina watching over Moses. <b>“And</b> his sister <b>stood”; as it is written: “And YHWH came, and stood”</b> (I Samuel 3:10). <b>“His sister”; as it is written: “Say to wisdom: You are my sister”</b> (Proverbs 7:4). <b>“Afar off”; as it is written: “From afar YHWH appeared to me”</b> (Jeremiah 31:2). <b>“To know”; as it is written: “For YHWH is a God of knowledge”</b> (I Samuel 2:3). <b>“What”; as it is written: “What does YHWH God require of you”</b> (Deuteronomy 10:12). <b>“Would be done”; as it is written: “For YHWH God will do nothing”</b> (Amos 3:7). <b>“To him”; as it is written: “And YHWH said to him: Peace</b> be with you” (Judges 6:23)."
        },
        {
          "verseLocation": "Judges 6:24",
          "verseText": "as it is written: “And he called Him the Lord of peace”",
          "talmudLocation": "Chagigah 12b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12b#section-12",
          "talmudFullText": "<b><i>Aravot</i>, </b> skies, is the firmament <b>that contains righteousness; justice; righteousness, </b> i.e., charity; <b>the treasuries of life; the treasuries of peace; the treasuries of blessing; the souls of the righteous; the spirits and souls that are to be created; and the dew that God will use to revive the dead. </b> The Talmud proves this statement: <b>Righteousness and justice</b> are found in heaven, <b>as it is written: “Righteousness and justice are the foundation of Your throne”</b> (Psalms 89:15); <b>righteousness, as it is written: “And He donned righteousness as armor”</b> (Isaiah 59:17); <b>the treasuries of life, as it is written: “For with You is the source of life”</b> (Psalms 36:10). <b>And the treasuries of peace</b> are found in heaven, <b>as it is written: “And he called Him YHWH of peace”</b> (Judges 6:24), implying that peace is God’s name and is therefore found close to Him. <b>And the treasuries of blessing, as it is written: “He shall receive a blessing from YHWH”</b> (Psalms 24:5)."
        },
        {
          "verseLocation": "Judges 6:24",
          "verseText": "and he called Him Lord Shalom”",
          "talmudLocation": "Shabbat 10b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/10b#section-2",
          "talmudFullText": "It was taught in the <i>Tosefta</i>: <b>There is no greeting [<i>shalom</i>] others</b> permitted in the bathhouse. The Talmud comments that <b>this</b> statement <b>supports</b> the opinion of <b>Rav Hamnuna in the name of Ulla, who said: It is forbidden for a person to greet [<i>shalom</i>] his friend in the bathhouse because</b> Shalom is one of the names of God, as <b>it is stated: </b> “And Gideon built there an altar for God <b>and he called Him Lord Shalom”</b> (Judges 6:24). Therefore, it is prohibited to utter the word <i>shalom</i> in a dishonorable place."
        },
        {
          "verseLocation": "Judges 6:26",
          "verseText": "the wood of an asheira ,",
          "talmudLocation": "Temurah 29a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/29a#section-1",
          "talmudFullText": "<b>and</b> the prohibition against sacrificing without <b>service vessels; and</b> the prohibition against utilizing <b>vessels</b> that had been previously used for the service of <b>a tree worshipped as idolatry [<i>asheira</i>]; and</b> the prohibition against using <b>the wood of an <i>asheira</i>, </b> as God commanded Gideon to sacrifice the burnt offering with the wood of an <i>asheira</i> that he will cut down (Judges 6:26); <b>and</b> the prohibition of sacrificing an animal <b>set aside</b> for idolatry; <b>and</b> the prohibition against using an animal that was <b>worshipped</b> as an idol."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Judges 7:19",
          "verseText": "What is Rabbi Natan’s reasoning? As it is written: “And Gideon, and the one hundred men who were with him, came to the edge of camp at the beginning of the middle watch”",
          "talmudLocation": "Berakhot 3b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/3b#section-11",
          "talmudFullText": "The Talmud explains: <b>What is R' Natan’s reasoning? As it is written: “And Gideon, and the one hundred men who were with him, came to the edge of camp at the beginning of the middle watch”</b> (Judges 7:19). <b>It was taught</b> in the <i>Tosefta</i>: <b>Middle means nothing other than</b> that <b>there is one before it and one after it. </b> From the fact that the verse refers to a middle watch, the fact that the night is comprised of three watches may be inferred."
        },
        {
          "verseLocation": "Judges 7:25",
          "verseText": "two men whose names were Oreb? Isn’t it written: “And they slew Oreb at the Rock of Oreb, and Zeeb",
          "talmudLocation": "Chullin 5a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/5a#section-4",
          "talmudFullText": "The Talmud asks: <b>What</b> is the meaning of <b><i>orevim</i></b> in this context? <b>Ravina said: </b> They were <b>actual ravens. Rav Adda bar Minyumi said to him: And perhaps</b> they were <b>two men whose names were Oreb? Isn’t it written: “And they slew Oreb at the Rock of Oreb, and Zeeb</b> they slew at the winepress of Zeeb” (Judges 7:25), indicating that Oreb is a person’s name? Ravina <b>said to him: </b> Did <b>the matter</b> just so <b>happen that the names of both of</b> the people supplying Elijah with food <b>were Oreb? </b> The improbability of this occurrence indicates that they were actual ravens."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "Judges 8:21",
          "verseText": "this is what they said to her: “For as the man is, so is his strength”",
          "talmudLocation": "Bava Metzia 84a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/84a#section-4",
          "talmudFullText": "<b>A certain</b> Roman <b>noblewoman [<i>matronita</i>]</b> once <b>said to them: Your children are not</b> really <b>your own, </b> as due to your obesity it is impossible that you had sex with your wives. <b>They said to her: Theirs, </b> i.e., our wives’ bellies, <b>are larger than ours. </b> She said to them: <b>All the more so</b> you could not have had sex. <b>There are</b> those <b>who say</b> that <b>this is what they said to her: “For as the man is, so is his strength”</b> (Judges 8:21), i.e., our sexual organs are proportionate to our bellies. <b>There are</b> those <b>who say</b> that <b>this is what they said to her: Love compresses the flesh. </b>"
        },
        {
          "verseLocation": "Judges 8:33",
          "verseText": "went astray after the Be’alim”",
          "talmudLocation": "Berakhot 12b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/12b#section-22",
          "talmudFullText": "In response, the Talmud cites a <i>baraita</i> where these elements were derived from allusions in the verse, “You shall stray neither after your hearts nor after your eyes, after which you would lust” (Numbers 15:39). <b>As it was taught: “After your hearts” refers to</b> following opinions <b>of heresy</b> that may arise in one’s heart. The Talmud offers a proof, <b>as it is stated: “The fool said in his heart: ‘There is no God’; </b> they have been corrupt, they have acted abominably; there is none who does good” (Psalms 14:1). The phrase: <b>“After your eyes, ”</b> in <b>this</b> verse refers to following <b>thoughts of transgressions</b> of licentiousness, that a person might see and desire, <b>as it is stated: “And Samson said to his father, ‘That one take for me, for she is upright in my eyes’”</b> (Judges 14:3). The passage: <b>“You shall stray after”</b> refers to promiscuity, which in the parlance of the prophets is a metaphor for <b>idol worship, as it is stated: </b> “The children of Israel again <b>went astray after the Be’alim”</b> (Judges 8:33)."
        },
        {
          "verseLocation": "Judges 8:33",
          "verseText": "“And they made Baal Berit into their god”",
          "talmudLocation": "Shabbat 83b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/83b#section-3",
          "talmudFullText": "<b>Rav Aḥadvoi bar Ami raised a dilemma: What</b> is the <i>halakha</i> with regard to <b>idolatry</b> that is <b>less than an olive-bulk? Rav Yosef strongly objected to this: </b> With regard <b>to what</b> use was this dilemma raised? <b>If you say</b> it was raised with regard <b>to the matter of the prohibition</b> of idolatry, <b>let it only be</b> like <b>Zevuv, the Baal of Ekron, </b> which was the size and form of a fly, <b>as it was taught</b> in a <i>baraita</i> with regard to the verse: <b>“And they made Baal Berit into their god”</b> (Judges 8:33). The rabbis said that <b>this is</b> referring to <b>Zevuv, the Baal of Ekron. </b> It <b>teaches that each and every</b> person <b>made an image of his god and placed it in his pocket. When he remembered it, he removed it from his pocket and embraced and kissed it. </b> Apparently, even idolatry the size of a fly falls under the rubric of the prohibition of idolatry. <b>Rather, </b> the dilemma is: <b>What</b> is the <i>halakha</i> with regard <b>to the matter of impurity? </b> The two sides of the dilemma are as follows: <b>Since</b> an idol <b>is juxtaposed to a creeping animal, just as a creeping animal</b> transmits impurity when it is <b>a lentil-bulk, so too, idolatry</b> transmits impurity when it is <b>a lentil-bulk. Or perhaps</b> idolatry <b>is juxtaposed to a corpse, </b> and <b>just as a corpse</b> transmits impurity only <b>when</b> it is at least <b>an olive-bulk, so too, idolatry</b> transmits impurity only <b>when</b> it is at least <b>an olive-bulk. </b>"
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "Judges 9:13",
          "verseText": "As it is stated: “And the vine replied: Should I leave my wine, which gladdens God and man,",
          "talmudLocation": "Arakhin 11a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/11a#section-14",
          "talmudFullText": "The Talmud asks: <b>Is that so? But doesn’t R' Shmuel bar Naḥmani say</b> that <b>R' Yonatan said: From where</b> is it derived that <b>songs</b> of praise in the Temple <b>are recited only over</b> the <b>wine</b> libation accompanying the sacrifice? <b>As it is stated: “And the vine replied: Should I leave my wine, which gladdens God and man, </b> and go and wave above the trees” (Judges 9:13). <b>If</b> it is clear that wine <b>gladdens people, in what</b> way <b>does it gladden God? </b> Rather, derive <b>from here that songs</b> of praise in the Temple <b>are recited only over</b> the <b>wine</b> of libation, and it is this song that gladdens God. This is difficult, as since there is no wine libation associated with the bringing of first fruits, how can it be accompanied by song?"
        },
        {
          "verseLocation": "Judges 9:13",
          "verseText": "As it is stated: “And the vine replied: Should I leave my wine, which gladdens God and man,",
          "talmudLocation": "Berakhot 35a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/35a#section-3",
          "talmudFullText": "The Talmud asks: <b>And</b> did <b>this</b> verse: <b>“Sanctified for praises, ” come for that</b> purpose? <b>This</b> verse <b>is necessary</b> to derive other matters. <b>One</b> being <b>that God said: Redeem it and then eat it. </b> This midrash interprets <i>hillul</i>, praise, as <i>ḥillul</i>, redemption. <b>And the other</b> matter derived from this verse is: <b>An object which</b> is offered upon the altar and <b>requires a song</b> of praise when it is offered, as is the case with the libation of wine, <b>requires redemption. And that which does not require a song</b> of praise, all other fruits, <b>does not require redemption. And</b> this is <b>in accordance with</b> the opinion that <b>R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said, as R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: From where</b> is it derived that <b>one only recites a song</b> of praise in the Temple <b>over the</b> libation of <b>wine</b> on the altar? <b>As it is stated: “And the vine replied: Should I leave my wine, which gladdens God and man, </b> and go and wave above the trees? ” (Judges 9:13). <b>If</b> wine <b>gladdens people, in what</b> way <b>does it gladden God? </b> Rather, derive <b>from here that one only recites a song</b> of praise <b>over wine, </b> as wine gladdens God when offered as part of the service in the Temple. In any case, other <i>halakhot</i> have been derived from this verse. From where, then, is the requirement to recite blessings derived?"
        },
        {
          "verseLocation": "Judges 9:25",
          "verseText": "the men of Shechem, as it is stated: “And the men of Shechem set ambushers for him on the tops of the mountains, and they robbed all that came along that way by them”",
          "talmudLocation": "Bava Kamma 79b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/79b#section-5",
          "talmudFullText": "<b>R' Yoḥanan said: </b> A different example of a robber is a case <b>like</b> that of <b>the men of Shechem, as it is stated: “And the men of Shechem set ambushers for him on the tops of the mountains, and they robbed all that came along that way by them”</b> (Judges 9:25)."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "Judges 10:6",
          "verseText": "As it is stated: “And the children of Israel continued to do evil in the eyes of the Lord, and served the Baalim and the Ashtaroth, and the gods of Aram and the gods of Zidon and the gods of Moab and the gods of the children of Ammon and the gods of the Philistines, and they forsook the Lord and did not serve Him”",
          "talmudLocation": "Beitzah 25b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/beitzah/25b#section-5",
          "talmudFullText": "<b>The lupine [<i>turmus</i>], </b> an extremely bitter legume that is edible only after an extensive process, <b>will cut off the feet of the enemies of the Jewish people, </b> a euphemism for the Jewish people themselves. <b>As it is stated: “And the children of Israel continued to do evil in the eyes of YHWH, and served the Baalim and the Ashtaroth, and the gods of Aram and the gods of Zidon and the gods of Moab and the gods of the children of Ammon and the gods of the Philistines, and they forsook YHWH and did not serve Him”</b> (Judges 10:6)."
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "Judges 11:3",
          "verseText": "is repeated in the Prophets, as it is written: “And there were gathered vain fellows to Yiftah, and they went out with him”",
          "talmudLocation": "Bava Kamma 92b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/92b#section-13",
          "talmudFullText": "Rabba bar Mari explains each of the sources. It <b>is written in the Torah, as it is written: “And so Esau went to Ishmael”</b> (Genesis 28:9). It <b>is repeated in the Prophets, as it is written: “And there were gathered vain fellows to Yiftah, and they went out with him”</b> (Judges 11:3). <b>And</b> it <b>is triplicated in the Writings, as it is written: All fowl will live with its kind, and men with those like him</b> (Book of Ben Sira 13:17). <b>We learned</b> it <b>in a Mishnah</b> (<i>Kelim</i> 12:2): <b>All that is attached to</b> that which is <b>ritually impure</b> is <b>ritually impure; all that is attached to</b> that which is <b>ritually pure</b> is <b>ritually pure. And we learned</b> it <b>in a <i>baraita</i>: R' Eliezer says: Not for naught</b> did the <b>starling go to the raven but because it is its kind, </b> as it too is a non-kosher bird."
        },
        {
          "verseLocation": "Judges 11:31",
          "verseText": "as it is written: “Then it shall be that whatever comes forth from the doors of my house",
          "talmudLocation": "Taanit 4a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/4a#section-7",
          "talmudFullText": "By contrast, there is the case of <b>Jephthah the Gileadite. </b> Upon leaving for battle he issued a statement, <b>as it is written: “Then it shall be that whatever comes forth from the doors of my house</b> to meet me when I return in peace…it shall be to YHWH and I will bring it up for a burnt-offering” (Judges 11:31). This <b>might even</b> have been <b>an impure, </b> non-kosher <b>animal, </b> which he had committed himself to sacrifice. In this instance, God <b>responded</b> to him <b>unreasonably, and his daughter happened</b> to come <b>to him. </b>"
        },
        {
          "verseLocation": "Judges 11:40",
          "verseText": "from time to time [ yamim yamima ]",
          "talmudLocation": "Nazir 5a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/5a#section-7",
          "talmudFullText": "The Talmud asks: <b>But say</b> that R' Yehuda HaNasi should have derived the meaning of the term <i>yamim</i> <b>from here: </b> “The daughters of Israel went <b>from time to time [<i>yamim yamima</i>]</b> to lament the daughter of Jephthah the Gileadite four days in a year” (Judges 11:40). This teaches that the daughters of Israel would go four times a year, each time for one day, to lament her, in which case <i>yamim yamima</i> means once every three months. The Talmud rejects this: <b>We derive</b> the meaning of the term <b><i>yamim</i> from</b> another usage of the term <b><i>yamim</i>, and we do not derive</b> the meaning of the term <b><i>yamim</i> from</b> a case where the word <i>yamim</i> is used in conjunction with the term <b><i>yamima</i>. </b>"
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "Judges 12:9",
          "verseText": "“And he had thirty sons, and thirty daughters he sent abroad, and thirty daughters he brought in from abroad for his sons. And he judged Israel seven years”",
          "talmudLocation": "Bava Batra 91a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/91a#section-10",
          "talmudFullText": "Apropos the story of Ruth the Talmud adds: <b>Rabba bar Rav Huna says</b> that <b>Rav says: </b> The judge <b>Ibzan</b> of Bethlehem (see Judges 12:8–10) <b>is Boaz. </b> The Talmud asks: <b>What is he teaching us? </b> The Talmud explains that this comment is <b>in accordance with the other</b> statement <b>of Rabba bar Rav Huna, as Rabba bar Rav Huna says</b> that <b>Rav says: Boaz prepared one hundred and twenty feasts for his children</b> at their weddings. <b>As it is stated, </b> concerning Ibzan: <b>“And he had thirty sons, and thirty daughters he sent abroad, and thirty daughters he brought in from abroad for his sons. And he judged Israel seven years”</b> (Judges 12:9). The verse indicates that he had sixty children."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "Judges 13:4",
          "verseText": "“Now therefore beware, I pray of you, and drink no wine nor strong drink, and eat not any unclean thing”",
          "talmudLocation": "Sotah 9b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-19",
          "talmudFullText": "When the angel spoke to Samson’s mother, he said: <b>“Now therefore beware, I pray of you, and drink no wine nor strong drink, and eat not any unclean thing”</b> (Judges 13:4). The Talmud asks, <b>what</b> is the meaning of <b>“any unclean thing”? </b> That term usually means non-kosher foods, but obviously she would not eat them anyway. <b>And</b> what’s <b>more, until now was she eating unclean things, </b> that she should have to be warned not to continue doing so? <b>R' Yitzḥak of the school of R' Ami says: </b> The angel was not referring to foods that are actually unclean, but rather <b>items that are forbidden to a nazirite. </b>"
        },
        {
          "verseLocation": "Judges 13:5",
          "verseText": "Isn’t it written: “For the child shall be a nazirite of God from the womb”",
          "talmudLocation": "Nazir 4b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/4b#section-17",
          "talmudFullText": "The Talmud challenges the assumption that Samson’s naziriteship was not accepted through a vow: <b>And was Samson not a nazirite</b> whose naziriteship was accepted by a vow? <b>Isn’t it written: “For the child shall be a nazirite of God from the womb”</b> (Judges 13:5)? The Talmud answers: <b>There it was the angel who spoke. </b> Samson’s nazirite status did not stem from a vow uttered by a human being."
        },
        {
          "verseLocation": "Judges 13:5",
          "verseText": "razor [ mora ]",
          "talmudLocation": "Nazir 66a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/66a#section-10",
          "talmudFullText": "<strong>Mishnah: </strong> The tractate concludes with an aggadic statement about nazirites. <b>Samuel</b> the prophet <b>was a nazirite, in accordance with the statement of R' Nehorai, as it was stated</b> that when Hannah, his mother, prayed for a son, she vowed: <b>“And no <i>mora</i> shall come upon his head”</b> (I Samuel 1:11). How is it derived that <i>mora</i> is an expression of naziriteship? <b>It is stated with regard to Samson: “And</b> no <b>razor [<i>mora</i>]</b> shall come upon his head, for the child shall be a nazirite to God” (Judges 13:5), <b>and it is stated: “And</b> no <b><i>mora</i>, ” with regard to Samuel. Just as</b> the term <b>“<i>mora</i>” that is stated with regard to Samson</b> means that he was <b>a nazirite, so too</b> the term <b>“<i>mora</i>” that is stated with regard to Samuel</b> indicates that he was <b>a nazirite. </b>"
        },
        {
          "verseLocation": "Judges 13:5",
          "verseText": "and he shall begin to save Israel",
          "talmudLocation": "Sotah 9b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-24",
          "talmudFullText": "Samson’s parents were told: “For behold, you shall conceive, and bear a son; and no razor shall come upon his head; for the child shall be a nazirite unto God from the womb; <b>and he shall begin to save Israel</b> out of the hand of the Philistines” (Judges 13:5). <b>R' Ḥama ben Ḥanina, says: </b>"
        },
        {
          "verseLocation": "Judges 13:11",
          "verseText": "Manoah, was an ignoramus, as it is written: “And Manoah…went after his wife”",
          "talmudLocation": "Berakhot 61a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/61a#section-22",
          "talmudFullText": "<b>Rav Naḥman said: </b> From the following verse we know that Samson’s father, <b>Manoah, was an am ha'aretz, as it is written: “And Manoah…went after his wife”</b> (Judges 13:11)."
        },
        {
          "verseLocation": "Judges 13:11",
          "verseText": "Manoah, was an ignoramus, as it is stated: “And Manoah arose, and went after his wife”",
          "talmudLocation": "Eruvin 18b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/18b#section-5",
          "talmudFullText": "<b>Rav Naḥman said: </b> From the following verse, it is known that Samson’s father, <b>Manoah, was an am ha'aretz, as it is stated: “And Manoah arose, and went after his wife”</b> (Judges 13:11), which shows that he was unfamiliar with the principle that one must not walk behind a woman."
        },
        {
          "verseLocation": "Judges 13:19",
          "verseText": "Rabbi Yoḥanan said: What is the reason of Rabbi Shimon? As it is written: “And Manoah took the kid with the meal offering, and offered it up upon the rock, to the Lord”",
          "talmudLocation": "Zevachim 108b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/108b#section-16",
          "talmudFullText": "<b>R' Yoḥanan said: What is the reason of R' Shimon? As it is written: “And Manoah took the kid with the meal offering, and offered it up upon the rock, to YHWH”</b> (Judges 13:19). Evidently, even placing an offering upon a rock is considered an act of offering up."
        },
        {
          "verseLocation": "Judges 13:19",
          "verseText": "altars were permitted, this is as it is written: “So Manoah took the kid with the meal offering, and offered them upon the rock to the Lord”",
          "talmudLocation": "Zevachim 119b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/119b#section-4",
          "talmudFullText": "The Talmud comments: <b>Granted, according to the one, </b> i.e., R' Shimon ben Yoḥai, <b>who says</b> that <b>this and that</b> are references to <b>Jerusalem, </b> and consequently private altars were forbidden only following the establishment of the Temple in Jerusalem, <b>but</b> during the period of the Tabernacle in <b>Shiloh</b> private <b>altars were permitted, this is as it is written: “So Manoah took the kid with the meal offering, and offered them upon the rock to YHWH”</b> (Judges 13:19), i.e., he sacrificed them upon a private altar and not in Shiloh."
        },
        {
          "verseLocation": "Judges 13:24",
          "verseText": "and the child grew, and the Lord blessed him”",
          "talmudLocation": "Sotah 10a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-2",
          "talmudFullText": "The verse states: “And the woman bore a son, and called his name Samson; <b>and the child grew, and YHWH blessed him”</b> (Judges 13:24). The Talmud asks: <b>With what did He bless him? Rav Yehuda says</b> that <b>Rav says: </b> It means <b>that He blessed him with regard to his penis, </b> that despite his youth <b>his penis</b> should function <b>like</b> that of physically mature <b>men, and</b> that <b>his seed</b> should be <b>like an overflowing river. </b>"
        },
        {
          "verseLocation": "Judges 13:25",
          "verseText": "“And the spirit of the Lord began [ vataḥel ]",
          "talmudLocation": "Sotah 9b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-21",
          "talmudFullText": "The verse states with regard to Samson: <b>“And the spirit of YHWH began [<i>vataḥel</i>]</b> to move him in Mahaneh Dan, between Zorah and Eshtaol” (Judges 13:25). <b>R' Ḥama ben Ḥanina, says: The prophecy of Jacob our forefather</b> concerning the tribe of Dan <b>took effect [<i>ḥaleta</i>]</b> through Samson, a member of the tribe of Dan, <b>as it is written: “Dan shall be a serpent in the way, </b> a horned snake in the path, that bites the horse’s heels, so that his rider falls backward” (Genesis 49:17)."
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "Judges 14:1",
          "verseText": "“And Samson went down to Timnah,",
          "talmudLocation": "Sotah 10a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-16",
          "talmudFullText": "§ <b>It is written</b> with regard to Samson: <b>“And Samson went down to Timnah, </b> and saw a woman in Timnah of the daughters of the Philistines” (Judges 14:1), <b>and it is written</b> in the Torah passage concerning the incident of Judah and Tamar: “And it was told to Tamar, saying: <b>Behold, your father-in-law is going up to Timnah</b> to sheer his sheep” (Genesis 38:13). The verses contain an apparent contradiction as to whether Timnah was a place to which one must descend or a place to which one must ascend. <b>R' Elazar says: </b> These terms do not refer to the manner of traveling to Timnah but are used figuratively. Concerning <b>Samson, who was disgraced there</b> in Timnah, the term indicating <b>descent is written with regard to his</b> journey. Concerning <b>Judah, who was elevated there, </b> the term indicating <b>ascent is written with regard to his</b> journey."
        },
        {
          "verseLocation": "Judges 14:1",
          "verseText": "“And Samson went down to Timnah,",
          "talmudLocation": "Sotah 9b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-14",
          "talmudFullText": "The Talmud asks: <b>But isn’t it written</b> earlier: <b>“And Samson went down to Timnah, </b> and saw a woman in Timnah of the daughters of the Philistines” (Judges 14:1), indicating that his initial wrongdoing was in Timnah? The <b>Talmud answers: In any event, his initial wrongdoing was in Gaza, </b> for at least he had married the woman in Timnah; in Gaza, Samson never wed the woman but only had sex with her."
        },
        {
          "verseLocation": "Judges 14:3",
          "verseText": "as it is stated: “And Samson said to his father, ‘That one take for me, for she is upright in my eyes’”",
          "talmudLocation": "Berakhot 12b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/12b#section-22",
          "talmudFullText": "In response, the Talmud cites a <i>baraita</i> where these elements were derived from allusions in the verse, “You shall stray neither after your hearts nor after your eyes, after which you would lust” (Numbers 15:39). <b>As it was taught: “After your hearts” refers to</b> following opinions <b>of heresy</b> that may arise in one’s heart. The Talmud offers a proof, <b>as it is stated: “The fool said in his heart: ‘There is no God’; </b> they have been corrupt, they have acted abominably; there is none who does good” (Psalms 14:1). The phrase: <b>“After your eyes, ”</b> in <b>this</b> verse refers to following <b>thoughts of transgressions</b> of licentiousness, that a person might see and desire, <b>as it is stated: “And Samson said to his father, ‘That one take for me, for she is upright in my eyes’”</b> (Judges 14:3). The passage: <b>“You shall stray after”</b> refers to promiscuity, which in the parlance of the prophets is a metaphor for <b>idol worship, as it is stated: </b> “The children of Israel again <b>went astray after the Be’alim”</b> (Judges 8:33)."
        },
        {
          "verseLocation": "Judges 14:3",
          "verseText": "“And Samson said: Get her for me, as she is pleasing to my eyes”",
          "talmudLocation": "Horayot 10b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/10b#section-11",
          "talmudFullText": "He explains: <b>“And Lot cast</b> his eyes” is an allusion to the verse: <b>“His master’s wife cast her eyes</b> upon Joseph and said: Lie with me” (Genesis 39:7). <b>“His eyes”</b> is an allusion to the verse: <b>“And Samson said: Get her for me, as she is pleasing to my eyes”</b> (Judges 14:3). <b>“And beheld”</b> is an allusion to the verse: <b>“And Shechem, son of Hamor, </b> the prince of the land, <b>beheld her; </b> and he took her and lay with her” (Genesis 34:2). <b>“The entire plain [<i>kikar</i>] of the Jordan”</b> is an allusion to the verse: <b>“For on account of a prostitute a man is brought to a loaf [<i>kikar</i>] of bread”</b> (Proverbs 6:26). <b>“That it was well watered [<i>mashke</i>] everywhere”</b> is an allusion to the verse <b>“I will follow my lovers, givers of my bread and my water, my wool and my flax, my oil and my drink [<i>veshikkuyai</i>]”</b> (Hosea 2:7)."
        },
        {
          "verseLocation": "Judges 14:3",
          "verseText": "“For she is pleasing in my eyes”",
          "talmudLocation": "Nazir 23a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/23a#section-16",
          "talmudFullText": "R' Yoḥanan explains: <b>“And Lot lifted up</b> his eyes” employs the same expression as a verse that refers to Joseph’s temptation: <b>“That his master’s wife lifted up her eyes”</b> (Genesis 39:7), which is clearly referring to sin. The phrase used in reference to Lot, <b>“his eyes, ”</b> is stated similarly to Samson’s appraisal of the Philistine girl he sought to marry: <b>“For she is pleasing in my eyes”</b> (Judges 14:3)."
        },
        {
          "verseLocation": "Judges 14:3",
          "verseText": "And Samson said to his father: Get her for me; for she is pleasant in my eyes”",
          "talmudLocation": "Sotah 9b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-11",
          "talmudFullText": "<strong>Talmud: </strong> <b>A baraita states</b> (<i>Tosefta</i> 3:15): <b>Samson rebelled with his eyes, as it is stated: </b> “Then his father and his mother said to him: Is there never a woman among the daughters of your brethren, or among all my people, that you go out to take a wife of the uncircumcised Philistines? <b>And Samson said to his father: Get her for me; for she is pleasant in my eyes”</b> (Judges 14:3). <b>Therefore, the Philistines gouged out his eyes, as it is stated: “And the Philistines laid hold on him, and put out his eyes”</b> (Judges 16:21)."
        },
        {
          "verseLocation": "Judges 14:4",
          "verseText": "From the Prophets, as it is written: “But his father and his mother knew not that it was of the Lord”",
          "talmudLocation": "Moed Katan 18b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/18b#section-15",
          "talmudFullText": "<b>Rav said in the name of R' Reuven ben Itzterobili as follows: From the Torah, and from the Prophets, and from the Writings; </b> it implies that the decree that a specific <b>woman</b> is destined to be married <b>to</b> a specific <b>man</b> is <b>from God. </b> From where is this derived? It is <b>from the Torah, as it is written: “Then Laban and Bethuel answered and said: The thing comes from YHWH, </b> we cannot speak to you either bad or good” (Genesis 24:50). <b>From the Prophets, as it is written: “But his father and his mother knew not that it was of YHWH”</b> (Judges 14:4). <b>From the Writings, as it is written: “House and riches are the inheritance of fathers; but a prudent woman is from YHWH”</b> (Proverbs 19:14)."
        },
        {
          "verseLocation": "Judges 14:4",
          "verseText": "Is that so? But isn’t it written: “But his father and his mother knew not that it was from the Lord;",
          "talmudLocation": "Sotah 9b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-12",
          "talmudFullText": "The Talmud asks: <b>Is that so? But isn’t it written: “But his father and his mother knew not that it was from YHWH; </b> as he sought a subterfuge against the Philistines” (Judges 14:4), indicating that Samson’s searching for a Philistine wife was due to a Divine mission? The Talmud answers: Although God did plan the punishment of the Philistines, <b>in any event when he went, he followed his inclination</b> and did not act for the sake of Heaven."
        },
        {
          "verseLocation": "Judges 14:6",
          "verseText": "“And he rent it as one would have rent a kid,",
          "talmudLocation": "Zevachim 65b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/65b#section-1",
          "talmudFullText": "§ The Mishnah teaches that after removing the crop and the feathers and innards that emerged with it, the priest <b>ripped</b> the bird lengthwise <b>and did not separate</b> the two halves of the bird. In this regard <b>A baraita states</b> in a <i>baraita</i>: The verse states: <b>“And he shall rend”</b> (Leviticus 1:17). The act of <b>rending is</b> performed <b>only by hand, and so too, </b> the verse <b>states</b> with regard to Samson: <b>“And he rent it as one would have rent a kid, </b> and he had nothing in his hand” (Judges 14:6)."
        },
        {
          "verseLocation": "Judges 14:18",
          "verseText": "“If you had not plowed with my calf",
          "talmudLocation": "Sanhedrin 21a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21a#section-14",
          "talmudFullText": "The Talmud challenges the notion that David had only six wives. <b>But there was</b> also <b>Michal, </b> and so he had at least seven wives. <b>Rav said: </b> One of those six wives, <b>Eglah, is Michal, and why was she called Eglah</b> in the verse? It was <b>because she was dear to him like a calf [<i>egla</i>], and so</b> the verse <b>states</b> that Samson referred to his wife with the same term: <b>“If you had not plowed with my calf</b> you would not have found my secret” (Judges 14:18)."
        },
        {
          "verseLocation": "Judges 14:19",
          "verseText": "from here: “And he smote thirty men of them, and took their garments”",
          "talmudLocation": "Nazir 4b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/4b#section-19",
          "talmudFullText": "<b>Rather, </b> it is derived <b>from here: “And he smote thirty men of them, and took their garments”</b> (Judges 14:19). Since he stripped the clothes off the dead he must have come into contact with them. The Talmud counters: <b>Perhaps he stripped them first and afterward killed them. </b> The Talmud responds: <b>It is written: “And he smote…and took, ”</b> in that order, indicating that first he killed them and then he took their clothing."
        }
      ]
    },
    {
      "chapterNumber": 15,
      "citations": [
        {
          "verseLocation": "Judges 15:4",
          "verseText": "“And Samson went and caught three hundred foxes,",
          "talmudLocation": "Sotah 10a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-4",
          "talmudFullText": "The verse states earlier: <b>“And Samson went and caught three hundred foxes, </b> and took torches, and turned tail to tail, and put a torch in the midst between every two tails” (Judges 15:4). The Talmud asks: <b>What is different</b> about <b>foxes</b> than any other animal, that he chose them for this purpose? <b>R' Aivu bar Nagdi says</b> that <b>R' Ḥiyya bar Abba says: Samson said: Let</b> the animal <b>that goes in reverse</b> when it tries to escape, i.e., the fox, <b>come and exact punishment from the Philistines, who reneged on their oath</b> that Abimelech swore to Abraham."
        },
        {
          "verseLocation": "Judges 15:5",
          "verseText": "a vineyard [ kerem ], as it is written: “And he burned up both the piles of produce and the standing grain, and also the olive yards [ kerem zayit ]”",
          "talmudLocation": "Bava Metzia 87b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/87b#section-10",
          "talmudFullText": "The Talmud refutes this suggestion: <b>And</b> is the <i>halakha</i> of <b>an olive derived from the common factor</b> of the two types of produce mentioned earlier? But <b>it itself is called</b> the fruit of <b>a vineyard [<i>kerem</i>], as it is written: “And he burned up both the piles of produce and the standing grain, and also the olive yards [<i>kerem zayit</i>]”</b> (Judges 15:5). <b>Rav Pappa said: </b> This verse does not mean that an olive is considered the product of a vineyard, as in the verse <b>it is called olive yard [<i>kerem zayit</i>], </b> and it is <b>not called a plain vineyard. </b> Therefore, the <i>halakha</i> of olives must be derived by analogy from the common denominator."
        },
        {
          "verseLocation": "Judges 15:5",
          "verseText": "kerem ; as it is written: “And burnt up from the shocks and the standing grain and the olive yards [ kerem zayit ]”",
          "talmudLocation": "Berakhot 35a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/35a#section-14",
          "talmudFullText": "The Talmud questions this point: <b>Is an olive derived from</b> the fact that it <b>has an aspect</b> of being offered upon the <b>altar? Isn’t it written explicitly with regard to</b> the olive <b>listed</b> that the orchard in which it grows is called <b><i>kerem</i>; as it is written: “And burnt up from the shocks and the standing grain and the olive yards [<i>kerem zayit</i>]”</b> (Judges 15:5)? Just as the orchard in which grapes grow is called <i>kerem</i>, and grapes require a blessing, the olive also grows in a <i>kerem</i> and should require a blessing. <b>Rav Pappa said: </b> Nevertheless, an analogy may not be drawn between the two; where the olive grows <b>is called <i>kerem zayit</i>, it is not called <i>kerem</i> unmodified, </b> which is a term reserved for grapevines."
        },
        {
          "verseLocation": "Judges 15:16",
          "verseText": "With the jawbone of an ass, I smote a thousand men”",
          "talmudLocation": "Nazir 4b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/4b#section-18",
          "talmudFullText": "The Talmud asks: <b>And from where do we</b> derive <b>that</b> Samson <b>became impure from corpses? If we say</b> it is <b>from</b> the fact <b>that it is written: </b> “And Samson said: <b>With the jawbone of an ass, I smote a thousand men”</b> (Judges 15:16), <b>perhaps he thrust</b> the jawbone <b>at them but did not touch them, </b> and he remained pure."
        },
        {
          "verseLocation": "Judges 15:19",
          "verseText": "“But God cleaved the hollow place that is in Lehi,",
          "talmudLocation": "Sotah 9b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-20",
          "talmudFullText": "After Samson smote one thousand Philistines with the jawbone of a donkey, he called the place Lehi, and God miraculously granted him to drink, as he was dying of thirst. The verse states: <b>“But God cleaved the hollow place that is in Lehi, </b> and out of there came water; and when he had drunk, his spirit came back, and he revived” (Judges 15:19). <b>R' Yitzḥak of the school of R' Ami says: He desired something unclean, </b> as he was driven by lust to Philistine women. <b>Therefore, </b> the saving of <b>his life was dependent on something unclean, </b> the jawbone of a donkey."
        }
      ]
    },
    {
      "chapterNumber": 16,
      "citations": [
        {
          "verseLocation": "Judges 16:1",
          "verseText": "His initial wrongdoing was in Gaza, as it is written: “And Samson went to Gaza, and saw there a harlot,",
          "talmudLocation": "Sotah 9b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-13",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> in the <i>Tosefta</i> (3:15): <b>R'</b> Yehuda HaNasi <b>says: His initial wrongdoing was in Gaza, </b> and <b>therefore he was smitten in Gaza. </b> The Talmud explains: <b>His initial wrongdoing was in Gaza, as it is written: “And Samson went to Gaza, and saw there a harlot, </b> and went in unto her” (Judges 16:1). <b>Therefore, he was smitten in Gaza, as it is written: </b> “And the Philistines laid hold on him, and put out his eyes; <b>and they brought him down to Gaza, </b> and bound him with fetters of brass; and he did grind in the prison-house” (Judges 16:21)."
        },
        {
          "verseLocation": "Judges 16:3",
          "verseText": "between the shoulders of Samson was sixty cubits, as it is stated: “And Samson lay till midnight, and arose at midnight, and grabbed hold of the doors of the gate of the city, and the two posts, and plucked them up, bar and all, and put them upon his shoulders,",
          "talmudLocation": "Sotah 10a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-5",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> that <b>R' Shimon the Pious said: </b> The width <b>between the shoulders of Samson was sixty cubits, as it is stated: “And Samson lay till midnight, and arose at midnight, and grabbed hold of the doors of the gate of the city, and the two posts, and plucked them up, bar and all, and put them upon his shoulders, </b> and carried them up to the top of the mountain that is before Hebron” (Judges 16:3). The verse indicates that the width of the gate of the city of Gaza was equal to the width of Samson’s shoulders, <b>and it is learned</b> as a tradition <b>that doors</b> of the gate <b>of Gaza were no less than sixty cubits</b> wide."
        },
        {
          "verseLocation": "Judges 16:4",
          "verseText": "“And it came to pass afterward, that he loved a woman in the valley of Sorek, whose name was Delilah”",
          "talmudLocation": "Sotah 9b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-15",
          "talmudFullText": "The Talmud continues its discussion of Samson. The verse states: <b>“And it came to pass afterward, that he loved a woman in the valley of Sorek, whose name was Delilah”</b> (Judges 16:4). <b>It is taught</b> in a <i>baraita</i> that <b>R'</b> Yehuda HaNasi <b>says: </b> Even <b>if she had not been called</b> by the <b>name Delilah, it would have been fitting that she be called Delilah, </b> for <b>she weakened [<i>dildela</i>] his strength, she weakened his heart, </b> and <b>she weakened his deeds, </b> thereby decreasing his merits."
        },
        {
          "verseLocation": "Judges 16:16",
          "verseText": "“And it came to pass, when she pressed him daily with her words, and urged him,",
          "talmudLocation": "Sotah 9b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-18",
          "talmudFullText": "The verse states: <b>“And it came to pass, when she pressed him daily with her words, and urged him, </b> that his soul was vexed unto death” (Judges 16:16). The Talmud asks: <b>What</b> is the meaning of <b>“and urged him”? </b> How did she do so? <b>R' Yitzḥak of the school of R' Ami says: At the moment</b> immediately before his <b>completion of</b> the act of <b>sex, she slipped away from beneath him. </b> By doing this, she urged him to reveal his secret."
        },
        {
          "verseLocation": "Judges 16:17",
          "verseText": "“If I be shaven, then my strength will go from me, and I shall become weak”",
          "talmudLocation": "Berakhot 56b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/56b#section-13",
          "talmudFullText": "<b>One who sees a shave in a dream</b> should <b>rise early and recite: “And he shaved himself, and changed his raiment”</b> (Genesis 41:14), which was said with regard to Joseph when he left prison and rose to greatness, <b>before a different verse, </b> with a negative connotation, <b>can precede it</b> in becoming reality: <b>“If I be shaven, then my strength will go from me, and I shall become weak”</b> (Judges 16:17). <b>One who sees a well in a dream</b> should <b>rise early and recite: “A well of living waters”</b> (Song of Songs 4:15), <b>before a different verse, </b> with a negative connotation, <b>can precede it</b> in becoming reality: <b>“As a cistern wells with her waters, </b> so it wells in its wickedness” (Jeremiah 6:7). <b>One who sees a reed in a dream</b> should <b>rise early and recite: “A bruised reed shall he not break”</b> (Isaiah 42:3), in praise of the Messiah, <b>before a different verse, </b> with a negative connotation, <b>can precede it</b> in becoming reality: <b>“Now, behold, you trust upon the staff of this bruised reed”</b> (II Kings 18:21), which is a disparaging depiction of Egypt."
        },
        {
          "verseLocation": "Judges 16:17",
          "verseText": "I have been a nazirite unto God",
          "talmudLocation": "Sotah 9b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-17",
          "talmudFullText": "The verse states: <b>“And when Delilah saw that he had told her all his heart”</b> (Judges 16:18). The Talmud asks: <b>From where did she know</b> that this time he had told her the truth about the source of his strength, as he had lied about it previously? <b>R' Ḥanin says</b> that <b>Rav says: Words of truth are recognizable, </b> and she felt that this time he was telling the truth. <b>Abaye says</b> differently: <b>She knew about</b> Samson being <b>a righteous individual, that he would not express the name of Heaven in vain. Once he said: </b> “And he told her all his heart, and said to her: There has not come a razor upon my head; for <b>I have been a nazirite unto God</b> from my mother’s womb” (Judges 16:17), <b>she said: Now he is certainly saying the truth. </b>"
        },
        {
          "verseLocation": "Judges 16:18",
          "verseText": "She weakened his heart, as it is written: “And when Delilah saw that he had told her all his heart,",
          "talmudLocation": "Sotah 9b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-16",
          "talmudFullText": "The Talmud explains: <b>She weakened his strength, as it is written: </b> “And she made him sleep upon her knees; and she called for a man and had the seven locks of his head shaved off; and she began to afflict him, <b>and his strength went from him”</b> (Judges 16:19). <b>She weakened his heart, as it is written: “And when Delilah saw that he had told her all his heart, </b> she sent and called for the lords of the Philistines, saying: Come up this once, for he has told me all his heart” (Judges 16:18). <b>She weakened his deeds, </b> thereby decreasing his merits, <b>as the Shekhina left him, as it is written: </b> “And she said: The Philistines are upon you, Samson. And he awoke out of his sleep, and said: I will go out as at other times, and shake myself. <b>But he knew not that YHWH was departed from him”</b> (Judges 16:20)."
        },
        {
          "verseLocation": "Judges 16:18",
          "verseText": "“And when Delilah saw that he had told her all his heart”",
          "talmudLocation": "Sotah 9b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-17",
          "talmudFullText": "The verse states: <b>“And when Delilah saw that he had told her all his heart”</b> (Judges 16:18). The Talmud asks: <b>From where did she know</b> that this time he had told her the truth about the source of his strength, as he had lied about it previously? <b>R' Ḥanin says</b> that <b>Rav says: Words of truth are recognizable, </b> and she felt that this time he was telling the truth. <b>Abaye says</b> differently: <b>She knew about</b> Samson being <b>a righteous individual, that he would not express the name of Heaven in vain. Once he said: </b> “And he told her all his heart, and said to her: There has not come a razor upon my head; for <b>I have been a nazirite unto God</b> from my mother’s womb” (Judges 16:17), <b>she said: Now he is certainly saying the truth. </b>"
        },
        {
          "verseLocation": "Judges 16:19",
          "verseText": "and his strength went from him”",
          "talmudLocation": "Sotah 10a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-11",
          "talmudFullText": "The Talmud clarifies: <b>Samson</b> was stricken <b>by his strength, </b> which led to his demise, <b>as it is written: </b> “And she made him sleep upon her knees; and she called for a man and had the seven locks of his head shaved off; and she began to afflict him, <b>and his strength went from him”</b> (Judges 16:19)."
        },
        {
          "verseLocation": "Judges 16:19",
          "verseText": "and his strength went from him”",
          "talmudLocation": "Sotah 9b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-16",
          "talmudFullText": "The Talmud explains: <b>She weakened his strength, as it is written: </b> “And she made him sleep upon her knees; and she called for a man and had the seven locks of his head shaved off; and she began to afflict him, <b>and his strength went from him”</b> (Judges 16:19). <b>She weakened his heart, as it is written: “And when Delilah saw that he had told her all his heart, </b> she sent and called for the lords of the Philistines, saying: Come up this once, for he has told me all his heart” (Judges 16:18). <b>She weakened his deeds, </b> thereby decreasing his merits, <b>as the Shekhina left him, as it is written: </b> “And she said: The Philistines are upon you, Samson. And he awoke out of his sleep, and said: I will go out as at other times, and shake myself. <b>But he knew not that YHWH was departed from him”</b> (Judges 16:20)."
        },
        {
          "verseLocation": "Judges 16:20",
          "verseText": "But he knew not that the Lord was departed from him”",
          "talmudLocation": "Sotah 9b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-16",
          "talmudFullText": "The Talmud explains: <b>She weakened his strength, as it is written: </b> “And she made him sleep upon her knees; and she called for a man and had the seven locks of his head shaved off; and she began to afflict him, <b>and his strength went from him”</b> (Judges 16:19). <b>She weakened his heart, as it is written: “And when Delilah saw that he had told her all his heart, </b> she sent and called for the lords of the Philistines, saying: Come up this once, for he has told me all his heart” (Judges 16:18). <b>She weakened his deeds, </b> thereby decreasing his merits, <b>as the Shekhina left him, as it is written: </b> “And she said: The Philistines are upon you, Samson. And he awoke out of his sleep, and said: I will go out as at other times, and shake myself. <b>But he knew not that YHWH was departed from him”</b> (Judges 16:20)."
        },
        {
          "verseLocation": "Judges 16:21",
          "verseText": "and he did grind in the prison-house”",
          "talmudLocation": "Sotah 10a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-6",
          "talmudFullText": "With regard to Samson’s capture, the verse states: “And the Philistines laid hold on him, and put out his eyes; and they brought him down to Gaza, and bound him with fetters of brass; <b>and he did grind in the prison-house”</b> (Judges 16:21). <b>R' Yoḥanan says: Grinding is nothing other</b> than <b>a language of a transgression</b> of sex, <b>and so</b> the verse <b>says: “Then let my wife grind unto another man”</b> (Job 31:10). This <b>teaches that each and every</b> Philistine man <b>brought his wife to the prison in order that she should be impregnated by</b> Samson. <b>Rav Pappa said: This</b> is an example of the folk saying <b>that people say: Before a wine drinker, </b> bring <b>wine; before one who digs in the ground, </b> bring <b>figs. </b> So too, Samson, who married Philistine women, was brought more Philistine women while in prison."
        },
        {
          "verseLocation": "Judges 16:21",
          "verseText": "Therefore, the Philistines gouged out his eyes, as it is stated: “And the Philistines laid hold on him, and put out his eyes”",
          "talmudLocation": "Sotah 9b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-11",
          "talmudFullText": "<strong>Talmud: </strong> <b>A baraita states</b> (<i>Tosefta</i> 3:15): <b>Samson rebelled with his eyes, as it is stated: </b> “Then his father and his mother said to him: Is there never a woman among the daughters of your brethren, or among all my people, that you go out to take a wife of the uncircumcised Philistines? <b>And Samson said to his father: Get her for me; for she is pleasant in my eyes”</b> (Judges 14:3). <b>Therefore, the Philistines gouged out his eyes, as it is stated: “And the Philistines laid hold on him, and put out his eyes”</b> (Judges 16:21)."
        },
        {
          "verseLocation": "Judges 16:21",
          "verseText": "and they brought him down to Gaza,",
          "talmudLocation": "Sotah 9b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-13",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> in the <i>Tosefta</i> (3:15): <b>R'</b> Yehuda HaNasi <b>says: His initial wrongdoing was in Gaza, </b> and <b>therefore he was smitten in Gaza. </b> The Talmud explains: <b>His initial wrongdoing was in Gaza, as it is written: “And Samson went to Gaza, and saw there a harlot, </b> and went in unto her” (Judges 16:1). <b>Therefore, he was smitten in Gaza, as it is written: </b> “And the Philistines laid hold on him, and put out his eyes; <b>and they brought him down to Gaza, </b> and bound him with fetters of brass; and he did grind in the prison-house” (Judges 16:21)."
        },
        {
          "verseLocation": "Judges 16:21",
          "verseText": "the Philistines gouged out his eyes, as it is stated: “And the Philistines laid hold on him, and put out his eyes”",
          "talmudLocation": "Sotah 9b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9b#section-6",
          "talmudFullText": "<strong>Mishnah: </strong> The Mishnah provides additional examples of people who were treated by Heaven commensurate with their actions. <b>Samson followed his eyes, therefore</b> he was punished measure for measure, as <b>the Philistines gouged out his eyes, as it is stated: “And the Philistines laid hold on him, and put out his eyes”</b> (Judges 16:21)."
        },
        {
          "verseLocation": "Judges 16:25",
          "verseText": "“And it came to pass, when their hearts were merry, that they said: Call for Samson, that he may make us sport”",
          "talmudLocation": "Avodah Zarah 19a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/19a#section-2",
          "talmudFullText": "<b>“Nor sat in the seat of the scornful”</b> (Psalms 1:1); this means <b>that</b> Abraham <b>did not sit in the seat of the Philistines, because they were scorners</b> who engaged in jest and buffoonery. <b>As it is stated</b> with regard to the Philistines in a later period: <b>“And it came to pass, when their hearts were merry, that they said: Call for Samson, that he may make us sport”</b> (Judges 16:25)."
        },
        {
          "verseLocation": "Judges 16:28",
          "verseText": "that I may be this once avenged of the Philistines for my two eyes”",
          "talmudLocation": "Sotah 10a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-3",
          "talmudFullText": "Prior to Samson’s death, the verse states: <b>“And Samson called unto YHWH, and said: Lord God, remember me, I pray to You, and strengthen me, I pray to You, only this once, </b> O God, <b>that I may be this once avenged of the Philistines for my two eyes”</b> (Judges 16:28). <b>Rav said</b> that <b>Samson said before God: God!, remember</b> on <b>my</b> behalf the <b>twenty-two years that I judged the Jewish people</b> without receiving any reward, <b>and I did not</b> even <b>say to any one of them: Move a stick for me from</b> one <b>place to</b> another <b>place. </b>"
        },
        {
          "verseLocation": "Judges 16:30",
          "verseText": "“Let me die with the Philistines”",
          "talmudLocation": "Avodah Zarah 28a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/28a#section-12",
          "talmudFullText": "The Talmud explains: The healer <b>of R' Yoḥanan was an expert physician</b> who would not jeopardize her reputation by harming him. The Talmud rejects this explanation: But the healer <b>of R' Abbahu was also an expert physician. </b> The Talmud answers: The case involving <b>R' Abbahu is different, as heretics establish within themselves</b> the attitude of: <b>“Let me die with the Philistines”</b> (Judges 16:30), i.e., heretics are willing to risk their lives in order to hurt Jews, due to their religious disputes. By contrast, non-Jews will not jeopardize their own reputation for this purpose, and therefore it was permitted for R' Yoḥanan to be treated by the matron."
        },
        {
          "verseLocation": "Judges 16:30",
          "verseText": "“Let me die with the Philistines”",
          "talmudLocation": "Ketubot 23b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/23b#section-10",
          "talmudFullText": "The Talmud answers: <b>Lest you say</b> that in this case, <b>both of them are</b> deemed <b>untainted</b> in accordance with the testimony of the witness, <b>and</b> the fact <b>that she said that</b> they are both tainted <b>was</b> because <b>she was acting</b> with the intention termed: <b>“Let me die with the Philistines”</b> (Judges 16:30), i.e., she was willing to implicate herself in order to bolster her credibility so that her testimony against her counterpart would be accepted, the <i>tanna</i> therefore <b>teaches us</b> that this is not a consideration."
        },
        {
          "verseLocation": "Judges 16:30",
          "verseText": "“Let me die with the Philistines”",
          "talmudLocation": "Sanhedrin 110a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/110a#section-2",
          "talmudFullText": "<b>Korah’s wife said to him: See what Moses is doing. He is the king, he appointed his brother High Priest, </b> and <b>he appointed his brother’s sons deputy priests. If <i>teruma</i> comes, he says: Let it be for the priest; if</b> the first <b>tithe comes, which you</b> as Levites <b>take, he says: Give one 10th to the priest. And furthermore, he shears your hair and waves you</b> as if you are as insignificant <b>as excrement</b> (see Numbers 8:5–11), as though <b>he set</b> his <b>sights on your hair</b> and wishes you to be shaven and unsightly. Korah <b>said to her: But didn’t he also do so; </b> he shaved his hair like the rest of the Levites? <b>She said to him: Since it is all</b> done <b>for his own prominence, he also said</b> metaphorically: <b>“Let me die with the Philistines”</b> (Judges 16:30); he was willing to humiliate himself in order to humiliate you."
        },
        {
          "verseLocation": "Judges 16:30",
          "verseText": "she says: Let her die with the Philistines.",
          "talmudLocation": "Yevamot 118a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/118a#section-3",
          "talmudFullText": "The Talmud answers that this inference is incorrect, as <b>it was necessary for</b> the Mishnah to state: <b>He did not die, </b> as it might <b>enter your mind to say</b> that <b>this</b> man did in fact <b>die, and</b> with regard to <b>that</b> which <b>she says: He did not die, she intends to ruin her rival wife. And</b> as for herself <b>she says: Let her die with the Philistines. </b> This is a paraphrase of the verse: “Let me die with the Philistines” (Judges 16:30), which is a shorthand expression for one’s desire to hurt his enemies even if he suffers the same fate himself. In this case it means that she is prepared to testify falsely that their husband did not die, so as to ruin her rival wife. Therefore the Mishnah <b>teaches us</b> that this is not the case, and she is not permitted to marry based on the testimony of her rival wife."
        },
        {
          "verseLocation": "Judges 16:30",
          "verseText": "“Let me die with the Philistines”",
          "talmudLocation": "Yevamot 120a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/120a#section-4",
          "talmudFullText": "The Talmud rejects that and suggests that <b>R' Elazar stated</b> his opinion <b>to</b> the Rabbis <b>in accordance with their</b> own <b>statement, </b> as follows: <b>According to my own</b> opinion, <b>one rival wife may testify for another, and although she, </b> herself, <b>has not married, </b> nevertheless <b>we may</b> allow <b>her</b> rival wife <b>to marry. But</b> even <b>according to your own</b> opinion, <b>admit, in any event, that where she has</b> actually <b>married we may</b> allow <b>her</b> rival wife <b>to marry because she would not cause injury to herself. But the Rabbis, </b> rejecting this, say that <b>she acts upon</b> the premise: <b>“Let me die with the Philistines”</b> (Judges 16:30), i.e., a woman may even harm herself by remarrying while her original husband is still alive, in order to harm her rival wife by causing her to remarry as well."
        }
      ]
    },
    {
      "chapterNumber": 17,
      "citations": [
        {
          "verseLocation": "Judges 17:6",
          "verseText": "is the book of Judges. And why did they call it the book of Yashar? As it is written: “In those days there was no king in Israel; every man did that which was right [ yashar ] in his own eyes”",
          "talmudLocation": "Avodah Zarah 25a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/25a#section-14",
          "talmudFullText": "The Talmud provides yet another explanation: <b>R' Shmuel bar Naḥmani says</b> that the book of Yashar <b>is the book of Judges. And why did they call it the book of Yashar? As it is written: “In those days there was no king in Israel; every man did that which was right [<i>yashar</i>] in his own eyes”</b> (Judges 17:6). <b>And where is it alluded</b> to in Judges that Judah must be taught to use the bow? The verse states: <b>“Only that the generations of the children of Israel might know, to teach them war”</b> (Judges 3:2). <b>What is</b> the form of <b>warfare that requires teaching? You must say</b> that <b>this is</b> referring to the use of <b>a bow. </b> This is the referent of the verse in Samuel."
        },
        {
          "verseLocation": "Judges 17:6",
          "verseText": "between kings, as it is written: “In those days there was no king in Israel; every man did that which was right in his own eyes”",
          "talmudLocation": "Chullin 57b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/57b#section-12",
          "talmudFullText": "<b>Rav Aḥa, son of Rava, said to Rav Ashi: But perhaps the king was with them</b> at the time and gave them permission. <b>Or</b> perhaps <b>they</b> already <b>possessed the king’s edict</b> giving them license to kill the ant. <b>Or</b> perhaps it <b>was</b> an interregnum <b>between kings, as it is written: “In those days there was no king in Israel; every man did that which was right in his own eyes”</b> (Judges 17:6). <b>Rather, rely on the credibility of Solomon, </b> the author of Proverbs, that ants have no king."
        },
        {
          "verseLocation": "Judges 17:6",
          "verseText": "“Every man did that which was right in his eyes”",
          "talmudLocation": "Sotah 47b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47b#section-21",
          "talmudFullText": "The <i>baraita</i> continues: <b>From</b> the time <b>when there was an increase</b> in those who <b>placed upon homeowners</b> the obligation to designate the profits from <b>merchandise</b> for the upkeep of judges, <b>bribery and corruption of judgment proliferated and good ceased. From</b> the time <b>when</b> those judges and leaders who say: <b>I accept your favor, and: I hold your favor, proliferated, </b> the fulfillment of the verse: <b>“Every man did that which was right in his eyes”</b> (Judges 17:6), <b>proliferated. Lowly ones were raised and lofty ones were lowered, and the monarchy is increasingly on the decline. From</b> the time <b>when misers and those greedy for profit proliferated, those hardened of heart and who closed their hands from lending proliferated, and they transgressed that which is written in the Torah: </b> “You shall not harden your heart, nor shut your hand from your needy brother…<b>Guard yourself in case</b> there is a base thought in your heart…and you do not give him” (Deuteronomy 15:7, 9)."
        },
        {
          "verseLocation": "Judges 17:7",
          "verseText": "“And there was a young man of Bethlehem in Judah of the family of Judah who was a Levite, and he sojourned there”",
          "talmudLocation": "Bava Batra 109b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/109b#section-6",
          "talmudFullText": "The Talmud raises a difficulty: <b>And</b> is one’s <b>mother’s family</b> indeed <b>not called</b> one’s <b>family? But it is written</b> in the episode of Micah forming an idol to be worshipped: <b>“And there was a young man of Bethlehem in Judah of the family of Judah who was a Levite, and he sojourned there”</b> (Judges 17:7). The Talmud explains the difficulty: <b>This matter itself</b> is <b>difficult. You said: “Who was a Levite, ”</b> as <b>apparently he came from</b> the tribe of <b>Levi, </b> but the verse says: <b>“Of the family of Judah, ”</b> so <b>apparently he came from</b> the tribe of <b>Judah. Rather, is it not that his father</b> was <b>from</b> the tribe of <b>Levi and his mother</b> was <b>from</b> the tribe of <b>Judah, and</b> yet the verse <b>says</b> that he was: <b>“Of the family of Judah”? </b> This appears to prove that one’s mother’s family is also called his family."
        },
        {
          "verseLocation": "Judges 17:13",
          "verseText": "“Now I know that the Lord will do me good, seeing that I have a Levite as my priest”",
          "talmudLocation": "Bava Batra 109b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/109b#section-7",
          "talmudFullText": "<b>Rava bar Rav Ḥanan said</b> in response: <b>No, </b> the verse speaks of <b>a man whose name</b> was <b>Levi, </b> but his father was of the tribe of Judah. The Talmud asks: <b>If that is so, </b> how <b>is that which Micah said</b> when that man agreed to serve as his priest: <b>“Now I know that YHWH will do me good, seeing that I have a Levite as my priest”</b> (Judges 17:13), understood? It is understood only if he was an actual Levite, not if he was from the tribe of Judah and named Levi. Rava bar Rav Ḥanan responded: <b>Yes, </b> it is understood. Micah understood the fact <b>that a man whose name</b> is <b>Levi happened upon him</b> as an auspicious sign."
        }
      ]
    },
    {
      "chapterNumber": 18,
      "citations": [
        {
          "verseLocation": "Judges 18:3",
          "verseText": "“And they turned aside there and said to him: Who brought you here [ halom ], and what [ ma ] are you doing in this place, and what do you have here [ po ]?”",
          "talmudLocation": "Bava Batra 110a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/110a#section-3",
          "talmudFullText": "In connection with the Talmud’s mention of Jonathan, who served as a priest for Micah, the Talmud quotes additional statements of the rabbis concerning that episode. Describing when the men from the tribe of Dan passed through Micah’s house, the verse states: <b>“And they turned aside there and said to him: Who brought you here [<i>halom</i>], and what [<i>ma</i>] are you doing in this place, and what do you have here [<i>po</i>]? ”</b> (Judges 18:3). The rabbis interpret their multiple questions. <b>They said to him: Do you not come from Moses, about whom it is written: “Do not draw close to here [<i>halom</i>]”</b> (Exodus 3:5)? <b>Do you not come from Moses, about whom it is written: “What [<i>ma</i>] is that in your hand”</b> (Exodus 4:2)? <b>Do you not come from Moses, about whom it is written: “But as for you, stand here [<i>po</i>] with me”</b> (Deuteronomy 5:27)? <b>Shall you, </b> a descendant of our teacher Moses, <b>become a priest for idol worship? </b>"
        },
        {
          "verseLocation": "Judges 18:30",
          "verseText": "Levi; but wasn’t Jonathan his name, as it is stated: “And Jonathan, the son of Gershom, the son of Manasseh, he and his sons were priests to the tribe of the Danites”",
          "talmudLocation": "Bava Batra 109b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/109b#section-8",
          "talmudFullText": "The Talmud asks further: <b>But</b> is it <b>so</b> that <b>his name</b> was indeed <b>Levi; but wasn’t Jonathan his name, as it is stated: “And Jonathan, the son of Gershom, the son of Manasseh, he and his sons were priests to the tribe of the Danites”</b> (Judges 18:30)? Rava bar Rav Ḥanan <b>said to him: And according to your reasoning, </b> that his name was not Levi but he was from the tribe of Levi, there is also a difficulty from that same verse: <b>But</b> is it <b>so</b> that <b>he</b> was <b>the son of Manasseh; but wasn’t he the son of Moses, as it is written: “The sons of Moses: Gershom and Eliezer”</b> (I Chronicles 23:15)?"
        },
        {
          "verseLocation": "Judges 18:31",
          "verseText": "alef lamed and it is sacred: “All the time that the house of Elohim was in Shiloh”",
          "talmudLocation": "Shevuot 35b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/35b#section-12",
          "talmudFullText": "<b>All names that are stated with regard to Naboth</b> are <b>sacred, </b> e.g., in the verse: “Naboth blasphemed <i>Elohim</i> and the king” (I Kings 21:13), and those stated <b>with regard to Micah</b> are <b>non-sacred</b> and are referring to the graven image that he fashioned (see Judges, chapters 17–18). <b>R' Eliezer says: </b> Indeed, all names that are stated <b>with regard to Naboth</b> are <b>sacred; </b> but those stated <b>with regard to Micah, some of them are non-sacred and some of them are sacred. </b> The names beginning with the letters <b><i>alef lamed</i>, </b> i.e., <i>Elohim</i>, are <b>non-sacred, </b> as the reference is to the idol that he crafted, and all the names beginning with the letters <b><i>yod heh</i>, </b> i.e., the Tetragrammaton, are <b>sacred, except for this</b> name that begins with the letters <b><i>alef lamed</i> and it is sacred: “All the time that the house of <i>Elohim</i> was in Shiloh”</b> (Judges 18:31)."
        }
      ]
    },
    {
      "chapterNumber": 19,
      "citations": [
        {
          "verseLocation": "Judges 19:2",
          "verseText": "“And his concubine went away from him”",
          "talmudLocation": "Gittin 6b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/6b#section-11",
          "talmudFullText": "<b>And furthermore, R' Evyatar</b> is the one <b>that his Master, </b> God, <b>agreed with</b> in his interpretation of a verse, <b>as it is written</b> with regard to the episode involving the concubine in Gibeah: <b>“And his concubine went away from him”</b> (Judges 19:2). The rabbis discussed what occurred that caused her husband to become so angry with her that she left him, and <b>R' Evyatar says: He found her</b> responsible for <b>a fly</b> in the food that she prepared for him, while <b>R' Yonatan says: He found her</b> responsible for <b>a hair [<i>nima</i>]. </b>"
        }
      ]
    },
    {
      "chapterNumber": 20,
      "citations": [
        {
          "verseLocation": "Judges 20:11",
          "verseText": "“And all the men of Israel gathered to the city, like one man, united [ ḥaverim ]”",
          "talmudLocation": "Chagigah 26a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/26a#section-10",
          "talmudFullText": "§ It was taught in the Mishnah: <b>And during a pilgrimage Festival</b> they are deemed credible <b>even with regard to <i>teruma</i>. </b> The Talmud poses a question: <b>From where are these matters</b> derived, i.e., that there is a difference between Festival days and other periods? <b>R' Yehoshua ben Levi said: The verse states</b> concerning the incident of the concubine in Gibeah: <b>“And all the men of Israel gathered to the city, like one man, united [<i>ḥaverim</i>]”</b> (Judges 20:11). This verse is interpreted to teach that whenever the entire people of Israel gathers together in a single place, <b>the Torah makes, </b> i.e., considers, <b>all of them <i>ḥaverim</i>. </b> The final word of the phrase, <i>ḥaverim</i>, is a reference to the members of a group dedicated to scrupulous observance of mitzvot, as the term is used by the rabbis."
        },
        {
          "verseLocation": "Judges 20:11",
          "verseText": "and the Sages rendered the ritual impurity of an am ha’aretz during a pilgrimage Festival as purity. As it is written: “And all the men of Israel gathered to the city, like one man, united [ ḥaverim ]”",
          "talmudLocation": "Niddah 34a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/34a#section-1",
          "talmudFullText": "This incident occurred during <b>a pilgrimage Festival, </b> either Passover, <i>Sukkot</i>, or <i>Shavuot</i>, <b>and the rabbis rendered the ritual impurity of an <i>am ha’aretz</i> during a pilgrimage Festival as purity. As it is written: “And all the men of Israel gathered to the city, like one man, united [<i>ḥaverim</i>]”</b> (Judges 20:11). Whenever all the Jewish people gather in a single place, such as on a pilgrimage Festival, <b>the verse renders all of them <i>ḥaverim</i>, </b> even one who is an <i>am ha’aretz</i>. There was therefore no concern for impurity due to the saliva of an <i>am ha’aretz</i>. Yet, the High Priest was concerned that this Sadducee was one who has sex with a menstruating woman."
        },
        {
          "verseLocation": "Judges 20:28",
          "verseText": "as it is stated: “And Pinehas, son of Elazar, son of Aaron was standing before it in those days, saying: Shall I yet again go out to battle against the children of Benjamin my brother, or shall I cease?",
          "talmudLocation": "Shevuot 35b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/35b#section-15",
          "talmudFullText": "<b>R' Yehoshua said to</b> R' Eliezer: <b>That which</b> God <b>promised, He fulfilled. </b> In each case, He responded to their question. The first time they consulted God through the <i>Urim VeTummim</i>, <b>but they did not seek to ascertain if</b> they are <b>to triumph</b> in the war or <b>if</b> they are <b>to be defeated. In the last</b> time that they consulted God through the <i>Urim VeTummim</i>, <b>where they sought to ascertain</b> whether they would emerge triumphant, <b>they consented</b> in Heaven <b>to their</b> endeavor, <b>as it is stated: “And Pinehas, son of Elazar, son of Aaron was standing before it in those days, saying: Shall I yet again go out to battle against the children of Benjamin my brother, or shall I cease? </b> And YHWH said: Go up, as tomorrow I will deliver them into your hand” (Judges 20:28)."
        },
        {
          "verseLocation": "Judges 20:28",
          "verseText": "as it is stated: “And Pinehas, the son of Elazar, the son of Aaron, stood before it in those days, saying: Shall I yet again go out to battle against the children of Benjamin my brother, or shall I cease? And God said: Go up, for tomorrow I will deliver him into your hand”",
          "talmudLocation": "Yoma 73b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/73b#section-6",
          "talmudFullText": "The Talmud answers: The first two times <b>they did not check</b> with the <i>Urim VeTummim</i> <b>whether they would be victorious or be defeated</b> but only inquired how and whether they should go to battle. Had they asked, they indeed would have been told that they would not succeed. <b>But on the last time, when they did check</b> and inquire whether they would be successful, the <i>UrimVeTummim</i> <b>agreed</b> with them that they should go to battle and that they would succeed, <b>as it is stated: “And Pinehas, the son of Elazar, the son of Aaron, stood before it in those days, saying: Shall I yet again go out to battle against the children of Benjamin my brother, or shall I cease? And God said: Go up, for tomorrow I will deliver him into your hand”</b> (Judges 20:28)."
        }
      ]
    },
    {
      "chapterNumber": 21,
      "citations": [
        {
          "verseLocation": "Judges 21:1",
          "verseText": "As it is written: “And the men of Israel had taken an oath in Mizpah, saying: None of us shall give his daughter to Benjamin as a wife”",
          "talmudLocation": "Bava Batra 121a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/121a#section-8",
          "talmudFullText": "<b>Rabba bar bar Ḥana says</b> that <b>R' Yoḥanan</b> offered another explanation: The fifteenth of Av was the <b>day when</b> the <b>tribe of Benjamin was permitted to enter into the congregation</b> of the other tribes of Israel through marriage, after the other tribes found a way to dissolve the vow that had prohibited them from marrying a member of the tribe of Benjamin in the aftermath of the episode of the concubine in Gibeah (Judges, chapters 19–20). <b>As it is written: “And the men of Israel had taken an oath in Mizpah, saying: None of us shall give his daughter to Benjamin as a wife”</b> (Judges 21:1). The Talmud asks: <b>What</b> verse <b>did</b> the rabbis of that time <b>interpret</b> that enabled them to dissolve this vow? The verse states: “None <b>of us, ” and not: </b> None <b>of our children; </b> therefore, the oath applied only to the generation that had taken the oath."
        },
        {
          "verseLocation": "Judges 21:1",
          "verseText": "as it is stated: “And the men of Israel had sworn in Mizpah, saying: None of us shall give his daughter to Benjamin as a wife”",
          "talmudLocation": "Taanit 30b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/30b#section-11",
          "talmudFullText": "<b>Rav Yosef said</b> that <b>Rav Naḥman said: </b> The fifteenth of Av was the <b>day on which the tribe of Benjamin was permitted to enter the congregation</b> of the Jewish people. After the tragic incident at Gibeah, for which the tribe of Benjamin was blamed, the other tribes ostracized them. They took an oath to prohibit themselves from marrying a member of the tribe of Benjamin, <b>as it is stated: “And the men of Israel had sworn in Mizpah, saying: None of us shall give his daughter to Benjamin as a wife”</b> (Judges 21:1). The Talmud asks: <b>What did they expound</b> that enabled them to dissolve this oath? <b>Rav said: </b> They understood the verse literally, as it states: “None <b>of us, ” and not: </b> None <b>of our children, </b> i.e., the oath applied only to the generation that took the oath, not their descendants."
        },
        {
          "verseLocation": "Judges 21:12",
          "verseText": "“And they found among the inhabitants of Jabesh-gilead four hundred young virgins that had not known man by lying with him”",
          "talmudLocation": "Yevamot 60b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/60b#section-12",
          "talmudFullText": "<b>Similarly, you</b> can <b>say</b> with regard to the verse: <b>“And they found among the inhabitants of Jabesh-gilead four hundred young virgins that had not known man by lying with him”</b> (Judges 21:12). <b>From where did they know</b> that they were virgins? <b>Rav Kahana said: They sat them on the opening of a jug of wine. </b> If she was <b>a non-virgin, her breath</b> would <b>smell</b> like wine; if she was <b>a virgin, her breath did not smell</b> like wine."
        },
        {
          "verseLocation": "Judges 21:17",
          "verseText": "“And they said: They that are escaped must be as an inheritance for Benjamin, that a tribe be not blotted out from Israel”",
          "talmudLocation": "Bava Batra 116a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/116a#section-2",
          "talmudFullText": "Having discussed the <i>halakha</i> of a son’s daughter’s right to inheritance, the Talmud cites a verse that relates to the matter. After the incident known as: The concubine in Gibeah, the men of the tribe of Benjamin numbered only six hundred, and each of these men had inherited large plots of land from their deceased relatives. The verse states: <b>“And they said: They that are escaped must be as an inheritance for Benjamin, that a tribe be not blotted out from Israel”</b> (Judges 21:17)."
        },
        {
          "verseLocation": "Judges 21:19",
          "verseText": "as it is written: “And they said: Behold, there is the feast of the Lord from year to year in Shiloh, which is on the north of Bethel, on the east side of the highway that goes up from Bethel to Shechem, and on the south of Lebonah”",
          "talmudLocation": "Gittin 7b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/7b#section-4",
          "talmudFullText": "<b>Abaye said: A strip extends</b> northward from Akko, which is still considered part of Eretz Yisrael, but the general border is at the latitude of Akko. The Talmud asks: <b>But</b> would the <b><i>tanna</i></b> of the <i>baraita</i> <b>provide a sign</b> in <b>this</b> manner for an area of a strip of land? The Talmud answers: <b>Yes, </b> and <b>a verse also provides a sign</b> in this manner, <b>as it is written: “And they said: Behold, there is the feast of YHWH from year to year in Shiloh, which is on the north of Bethel, on the east side of the highway that goes up from Bethel to Shechem, and on the south of Lebonah”</b> (Judges 21:19). <b>And Rav Pappa said: </b> The expression: “On the east side,” should be understood as meaning <b>to the east of the highway. </b> This verse demonstrates that an area as narrow as a road can be used as a sign."
        }
      ]
    }
  ]
}