{
  "bookName": "Lamentations",
  "totalEntries": 81,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Lamentations 1:1",
          "verseText": "“How does the city sit solitary”",
          "talmudLocation": "Moed Katan 26a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26a#section-16",
          "talmudFullText": "The Talmud explains: They said to Jehoiakim: Jeremiah has written a book of Lamentations over the future downfall and destruction of Jerusalem. He said to them: What is written in it?  They read him the first verse: “How does the city sit solitary” (Lamentations 1:1). He said to them: I am king,  and this does not apply to me. They read him the second verse: “She weeps sore in the night” (Lamentations 1:2). He said to them: I am king,  and this does not apply to me. They read him the 3rd verse: “Judah is gone into exile due to affliction” (Lamentations 1:3). He said to them: I am king.  They read to him: “The ways of Zion do mourn” (Lamentations 1:4). He said to them: I am king.  These are the four leaves, or verses, that he read first."
        },
        {
          "verseLocation": "Lamentations 1:1",
          "verseText": "“How [ eikha ] does the city sit solitary”",
          "talmudLocation": "Sanhedrin 104a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104a#section-12",
          "talmudFullText": "§ Apropos the exile of the descendants of the kings of Judea to Babylonia, the Talmud cites an aggadic statement about the destruction of the Temple and the sins of the Jewish people that caused it. With regard to the verse: “How [eikha] does the city sit solitary” (Lamentations 1:1), Rava says that R' Yoḥanan says: For what reason were the Jewish people stricken and their plight bemoaned with the term eikha?  It is due to the fact that they violated thirty-six prohibitions punishable with karet that are enumerated in the Torah,  corresponding to the numerological value of eikha, spelled alef, yod, kaf, heh."
        },
        {
          "verseLocation": "Lamentations 1:1",
          "verseText": "“The city that was full of people”",
          "talmudLocation": "Sanhedrin 104a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104a#section-14",
          "talmudFullText": "With regard to the phrase “Does the city sit solitary, ” Rava says that R' Yoḥanan says that God said: I said: “And Israel dwells in safety, the fountain of Jacob in solitude, to a land of grain and wine; also His heavens shall drop down dew” (Deuteronomy 33:28), indicating that their solitude shall be one of wealth and prominence. Now that they have rejected my directive and cleaved to and learned from the non-Jews, their dwelling shall be solitary in sorrow. With regard to the phrase: “The city that was full of people” (Lamentations 1:1), Rava says that R' Yoḥanan says: They would marry a younger female to an older male and an older female to a younger male so that they would have many children. "
        },
        {
          "verseLocation": "Lamentations 1:1",
          "verseText": "“She became like a widow”",
          "talmudLocation": "Sanhedrin 104a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104a#section-15",
          "talmudFullText": "With regard to the phrase describing Jerusalem: “She became like a widow” (Lamentations 1:1), Rav Yehuda says that Rav says: Like a widow, but not an actual widow. Rather,  Jerusalem is like a woman whose husband has gone to a country overseas, and yet he intends to return to her.  With regard to the phrase: “Great among the nations, and princess among the provinces” (Lamentations 1:1), Rava says that R' Yoḥanan says: Every place they go,  when exiled among the nations, the Jewish people become princes to their masters due to their wisdom."
        },
        {
          "verseLocation": "Lamentations 1:1",
          "verseText": "“How she has become like a widow”",
          "talmudLocation": "Taanit 20a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/20a#section-11",
          "talmudFullText": "Similarly, with regard to the verse: “How she has become like a widow” (Lamentations 1:1), Rav Yehuda said:  This too is for a blessing.  The verse states that Jerusalem is like a widow, but is not an actual widow. Rather,  Jerusalem is like a woman whose husband has gone to a country overseas.  Without her husband by her side she is likened to a widow, and yet he intends to return to her. "
        },
        {
          "verseLocation": "Lamentations 1:2",
          "verseText": "“She weeps sore in the night”",
          "talmudLocation": "Moed Katan 26a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26a#section-16",
          "talmudFullText": "The Talmud explains: They said to Jehoiakim: Jeremiah has written a book of Lamentations over the future downfall and destruction of Jerusalem. He said to them: What is written in it?  They read him the first verse: “How does the city sit solitary” (Lamentations 1:1). He said to them: I am king,  and this does not apply to me. They read him the second verse: “She weeps sore in the night” (Lamentations 1:2). He said to them: I am king,  and this does not apply to me. They read him the 3rd verse: “Judah is gone into exile due to affliction” (Lamentations 1:3). He said to them: I am king.  They read to him: “The ways of Zion do mourn” (Lamentations 1:4). He said to them: I am king.  These are the four leaves, or verses, that he read first."
        },
        {
          "verseLocation": "Lamentations 1:2",
          "verseText": "“She cries [ bakho tivke ] at night”",
          "talmudLocation": "Sanhedrin 104b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-4",
          "talmudFullText": "§ The Talmud returns to its interpretation of verses in Lamentations: “She cries [bakho tivke] at night” (Lamentations 1:2). These two cries,  indicated by the use of a compound verb, why are they written? Rabba says that R' Yoḥanan says: One is a cry over the destruction of the First Temple, and one is a cry over the destruction of the Second Temple,  which was destined to be destroyed. The term “at night” indicates that the crying is over matters of night, as it is stated with regard to the response of the Jewish people to the report of the spies after their return from the land of Canaan: “And all the congregation lifted up their voice, and the people cried that night” (Numbers 14:1)."
        },
        {
          "verseLocation": "Lamentations 1:2",
          "verseText": "“And her tears are on her cheeks”",
          "talmudLocation": "Sanhedrin 104b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-7",
          "talmudFullText": "With regard to the verse: “And her tears are on her cheeks” (Lamentations 1:2), Rava says that R' Yoḥanan says:  This is like a woman who cries over the husband of her youth, as it is stated: “Lament like a virgin girded with sackcloth for the husband of her youth” (Joel 1:8). With regard to the verse: “Her adversaries have become the head” (Lamentations 1:5), Rava says that R' Yoḥanan says:  This indicates that anyone who torments the Jewish people becomes a leader, as it is stated: “For there is no weariness to him that is set against her; at the first He lightly afflicted the land of Zebulun, and the land of Naphtali and afterward He afflicted her more grievously by the way of the sea, beyond the Jordan and the Galilee of the nations” (Isaiah 8:23). Rava says that R' Yoḥanan says:  From this verse one derives that anyone who harasses Israel does not grow weary. "
        },
        {
          "verseLocation": "Lamentations 1:3",
          "verseText": "“Judah is gone into exile due to affliction”",
          "talmudLocation": "Moed Katan 26a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26a#section-16",
          "talmudFullText": "The Talmud explains: They said to Jehoiakim: Jeremiah has written a book of Lamentations over the future downfall and destruction of Jerusalem. He said to them: What is written in it?  They read him the first verse: “How does the city sit solitary” (Lamentations 1:1). He said to them: I am king,  and this does not apply to me. They read him the second verse: “She weeps sore in the night” (Lamentations 1:2). He said to them: I am king,  and this does not apply to me. They read him the 3rd verse: “Judah is gone into exile due to affliction” (Lamentations 1:3). He said to them: I am king.  They read to him: “The ways of Zion do mourn” (Lamentations 1:4). He said to them: I am king.  These are the four leaves, or verses, that he read first."
        },
        {
          "verseLocation": "Lamentations 1:4",
          "verseText": "from here: “Her virgins are sorrowed [ nugot ] and she is embittered”",
          "talmudLocation": "Berakhot 28a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/28a#section-19",
          "talmudFullText": "Similarly, R' Elazar said: Regarding anyone who recites the morning prayer after four hours of the day, according to R' Yehuda, the verse states: “Those who are in sorrow [nugei] far from the Festivals, I shall gather from you,  they who carried for you the burden of insult” (Zephaniah 3:18). From where may it be inferred that nugei is an expression of sorrow? As it is written: “My soul drips in sorrow [tuga]” (Psalms 119:28). Rav Naḥman bar Yitzḥak said:  The proof that nugei indicates suffering is from here: “Her virgins are sorrowed [nugot] and she is embittered” (Lamentations 1:4)."
        },
        {
          "verseLocation": "Lamentations 1:4",
          "verseText": "“The ways of Zion do mourn”",
          "talmudLocation": "Moed Katan 26a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26a#section-16",
          "talmudFullText": "The Talmud explains: They said to Jehoiakim: Jeremiah has written a book of Lamentations over the future downfall and destruction of Jerusalem. He said to them: What is written in it?  They read him the first verse: “How does the city sit solitary” (Lamentations 1:1). He said to them: I am king,  and this does not apply to me. They read him the second verse: “She weeps sore in the night” (Lamentations 1:2). He said to them: I am king,  and this does not apply to me. They read him the 3rd verse: “Judah is gone into exile due to affliction” (Lamentations 1:3). He said to them: I am king.  They read to him: “The ways of Zion do mourn” (Lamentations 1:4). He said to them: I am king.  These are the four leaves, or verses, that he read first."
        },
        {
          "verseLocation": "Lamentations 1:5",
          "verseText": "battle against them in that world, and you will become the chief, as it is written: “Her adversaries [ tzareha ] have become the chief”",
          "talmudLocation": "Gittin 56b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/56b#section-18",
          "talmudFullText": "§ The Talmud relates: Onkelos bar Kalonikos, the son of Titus’s sister, wanted to convert to Judaism. He went and raised Titus from the grave through necromancy,  and said to him: Who is most important in that world where you are now? Titus said to him: The Jewish people.  Onkelos asked him: Should I then attach myself to them here in this world? Titus said to him: Their commandments are numerous, and you will not be able to fulfill them.  It is best that you do as follows: Go out and battle against them in that world, and you will become the chief, as it is written: “Her adversaries [tzareha] have become the chief” (Lamentations 1:5), which means: Anyone who distresses [meitzer] Israel will become the chief.  Onkelos said to him: What is the punishment of that man,  a euphemism for Titus himself, in the next world? Titus said to him: "
        },
        {
          "verseLocation": "Lamentations 1:5",
          "verseText": "“Her adversaries have become the chief”",
          "talmudLocation": "Moed Katan 26a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/26a#section-17",
          "talmudFullText": "They read him an additional verse: “Her adversaries have become the chief” (Lamentations 1:5), i.e., the reigning king will be removed from power. Once he heard this, he said to them: Who said this? They said to him: This is the continuation of the verse: “For YHWH has afflicted her for the multitude of her transgressions” (Lamentations 1:5). Immediately, he cut out all the names of God from the book and burned them in fire. This is as it is written: “Yet they were not afraid, nor rent their garments,  neither the king, nor any of his servants that heard all these words” (Jeremiah 36:24). By inference,  this shows that they were required to rend their clothing when they saw this."
        },
        {
          "verseLocation": "Lamentations 1:5",
          "verseText": "“Her adversaries have become the head”",
          "talmudLocation": "Sanhedrin 104b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-7",
          "talmudFullText": "With regard to the verse: “And her tears are on her cheeks” (Lamentations 1:2), Rava says that R' Yoḥanan says:  This is like a woman who cries over the husband of her youth, as it is stated: “Lament like a virgin girded with sackcloth for the husband of her youth” (Joel 1:8). With regard to the verse: “Her adversaries have become the head” (Lamentations 1:5), Rava says that R' Yoḥanan says:  This indicates that anyone who torments the Jewish people becomes a leader, as it is stated: “For there is no weariness to him that is set against her; at the first He lightly afflicted the land of Zebulun, and the land of Naphtali and afterward He afflicted her more grievously by the way of the sea, beyond the Jordan and the Galilee of the nations” (Isaiah 8:23). Rava says that R' Yoḥanan says:  From this verse one derives that anyone who harasses Israel does not grow weary. "
        },
        {
          "verseLocation": "Lamentations 1:6",
          "verseText": "Rabbi Ḥanina said: Jerusalem was destroyed only because the people did not rebuke one another, as it is stated: “Her ministers were like stags that found no pasture,",
          "talmudLocation": "Shabbat 119b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/119b#section-9",
          "talmudFullText": "Rav Amram, son of R' Shimon bar Abba, said that R' Shimon bar Abba said that R' Ḥanina said: Jerusalem was destroyed only because the people did not rebuke one another, as it is stated: “Her ministers were like stags that found no pasture,  and they walked without strength before their pursuer” (Lamentations 1:6). Just as this stag turns its head toward the other’s tail when it grazes, and each one feeds on its own, so too, the Jewish people in that generation lowered their faces to the ground and did not rebuke one another.  R' Yehuda said: Jerusalem was destroyed only because they disparaged the Torah scholars in it, as it is stated: “And they mocked the messengers of God and disdained His words and taunted His prophets, until the wrath of God arose against His people, until it could not be healed” (II Chronicles 36:16). What is the meaning of: Until it could not be healed? Rav Yehuda said that Rav said:  It means that anyone who disparages Torah scholars cannot be healed from his wound. "
        },
        {
          "verseLocation": "Lamentations 1:6",
          "verseText": "all her splendor”",
          "talmudLocation": "Yoma 54a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54a#section-1",
          "talmudFullText": "all her splendor” (Lamentations 1:6). What is the meaning of: “All her splendor [hadara]”?  It means: Her chamber [ḥadra],  i.e., something that was hidden within the innermost chambers, namely the Ark. You,  R' Shimon ben Yoḥai, what do you say in response to this? He said to him: As I say, the Ark was buried in its place and not exiled, as it is stated: “And the staves were so long that the ends of the staves were seen from the sacred place before the partition, but they could not be seen without; and they are there to this day” (I Kings 8:8)."
        },
        {
          "verseLocation": "Lamentations 1:8",
          "verseText": "them, as it is stated: “All who honored her debase her because they have seen her nakedness”",
          "talmudLocation": "Yoma 54b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54b#section-1",
          "talmudFullText": "It means like a man joined and clinging to his livaya,  his partner, i.e., his wife. In other words, the cherubs appeared to be embracing one another. Reish Lakish said: When non-Jews destroyed the Second Temple and entered the Sanctuary, they saw these drawings of cherubs clinging to one another.  They peeled them from the wall, took them out to the market, and said: These Jews, whose blessing is a blessing and whose curse is a curse,  due to their great fear of God, should they be occupied with such matters,  making images of this kind? They immediately debased and destroyed them, as it is stated: “All who honored her debase her because they have seen her nakedness” (Lamentations 1:8)."
        },
        {
          "verseLocation": "Lamentations 1:9",
          "verseText": "“Her filthiness [ tumatah ] is in her skirts”",
          "talmudLocation": "Bava Kamma 55a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/55a#section-5",
          "talmudFullText": "The Talmud asks: This latter statement is problematic, as even according to this explanation, one can say that a single letter tet alludes to the verse: “Her filthiness [tumatah] is in her skirts” (Lamentations 1:9), which begins with the letter tet. The Talmud answers: We mean that when one sees the letter tet together with the letter bet in his dream, it is a good sign for him, as the word tov is written with both. The Talmud asks further: According to this, say that it alludes to the verse: “Her gates are sunk [tave’u] into the ground” (Lamentations 2:9), which begins with the letter tet followed by the letter bet."
        },
        {
          "verseLocation": "Lamentations 1:9",
          "verseText": "“Her impurity was in her skirts”",
          "talmudLocation": "Yoma 57a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/57a#section-1",
          "talmudFullText": "Now you are certainly impure, as it is written about the Jewish people: “Her impurity was in her skirts” (Lamentations 1:9), and the Shekhina does not dwell upon the Jews when they are impure. R' Ḥanina said to him: Come and see what is written about the Jewish people: “That dwells with them in the midst of their impurity” (Leviticus 16:16). This indicates that even when they are impure, the Shekhina dwells among them. "
        },
        {
          "verseLocation": "Lamentations 1:10",
          "verseText": "which is written: “The adversary has spread out his hand upon all her treasures;",
          "talmudLocation": "Yevamot 16b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/16b#section-7",
          "talmudFullText": "And R' Shmuel bar Naḥmani further said that R' Yonatan said: What is the meaning of that which is written: “The adversary has spread out his hand upon all her treasures;  for she has seen that the heathens have entered into her Temple, concerning which You commanded that they should not enter into Your congregation” (Lamentations 1:10)? This is referring to Ammon and Moab.  How so? When the non-Jews entered the Sanctuary, all turned to plunder the silver and the gold, and the soldiers from Ammon and Moab turned to the scrolls of Torah to destroy them. They said:  Is this the scroll in which it is written: “An Ammonite and a Moabite shall not enter into the assembly of YHWH” (Deuteronomy 23:4)? Let it be burnt by fire. "
        },
        {
          "verseLocation": "Lamentations 1:12",
          "verseText": "“It is nothing to you, all you who pass by”",
          "talmudLocation": "Sanhedrin 104b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-8",
          "talmudFullText": "With regard to the verse: “It is nothing to you, all you who pass by” (Lamentations 1:12), Rava says that R' Yoḥanan says: From here there is a source from the Torah for complaint,  i.e., it is appropriate for one to make his suffering public so that others will have compassion for him. With regard to the phrase “all you who pass by, ” Rav Amram says that Rav says that it is as though Jerusalem said: They have rendered me like a city of those who violate the most fundamental precepts of law and morality, as, with regard to Sodom, it is written: “Then YHWH rained upon Sodom brimstone and fire from YHWH out of Heaven” (Genesis 19:24), while with regard to Jerusalem, it is written: “From above He has sent fire into my bones, and it prevails against them” (Lamentations 1:13). In both cities, fire rained down from Heaven. And it is written: “For the iniquity of the daughter of my people is greater than the sin of Sodom” (Lamentations 4:6)."
        },
        {
          "verseLocation": "Lamentations 1:13",
          "verseText": "while with regard to Jerusalem, it is written: “From above He has sent fire into my bones, and it prevails",
          "talmudLocation": "Sanhedrin 104b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-8",
          "talmudFullText": "With regard to the verse: “It is nothing to you, all you who pass by” (Lamentations 1:12), Rava says that R' Yoḥanan says: From here there is a source from the Torah for complaint,  i.e., it is appropriate for one to make his suffering public so that others will have compassion for him. With regard to the phrase “all you who pass by, ” Rav Amram says that Rav says that it is as though Jerusalem said: They have rendered me like a city of those who violate the most fundamental precepts of law and morality, as, with regard to Sodom, it is written: “Then YHWH rained upon Sodom brimstone and fire from YHWH out of Heaven” (Genesis 19:24), while with regard to Jerusalem, it is written: “From above He has sent fire into my bones, and it prevails against them” (Lamentations 1:13). In both cities, fire rained down from Heaven. And it is written: “For the iniquity of the daughter of my people is greater than the sin of Sodom” (Lamentations 4:6)."
        },
        {
          "verseLocation": "Lamentations 1:14",
          "verseText": "“The Lord has given me into the hands of those against whom I cannot stand”",
          "talmudLocation": "Yevamot 63b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/63b#section-7",
          "talmudFullText": "The Talmud cites further statements on the same issue. The verse states: “Behold, I will bring evil upon them, which they shall not be able to escape” (Jeremiah 11:11). Rav Naḥman said that Rabba bar Avuh said: This is a bad wife whose marriage contract is large.  Similarly, with regard to the verse: “YHWH has given me into the hands of those against whom I cannot stand” (Lamentations 1:14), Rav Ḥisda said that Mar Ukva bar Ḥiyya said: This is a bad wife whose marriage contract is large. In the West,  Eretz Yisrael, they said this verse is referring to one whose food is dependent on his money.  He is forced to purchase his food with cash, as he does not possess land of his own."
        },
        {
          "verseLocation": "Lamentations 1:15",
          "verseText": "as it is written: “He proclaimed an appointed time against me to crush my young men”",
          "talmudLocation": "Pesachim 77a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/77a#section-2",
          "talmudFullText": "This is in accordance with what Abaye said in order to defend the tradition that the spies returned from Eretz Yisrael and the entire Jewish people cried unnecessarily on the 9th of Av, which resulted in the 9th of Av becoming a day of crying for future generations. The calculation of the days does not work out precisely, and therefore Abaye said: They filled out Tammuz of that year,  meaning that it was a thirty-day month, rather than a twenty-nine-day month as it is nowadays. There is an allusion to this in a verse, as it is written: “He proclaimed an appointed time against me to crush my young men” (Lamentations 1:15), meaning that the New Moon was proclaimed in order to harm the Jewish people in the future. This proves that even the New Moon is called an appointed time."
        },
        {
          "verseLocation": "Lamentations 1:15",
          "verseText": "“The Lord has spurned all my mighty men in the midst of me”",
          "talmudLocation": "Sanhedrin 104b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-10",
          "talmudFullText": "The verse: “YHWH has spurned all my mighty men in the midst of me” (Lamentations 1:15), means that this is like a person who says to another: This coin was invalidated.  The prominent residents of Jerusalem were crushed and discredited, and their reputations were irreversibly tainted."
        },
        {
          "verseLocation": "Lamentations 1:15",
          "verseText": "as it is stated: “The Lord has trodden the virgin, the daughter of Judah, as in a winepress”",
          "talmudLocation": "Sanhedrin 96b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/96b#section-4",
          "talmudFullText": "He was proceeding and killing until he reached the Sanctuary.  When he reached the Sanctuary, he ignited a fire in it. The Sanctuary rose,  seeking to enter Heaven so that it would not burn. They trod upon it from Heaven and returned it to its place, as it is stated: “YHWH has trodden the virgin, the daughter of Judah, as in a winepress” (Lamentations 1:15). Nebuzaradan became haughty,  taking pride in his conquest. A bat kol emerged and said to him:  Your haughtiness is unwarranted, as you killed a nation that was already dead, you burned a Sanctuary that was already burned,  and you ground flour that was already ground, as it is stated with regard to Babylonia: “Take millstones and grind flour; uncover your locks, tuck up the train, uncover the leg, pass over rivers” (Isaiah 47:2). It was not stated:  Grind wheat, but “grind flour, ” indicating that all the destruction had already been wrought by God, and the role played by the enemy was insignificant."
        },
        {
          "verseLocation": "Lamentations 1:15",
          "verseText": "as it is written: “He proclaimed a festival to crush my young men”",
          "talmudLocation": "Shevuot 10a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/10a#section-13",
          "talmudFullText": "The Talmud refutes this: In truth,  the New Moon is also called a Festival, in accordance with what Abaye says with regard to a different issue, as Abaye says:  With regard to the month of Tammuz in that year during which the Jewish people sinned by accepting the slanderous report of the spies about Eretz Yisrael, the court made it a full month of thirty days, as it is written: “He proclaimed a festival to crush my young men” (Lamentations 1:15). Abaye understands the verse to mean that by extending the month of Tammuz by an extra day, by proclaiming that the thirtieth day should be celebrated as a New Moon in addition to the first day of the following month, it emerged that the acceptance of the spies’ report occurred on the 9th of Av, and not the 8th, thereby defining the 9th of Av as an ominous day for the Jewish people. From Abaye’s explanation it is apparent that the New Moon is also called a Festival."
        },
        {
          "verseLocation": "Lamentations 1:15",
          "verseText": "as it is written: “He has called an appointed time against me to crush my young men”",
          "talmudLocation": "Taanit 29a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/29a#section-6",
          "talmudFullText": "Abaye said: The month of Tammuz of that year was a full month of thirty days. Accordingly, there are exactly forty days until the 9th of Av. And this is alluded to in the following verse, as it is written: “He has called an appointed time against me to crush my young men” (Lamentations 1:15). This indicates that an additional appointed day, i.e., a New Moon, was added so that this calamity would fall specifically on the 9th of Av."
        },
        {
          "verseLocation": "Lamentations 1:16",
          "verseText": "Jeremiah lamented: “For these things I weep; my eye, my eye runs down with water”",
          "talmudLocation": "Gittin 58a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/58a#section-13",
          "talmudFullText": "When dawn arrived they recognized each other and saw that they were brother and sister. They fell on each other and burst into tears until their souls departed due to their great distress. And with regard to them and others like them, Jeremiah lamented: “For these things I weep; my eye, my eye runs down with water” (Lamentations 1:16)."
        },
        {
          "verseLocation": "Lamentations 1:16",
          "verseText": "Menaḥem ben Ḥizkiyya is his name, as it is stated: “Because the comforter [ menaḥem ] that should relieve my soul is far from me”",
          "talmudLocation": "Sanhedrin 98b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98b#section-14",
          "talmudFullText": "Apropos the Messiah, the Talmud asks: What is his name? The school of R' Sheila says: Shiloh is his name, as it is stated: “Until when Shiloh shall come” (Genesis 49:10). The school of R' Yannai says: Yinnon is his name, as it is stated: “May his name endure forever; may his name continue [yinnon] as long as the sun;  and may men bless themselves by him” (Psalms 72:17). The school of R' Ḥanina says: Ḥanina is his name, as it is stated: “For I will show you no favor [ḥanina]” (Jeremiah 16:13). And some say that Menaḥem ben Ḥizkiyya is his name, as it is stated: “Because the comforter [menaḥem] that should relieve my soul is far from me” (Lamentations 1:16). And the Rabbis say: The metzora of the house of R' Yehuda HaNasi is his name, as it is stated: “Indeed our illnesses he did bear and our pains he endured; yet we did esteem him injured, stricken by God, and afflicted” (Isaiah 53:4)."
        },
        {
          "verseLocation": "Lamentations 1:17",
          "verseText": "“The Lord has commanded concerning Jacob, that they that are round about him should be his adversaries”",
          "talmudLocation": "Kiddushin 72b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/72b#section-3",
          "talmudFullText": "The Talmud stated above that Homanya is an Ammonite city. The verse states: “YHWH has commanded concerning Jacob, that they that are round about him should be his adversaries” (Lamentations 1:17), indicating that the Jewish people are surrounded by enemies even in its exile. Rav Yehuda says: Homanya is close to Pum Nahara,  which had Jewish residents."
        },
        {
          "verseLocation": "Lamentations 1:17",
          "verseText": "“Jerusalem among them was a like a menstruating woman”",
          "talmudLocation": "Taanit 20a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/20a#section-10",
          "talmudFullText": "This statement reverses the plain meaning of a verse. The Talmud provides other interpretations that Rav Yehuda attributed to Rav, which also run contrary to the simple meaning of a verse. “Jerusalem among them was a like a menstruating woman” (Lamentations 1:17). Rav Yehuda said that Rav said:  Although the simple meaning of this verse is a curse, it can also be understood as a blessing.  Jerusalem was like a menstruating woman: Just as a menstruating woman will become permitted to her husband after the conclusion of her days of ritual impurity, so too, Jerusalem will be repaired from its destruction."
        },
        {
          "verseLocation": "Lamentations 1:17",
          "verseText": "“The Lord has commanded against Jacob that they who are round about him should be his adversaries”",
          "talmudLocation": "Yevamot 16b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/16b#section-8",
          "talmudFullText": "With regard to the Ammonites, the Talmud cites another verse: “YHWH has commanded against Jacob that they who are round about him should be his adversaries” (Lamentations 1:17). Rav said: For an example of this, there is the city Homanya in relation to the city Pum Nahara,  as the descendants of the Ammonites live in Homanya, and they harass the Jews of Pum Nahara."
        },
        {
          "verseLocation": "Lamentations 1:18",
          "verseText": "said: “The Lord is righteous, for I have rebelled against His word”",
          "talmudLocation": "Taanit 22b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/22b#section-6",
          "talmudFullText": "The Talmud discusses Josiah’s deathbed reflections. When Josiah was dying, Jeremiah saw his lips moving.  Jeremiah said: Perhaps, Heaven forbid, he is saying something improper and complaining about God’s judgment on account of his great distress.  Jeremiah bent over and heard that he was justifying God’s judgment against himself.  Josiah said: “YHWH is righteous, for I have rebelled against His word” (Lamentations 1:18). At that moment,  Jeremiah began his eulogy for Josiah: “The breath of our nostrils, the anointed of YHWH,  was trapped in their pits” (Lamentations 4:20)."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Lamentations 2:1",
          "verseText": "book of Lamentations and was reading from it. When he reached the verse: “He has cast down from heaven to earth",
          "talmudLocation": "Chagigah 5b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/5b#section-16",
          "talmudFullText": "The Talmud relates: R' Yehuda HaNasi was holding the book of Lamentations and was reading from it. When he reached the verse: “He has cast down from heaven to earth the beauty of Israel” (Lamentations 2:1), in his distress the book fell from his hand. He said: From a high roof to a deep pit,  i.e., it is terrible to tumble from the sky to the ground."
        },
        {
          "verseLocation": "Lamentations 2:2",
          "verseText": "“The Lord has swallowed up without pity all the habitations of Jacob”",
          "talmudLocation": "Gittin 57a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/57a#section-11",
          "talmudFullText": "§ Concerning the verse: “YHWH has swallowed up without pity all the habitations of Jacob” (Lamentations 2:2), it is related that when Ravin came from Eretz Yisrael to Babylonia he said that R' Yoḥanan says: This is referring to the six hundred thousand cities that King Yannai had in the King’s Mountain.  As Rav Yehuda says that Rav Asi says: King Yannai had six hundred thousand cities in the King’s Mountain, and each of them had a population as great as the number of those who left Egypt, except for three of those cities, the population of which was double the number of those who left Egypt. "
        },
        {
          "verseLocation": "Lamentations 2:3",
          "verseText": "“He has cut off in His fierce anger all the horn of Israel”",
          "talmudLocation": "Gittin 57a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/57a#section-22",
          "talmudFullText": "It was in connection with the war that ensued that the rabbis expounded the following verse: “He has cut off in His fierce anger all the horn of Israel” (Lamentations 2:3). R' Zeira says that R' Abbahu says that R' Yoḥanan says: These are the eighty thousand officers bearing battle trumpets in their hands, who entered the city of Beitar when the enemy took it and killed men, women, and children until their blood flowed into the Great Sea. Lest you say that the city was close to the sea, know that it was a mil away. "
        },
        {
          "verseLocation": "Lamentations 2:8",
          "verseText": "as it is written: “He has made the rampart and wall mourn”",
          "talmudLocation": "Pesachim 86a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/86a#section-13",
          "talmudFullText": "The Talmud answers: You find it in the case of the low wall on the Temple Mount, which was the same height as the floor of the courtyard. This low wall is mentioned in the Bible, as it is written: “He has made the rampart and wall mourn” (Lamentations 2:8), and R' Aḥa said, and some say it in the name of R' Ḥanina,  that this double language of both rampart and wall in the verse is referring to a wall and a low wall that were next to each other. This low wall was the same height as the floor of the courtyard."
        },
        {
          "verseLocation": "Lamentations 2:9",
          "verseText": "“Her gates are sunk [ tave’u ] into the ground”",
          "talmudLocation": "Bava Kamma 55a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/55a#section-5",
          "talmudFullText": "The Talmud asks: This latter statement is problematic, as even according to this explanation, one can say that a single letter tet alludes to the verse: “Her filthiness [tumatah] is in her skirts” (Lamentations 1:9), which begins with the letter tet. The Talmud answers: We mean that when one sees the letter tet together with the letter bet in his dream, it is a good sign for him, as the word tov is written with both. The Talmud asks further: According to this, say that it alludes to the verse: “Her gates are sunk [tave’u] into the ground” (Lamentations 2:9), which begins with the letter tet followed by the letter bet."
        },
        {
          "verseLocation": "Lamentations 2:9",
          "verseText": "as it is written: “Her gates are sunk into the ground”",
          "talmudLocation": "Sotah 9a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9a#section-14",
          "talmudFullText": "With regard to David,  the citadel that housed his home and city, was not destroyed, as it is written: “Her gates are sunk into the ground” (Lamentations 2:9), as the gates of Jerusalem built by David were not destroyed by enemies, but sunk into the ground and were buried there. This is also so with regard to Moses, as the Master said: When the first Temple was built, the Tent of Meeting was sequestered,  including its boards, its clasps, and its bars, and its pillars, and its sockets.  The Talmud asks: Where is it sequestered? Rav Ḥisda says that Avimi says: Beneath the tunnels of the Sanctuary. "
        },
        {
          "verseLocation": "Lamentations 2:10",
          "verseText": "“They sit upon the ground, and keep silence, the elders of the daughter of Zion”",
          "talmudLocation": "Nedarim 65a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/65a#section-4",
          "talmudFullText": "He said to them: Can one request the dissolution of an oath? They said to him: Yes. He said to them:  Must this be done in the presence of the person he took an oath to, or even not in his presence? They said to him:  It must be dissolved in his presence. He said to them: And you, what did you do? What is the reason you did not say to Zedekiah that he can have his oath dissolved only in my presence? Immediately,  they fulfilled the verse: “They sit upon the ground, and keep silence, the elders of the daughter of Zion” (Lamentations 2:10). R' Yitzḥak said:  This means that they removed the cushions upon which they sat from underneath them,  as a sign that they had erred in halakha."
        },
        {
          "verseLocation": "Lamentations 2:16",
          "verseText": "“They have opened their mouths against you”",
          "talmudLocation": "Sanhedrin 104b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-11",
          "talmudFullText": "With regard to the verse: “They have opened their mouths against you” (Lamentations 2:16), Rava says that R' Yoḥanan says: For what reason did the prophet precede the verse beginning with the letter peh to the verse beginning with the letter ayin in several chapters of Lamentations? Since peh means mouth and ayin means eye, it is for the spies who said with their mouths [befihem] what they did not see with their eyes [be’eineihem]. "
        },
        {
          "verseLocation": "Lamentations 2:19",
          "verseText": "with Torah at night, the Divine Presence is across from him, as it is stated: “Arise, cry out in the night, at the beginning of the watches; pour out your heart like water before the face of the Lord,",
          "talmudLocation": "Tamid 32b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/tamid/32b#section-6",
          "talmudFullText": "The chapter, as well as the talmudic portion of the tractate, concludes with words of praise for those who study Torah. R' Ḥiyya taught:  With regard to anyone who occupies himself with Torah at night, the Shekhina is across from him, as it is stated: “Arise, cry out in the night, at the beginning of the watches; pour out your heart like water before the face of YHWH,  lift up your hands toward Him” (Lamentations 2:19). R' Elazar ben Azarya said: Torah scholars increase peace in the world, as it is stated: “And all your children [banayikh] shall be taught of YHWH, and great shall be the peace of your children” (Isaiah 54:13). This can be read as bonayikh, your builders, i.e., scholars build and increase peace for the entire world."
        },
        {
          "verseLocation": "Lamentations 2:20",
          "verseText": "“Shall the priest and the prophet be slain in the sanctuary of the Lord?”",
          "talmudLocation": "Sanhedrin 7a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/7a#section-4",
          "talmudFullText": "Aaron said to himself: If I do not listen to them now, they will do to me as they did to Hur,  and the verse: “Shall the priest and the prophet be slain in the sanctuary of YHWH? ” (Lamentations 2:20), will be fulfilled through me, and they will never have a remedy for such a sin. It is better for them to worship the calf,  as it is possible they will have a remedy through repentance.  Nevertheless, according to R' Tanḥum bar Ḥanilai, whoever praises Aaron for this compromise is provoking God."
        },
        {
          "verseLocation": "Lamentations 2:20",
          "verseText": "Jeremiah lamented: “Shall the women eat their fruit, their children in their care [ tipuḥim ]?”",
          "talmudLocation": "Yoma 38b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/38b#section-5",
          "talmudFullText": "And with regard to her and others like her Jeremiah lamented: “Shall the women eat their fruit, their children in their care [tipuḥim]? ” (Lamentations 2:20). The Talmud interprets the term tipuḥim homiletically as referring to this baby, who was measured in handbreadths [tefaḥim]. Even he was eaten by his mother. And the Holy Spirit responds and says:  Why did this happen? “Shall the priest and the prophet be slain in the Temple of YHWH? ” (Lamentations 2:20). It is punishment for the murder of the priest Zechariah ben Jehoiada. This incident involves a boy named Doeg; even though the person with that name was wicked (see I Samuel, chapter 22), the boy was named for him. The Talmud responds: See what befell him.  Clearly, his name was a bad omen."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Lamentations 3:6",
          "verseText": "as it is written: “He has made me to dwell in dark places, as those that have been long dead”",
          "talmudLocation": "Avodah Zarah 5a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/5a#section-19",
          "talmudFullText": "A blind person is considered as though he were dead, as it is written: “He has made me to dwell in dark places, as those that have been long dead” (Lamentations 3:6). A metzora is considered as though he were dead, as it is written that Aaron said to Moses when Miriam was struck with tzara'at: “Let her not, I pray, be as one dead” (Numbers 12:12). And one who has no children is considered as though he were dead, as it is written that Rachel said to Jacob: “Give me children, or else I am dead” (Genesis 30:1)."
        },
        {
          "verseLocation": "Lamentations 3:6",
          "verseText": "as it is written: “He has made me to dwell in dark places, as those that have been long dead”",
          "talmudLocation": "Nedarim 64b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/64b#section-6",
          "talmudFullText": "The Talmud relates: R' Yehoshua ben Levi said: Any person who does not have children is considered like a dead person. The source is as is stated in the words Rachel said to Jacob: “Give me children, or else I am dead” (Genesis 30:1). And it was taught in a baraita: Four are considered as if they were dead: A pauper, and a metzora, and a blind person, and one who has no children. A pauper, as it is written: “For all the men are dead” (Exodus 4:19). As explained above, they were not actually dead but had descended into poverty, and yet they were considered dead. A metzora, as it is written that Aaron said to Moses with regard to Miriam’s tzara'at: “Let her not, I pray, be as one dead” (Numbers 12:12). And a blind person, as it is written: “He has made me to dwell in dark places, as those that have been long dead” (Lamentations 3:6). And one who has no children, as it is written: “Give me children, or else I am dead” (Genesis 30:1)."
        },
        {
          "verseLocation": "Lamentations 3:6",
          "verseText": "“He has made me dwell in dark places, as those that have been long dead”",
          "talmudLocation": "Sanhedrin 24a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/24a#section-18",
          "talmudFullText": "The Talmud asks: What is the homiletic interpretation of the word Babylonia? R' Yoḥanan says,  as a tribute to the Jewish community of Babylonia and its Torah scholars: It means mixed with Bible, mixed with Mishnah,  and mixed with Talmud.  Other rabbis had a different opinion of the Torah in Babylonia: With regard to the verse: “He has made me dwell in dark places, as those that have been long dead” (Lamentations 3:6), R' Yirmeya says: This is the Talmud of Babylonia,  which is not as clear as the Talmud of Eretz Yisrael."
        },
        {
          "verseLocation": "Lamentations 3:8",
          "verseText": "“Though I plead and call out, He shuts out my prayer”",
          "talmudLocation": "Bava Metzia 59a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/59a#section-5",
          "talmudFullText": "R' Elazar says: Since the day the Temple was destroyed the gates of prayer were locked,  and prayer is not accepted as it once was, as it is stated in lament of the Temple’s destruction: “Though I plead and call out, He shuts out my prayer” (Lamentations 3:8). Yet, despite the fact that the gates of prayer were locked with the destruction of the Temple, the gates of tears were not locked,  and one who cries before God may rest assured that his prayers will be answered, as it is stated: “Hear my prayer, Lord, and give ear to my pleading, keep not silence at my tears” (Psalms 39:13)."
        },
        {
          "verseLocation": "Lamentations 3:8",
          "verseText": "“Though I plead and call out, He shuts out my prayer”",
          "talmudLocation": "Berakhot 32b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/32b#section-5",
          "talmudFullText": "On the subject of prayer, R' Elazar also said: Since the day the Temple was destroyed the gates of prayer were locked and prayer is not accepted as it once was, as it is said in lamentation of the Temple’s destruction: “Though I plead and call out, He shuts out my prayer” (Lamentations 3:8). Yet, despite the fact that the gates of prayer were locked with the destruction of the Temple, the gates of tears were not locked,  and one who cries before God may rest assured that his prayers will be answered, as it is stated: “Hear my prayer, Lord, and give ear to my pleading, keep not silence at my tears” (Psalms 39:13). Since this prayer is a request that God should pay heed to the tears of one who is praying, he is certain that at least the gates of tears are not locked."
        },
        {
          "verseLocation": "Lamentations 3:9",
          "verseText": "from here, as it is written: “He has made my paths crooked”",
          "talmudLocation": "Rosh Hashanah 23b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/23b#section-5",
          "talmudFullText": "The Talmud provides a source for this claim. As it is written: “Therefore, behold, I will hedge up your way with thorns,  and make a wall against her, that she shall not find her paths” (Hosea 2:8). Rav Naḥman bar Yitzḥak said:  It is derived from here, as it is written: “He has made my paths crooked” (Lamentations 3:9), which indicates that over the course of the exile the routes have become longer."
        },
        {
          "verseLocation": "Lamentations 3:17",
          "verseText": "“And my soul is removed far off from peace, I forgot prosperity”",
          "talmudLocation": "Shabbat 25b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/25b#section-5",
          "talmudFullText": "Since bathing as preparation for enjoyment of Shabbat was discussed, the Talmud cites the homiletic interpretation of the verse describing those heading into exile: “And my soul is removed far off from peace, I forgot prosperity” (Lamentations 3:17). What is: And my soul is removed far off from peace? R' Abbahu said: That is the lack of opportunity to engage in kindling the Shabbat lights,  which a refugee is unable to do. I forgot prosperity, R' Yirmeya said: That is the lack of opportunity to bathe in the bathhouse. R' Yoḥanan said: That is the lack of opportunity to engage in washing one’s hands and feet in hot water. R' Yitzḥak Nappaḥa said:  Prosperity is a pleasant bed and the pleasant bedclothes that are on it,  which are not available in exile. R' Abba said: That is a made bed, and a wife adorned,  i.e., worthy of and suitable (Rashba) for Torah scholars. "
        },
        {
          "verseLocation": "Lamentations 3:23",
          "verseText": "as it is stated: “They are new every morning; great is Your faithfulness”",
          "talmudLocation": "Chagigah 14a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/14a#section-3",
          "talmudFullText": "Shmuel said to Ḥiyya bar Rav: Son of great ones, come and I will tell you something of the great things that your father would say: Each and every day, ministering angels are created from the River Dinur, and they recite song to God and then immediately cease to exist, as it is stated: “They are new every morning; great is Your faithfulness” (Lamentations 3:23), indicating that new angels praise God each morning. The Talmud comments: And this opinion disagrees with that of R' Shmuel bar Naḥmani, as R' Shmuel bar Naḥmani said that R' Yonatan said:  With each and every word that emerges from the mouth of God an angel is created, as it is stated: “By the word of YHWH the heavens were made, and by the breath of His mouth all their hosts” (Psalms 33:6). The hosts of heaven are the angels, who, he claims, are created from the mouth of God, rather than from the River Dinur."
        },
        {
          "verseLocation": "Lamentations 3:25",
          "verseText": "“The Lord is good to those who wait for Him,",
          "talmudLocation": "Sanhedrin 39b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-2",
          "talmudFullText": "The Talmud cites a related statement: R' Elazar raises a contradiction: It is written in one verse: “YHWH is good to all and His compassion is over all His works” (Psalms 145:9), and it is written in a different verse: “YHWH is good to those who wait for Him,  to the soul that seeks Him” (Lamentations 3:25). He explains: This can be compared to a person who has an orchard. When he waters it, he waters all of it.  Perforce, the water reaches all parts of the orchard, and he cannot discriminate between trees. This is the meaning of the verse: “YHWH is good to all. ” By contrast, when he hoes around the trees, he hoes only around the good trees among them.  Similarly, when God bestows goodness to the world, all receive it. When He protects people from harm, not all are protected."
        },
        {
          "verseLocation": "Lamentations 3:29",
          "verseText": "When Rabbi Ami reached this verse, he cried: “Let him put his mouth in the dust, perhaps there may be hope”",
          "talmudLocation": "Chagigah 4b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/4b#section-10",
          "talmudFullText": "When R' Ami reached this verse, he cried: “Let him put his mouth in the dust, perhaps there may be hope” (Lamentations 3:29). He said:  A sinner suffers through all this punishment and only perhaps there may be hope? When R' Ami reached this verse, he cried: “Seek righteousness, seek humility; perhaps you shall be hidden on the day of YHWH’s anger”(Zephaniah 2:3). He said: All of this is expected of each individual, and only perhaps God’s anger may be hidden? Likewise, when R' Asi reached this verse, he cried: “Hate the evil, and love the good, and establish justice in the gate; perhaps YHWH, the God of hosts, will be gracious” (Amos 5:15). He said: All of this, and only perhaps? "
        },
        {
          "verseLocation": "Lamentations 3:31",
          "verseText": "as it is written: “For the Lord will not abandon [ yizaḥ ] forever”",
          "talmudLocation": "Chullin 7a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/7a#section-3",
          "talmudFullText": "The Talmud explains: With regard to the one who says meziḥin,  it is as that which is written: “And the breastplate shall not be loosed [yizaḥ] from the ephod” (Exodus 28:28). And with regard to the one who says: One does not disregard [mazniḥin],  it is as it is written: “For YHWH will not abandon [yizaḥ] forever” (Lamentations 3:31). And with regard to the one who says mazḥiḥin,  it is as we learned in a baraita (Tosefta, Sota 14:9): From the time that those with conceited [zeḥuḥei] hearts proliferated, dispute proliferated among the Jewish people. "
        },
        {
          "verseLocation": "Lamentations 3:33",
          "verseText": "And this is as it is written: “For He does not afflict from His heart",
          "talmudLocation": "Megillah 12a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-10",
          "talmudFullText": "They said to him:  But if it is true that they worshipped idols and therefore deserved to be destroyed, why was a miracle performed on their behalf? Is there favoritism expressed by God here? He said to them: They did not really worship the idol, but pretended to do so only for appearance,  acting as if they were carrying out the king’s command to bow before the idol. So too, God did not destroy them but did act angry with them only for appearance.  He too merely pretended to desire to destroy them, as all He did was issue a threat, but in the end the decree was annulled. And this is as it is written: “For He does not afflict from His heart willingly” (Lamentations 3:33), but only for appearances’ sake."
        },
        {
          "verseLocation": "Lamentations 3:39",
          "verseText": "“Why does a living man complain, a powerful man due to his sins?”",
          "talmudLocation": "Kiddushin 80b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/80b#section-11",
          "talmudFullText": "And the Rabbis,  who render seclusion forbidden even then, hold in accordance with the statement of R' Yitzḥak, as R' Yitzḥak says as follows with regard to the verse: “Why does a living man complain, a powerful man due to his sins? ” (Lamentations 3:39): Even at the time of a person’s acute mourning, his inclination to sin overpowers him.  The Talmud asks: And how does Abba Shaul explain this verse? The Talmud answers: When that was written, it was written with regard to one who complains about God’s ways. And this is what the verse is saying: Why does one complain about God’s ways and claim that he has been treated unjustly? Has he overpowered his sins?  God responds: The life I have given him is sufficient for him,  and he deserves no more."
        },
        {
          "verseLocation": "Lamentations 3:40",
          "verseText": "as it is stated: “We will search and examine our ways, and return to God”",
          "talmudLocation": "Berakhot 5a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/5a#section-9",
          "talmudFullText": "Previously, the Talmud discussed suffering that results from one’s transgressions. The Talmud shifts the focus and discusses suffering that does not result from one’s transgressions and the suffering of the righteous. Rava, and some say Rav Ḥisda, said: If a person sees that suffering has befallen him, he should examine his actions.  Generally, suffering comes about as punishment for one’s transgressions, as it is stated: “We will search and examine our ways, and return to God” (Lamentations 3:40). If he examined his ways and found no transgression for which that suffering is appropriate, he may attribute his suffering to dereliction in the study of Torah.  God punishes an individual for dereliction in the study of Torah in order to emphasize the gravity of the issue, as it is stated: “Happy is the man whom You punish, Lord, and teach out of Your law” (Psalms 94:12). This verse teaches us that his suffering will cause him to return to Your law."
        },
        {
          "verseLocation": "Lamentations 3:41",
          "verseText": "“Let us lift up our heart with our hands to God in Heaven”",
          "talmudLocation": "Taanit 16a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/16a#section-15",
          "talmudFullText": "As it is stated:  “He who covers his transgressions shall not prosper, but whoever confesses and forsakes them shall obtain mercy” (Proverbs 28:13). That is, confession alone is futile, but one who also abandons his transgressions will receive mercy. And it states elsewhere: “Let us lift up our heart with our hands to God in Heaven” (Lamentations 3:41), which likewise indicates that it is not enough to lift one’s hands in prayer; rather, one must also raise his heart and return to God."
        },
        {
          "verseLocation": "Lamentations 3:41",
          "verseText": "as it is stated: “Let us lift up our heart with our hands”",
          "talmudLocation": "Taanit 8a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/8a#section-12",
          "talmudFullText": "R' Ami said: A person’s prayer is heard only if he places his soul in his palm,  i.e., one must submit his entire soul with sincerity in his outstretched hands as he prays, as it is stated: “Let us lift up our heart with our hands” (Lamentations 3:41). The Talmud raises an objection: Is that so? But Shmuel once established for himself an interpreter to teach in public, and interpreted homiletically the verse: “But they beguiled Him with their mouth and lied to Him with their tongue, for their heart was not steadfast with Him, neither were they faithful to His covenant” (Psalms 78:36–37), and nevertheless the psalm continues: “But He, being full of compassion, forgives iniquity,  and does not destroy” (Psalms 78:38). This indicates that all prayers are accepted, even if they lack sincerity."
        },
        {
          "verseLocation": "Lamentations 3:41",
          "verseText": "his eyes upward, because it is stated: “Let us lift our hearts with our hands",
          "talmudLocation": "Yevamot 105b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/105b#section-5",
          "talmudFullText": "And one of them said he must direct his eyes upward, because it is stated: “Let us lift our hearts with our hands toward God in Heaven” (Lamentations 3:41). In the meantime, R' Yishmael ben Yosei, came beside them. He said to them: What are you dealing with? They said to him: With prayer,  as we are debating the proper posture for prayer. He said to them: My father,  R' Yosei, said as follows: One who prays must direct his eyes downward and his heart upward, in order to fulfill both of these verses. "
        },
        {
          "verseLocation": "Lamentations 3:44",
          "verseText": "Rava did not decree a fast on a cloudy day because it is stated: “You have covered Yourself in a cloud, through which prayer cannot pass”",
          "talmudLocation": "Berakhot 32b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/32b#section-6",
          "talmudFullText": "With regard to the locking of the gates of prayer, the Talmud relates that Rava did not decree a fast on a cloudy day because it is stated: “You have covered Yourself in a cloud, through which prayer cannot pass” (Lamentations 3:44). The verse indicates that clouds are a bad omen, indicating that God has averted His face (Rav Hai Gaon)."
        },
        {
          "verseLocation": "Lamentations 3:51",
          "verseText": "“My eye affected my soul, because of all the daughters of my city”",
          "talmudLocation": "Bava Kamma 83a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/83a#section-2",
          "talmudFullText": "The Talmud further pursues this line of inquiry: And is Greek wisdom itself actually prohibited? But doesn’t Rav Yehuda say that Shmuel says in the name of Rabban Shimon ben Gamliel:  It is written: “My eye affected my soul, because of all the daughters of my city” (Lamentations 3:51). Rabban Shimon ben Gamliel applied this verse to a personal tragedy: There were a thousand children in the household of my father,  Rabban Gamliel; five hundred of them studied the Torah, and five hundred of them studied Greek wisdom.  All of them were killed by the Romans; and the only ones that remain of them are I,  who is here, and the son of my father’s brother,  who is in Asia Minor [Asya]. Rabban Shimon ben Gamliel’s statement indicates that it is permitted to study Greek wisdom."
        },
        {
          "verseLocation": "Lamentations 3:51",
          "verseText": "which is written: “My eye affects my soul because of all the daughters of my city”",
          "talmudLocation": "Gittin 58a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/58a#section-7",
          "talmudFullText": "Rav Yehuda says that Shmuel says in the name of Rabban Shimon ben Gamliel: What is the meaning of that which is written: “My eye affects my soul because of all the daughters of my city” (Lamentations 3:51)? There were four hundred synagogues in the city of Beitar, and in each and every one of them there were four hundred schoolteachers, and each and every one of these teachers had four hundred schoolchildren. "
        },
        {
          "verseLocation": "Lamentations 3:51",
          "verseText": "which is written: “My eye affected my soul, due to all the daughters of my city”",
          "talmudLocation": "Sotah 49b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/49b#section-13",
          "talmudFullText": "The Talmud poses a question: And is Greek wisdom prohibited? But didn’t Rav Yehuda say that Shmuel said in the name of Rabban Shimon ben Gamliel: What is the meaning of that which is written: “My eye affected my soul, due to all the daughters of my city” (Lamentations 3:51)? There were a thousand children in my father’s house,  the princes’ household. Five hundred of them learned Torah, and the other five hundred learned Greek wisdom, and there only remained of them,  after the bar Kokheva revolt, me, here in Eretz Yisrael, and the son of my father’s brother,  who lives in Asia Minor [Asya].  The fact that Rabban Gamliel allowed half of his household to study Greek wisdom indicates that it is permitted."
        },
        {
          "verseLocation": "Lamentations 3:53",
          "verseText": "and it is written there: “They have destroyed [ tzamtu ] my life in the dungeon, and have cast stones upon me”",
          "talmudLocation": "Arakhin 15b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/15b#section-12",
          "talmudFullText": "Rav Ḥisda says that Mar Ukva says: Anyone who speaks malicious speech,  it is appropriate to stone him with stones. It is written here:  “Whoever defames his neighbor in secret, I will destroy him [atzmit]” (Psalms 101:5), and it is written there: “They have destroyed [tzamtu] my life in the dungeon, and have cast stones upon me” (Lamentations 3:53)."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Lamentations 4:2",
          "verseText": "“The precious sons of Zion, comparable to fine gold”",
          "talmudLocation": "Gittin 58a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/58a#section-4",
          "talmudFullText": "§ The verse states: “The precious sons of Zion, comparable to fine gold” (Lamentations 4:2). What is the meaning of the expression “comparable to fine gold”? If we say that it means they were covered in fine gold [piza],  this is difficult; but didn’t the school of R' Sheila say: Two istira weights of fine gold came down into the world, one in Rome and one in all the rest of the world.  If so, it is certainly impossible to cover the inhabitants of Jerusalem with fine gold, as there is not enough of it in the entire world to do so. Rather,  this means that they would be so attractive that they would disgrace fine gold because of their beauty. "
        },
        {
          "verseLocation": "Lamentations 4:3",
          "verseText": "should not enter your mind, as it is written: “The daughter of my people has become cruel, like the ye’enim in the wilderness”",
          "talmudLocation": "Chullin 64b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/64b#section-4",
          "talmudFullText": "§ Ḥizkiyya says: From where is it derived that the egg of a non-kosher bird is prohibited by Torah law? As it is stated: “And the daughter [bat] of the ya’ana” (Leviticus 11:16). But does the ya’ana have a daughter whose forbidden status would be different from that of its mother? Both daughter and mother should be included in the same prohibition. Rather, which is this? This is a non-kosher egg.  The Talmud challenges: But perhaps this is their name,  i.e., the bird is called bat ya’ana. The Talmud responds: This should not enter your mind, as it is written: “The daughter of my people has become cruel, like the ye’enim in the wilderness” (Lamentations 4:3)."
        },
        {
          "verseLocation": "Lamentations 4:6",
          "verseText": "And it is written: “For the iniquity of the daughter of my people is greater than the sin of Sodom”",
          "talmudLocation": "Sanhedrin 104b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-8",
          "talmudFullText": "With regard to the verse: “It is nothing to you, all you who pass by” (Lamentations 1:12), Rava says that R' Yoḥanan says: From here there is a source from the Torah for complaint,  i.e., it is appropriate for one to make his suffering public so that others will have compassion for him. With regard to the phrase “all you who pass by, ” Rav Amram says that Rav says that it is as though Jerusalem said: They have rendered me like a city of those who violate the most fundamental precepts of law and morality, as, with regard to Sodom, it is written: “Then YHWH rained upon Sodom brimstone and fire from YHWH out of Heaven” (Genesis 19:24), while with regard to Jerusalem, it is written: “From above He has sent fire into my bones, and it prevails against them” (Lamentations 1:13). In both cities, fire rained down from Heaven. And it is written: “For the iniquity of the daughter of my people is greater than the sin of Sodom” (Lamentations 4:6)."
        },
        {
          "verseLocation": "Lamentations 4:8",
          "verseText": "in their regard: “Their skin is shriveled upon their bones, it is withered, it has become like a stick”",
          "talmudLocation": "Ketubot 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/10b#section-7",
          "talmudFullText": "The Talmud relates: A certain man who came before R' Yehuda HaNasi said to him: My teacher, I had sex and did not find blood.  The bride said to him: My teacher, I was still a virgin. And the Talmud comments that this incident was during years of drought. R' Yehuda HaNasi saw that their faces were black due to hunger. He instructed his attendants to tend to them and they took them into the bathhouse and bathed them and they fed them and gave them drink.  Then they took them into a room,  and the groom had sex with her and found blood,  as it was due to the famine that there was no blood. R' Yehuda HaNasi said to him: Go take possession of your acquisition. R' Yehuda HaNasi read this verse in their regard: “Their skin is shriveled upon their bones, it is withered, it has become like a stick” (Lamentations 4:8), in the sense that no blood flows from them."
        },
        {
          "verseLocation": "Lamentations 4:9",
          "verseText": "a verse: “More fortunate were the victims of the sword than the victims of famine”",
          "talmudLocation": "Bava Batra 8b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/8b#section-4",
          "talmudFullText": "Famine is worse than the sword. If you wish, say that this is derived by way of logical reasoning: This one,  who dies of famine, suffers greatly before departing from this world, but that one,  who dies by the sword, does not suffer. If you wish, say instead that the fact that famine is worse than the sword is learned from a verse: “More fortunate were the victims of the sword than the victims of famine” (Lamentations 4:9). And captivity is worse than all of them, as it includes all of them,  i.e., famine, the sword, and death."
        },
        {
          "verseLocation": "Lamentations 4:10",
          "verseText": "Whereas, with regard to Jerusalem it is written: “The hands of compassionate women cooked their own children”",
          "talmudLocation": "Sanhedrin 104b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104b#section-9",
          "talmudFullText": "The Talmud asks: And is there partiality in the matter?  Why was Jerusalem not overturned like Sodom? Rava says that R' Yoḥanan says:  It is because there was an additional measure of suffering in Jerusalem that was not in Sodom, as with regard to Sodom it is written: “Behold this was the iniquity of your sister Sodom; pride, surfeit of bread and careless ease was in her and in her daughters; and yet she did not strengthen the hand of the poor and needy” (Ezekiel 16:49). The people of Sodom were not subject to the afflictions of hunger and famine. Whereas, with regard to Jerusalem it is written: “The hands of compassionate women cooked their own children” (Lamentations 4:10). The residents of Jerusalem were punished with great severity."
        },
        {
          "verseLocation": "Lamentations 4:11",
          "verseText": "and He has kindled a fire in Zion, which has devoured its foundations”",
          "talmudLocation": "Bava Kamma 60b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/60b#section-14",
          "talmudFullText": "I,  God, kindled a fire in Zion, as it is stated:  “YHWH has accomplished His fury, He has poured out His fierce anger; and He has kindled a fire in Zion, which has devoured its foundations” (Lamentations 4:11). And I will build it with fire in the future, as it is stated: “For I,  says YHWH, will be for her a wall of fire round about; and I will be the glory in her midst” (Zechariah 2:9)."
        },
        {
          "verseLocation": "Lamentations 4:19",
          "verseText": "about him: “Our pursuers were swifter",
          "talmudLocation": "Rosh Hashanah 21a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/21a#section-7",
          "talmudFullText": "Rav Naḥman said to him: From where do you come? He said to him: From a place called Damihareya. He said to him,  playing on the name of his place: Blood will be his end,  meaning Rav Naḥman’s own end. Due to this information, Rav Naḥman would have to fast two successive days, and thereby suffer greatly, as if his blood were being shed. He read the verse about him: “Our pursuers were swifter than vultures in the sky” (Lamentations 4:19), for had this messenger arrived just a little bit later, they would have eaten and drunk in the meantime."
        },
        {
          "verseLocation": "Lamentations 4:20",
          "verseText": "“The breath of our nostrils, the anointed of the Lord,",
          "talmudLocation": "Taanit 22b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/22b#section-6",
          "talmudFullText": "The Talmud discusses Josiah’s deathbed reflections. When Josiah was dying, Jeremiah saw his lips moving.  Jeremiah said: Perhaps, Heaven forbid, he is saying something improper and complaining about God’s judgment on account of his great distress.  Jeremiah bent over and heard that he was justifying God’s judgment against himself.  Josiah said: “YHWH is righteous, for I have rebelled against His word” (Lamentations 1:18). At that moment,  Jeremiah began his eulogy for Josiah: “The breath of our nostrils, the anointed of YHWH,  was trapped in their pits” (Lamentations 4:20)."
        },
        {
          "verseLocation": "Lamentations 4:22",
          "verseText": "his transgressions have ceased, as it is stated: “Your iniquity is finished, O daughter of Zion”",
          "talmudLocation": "Berakhot 57a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/57a#section-8",
          "talmudFullText": "One who sees olives in a dream,  and they were small,  it is a sign that his business will flourish, increase and be durable like olives.  However, the Talmud adds a caveat, saying that this applies only when he sees the fruit of an olive tree; but,  one who sees olive trees,  it is a sign that he will have many children, as it is stated: “Your children like olive plants,  round about your table” (Psalms 128:3). Some say that one who sees an olive tree in a dream,  it is a sign that a good reputation will spread for him, as it is stated:  “YHWH called your name a leafy olive tree, fair with goodly fruit” (Jeremiah 11:16). One who sees olive oil in a dream should anticipate the light of Torah, as it is stated: “That they bring unto you pure olive oil beaten for the light” (Exodus 27:20). One who sees palm trees [temarim] in a dream has seen a sign that his transgressions have ceased, as it is stated: “Your iniquity is finished, O daughter of Zion” (Lamentations 4:22), as the Talmud likens temara, date, to tam ra, evil has ceased."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Lamentations 5:4",
          "verseText": "which is written: “We have drunk our water for money; our wood comes to us for a price”",
          "talmudLocation": "Yevamot 108b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/108b#section-11",
          "talmudFullText": "§ The Talmud asks: According to R' Elazar, who holds that the Mishnah is disjointed, who is the tanna that taught that a minor may always remarry a husband she refused but not one who divorced her? Rav Yehuda said that Rav said:  This can be determined based on the following incident. What is the meaning of that which is written: “We have drunk our water for money; our wood comes to us for a price” (Lamentations 5:4), implying that Torah, which is analogous to water, can be purchased with money. The Talmud explains: During the time of danger,  i.e., religious persecution by the Romans, this halakhic ruling was requested: If she,  a minor, left her first husband by means of a bill of divorce and her second by refusal, what is the halakha with regard to her returning to the first? "
        },
        {
          "verseLocation": "Lamentations 5:11",
          "verseText": "whom it is written: “They have ravished the women in Zion, the maidens in the cities of Judah”",
          "talmudLocation": "Kiddushin 71b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/71b#section-5",
          "talmudFullText": "The Talmud relates another incident: Ulla arrived in Pumbedita to the house of Rav Yehuda. He observed that Rav Yitzḥak, son of Rav Yehuda, was grown up and was unmarried.  Ulla said to Rav Yehuda: What is the reason that the Master does not marry a woman to his son?  Rav Yehuda said to him: Do I know from where I can find a woman to marry him? I am concerned about flawed lineage. Ulla said to him: Is that to say that we know where we come from?  Can we be sure that our lineage is unflawed? Perhaps we are from those about whom it is written: “They have ravished the women in Zion, the maidens in the cities of Judah” (Lamentations 5:11). Perhaps we are descended from women ravished by non-Jews."
        },
        {
          "verseLocation": "Lamentations 5:11",
          "verseText": "turned to the daughters of Jerusalem, as it is stated: “They have ravished the women in Zion, the maidens in the cities of Judah”",
          "talmudLocation": "Yevamot 16b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/16b#section-5",
          "talmudFullText": "The Talmud elaborates: One of them said that twelve thousand men and six thousand archers came from Tarmod, and the other one said that there were twelve thousand men, of whom six thousand were archers. When the non-Jews entered the Sanctuary during the conquest of Jerusalem, they all turned to plunder the silver and the gold they saw there, but the warriors of Tarmod turned to the daughters of Jerusalem, as it is stated: “They have ravished the women in Zion, the maidens in the cities of Judah” (Lamentations 5:11). According to the opinion that children born of sex between non-Jews and Jewish women are mamzerim, all the children born to these women are mamzerim."
        },
        {
          "verseLocation": "Lamentations 5:14",
          "verseText": "the verse states: “The Elders have ceased from the gate, the young men from their music”",
          "talmudLocation": "Sotah 48a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/48a#section-15",
          "talmudFullText": "Talmud:  The Talmud poses a question with regard to the first clause of the Mishnah: And from where is it derived that the verse: “With song they shall not drink wine” (Isaiah 24:9) is written about the period from the time when the Sanhedrin was nullified? Rav Huna, son of Rav Yehoshua, said:  From that which the verse states: “The Elders have ceased from the gate, the young men from their music” (Lamentations 5:14). This indicates that the dissolution of the Sanhedrin, who are the Elders from the gate, is linked to the end of the young men singing."
        }
      ]
    }
  ]
}