{
  "bookName": "Malachi",
  "totalEntries": 51,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Malachi 1:6",
          "verseText": "“A son honors his father and a servant his master”",
          "talmudLocation": "Sanhedrin 96a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/96a#section-14",
          "talmudFullText": "The Talmud asks: <b>What is</b> the meaning of: Merodach-<b>Baladan, son of Baladan? </b> If his name was Merodach it was not Baladan. The rabbis <b>say: Baladan was a king, and his visage was transformed and became like that of a dog. His son was sitting on the throne</b> in his stead <b>and when he would write</b> a letter <b>he would write his name and the name of his father, King Baladan. That is</b> the meaning of that <b>which is written</b> with regard to the honor accorded by non-Jews to their fathers: <b>“A son honors his father and a servant his master”</b> (Malachi 1:6)."
        },
        {
          "verseLocation": "Malachi 1:8",
          "verseText": "“Present it now unto your governor; will he be pleased with you or will he accept your person?",
          "talmudLocation": "Bava Batra 97b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/97b#section-9",
          "talmudFullText": "<b>Rather, </b> Rav’s statement serves <b>to exclude</b> wine <b>that</b> has <b>a foul odor. And if you wish, say</b> that <b>actually</b> his statement serves <b>to exclude</b> wine that has been left <b>uncovered, and</b> it teaches the novelty that <b>even though one passes it through a sieve, in accordance with</b> the opinion of <b>R' Neḥemya</b> (see <i>Terumot</i> 8:7), <b>nevertheless, </b> it still may not be used for the sanctification of the Shabbat day. This is because it is disrespectful to use inferior wine for a mitzva, as derived from the verse in which God rebukes the Jewish people for offering lame animals as offerings: <b>“Present it now unto your governor; will he be pleased with you or will he accept your person? </b> says YHWH of hosts” (Malachi 1:8)."
        },
        {
          "verseLocation": "Malachi 1:8",
          "verseText": "“Present it now unto your governor;",
          "talmudLocation": "Chullin 90b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/90b#section-7",
          "talmudFullText": "The Talmud responds: <b>No, </b> the <i>baraita</i> means that <b>he brings it up</b> to the altar <b>and removes it</b> from the thigh before placing the thigh on the fire. The Talmud asks: <b>But since he removes it</b> from the thigh, <b>why does he bring it up</b> to the altar? The Talmud answers that one cannot bring the thigh up to the altar after the sciatic nerve has been removed <b>because it is stated</b> with regard to one who sacrifices offerings that are damaged or unattractive: <b>“Present it now unto your governor; </b> will he be pleased with you, or will he accept your person? says YHWH of hosts” (Malachi 1:8). Consequently, the leg of the animal must be brought up to the altar while it is whole, and the sciatic nerve must be removed on top of the altar."
        },
        {
          "verseLocation": "Malachi 1:8",
          "verseText": "“Present it now unto your governor; will he be pleased with you or show you favor?",
          "talmudLocation": "Menachot 69a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/69a#section-12",
          "talmudFullText": "The Talmud provides another suggestion: <b>Rather, </b> perhaps Rami bar Ḥama’s dilemma is referring to the use of these kernels <b>for meal offerings. </b> The Talmud rejects this: It is <b>obvious that</b> they may <b>not</b> be used for meal offerings, as it is written with regard to those who offer inferior items to the Temple: <b>“Present it now unto your governor; will he be pleased with you or show you favor? </b> Says YHWH of hosts” (Malachi 1:8). Any item that one would not feel comfortable bringing to a governor or local ruler may certainly not be brought to the Temple."
        },
        {
          "verseLocation": "Malachi 1:8",
          "verseText": "present it now unto your governor,",
          "talmudLocation": "Sotah 14b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/14b#section-7",
          "talmudFullText": "The Talmud responds: <b>You</b> can <b>even say that</b> the Mishnah is in accordance with the opinion of <b>R' Yosei ben Yehuda. Say that R' Yosei ben Yehuda, says</b> that wooden vessels are deemed fit <b>with regard to</b> those of <b>superior</b> quality; but <b>does he say</b> likewise <b>with regard to</b> vessels of <b>lesser</b> quality, e.g., a basket made of palm branches? <b>Doesn’t R' Yosei ben Yehuda, hold</b> to the principle articulated in the verse: “And when you offer the blind for a sacrifice, is it not evil! …If you would <b>present it now unto your governor, </b> will he be pleased with you or show you favor? ” (Malachi 1:8)? Nothing that is unfit for presentation to a ruler may be brought to the Temple. Therefore, even R' Yosei ben Yehuda, must agree that a basket made of palm branches cannot be a service vessel."
        },
        {
          "verseLocation": "Malachi 1:8",
          "verseText": "Present it now unto your governor; will he be pleased with you or will he accept your person, says the Lord of hosts”",
          "talmudLocation": "Sukkah 50a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/50a#section-4",
          "talmudFullText": "The Talmud answers: <b>Even</b> if <b>you say</b> it is in accordance with the opinion of <b>R' Neḥemya, say that R' Neḥemya said</b> his opinion permitting strained water <b>for a common</b> person. <b>However, did he</b> actually <b>say</b> that strained water is permitted even to be sacrificed <b>to God? </b> Even if it is possible to render this water potable, it is certainly not of the select quality that would render it eligible for use in the Temple service. <b>Isn’t R' Neḥemya of</b> the opinion that it is inappropriate to sacrifice on the altar any item that one would not give to someone of prominent stature? As it is stated: “And when you offer the blind for sacrifice, it is no evil; and when you offer the lame and sick, it is no evil. <b>Present it now unto your governor; will he be pleased with you or will he accept your person, says YHWH of hosts”</b> (Malachi 1:8)."
        },
        {
          "verseLocation": "Malachi 1:8",
          "verseText": "“Present it now to your governor; will he be pleased with you? Or will he accept your person?”",
          "talmudLocation": "Zevachim 85a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/85a#section-15",
          "talmudFullText": "The Talmud responds: Rather, <b>what should we do? Should we offer them with their dung? </b> Doesn’t the verse state: <b>“Present it now to your governor; will he be pleased with you? Or will he accept your person? ”</b> (Malachi 1:8), and isn’t it derived from this verse that items considered repulsive to people are not fit for use as an offering for the Most High?"
        },
        {
          "verseLocation": "Malachi 1:11",
          "verseText": "“From the rising of the sun until it sets, My name is great among the nations; and in every place offerings are presented to My name, and a pure meal offering;",
          "talmudLocation": "Menachot 110a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/110a#section-5",
          "talmudFullText": "<b>Rav Shimi bar Ḥiyya raised an objection to</b> the statement of <b>Rav</b> from the verse: <b>“From the rising of the sun until it sets, My name is great among the nations; and in every place offerings are presented to My name, and a pure meal offering; </b> for My name is great among the nations, says YHWH of hosts” (Malachi 1:11). This indicates that God’s name is known across the entire world, even to the west of Tyre and the east of Carthage. Rav <b>said to him: Shimi, </b> is it <b>you</b> who is raising such an objection? The verse does not mean that they recognize God and worship him. Rather, it means <b>that</b> although they worship idols, <b>they call Him the God of gods. </b>"
        },
        {
          "verseLocation": "Malachi 1:13",
          "verseText": "“And you have brought that which is stolen, and the lame, and the sick”",
          "talmudLocation": "Bava Kamma 67a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/67a#section-13",
          "talmudFullText": "<b>Ulla says: From where</b> is it derived <b>that</b> the owner’s <b>despair</b> of recovering his stolen item <b>does not</b> cause the thief to <b>acquire</b> it? <b>As it is stated</b> in the criticism of the Jewish people for bringing inferior animals as offerings: <b>“And you have brought that which is stolen, and the lame, and the sick”</b> (Malachi 1:13). From the juxtaposition of these cases it may be derived that <b>a stolen</b> animal <b>is similar to a lame</b> animal: <b>Just as a lame</b> animal <b>has no rectification at all</b> with regard to its disqualification as an offering,"
        },
        {
          "verseLocation": "Malachi 1:13",
          "verseText": "as it is stated: “And you have brought that which was stolen and the lame, and the sick;",
          "talmudLocation": "Sukkah 30a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/30a#section-1",
          "talmudFullText": "It is unfit <b>because it is a mitzva that comes</b> to be fulfilled <b>by means of a transgression, </b> which renders the mitzva unfulfilled, <b>as it is stated: “And you have brought that which was stolen and the lame, and the sick; </b> that is how you bring the offering; should I accept this of your hand? says YHWH” (Malachi 1:13). Based on the juxtaposition in the verse, it is derived that the legal status of <b>a stolen</b> animal is <b>equivalent to</b> that of <b>a lame</b> animal. <b>Just as a lame</b> animal, because it is blemished, <b>has no remedy</b> and is unfit for use, <b>so too, a stolen</b> animal <b>has no remedy. </b> There is <b>no difference before</b> the owners reach a state of <b>despair</b> of recovering the stolen animal, and there is <b>no difference after despair. </b> In both cases there is no remedy."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Malachi 2:3",
          "verseText": "“And I will spread dung upon your faces, even the dung of your Festival offerings”",
          "talmudLocation": "Shabbat 151b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/151b#section-5",
          "talmudFullText": "<b>And similarly, it says</b> in the verse: <b>“And I will spread dung upon your faces, even the dung of your Festival offerings”</b> (Malachi 2:3). <b>Rav Huna said, and some say</b> that it was <b>Rav Ḥagga</b> who <b>said: </b> This verse is referring to <b>those people who neglect the words of the Torah and turn all of their days into Festivals. R' Levi said</b> that <b>Rav Pappi said</b> that <b>R' Yehoshua said: Three days after</b> death, <b>the stomach</b> of the dead <b>bursts and falls onto his face and says to him: Take what you have put inside me. </b>"
        },
        {
          "verseLocation": "Malachi 2:5",
          "verseText": "“And he was afraid before My name”",
          "talmudLocation": "Berakhot 12a:26",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/12a#section-26",
          "talmudFullText": "The Talmud <b>raises an objection</b> based on what we learned in praise of a priest: <b>“And he was afraid before My name”</b> (Malachi 2:5), indicating that one must be humbled and not upright before God’s name."
        },
        {
          "verseLocation": "Malachi 2:6",
          "verseText": "person and the other, as it is stated: “The law of truth was in his mouth, and unrighteousness was not found in his lips; he walked with Me in peace and uprightness, and turned many away from iniquity”",
          "talmudLocation": "Sanhedrin 6b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/6b#section-3",
          "talmudFullText": "<b>Rather, </b> the judge must assure that <b>the</b> true <b>judgment will</b> prevail at all costs and metaphorically <b>pierce the mountain, as it is stated: “For the judgment is God’s”</b> (Deuteronomy 1:17). <b>And similarly, Moses would say: Let the judgment pierce the mountain. But</b> by contrast, <b>Aaron, </b> whose role was not that of a judge, was <b>a lover of peace and a pursuer of peace, and</b> he <b>would apply peace between</b> one <b>person and the other, as it is stated: “The law of truth was in his mouth, and unrighteousness was not found in his lips; he walked with Me in peace and uprightness, and turned many away from iniquity”</b> (Malachi 2:6)."
        },
        {
          "verseLocation": "Malachi 2:7",
          "verseText": "which is written: “For the priest’s lips should keep knowledge, and they should seek Torah from his mouth; for he is an angel of the Lord of hosts”",
          "talmudLocation": "Chagigah 15b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/15b#section-6",
          "talmudFullText": "The Talmud poses a question: <b>And R' Meir, how could he learn Torah from</b> the <b>mouth of <i>Aḥer</i>? But didn’t Rabba bar bar Ḥana say</b> that <b>R' Yoḥanan said: What is</b> the meaning of that <b>which is written: “For the priest’s lips should keep knowledge, and they should seek Torah from his mouth; for he is an angel of YHWH of hosts”</b> (Malachi 2:7)? The verse teaches: <b>If the R' is similar to an angel of YHWH of hosts, </b> perfect in his ways, <b>they should seek Torah from his mouth; but if not, they should not seek Torah from his mouth. </b>"
        },
        {
          "verseLocation": "Malachi 2:7",
          "verseText": "which is written: “For the priest’s lips should keep knowledge, and they should seek Torah at his mouth; for he is a messenger [ malakh ] of the Lord of hosts”",
          "talmudLocation": "Moed Katan 17a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/17a#section-5",
          "talmudFullText": "Rav Yehuda <b>said to Rabba bar bar Ḥana: </b> Have <b>you heard anything with regard to this</b> issue? <b>He said to him: R' Yoḥanan said as follows: What is</b> the meaning of that <b>which is written: “For the priest’s lips should keep knowledge, and they should seek Torah at his mouth; for he is a messenger [<i>malakh</i>] of YHWH of hosts”</b> (Malachi 2:7)? This verse teaches: <b>If the teacher is similar to an angel [<i>malakh</i>] of YHWH, </b> then <b>seek Torah from his mouth, </b> but if he is <b>not</b> pure and upright, then <b>do not seek Torah from his mouth; </b> even if he is knowledgeable about Torah, do not learn from him."
        },
        {
          "verseLocation": "Malachi 2:8",
          "verseText": "you have corrupted the covenant of Levi,",
          "talmudLocation": "Bekhorot 26b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/26b#section-18",
          "talmudFullText": "<b>A baraita states</b> in a <i>baraita</i>: With regard to <b>the priests, the Levites, and the poor</b> people <b>who assist in the home of the shepherd, or at the threshing floor, or in the slaughterhouse, one may not give them <i>teruma</i> or tithe as their wages. And if one did so, he desecrated</b> the sanctity of the item. <b>And with regard to them the verse states: </b> “But you are turned aside out of the way; you have caused many to stumble in the law; <b>you have corrupted the covenant of Levi, </b> says YHWH of hosts” (Malachi 2:8). <b>And</b> another verse <b>states: </b> “And you shall bear no sin by it, seeing that you have set apart the best from it; <b>and you shall not desecrate the sacred items of the children of Israel, that you shall not die”</b> (Numbers 18:32)."
        },
        {
          "verseLocation": "Malachi 2:9",
          "verseText": "“Therefore I have also made you contemptible and base”",
          "talmudLocation": "Taanit 20a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/20a#section-12",
          "talmudFullText": "The same manner of explanation is provided for the verse: <b>“Therefore I have also made you contemptible and base”</b> (Malachi 2:9). <b>Rav Yehuda said: </b> This too can be interpreted <b>as a blessing, as</b> meaning that the nations view us as lowly, but nevertheless, they do not assign us unpleasant jobs. <b>They do not</b> appoint <b>from us either river officials or government officials [<i>geziripatei</i>]. </b>"
        },
        {
          "verseLocation": "Malachi 2:11",
          "verseText": "as it is stated in Malachi’s prophecy: “Judah has dealt treacherously, and a disgusting thing has been done in Israel and in Jerusalem; for Judah has profaned the sanctity of the Lord which he loved, and has married the daughter of a strange god”",
          "talmudLocation": "Megillah 15a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-5",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i>: <b>R' Yehoshua ben Korḥa said: Malachi is</b> in fact <b>Ezra. And the Rabbis say</b> otherwise: <b>Malachi was his</b> real <b>name, </b> and it was not merely another name for Ezra or another prophet. <b>Rav Naḥman said: </b> It <b>stands to reason</b> that indeed, they are one and the same person, <b>like</b> the opinion of <b>the one who said that Malachi is Ezra, </b> since there is a similarity between them, <b>as it is stated in Malachi’s prophecy: “Judah has dealt treacherously, and a disgusting thing has been done in Israel and in Jerusalem; for Judah has profaned the sanctity of YHWH which he loved, and has married the daughter of a strange god”</b> (Malachi 2:11)."
        },
        {
          "verseLocation": "Malachi 2:11",
          "verseText": "to Rav Kahana in his dream: “Judah has dealt treacherously and an abomination is committed in Israel and in Jerusalem, as Judah has profaned the sacred of the Lord, which he loves, and has engaged in intercourse with the daughter of a strange god”",
          "talmudLocation": "Sanhedrin 82a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/82a#section-1",
          "talmudFullText": "<b>If zealots did not strike him, what is</b> the <i>halakha</i>? <b>Rav forgot</b> that which he learned through <b>tradition</b> concerning this matter. <b>They read</b> this verse <b>to Rav Kahana in his dream: “Judah has dealt treacherously and an abomination is committed in Israel and in Jerusalem, as Judah has profaned the sacred of YHWH, which he loves, and has had sex with the daughter of a strange god”</b> (Malachi 2:11). Rav Kahana <b>came and said</b> to Rav: <b>This is what they read to me</b> in my dream."
        },
        {
          "verseLocation": "Malachi 2:12",
          "verseText": "“May the Lord excise the man who does this, who calls and who answers from the tents of Jacob, and he who sacrifices a meal-offering to the Lord of hosts”",
          "talmudLocation": "Sanhedrin 82a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/82a#section-3",
          "talmudFullText": "<b>And it is written thereafter</b> with regard to those enumerated in the verse: <b>“May YHWH excise the man who does this, who calls and who answers from the tents of Jacob, and he who sacrifices a meal-offering to YHWH of hosts”</b> (Malachi 2:12). The Talmud interprets the verse: <b>If he is a Torah scholar, he will have neither one</b> among his descendants <b>who calls</b> and initiates discourse <b>among the rabbis, nor one who answers among the students, </b> i.e., one who is capable of answering questions posed by the rabbis. <b>If he is a priest, he will not have</b> among his descendants <b>a son who sacrifices a meal-offering to YHWH of hosts. </b>"
        },
        {
          "verseLocation": "Malachi 2:12",
          "verseText": "“The Lord will cut off from the man that does this, him that is awake and him that answers from the tents of Jacob, or any to present an offering to the Lord of hosts”",
          "talmudLocation": "Shabbat 55b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55b#section-15",
          "talmudFullText": "<b>Wasn’t it was already stated</b> with regard to those who engage in promiscuous sex: <b>“YHWH will cut off from the man that does this, him that is awake and him that answers from the tents of Jacob, or any to present an offering to YHWH of hosts”</b> (Malachi 2:12). The rabbis interpreted the verse homiletically: <b>If</b> the sinner is <b>an Israelite, he will not have</b> among his descendants <b>one who is</b> sharp and <b>awake among the rabbis, or</b> even <b>one among</b> their <b>disciples who can answer</b> questions. <b>And if he is a priest, he will not have a son who will present a meal-offering. </b> If Pinehas had sons and grandsons serving as priests, <b>conclude from it that Pinehas did not sin. </b>"
        },
        {
          "verseLocation": "Malachi 2:13",
          "verseText": "anyone who divorces his first wife, even the altar sheds tears about him, as it is stated: “And further, this you should do: Cover the altar of the Lord with tears, with weeping and sighing, from His no longer showing regard to the offering, nor receiving it with goodwill from your hand”",
          "talmudLocation": "Sanhedrin 22a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-16",
          "talmudFullText": "§ <b>R' Eliezer says: </b> Concerning <b>anyone who divorces his first wife, even the altar sheds tears about him, as it is stated: “And further, this you should do: Cover the altar of YHWH with tears, with weeping and sighing, from His no longer showing regard to the offering, nor receiving it with goodwill from your hand”</b> (Malachi 2:13), <b>and it is written: “Yet you say: Why? Because YHWH has been witness between you and the wife of your youth, against whom you have dealt treacherously, though she is your companion and the wife of your covenant”</b> (Malachi 2:14)."
        },
        {
          "verseLocation": "Malachi 2:14",
          "verseText": "and it is written: “Yet you say: Why? Because the Lord has been witness between you and the wife of your youth, against whom you have dealt treacherously, though she is your companion and the wife of your covenant”",
          "talmudLocation": "Sanhedrin 22a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-16",
          "talmudFullText": "§ <b>R' Eliezer says: </b> Concerning <b>anyone who divorces his first wife, even the altar sheds tears about him, as it is stated: “And further, this you should do: Cover the altar of YHWH with tears, with weeping and sighing, from His no longer showing regard to the offering, nor receiving it with goodwill from your hand”</b> (Malachi 2:13), <b>and it is written: “Yet you say: Why? Because YHWH has been witness between you and the wife of your youth, against whom you have dealt treacherously, though she is your companion and the wife of your covenant”</b> (Malachi 2:14)."
        },
        {
          "verseLocation": "Malachi 2:16",
          "verseText": "“For I hate sending away,",
          "talmudLocation": "Gittin 90b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/90b#section-5",
          "talmudFullText": "§ The prophet Malachi states in rebuke of those who divorce their wives: <b>“For I hate sending away, </b> says YHWH, the God of Israel” (Malachi 2:16). <b>R' Yehuda says: </b> The verse means that <b>if you hate</b> your wife, <b>send</b> her away. Do not continue living with a woman whom you hate. <b>R' Yoḥanan says: </b> The verse means that <b>one who sends</b> his wife away <b>is hated</b> by God."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Malachi 3:3",
          "verseText": "“And he shall sit as a refiner and purifier of silver; and he shall purify the sons of Levi, and purge them as gold and silver; and there shall be they that shall offer to the Lord offerings in righteousness”",
          "talmudLocation": "Kiddushin 71a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/71a#section-1",
          "talmudFullText": "<b>purifies</b> the <b>tribes, </b> i.e., clarifies their lineage, He will <b>purify</b> that of <b>the tribe of Levi first, as it is stated</b> with regard to the angel sent forth by God: <b>“And he shall sit as a refiner and purifier of silver; and he shall purify the sons of Levi, and purge them as gold and silver; and there shall be they that shall offer to YHWH offerings in righteousness”</b> (Malachi 3:3)."
        },
        {
          "verseLocation": "Malachi 3:5",
          "verseText": "When Rabbi Yoḥanan reached this verse, he cried: “And I will come near to you to judgment; and I will be a swift witness against the sorcerers, and against the adulterers, and against false witnesses, and against those who oppress the hireling in his wages,",
          "talmudLocation": "Chagigah 5a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/5a#section-7",
          "talmudFullText": "<b>When R' Yoḥanan reached this verse, he cried: “And I will come near to you to judgment; and I will be a swift witness against the sorcerers, and against the adulterers, and against false witnesses, and against those who oppress the hireling in his wages, </b> the widow, and the fatherless, and who turn aside the convert from his right, and do not fear Me, says YHWH” (Malachi 3:5). He said: With regard to <b>a slave whose master comes near to him to judge him and is swift to testify</b> against <b>him, </b> is <b>there a remedy for him? </b>"
        },
        {
          "verseLocation": "Malachi 3:5",
          "verseText": "above, as it is stated: “And who turn aside [ umattei ] the convert”",
          "talmudLocation": "Chagigah 5a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/5a#section-9",
          "talmudFullText": "<b>Reish Lakish said: Anyone who distorts the judgment of a convert, it is</b> considered <b>as if he distorted the judgment of</b> the One <b>above, as it is stated: “And who turn aside [<i>umattei</i>] the convert”</b> (Malachi 3:5). This term <b>is written</b> as: <b><i>Umatti</i>, </b> turn Me aside, i.e., one who distorts the judgment of a convert is considered as though he distorts the judgment of God, as it were. <b>R' Ḥanina bar Pappa said: Anyone who does something</b> sinful <b>and regrets it, he is forgiven immediately, as it is stated: “And do not fear Me”</b> (Malachi 3:5), which indicates that if <b>they</b> do <b>fear Me</b> and are embarrassed to sin before God, <b>they are forgiven immediately. </b>"
        },
        {
          "verseLocation": "Malachi 3:6",
          "verseText": "which is written: “For I the Lord change not; and you, sons of Jacob, are not consumed”",
          "talmudLocation": "Sotah 9a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/9a#section-11",
          "talmudFullText": "<b>Ameimar teaches that</b> statement <b>of Rav Ḥinnana bar Pappa with regard to this: What is</b> the meaning of that <b>which is written: “For I YHWH change not; and you, sons of Jacob, are not consumed”</b> (Malachi 3:6)? <b>“For I YHWH change [<i>shaniti</i>] not”</b> is interpreted to mean: <b>I did not strike a nation and repeat [<i>shaniti</i>]</b> striking <b>it, </b> as a stricken nation never recovers from the initial strike. <b>“And you, sons of Jacob, are not consumed, ”</b> is interpreted to mean: Despite the fact that I strike you many times for your sins, I do not let you perish. <b>This is</b> the same <b>as that which is written: </b> “I will heap evils upon them; <b>I will consume My arrows upon them”</b> (Deuteronomy 32:23), which is interpreted to mean: <b>My arrows are consumed</b> and used up, <b>and they, </b> the Jewish people, <b>are not consumed</b> but will continue to endure despite the many calamities that will befall them."
        },
        {
          "verseLocation": "Malachi 3:7",
          "verseText": "Rabbi Eliezer said to Rabbi Yehoshua: But isn’t it already stated: “Return to me and I will return to you”",
          "talmudLocation": "Sanhedrin 97b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/97b#section-16",
          "talmudFullText": "<b>R' Eliezer said to R' Yehoshua: But isn’t it already stated: “Return to me and I will return to you”</b> (Malachi 3:7)? <b>R' Yehoshua said to him: But isn’t it already stated: “For I have taken you to Myself; and I will take you one from a city and two from a family, and I will bring you to Zion”</b> (Jeremiah 3:14), unconditionally?"
        },
        {
          "verseLocation": "Malachi 3:8",
          "verseText": "said to you: He robbed me, as it is written: “Will a man rob [ hayikba ] God?”",
          "talmudLocation": "Rosh Hashanah 26b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/26b#section-1",
          "talmudFullText": "<b>So-and-so <i>keva’a</i> from me. </b> Levi <b>did not understand what</b> that man <b>was saying to him, </b> as he did not know the meaning of the word <i>kava</i>. So <b>he went</b> and <b>asked in the study hall. They said to him: </b> That man <b>said to you: He robbed me, as it is written: “Will a man rob [<i>hayikba</i>] God? ”</b> (Malachi 3:8). <b>Rava from</b> a place called <b>Barnish said to Rav Ashi: Had I been there</b> in Levi’s place I would have tried to uncover the meaning of the word in a different way, for <b>I would have said to him: How did he <i>keva’a</i> you? With what did he <i>keva’a</i> you? And why did he <i>keva’a</i> you? And</b> from his answers <b>I would have understood on my own</b> what was being said. The Talmud comments: <b>And</b> Levi, who did not do this, <b>thought</b> that the man <b>was talking about a matter of prohibition</b> and not a monetary matter, and so asking the man these questions would not have helped, as they are relevant only to monetary matters."
        },
        {
          "verseLocation": "Malachi 3:9",
          "verseText": "“You are cursed with the curse, yet you rob Me, even this whole nation”",
          "talmudLocation": "Avodah Zarah 36b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/36b#section-1",
          "talmudFullText": "It is the verse: <b>“You are cursed with the curse, yet you rob Me, even this whole nation”</b> (Malachi 3:9). This teaches that <b>if there is</b> the acceptance of <b>the whole nation, yes, </b> an ordinance may be instituted, but <b>if not, no, </b> the ordinance may not be instituted."
        },
        {
          "verseLocation": "Malachi 3:9",
          "verseText": "do not issue a decree upon the public unless a majority of the public is able to abide by it, as it is written: “You are cursed with the curse, yet you rob Me, even this whole nation”",
          "talmudLocation": "Bava Batra 60b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/60b#section-13",
          "talmudFullText": "R' Yehoshua <b>said to them: My children, come, and I will tell you</b> how we should act. <b>To not mourn at all</b> is <b>impossible, as</b> the <b>decree was already issued</b> and the Temple has been destroyed. <b>But to mourn excessively</b> as you are doing is also <b>impossible, as</b> the rabbis <b>do not issue a decree upon the public unless a majority of the public is able to abide by it, as it is written: “You are cursed with the curse, yet you rob Me, even this whole nation”</b> (Malachi 3:9), indicating that the prophet rebukes the people for neglecting observances only if they were accepted by the whole nation."
        },
        {
          "verseLocation": "Malachi 3:9",
          "verseText": "“With the curse you are cursed, yet you rob Me, the entire nation”",
          "talmudLocation": "Horayot 3b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/3b#section-7",
          "talmudFullText": "<b>And Rav Adda bar Abba said: What is the verse</b> from which this principle is derived? It is derived from the verse: <b>“With the curse you are cursed, yet you rob Me, the entire nation”</b> (Malachi 3:9). The verse is referring to the oath taken by the entire people to observe the <i>halakhot</i> of tithes, and they violated those <i>halakhot</i>. <b>But here it is written: “The entire nation, ” and</b> yet, Rabban Shimon ben Gamliel and R' Elazar ben Tzadok, relied on this verse to derive that the legal status of <b>the majority of</b> an entity is <b>like</b> that of <b>the entire</b> entity, and therefore if a majority of the congregation can withstand the decree the court may issue it. The Talmud concludes: <b>The refutation of</b> the opinion of <b>R' Yonatan</b> is indeed <b>a conclusive refutation. </b>"
        },
        {
          "verseLocation": "Malachi 3:10",
          "verseText": "as it is written: “Bring you the whole tithe into the storehouse, that there may be food in My house, and try Me now with this, says the Lord of hosts, if I will not open for you the windows of heaven and pour you out a blessing, that there shall be more than sufficiency [ ad beli dai ]”",
          "talmudLocation": "Makkot 23b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/23b#section-11",
          "talmudFullText": "From where is it derived that the heavenly court agreed to the <b>bringing</b> of the first <b>tithe</b> to the Temple treasury in Jerusalem? It is derived from a verse, <b>as it is written: “Bring you the whole tithe into the storehouse, that there may be food in My house, and try Me now with this, says YHWH of hosts, if I will not open for you the windows of heaven and pour you out a blessing, that there shall be more than sufficiency [<i>ad beli dai</i>]”</b> (Malachi 3:10). This indicates that the heavenly court agreed that the first tithe should be brought to the Temple treasury. The Talmud asks: <b>What</b> is the meaning of <b>“<i>ad beli dai</i>”? Rami bar Rav says: </b> It means that the abundance will be so great <b>that your lips will be worn out [<i>yivlu</i>], from saying enough [<i>dai</i>]. </b>"
        },
        {
          "verseLocation": "Malachi 3:10",
          "verseText": "they are blessed, as it is stated: “Bring you the whole tithe into the storehouse, that there may be food in My house, and try Me now with this, says the Lord of Hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall be more than sufficiency [ ad bli dai ]”",
          "talmudLocation": "Shabbat 32b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/32b#section-8",
          "talmudFullText": "They also said: <b>Due to the sin of abrogation of <i>terumot</i> and tithes, the heavens are prevented from pouring down dew and rain, and expense prevails, and profit is lost, and people pursue their livelihood but do not attain</b> it, <b>as it is stated: “Drought and heat consume the snow waters; so does the netherworld those that have sinned”</b> (Job 24:19). The Talmud asks: <b>What is the inference? </b> How is that concept derived from this verse? <b>The school of R' Yishmael taught</b> that it should be explained as follows: <b>Due to</b> the <b>things that I commanded you during the summer, </b> separating <i>terumot</i> and tithes from the summer crops, <b>and you did not do</b> them, <b>the snow waters will be robbed from you during the winter. And if</b> people <b>give</b> <i>terumot</i> and tithes, <b>they are blessed, as it is stated: “Bring you the whole tithe into the storehouse, that there may be food in My house, and try Me now with this, says YHWH of Hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall be more than sufficiency [<i>ad bli dai</i>]”</b> (Malachi 3:10). The Talmud asks: <b>What</b> is the meaning of: <b>More than sufficiency [<i>ad bli dai</i>]? Rami bar Rav said</b> that <b>Rav said: </b> It means that the abundance will be so great <b>that your lips will be worn out [<i>yivlu</i>], </b> similar to the word <i>beli</i>, <b>from saying enough [<i>dai</i>]. </b>"
        },
        {
          "verseLocation": "Malachi 3:10",
          "verseText": "is stated: “Bring the whole tithe into the storeroom,",
          "talmudLocation": "Taanit 22b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/22b#section-15",
          "talmudFullText": "<b>And R' Yoḥanan said: From where</b> is it derived <b>that one does not pray over an excess of good? </b> It <b>is stated: “Bring the whole tithe into the storeroom, </b> that there may be food in My house, and test Me now by this, said YHWH of hosts, if I will not open for you the windows of heaven, and pour out for you a blessing that there shall be more than sufficiency” (Malachi 3:10). <b>What</b> is the meaning of the phrase: <b>“That there shall be more than sufficiency [<i>ad beli dai</i>]”? Rami bar Ḥama said: </b> It means that the abundance will be so great <b>that your lips will be worn out [<i>yivlu</i>], </b> similar to the word <i>beli</i>, <b>from saying enough [<i>dai</i>]. </b> In other words, even when a blessing is delivered in gross excess, one should not pray for it to cease, as the verse blesses the people with an excess."
        },
        {
          "verseLocation": "Malachi 3:10",
          "verseText": "as it is stated: “Bring the whole tithe into the storeroom, that there may be food in My house, and test Me now by this, said the Lord of hosts, if I will not open for you the windows of heaven, and pour out for you a blessing that there shall be more than sufficiency”",
          "talmudLocation": "Taanit 9a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/9a#section-3",
          "talmudFullText": "The boy <b>said to him: And is it permitted to test God? But isn’t it written: “You shall not test YHWH your God”</b> (Deuteronomy 6:16)? R' Yoḥanan <b>said to</b> the boy that <b>R' Hoshaya said as follows: </b> It is prohibited to test God in any way, <b>except in this</b> case of tithes, <b>as it is stated: “Bring the whole tithe into the storeroom, that there may be food in My house, and test Me now by this, said YHWH of hosts, if I will not open for you the windows of heaven, and pour out for you a blessing that there shall be more than sufficiency”</b> (Malachi 3:10)."
        },
        {
          "verseLocation": "Malachi 3:16",
          "verseText": "the Divine Presence is with them? As it is stated: “Then they that feared the Lord spoke one with the other, and the Lord listened,",
          "talmudLocation": "Berakhot 6a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/6a#section-11",
          "talmudFullText": "<b>From where</b> is it derived <b>that two who sit and engage in Torah</b> study, <b>the Shekhina is with them? As it is stated: “Then they that feared YHWH spoke one with the other, and YHWH listened, </b> and heard, and a book of remembrance was written before Him, for them that fear YHWH, and that think upon His name” (Malachi 3:16). The Shekhina listens to any two God-fearing individuals who speak with each other."
        },
        {
          "verseLocation": "Malachi 3:16",
          "verseText": "links a good thought to an action, as it is stated: “Then they that feared the Lord spoke one with the other, and the Lord listened, and heard, and a book of remembrance was written before Him, for them that fear the Lord, and that think upon His name”",
          "talmudLocation": "Kiddushin 40a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/40a#section-12",
          "talmudFullText": "The Talmud further teaches: God, <b>links a good thought to an action, as it is stated: “Then they that feared YHWH spoke one with the other, and YHWH listened, and heard, and a book of remembrance was written before Him, for them that fear YHWH, and that think upon His name”</b> (Malachi 3:16). The Talmud explains: <b>What</b> is the meaning of the phrase <b>“and that think upon His name”? Rav Asi said: Even</b> if <b>a person intended to perform a mitzva but due to</b> circumstances <b>beyond</b> his <b>control he did not perform it, the verse ascribes him</b> credit <b>as if he performed</b> the mitzva, as he is among those that think upon His name."
        },
        {
          "verseLocation": "Malachi 3:16",
          "verseText": "spoke [ nidberu ]",
          "talmudLocation": "Makkot 11a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/11a#section-2",
          "talmudFullText": "The Talmud asks: <b>Is that to say that all</b> instances of <b>speaking [<i>dibbur</i>]</b> indicate <b>harsh language? </b> The Talmud answers: <b>Yes, as it is written</b> with regard to Joseph’s brothers: <b>“The man, YHWH of the land, spoke [<i>dibber</i>] harshly to us”</b> (Genesis 42:30). The Talmud asks: <b>But isn’t it taught</b> in a <i>baraita</i> with regard to the verse: “Then <b>they</b> who feared YHWH <b>spoke [<i>nidberu</i>]</b> with one another” (Malachi 3:16), that the term <b>“they spoke” is nothing other than a term of gentleness, and likewise, </b> the same is true of the verse which <b>states: “He subdues [<i>yadber</i>] peoples under us”</b> (Psalms 47:4), meaning that God will calmly and gently conduct the nations under the influence of the Jewish people? The Talmud answers: The meaning of <b><i>dibber</i> is discrete</b> and the meaning of <b><i>yadber</i> is discrete. </b> There is a difference between the two conjugations of the same root."
        },
        {
          "verseLocation": "Malachi 3:16",
          "verseText": "halakha , the Holy One, Blessed be He, listens to them, as it is stated: “Then they that feared the Lord spoke [ nidberu ]",
          "talmudLocation": "Shabbat 63a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/63a#section-19",
          "talmudFullText": "<b>R' Yirmeya said</b> that <b>R' Shimon ben Lakish said: Two Torah scholars who are agreeable to each other</b> when engaging <b>in</b> discussions of <b><i>halakha</i>, God listens to them, as it is stated: “Then they that feared YHWH spoke [<i>nidberu</i>]</b> one with another; and YHWH hearkened, and heard, and a book of remembrance was written before Him, for them that fear YHWH, and that think upon His name” (Malachi 3:16). <b>And</b> the term <b>speech</b> [<b><i>dibbur</i></b>] <b>means nothing other than calm, as it is stated: “He subdues [<i>yadber</i>] people under us”</b> (Psalms 47:4). He will cause the nations to submit to the Jewish people leading to a period of calm. Here too the term <i>dibbur</i> indicates calm and agreeability."
        },
        {
          "verseLocation": "Malachi 3:18",
          "verseText": "which is written: “Then you shall again discern between the righteous and the wicked, between he who serves God and he who does not serve Him”",
          "talmudLocation": "Chagigah 9b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/9b#section-10",
          "talmudFullText": "The Talmud records another discussion between bar Hei Hei and Hillel. <b>Bar Hei Hei said to Hillel: What is</b> the meaning of that <b>which is written: “Then you shall again discern between the righteous and the wicked, between he who serves God and he who does not serve Him”</b> (Malachi 3:18). There are two redundancies here: <b>“The righteous” is</b> the same as <b>“he who serves God, ”</b> and <b>“the wicked” is</b> the same as <b>“he who does not serve Him. ”</b> Hillel <b>said to him: </b> The one <b>“who serves Him”</b> and the one <b>“who does not serve Him” are both</b> referring to <b>completely righteous people. But</b> the verse is hinting at a distinction between them, as <b>one who reviews his studies one hundred times is not comparable to one who reviews his studies one hundred and one</b> times."
        },
        {
          "verseLocation": "Malachi 3:19",
          "verseText": "by it, as it is written: “For, behold, the day comes, it burns as a furnace; and all the proud, and all that work wickedness, shall be stubble; and the day that comes shall set them ablaze, said the Lord of hosts, that it shall leave them neither root nor branch”",
          "talmudLocation": "Avodah Zarah 4a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-1",
          "talmudFullText": "<b>by it, as it is written: “For, behold, the day comes, it burns as a furnace; and all the proud, and all that work wickedness, shall be stubble; and the day that comes shall set them ablaze, said YHWH of hosts, that it shall leave them neither root nor branch”</b> (Malachi 3:19). This verse is interpreted as follows: <b>Neither a root</b> shall remain for them <b>in this world, nor</b> will <b>a branch</b> grow for them <b>in the World-to-Come. </b> This teaches that the sun itself will burn and consume the wicked in the future."
        },
        {
          "verseLocation": "Malachi 3:19",
          "verseText": "as it is stated: “For behold, the day is coming, it burns as a furnace;",
          "talmudLocation": "Nedarim 8b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/8b#section-7",
          "talmudFullText": "<b>And the wicked will be punished by</b> the same sun, <b>as it is stated: “For behold, the day is coming, it burns as a furnace; </b> and all the proud, and all that work wickedness, shall be stubble; and the day that comes shall set them ablaze” (Malachi 3:19). Consequently, R' Shimon ben Lakish holds that the sun heals only in the World-to-Come, whereas Abaye interprets the verse as referring to this world."
        },
        {
          "verseLocation": "Malachi 3:19",
          "verseText": "do not come into the World-to-Come, as it is stated: “For behold the day is coming; it burns like a furnace, and all the arrogant and all who do wickedly shall be straw; and the day that is coming shall burn them up, says the Lord of hosts, so that it will leave them neither root nor branch”",
          "talmudLocation": "Sanhedrin 110b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/110b#section-9",
          "talmudFullText": "§ The Talmud asks: <b>What is the</b> characteristic <b>piety of</b> R' Akiva mentioned above? The Talmud answers: It is <b>as it is taught</b> in a <i>baraita</i>: <b>The minor children of the wicked of the Jewish people, </b> who died with neither their own virtue nor the virtue of their parents, <b>do not come into the World-to-Come, as it is stated: “For behold the day is coming; it burns like a furnace, and all the arrogant and all who do wickedly shall be straw; and the day that is coming shall burn them up, says YHWH of hosts, so that it will leave them neither root nor branch”</b> (Malachi 3:19). “Root” and “branch” are referring to descendants; they will have neither <b>a root in this world</b> nor <b>a branch in the World-to-Come; </b> this is <b>the statement of Rabban Gamliel. </b>"
        },
        {
          "verseLocation": "Malachi 3:20",
          "verseText": "“But to you that fear My Name shall the sun of righteousness arise with healing in its wings”",
          "talmudLocation": "Avodah Zarah 4a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-2",
          "talmudFullText": "And <b>the righteous will be healed by it, as it is written</b> in the next verse: <b>“But to you that fear My Name shall the sun of righteousness arise with healing in its wings”</b> (Malachi 3:20). <b>And moreover, </b> not only will they be healed by it, <b>but they will</b> even <b>be rejuvenated by it, as it is stated</b> in the continuation of that verse: <b>“And you shall go forth and leap as calves of the stall. ”</b>"
        },
        {
          "verseLocation": "Malachi 3:20",
          "verseText": "which is written: “But to you that fear My name shall the sun of righteousness arise",
          "talmudLocation": "Nedarim 8b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/8b#section-5",
          "talmudFullText": "§ <b>R' Shimon bar Zevid said</b> that <b>R' Yitzḥak bar Tavla said</b> that <b>R' Ḥiyya Arikha, </b> the tall, <b>of the school of R' Aḥa said</b> that <b>R' Zeira said</b> that <b>R' Elazar said</b> that <b>R' Ḥanina said</b> that <b>R' Meyasha said in the name of R' Yehuda bar Elai: What is</b> the meaning of that <b>which is written: “But to you that fear My name shall the sun of righteousness arise</b> with healing in its wings; and you shall go forth and leap as calves of the stall” (Malachi 3:20)? “You that fear My name”; <b>these are people who are afraid to mention the name of Heaven in vain. </b> The verse states that <b>a sun of righteousness with healing</b> will arise to heal them. <b>Abaye said: Learn from this</b> verse that <b>the dust [<i>ḥirga</i>]</b> that is illuminated by the rays of the sun during <b>the day heals, </b> as it states: “With healing in its wings. ”"
        },
        {
          "verseLocation": "Malachi 3:20",
          "verseText": "As it is stated: “But for you who fear My name, the sun of righteousness shall arise with healing in its wings”",
          "talmudLocation": "Taanit 8b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/8b#section-12",
          "talmudFullText": "<b>And R' Yitzḥak said: Sun on Shabbat is charity for the poor, </b> who are then able to enjoy the outdoors without suffering from cold. <b>As it is stated: “But for you who fear My name, the sun of righteousness shall arise with healing in its wings”</b> (Malachi 3:20). <b>And R' Yitzḥak</b> further <b>said: The day of the rains is great, as even a <i>peruta</i> in</b> one’s <b>pocket is blessed on it, as it is stated: “To give the rain of your land in its due time, and to bless all the work of your hand”</b> (Deuteronomy 28:12)."
        },
        {
          "verseLocation": "Malachi 3:21",
          "verseText": "with their bodies descend to Gehenna and are judged there for twelve months. After twelve months, their bodies are consumed, their souls are burned, and a wind scatters them under the soles of the feet of the righteous, as it is stated: “And you shall tread down the wicked; for they shall be ashes under the soles of your feet”",
          "talmudLocation": "Rosh Hashanah 17a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-3",
          "talmudFullText": "<b>The rebellious Jews</b> who have sinned <b>with their bodies and</b> also <b>the rebellious</b> people <b>of the nations of the world</b> who have sinned <b>with their bodies descend to Gehenna and are judged there for twelve months. After twelve months, their bodies are consumed, their souls are burned, and a wind scatters them under the soles of the feet of the righteous, as it is stated: “And you shall tread down the wicked; for they shall be ashes under the soles of your feet”</b> (Malachi 3:21)."
        },
        {
          "verseLocation": "Malachi 3:22",
          "verseText": "will be called by your name, as it is stated: “Remember the Torah of Moses My servant",
          "talmudLocation": "Shabbat 89a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/89a#section-4",
          "talmudFullText": "<b>He went to Moses</b> and <b>said to him: The Torah that God gave you, where is it? </b> Moses evaded the question and <b>said to him: And what am I that God would have given me the Torah? </b> I am unworthy. <b>God said to Moses: Moses, are you a fabricator? </b> Moses <b>said before Him: God!, You have a hidden treasure in which You delight every day, </b> as it is stated: “And I was His delight every day, playing before Him at every moment” (Proverbs 8:30). <b>Should I take credit for myself</b> and say that You gave it to me? <b>God said to Moses: Since you belittled yourself, </b> the Torah <b>will be called by your name, as it is stated: “Remember the Torah of Moses My servant</b> to whom I commanded at Horeb laws and statutes for all of Israel” (Malachi 3:22)."
        },
        {
          "verseLocation": "Malachi 3:23",
          "verseText": "day",
          "talmudLocation": "Shabbat 118a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/118a#section-7",
          "talmudFullText": "<b>R' Shimon ben Pazi said</b> that <b>R' Yehoshua ben Levi said in the name of bar Kappara: Anyone who fulfills</b> the obligation to eat <b>three meals on Shabbat is rescued from three punishments: From the pangs of the Messiah, </b> i.e., the suffering that precedes the advent of Messiah, <b>and from the judgment of Gehenna, and from the war of Gog and Magog. </b> The Talmud derives that one is rescued <b>from the pangs of Messiah</b> by means of a verbal analogy. <b>It is written here, </b> with regard to Shabbat, <b>day: </b> “Eat it today” (Exodus 16:25). <b>And it is written there, </b> with regard to Messiah, day: <b>“Behold, I am sending you Elijah the prophet before the coming of the</b> great and awesome <b>day</b> of God” (Malachi 3:23). The Talmud derives that one is rescued <b>from the judgment of Gehenna</b> by means of a verbal analogy. <b>It is written here, </b> with regard to Shabbat, <b>day, </b> as cited above. <b>And it is written there, </b> day: <b>“That day will be a day of wrath, </b> a day of trouble and distress, a day of destruction and desolation, a day of darkness and blackness, a day of cloud and thick fog” (Zephaniah 1:15), which is interpreted as referring to the punishment of Gehenna. The Talmud derives that one is rescued <b>from the war of Gog and Magog</b> by means of a verbal analogy. <b>It is written here, </b> with regard to Shabbat, <b>day. And it is written there, </b> with regard to the War of Gog and Magog, day: “And it shall be on that day, <b>on the day that Gog arrives</b> on the land of Israel” (Ezekiel 38:18)."
        }
      ]
    }
  ]
}