{
  "bookName": "Micah",
  "totalEntries": 45,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Micah 1:6",
          "verseText": "its neighbors were blessed, as it is written: “Therefore I will make Samaria a heap in the field, a place for the planting of vineyards”",
          "talmudLocation": "Berakhot 58a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58a#section-1",
          "talmudFullText": "With regard to Babylonia, the Talmud cites what R' Yirmeya ben Elazar said:  When Babylonia was cursed, its neighbors were cursed along with it. When Samaria was cursed, its neighbors were blessed.  When Babylonia was cursed its neighbors were cursed along with it, as it is written: “I will also make it a possession for the bittern,  a wading bird, and pools of water” (Isaiah 14:23); not only will it be destroyed, but the site will become a habitat for destructive, environmentally harmful creatures. When Samaria was cursed,  however, its neighbors were blessed, as it is written: “Therefore I will make Samaria a heap in the field, a place for the planting of vineyards” (Micah 1:6); although destroyed, it will serve a beneficial purpose."
        },
        {
          "verseLocation": "Micah 1:6",
          "verseText": "for planting vines”",
          "talmudLocation": "Eruvin 19a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/19a#section-1",
          "talmudFullText": "for planting vines” (Micah 1:6), which benefits all the surrounding inhabitants."
        },
        {
          "verseLocation": "Micah 1:7",
          "verseText": "“For of the payment to a prostitute she has gathered them, and to the payment to a prostitute they shall return”",
          "talmudLocation": "Avodah Zarah 17a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/17a#section-2",
          "talmudFullText": "He said to me: Jesus the Nazarene taught me the following:  It is permitted, as derived from the verse: “For of the payment to a prostitute she has gathered them, and to the payment to a prostitute they shall return” (Micah 1:7). Since the coins came from a place of filth, let them go to a place of filth and be used to build a bathroom."
        },
        {
          "verseLocation": "Micah 1:8",
          "verseText": "But isn’t it written: “I will make a wailing like the jackals, and a mourning like the daughters [ benot ] of the ya’ana ”",
          "talmudLocation": "Chullin 64b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/64b#section-5",
          "talmudFullText": "The Talmud persists: And is bat ya’ana not its name? But isn’t it written: “I will make a wailing like the jackals, and a mourning like the daughters [benot] of the ya’ana” (Micah 1:8)? The Talmud responds: The verse means: I will make mourning like this ya’ana that mourns for its children.  The Talmud asks: But isn’t it written: “And benot ya’ana shall dwell there” (Isaiah 13:21)? The Talmud responds: Here too, the verse means: And they shall dwell there like this ya’ana that dwells with its children. "
        },
        {
          "verseLocation": "Micah 1:14",
          "verseText": "“Therefore shall you give parting gifts to Moresheth Gath; the houses of Achzib are a deceitful thing for the kings of Israel”",
          "talmudLocation": "Sanhedrin 102a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102a#section-10",
          "talmudFullText": "The verse states: “Therefore shall you give parting gifts to Moresheth Gath; the houses of Achzib are a deceitful thing for the kings of Israel” (Micah 1:14). R' Ḥanina bar Pappa says:  When they crowned Jeroboam, a bat kol emerged and said to the subjects of the kingdom of Israel: He who killed the Philistine and bequeathed the city of Gath to you,  i.e., King David, will you give parting gifts to his sons and revolt against them? Ultimately, the houses of Achzib are a deceitful thing for the kings of Israel,  as the kings of Israel will also be forsaken by their subjects."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Micah 2:2",
          "verseText": "so they oppress a man and his house, even a man and his heritage”",
          "talmudLocation": "Gittin 58a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/58a#section-18",
          "talmudFullText": "§ Rav Yehuda says that Rav says: What is the meaning of that which is written:  “And they covet fields, and take them by violence; and houses, and take them away; so they oppress a man and his house, even a man and his heritage” (Micah 2:2)? There was an incident involving a certain man who set his eyes on his master’s wife, and he was a carpenter’s apprentice [shulya]. "
        },
        {
          "verseLocation": "Micah 2:5",
          "verseText": "will have neither a child nor a grandchild “who shall cast the line by lot in the congregation of the Lord”",
          "talmudLocation": "Kiddushin 39a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/39a#section-3",
          "talmudFullText": "Rav Yehuda sent a question to R' Yoḥanan concerning the halakha with regard to orla outside of Eretz Yisrael. R' Yoḥanan sent him the following response: Conceal,  i.e., do not publicize, the halakha that produce whose orla status is uncertain is permitted; and destroy,  i.e., prohibit entirely, produce whose orla status is certain; and with regard to the produce of those who are lenient in this halakha, declare that it requires interment,  as it is prohibited to derive benefit from such produce. And whoever says that there is no prohibition of orla outside of Eretz Yisrael will have neither a child nor a grandchild “who shall cast the line by lot in the congregation of YHWH” (Micah 2:5)."
        },
        {
          "verseLocation": "Micah 2:9",
          "verseText": "the verse says about him: “The women of my people you cast out from their pleasant houses”",
          "talmudLocation": "Eruvin 63b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/63b#section-8",
          "talmudFullText": "With regard to the neglect of the commandment of procreation, Rav Beruna said that Rav said: Whoever sleeps in a chamber in which a husband and wife are resting,  thus thwarting their intimacy, the verse says about him: “The women of my people you cast out from their pleasant houses” (Micah 2:9), and his punishment is detailed in that chapter."
        },
        {
          "verseLocation": "Micah 2:13",
          "verseText": "from here: “And their king passed [ vaya’avor ] before them and the Lord at their head”",
          "talmudLocation": "Megillah 21b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/21b#section-4",
          "talmudFullText": "The Talmud asks: From where may it be inferred that the word over is the language of precedence? Rav Naḥman bar Yitzḥak said that the verse states: “And Ahimaaz ran by the way of the plain, and overran [vaya’avor] the Cushite” (II Samuel 18:23), i.e., Ahimaaz overtook the Cushite. Abaye said:  It is derived from here: “And he passed [avar] before them” (Genesis 33:3). And if you wish, say instead that the proof is from here: “And their king passed [vaya’avor] before them and YHWH at their head” (Micah 2:13)."
        },
        {
          "verseLocation": "Micah 2:13",
          "verseText": "from here: “And their king passed [ vayya’avor ] before them and the Lord at their head”",
          "talmudLocation": "Niddah 63a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/63a#section-8",
          "talmudFullText": "The Talmud asks: From where may it be inferred that the word over is a formulation of priority? Rav Naḥman bar Yitzḥak said that the verse states: “And Ahimaaz ran by the way of the plain, and overran [vayya’avor] the Cushite” (II Samuel 18:23), i.e., Ahimaaz overtook the Cushite. Abaye said:  It is derived from here: “And he passed [avar] before them” (Genesis 33:3). And if you wish, say instead that the proof is from here: “And their king passed [vayya’avor] before them and YHWH at their head” (Micah 2:13)."
        },
        {
          "verseLocation": "Micah 2:13",
          "verseText": "from here: “And their king shall pass on [ vaya’avor ] before them, and God at their head”",
          "talmudLocation": "Pesachim 119b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/119b#section-2",
          "talmudFullText": "The Talmud asks: From where may it be inferred that the word over is a formulation that means before an action is performed? Rav Naḥman bar Yitzḥak said that this is as it is written: “And Ahimaaz ran by way of the square and he passed [vaya’avor] the Kushite” (II Samuel 18:23), i.e., Ahimaaz overtook the Kushite. Abaye said that it is derived from here: “And he passed [avar] before them” (Genesis 33:3). Some say that the proof is from here: “And their king shall pass on [vaya’avor] before them, and God at their head” (Micah 2:13)."
        },
        {
          "verseLocation": "Micah 2:13",
          "verseText": "from here: “And their king passed [ vaya’avor ] before them and God at their head”",
          "talmudLocation": "Pesachim 7b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/7b#section-10",
          "talmudFullText": "The Talmud asks: From where may it be inferred that the word over is the language of priority? Rav Naḥman bar Yitzḥak said that the verse said: “And Ahimaaz ran by the way of the plain, and overran [vaya’avor] the Cushite” (II Samuel 18:23), i.e., Ahimaaz overtook the Cushite. Abaye said:  It is derived from here: “And he passed [avar] before them” (Genesis 33:3). And if you wish, say instead that the proof is from here: “And their king passed [vaya’avor] before them and God at their head” (Micah 2:13)."
        },
        {
          "verseLocation": "Micah 2:13",
          "verseText": "from here: “And their king passed [ vaya’avor ] before them and the Lord at their head”",
          "talmudLocation": "Sukkah 39a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/39a#section-3",
          "talmudFullText": "§ The Mishnah continues: In a place where the custom is to recite a blessing when reciting hallel, he should recite a blessing. Abaye said:  The rabbis taught that the obligation to recite a blessing is dependent on custom only with regard to the blessing recited after hallel. However, before hallel, there is a mitzva to recite a blessing, as Rav Yehuda said that Shmuel said:  With regard to all the mitzvot, one recites a blessing over them prior to [over] their performance.  The Talmud asks: From where may it be inferred that the word over is the language of priority?  It is as Rav Naḥman bar Yitzḥak said that it is written: “And Ahimaaz ran by the way of the plain and overtook [vaya’avor] the Cushite” (II Samuel 18:23). Abaye said:  It is derived from here: “And he passed [avar] before them” (Genesis 33:3). And if you wish, say instead that the proof is from here: “And their king passed [vaya’avor] before them and YHWH at their head” (Micah 2:13)."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Micah 3:3",
          "verseText": "“Yea, they chop them in pieces, as that which is in the pot, and as flesh within the cauldron”",
          "talmudLocation": "Berakhot 56b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/56b#section-8",
          "talmudFullText": "R' Ḥanan said: There are three items seen in dreams that are indications of peace: A river, a bird and a pot.  The Talmud elaborates: A river, as it is written: “I will extend peace to her like a river” (Isaiah 66:12); a bird, as it is written: “As birds hovering, so will YHWH of hosts protect Jerusalem” (Isaiah 31:5); and a pot, as it is written: “Lord, You will establish [tishpot] peace for us” (Isaiah 26:12). Peace is likened to a pot which is placed [shafat] on the fire. And R' Ḥanina said: We learned that a pot in a dream is a sign of peace with regard to a pot that does not have meat in it,  as a pot that has meat in it symbolizes calamity, as it is stated: “Yea, they chop them in pieces, as that which is in the pot, and as flesh within the cauldron” (Micah 3:3)."
        },
        {
          "verseLocation": "Micah 3:3",
          "verseText": "“ She’era ”; this is sustenance, and it likewise states: “Who also eat the flesh [ she’er ] of my people”",
          "talmudLocation": "Ketubot 47b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/47b#section-10",
          "talmudFullText": "§ Rava said: This tanna,  in the baraita cited below, maintains that the obligation of a husband to provide his wife’s sustenance applies by Torah law, as it is taught with regard to the verse pertaining to a husband’s obligations toward his wife: “If he takes another wife for himself, her food [she’era], her clothing [kesuta], and her conjugal rights [onata], he shall not diminish” (Exodus 21:10). “She’era”; this is sustenance, and it likewise states: “Who also eat the flesh [she’er] of my people” (Micah 3:3). “Kesuta” is understood in its literal sense as referring to clothing. “Onata”; this is her conjugal rights, which is stated in the Torah, and so it says: “If you shall afflict [te’aneh] my daughters” (Genesis 31:50), which indicates that a husband may not deprive his wife of her conjugal rights."
        },
        {
          "verseLocation": "Micah 3:11",
          "verseText": "which it is written: “Her chiefs judge for bribes, her priests give rulings for a fee, and her prophets divine for pay; yet they rely on the Lord, saying: The Lord is in our midst, no tragedy will overtake us”",
          "talmudLocation": "Yoma 9b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/9b#section-9",
          "talmudFullText": "The Talmud continues: They were wicked; however, they put their faith in God.  With that statement we have come to the First Temple era, about which it is written: “Her chiefs judge for bribes, her priests give rulings for a fee, and her prophets divine for pay; yet they rely on YHWH, saying: YHWH is in our midst, no tragedy will overtake us” (Micah 3:11). At least the final portion of the verse was to their credit. Therefore, God brought upon them three decrees corresponding to their three wicked sins, as it is stated: “Therefore, due to you Zion will be plowed as a field, Jerusalem will become heaps of ruins, and the Temple Mount will be a like a shrine in the woods” (Micah 3:12)."
        },
        {
          "verseLocation": "Micah 3:12",
          "verseText": "Uriah it is written: “Therefore, for your sake Zion shall be plowed as a field,",
          "talmudLocation": "Makkot 24b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/24b#section-4",
          "talmudFullText": "In the prophecy of Uriah it is written: “Therefore, for your sake Zion shall be plowed as a field,  and Jerusalem shall become rubble, and the Temple Mount as the high places of a forest” (Micah 3:12), where foxes are found. There is a rabbinic tradition that this was prophesied by Uriah. In the prophecy of Zechariah it is written: “There shall yet be elderly men and elderly women sitting in the streets of Jerusalem” (Zechariah 8:4). Until the prophecy of Uriah with regard to the destruction of the city was fulfilled I was afraid that the prophecy of Zechariah would not be fulfilled,  as the two prophecies are linked. Now that the prophecy of Uriah was fulfilled, it is evident that the prophecy of Zechariah remains valid.  The Talmud adds: The rabbis said to him,  employing this formulation: Akiva, you have comforted us; Akiva, you have comforted us. "
        },
        {
          "verseLocation": "Micah 3:12",
          "verseText": "“Therefore, because of you, Zion shall be plowed as a field, and Jerusalem shall become heaps, and the Temple Mount as the high places of a forest”",
          "talmudLocation": "Shabbat 139a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/139a#section-3",
          "talmudFullText": "The Talmud comments: They are wicked, but they placed their trust in the One Who spoke and the world came into being,  God. Therefore, God brings upon them three calamities corresponding to the three transgressions for which they are responsible,  as it is stated in the following verse: “Therefore, because of you, Zion shall be plowed as a field, and Jerusalem shall become heaps, and the Temple Mount as the high places of a forest” (Micah 3:12)."
        },
        {
          "verseLocation": "Micah 3:12",
          "verseText": "Therefore, the Holy One, Blessed be He, brought upon them three decrees corresponding to their three wicked sins, as it is stated: “Therefore, due to you Zion will be plowed as a field, Jerusalem will become heaps of ruins, and the Temple Mount will be a like a shrine in the woods”",
          "talmudLocation": "Yoma 9b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/9b#section-9",
          "talmudFullText": "The Talmud continues: They were wicked; however, they put their faith in God.  With that statement we have come to the First Temple era, about which it is written: “Her chiefs judge for bribes, her priests give rulings for a fee, and her prophets divine for pay; yet they rely on YHWH, saying: YHWH is in our midst, no tragedy will overtake us” (Micah 3:11). At least the final portion of the verse was to their credit. Therefore, God brought upon them three decrees corresponding to their three wicked sins, as it is stated: “Therefore, due to you Zion will be plowed as a field, Jerusalem will become heaps of ruins, and the Temple Mount will be a like a shrine in the woods” (Micah 3:12)."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Micah 4:6",
          "verseText": "those with whom I have dealt in wickedness”",
          "talmudLocation": "Berakhot 32a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/32a#section-1",
          "talmudFullText": "As it is written in a future prophecy: “In that day, says YHWH, I will assemble the lame, and I will gather those who are abandoned and those with whom I have dealt in wickedness” (Micah 4:6). God states that He caused Israel to act wickedly."
        },
        {
          "verseLocation": "Micah 4:6",
          "verseText": "and her that I corrupted”",
          "talmudLocation": "Sukkah 52b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52b#section-8",
          "talmudFullText": "Ishmaelites, as it is written: “The tents of robbers prosper, and they that provoke God are secure, in whatsoever God brings with His hand” (Job 12:6). God brought upon Himself these Arabs that dwell in the deserts in tents. The evil inclination, as it is written:  “On that day, says YHWH, will I assemble her that is lame, and I will gather her that is driven away, and her that I corrupted” (Micah 4:6). God is saying that He created the evil inclination that led the people to sin and to be cast into exile."
        },
        {
          "verseLocation": "Micah 4:12",
          "verseText": "as the verse states: “For He has gathered them as the sheaves to the threshing-floor”",
          "talmudLocation": "Bava Metzia 89b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/89b#section-10",
          "talmudFullText": "The Talmud asks: And from where do we derive this halakha that with regard to eating fruit two at a time, dipping in salt establishes that they are subject to tithes? Rav Mattana said that it is as the verse states: “For He has gathered them as the sheaves to the threshing-floor” (Micah 4:12). This verse shows that one who gathers items together, an act that involves at least two items, is considered to have brought them into his granary. Consequently, if he also dips them in salt he has established his consumption as a fixed meal, which means that he must separate tithes."
        },
        {
          "verseLocation": "Micah 4:13",
          "verseText": "that they grind [ mehaddekin ] the nations of the world into Gehenna, as it is stated: “Arise and thresh, O daughter of Zion, for I will make your horn iron, and I will make your hoofs brass, and you shall beat in pieces [ vahadikot ] many peoples;",
          "talmudLocation": "Eruvin 101a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/101a#section-10",
          "talmudFullText": "With regard to bundles of thorns used to seal a breach, the Talmud cites a related incident: A certain heretic once said to R' Yehoshua ben Ḥananya: Man of thorns! For it says about you: “The best of them is as a brier” (Micah 7:4), which indicates that even Israel’s best are merely thorns. He said to him: Fool, go down to the end of the verse: “The most upright is worse than a thorn hedge, ” a derogatory expression meant as praise. Rather, what is the meaning of the best of them is as a brier?  It means that just as these thorns protect a breach, so the best among us protect us. Alternatively: The best of them is as a brier [ḥedek] means that they grind [mehaddekin] the nations of the world into Gehenna, as it is stated: “Arise and thresh, O daughter of Zion, for I will make your horn iron, and I will make your hoofs brass, and you shall beat in pieces [vahadikot] many peoples;  and you shall devote their gain to God, and their substance to the God of the whole earth” (Micah 4:13)."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Micah 5:2",
          "verseText": "kingdom will disperse throughout Eretz Yisrael for nine months, as it is stated: “Therefore will He give them up, until the time when she who is in labor has given birth; then the remnant of his brethren shall return with the children of Israel”",
          "talmudLocation": "Sanhedrin 98b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98b#section-2",
          "talmudFullText": "Rav says: The son of David will not come until the evil Roman kingdom will disperse throughout Eretz Yisrael for nine months, as it is stated: “Therefore will He give them up, until the time when she who is in labor has given birth; then the remnant of his brethren shall return with the children of Israel” (Micah 5:2). Once a period equivalent to a term of pregnancy passes, the redemption will come."
        },
        {
          "verseLocation": "Micah 5:2",
          "verseText": "throughout the world for nine months, as it is stated: “Therefore He will give them up until she who is to bear has borne; then the remnants of his brethren will return with the children of Israel”",
          "talmudLocation": "Yoma 10a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/10a#section-12",
          "talmudFullText": "That was also taught in a baraita: Persia is destined to fall into the hands of Rome. One reason is that they destroyed synagogues. And furthermore, it is the King’s decree that the builders will fall into the hands of the destroyers, as Rav Yehuda said that Rav said: The son of David will come only when the wicked kingdom of Rome spreads its dominance throughout the world for nine months, as it is stated: “Therefore He will give them up until she who is to bear has borne; then the remnants of his brethren will return with the children of Israel” (Micah 5:2). The duration of Rome’s rule over the world will be the duration of a pregnancy, nine months."
        },
        {
          "verseLocation": "Micah 5:4",
          "verseText": "“And this shall be peace: When the Assyrian shall come into our land, and when he shall tread in our palaces, then shall we raise against him seven shepherds, and eight princes among men”",
          "talmudLocation": "Sukkah 52b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52b#section-13",
          "talmudFullText": "The Talmud continues homiletically interpreting verses that relate to the end of days. It is stated: “And this shall be peace: When the Assyrian shall come into our land, and when he shall tread in our palaces, then shall we raise against him seven shepherds, and eight princes among men” (Micah 5:4). The Talmud asks: Who are these seven shepherds?  The Talmud explains: David is in the middle; Adam, Seth, and Methuselah are to his right; Abraham, Jacob, and Moses are to his left. And who are the eight princes among men?  They are Yishai, Saul, Samuel, Amos, Zephania, Zedekiah, Messiah, and Elijah. "
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "Micah 6:2",
          "verseText": "And it says: “Hear, O mountains, the Lord’s controversy, and you strong [ eitanim ] foundations of the earth”",
          "talmudLocation": "Rosh Hashanah 11a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/11a#section-8",
          "talmudFullText": "The Talmud asks: From where may it be inferred that the term eitan denotes mighty? As it is written: “Strong [eitan] is Your dwelling place,  and You put Your nest in a rock” (Numbers 24:21). And it says: “Hear, O mountains, YHWH’s controversy, and you strong [eitanim] foundations of the earth” (Micah 6:2), which is a call to the Patriarchs. And it says: “The voice of my beloved; behold, he comes leaping upon the mountains, skipping upon the hills” (Song of Songs 2:8): “Leaping upon the mountains” means that the redemption will arrive early in the merit of the Patriarchs,  who are called mountains, and “skipping upon the hills” means that it will come in the merit of the Matriarchs. "
        },
        {
          "verseLocation": "Micah 6:2",
          "verseText": "and it states: “Hear, O you mountains, the Lord’s controversy, and the enduring rocks [ eitanim ], the foundations of the earth”",
          "talmudLocation": "Sotah 46b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/46b#section-1",
          "talmudFullText": "“Firm [eitan] is your dwelling-place, and your nest is set in the rock” (Numbers 24:21), and it states: “Hear, O you mountains, YHWH’s controversy, and the enduring rocks [eitanim], the foundations of the earth” (Micah 6:2). The use of the word in these verses indicates that “eitan” means something hard, like a rock or a mountain. Others say a different explanation of the word eitan: From where is it derived that eitan means old? As it is stated: “It is an ancient [eitan] nation, a nation from of old” (Jeremiah 5:15)."
        },
        {
          "verseLocation": "Micah 6:5",
          "verseText": "“O My people, remember now what Balak, king of Moab, devised, and what Balaam, son of Beor, answered him; from Shittim unto Gilgal, that you may know the righteous acts of the Lord”",
          "talmudLocation": "Avodah Zarah 4b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4b#section-4",
          "talmudFullText": "The Talmud returns to its previous question: Rather, what is the meaning of: “And knows the knowledge of the Most High” (Numbers 24:16)? It means that he was able to determine precisely the hour at which God is angry.  At that moment Balaam would utter his curse and, through God’s anger, it would be fulfilled. And this is what the prophet said to the Jewish people: “O My people, remember now what Balak, king of Moab, devised, and what Balaam, son of Beor, answered him; from Shittim unto Gilgal, that you may know the righteous acts of YHWH” (Micah 6:5)."
        },
        {
          "verseLocation": "Micah 6:5",
          "verseText": "And that is what the prophet said to Israel: “My nation, remember what Balak king of Moab advised,",
          "talmudLocation": "Berakhot 7a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/7a#section-11",
          "talmudFullText": "And that is what the prophet said to Israel: “My nation, remember what Balak king of Moab advised,  and how Balaam, son of Beor, responded; from Shittim to Gilgal, so that you may know the righteous acts of YHWH” (Micah 6:5). What is meant by the statement: “So that you may know the righteous acts of YHWH”? "
        },
        {
          "verseLocation": "Micah 6:5",
          "verseText": "And that is what the prophet said to Israel: “My nation, remember what Balak, king of Moab, advised, and how Balaam, son of Beor, responded; from Shittim to Gilgal, so that you may know the righteous acts of the Lord”",
          "talmudLocation": "Sanhedrin 105b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105b#section-6",
          "talmudFullText": "And that is what the prophet said to Israel: “My nation, remember what Balak, king of Moab, advised, and how Balaam, son of Beor, responded; from Shittim to Gilgal, so that you may know the righteous acts of YHWH” (Micah 6:5). What is the meaning of the phrase “So that you may know the righteous acts of YHWH”? God said to Israel: Know how many acts of kindness I performed on your behalf, that I did not become angry during all the days of Balaam the wicked, as had I become angry during all those days, no remnant or refugee would have remained among the enemies of Israel,  a euphemism for Israel itself. Instead, God restrained His anger and Balaam’s curse went unfulfilled."
        },
        {
          "verseLocation": "Micah 6:8",
          "verseText": "upon three, as it is written: “It has been told to you, O man, what is good, and what the Lord does require of you; only to do justly, and to love mercy, and to walk humbly with your God”",
          "talmudLocation": "Makkot 24a:25",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/24a#section-25",
          "talmudFullText": "Micah came and established the 613 mitzvot upon three, as it is written: “It has been told to you, O man, what is good, and what YHWH does require of you; only to do justly, and to love mercy, and to walk humbly with your God” (Micah 6:8)."
        },
        {
          "verseLocation": "Micah 6:8",
          "verseText": "which is written: “It has been told you, O man, what is good, and what the Lord does require of you; only to do justly, and to love mercy, and to walk humbly with your God”",
          "talmudLocation": "Sukkah 49b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/49b#section-8",
          "talmudFullText": "And this is what R' Elazar said: What is the meaning of that which is written: “It has been told you, O man, what is good, and what YHWH does require of you; only to do justly, and to love mercy, and to walk humbly with your God” (Micah 6:8)? “To do justly”; this is justice. “To love mercy”; this is acts of kindness. “To walk humbly with your God”; this is referring to taking the indigent dead out for burial and accompanying a poor bride to her wedding canopy,  both of which must be performed without fanfare. The Talmud summarizes: And are these matters not inferred a fortiori? If,  with regard to matters that tend to be conducted in public,  as the multitudes participate in funerals and weddings, the Torah says: Walk humbly,  then in matters that tend to be conducted in private,  e.g., giving charity and studying Torah, all the more so should they be conducted privately."
        },
        {
          "verseLocation": "Micah 6:9",
          "verseText": "From the wall to the city, as it is written: “The Lord’s voice cries to the city”",
          "talmudLocation": "Rosh Hashanah 31a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/31a#section-16",
          "talmudFullText": "And from the threshold of the Sanctuary the Shekhina went to the courtyard, as it is written: “And the House was filled with the cloud and the courtyard was full of the brightness of YHWH’s glory” (Ezekiel 10:4). From the courtyard to the altar, as it is written: “I saw YHWH standing on the altar” (Amos 9:1). And from the altar to the roof, as it is written: “It is better to dwell in a corner of the roof than in a house together with a contentious woman” (Proverbs 21:9). From the roof to the wall, as it is written: “And behold, YHWH stood upon a wall made by a plumb line” (Amos 7:7). From the wall to the city, as it is written: “YHWH’s voice cries to the city” (Micah 6:9)."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Micah 7:1",
          "verseText": "is stated: “There is no cluster to eat; nor first-ripe fig that my soul desires”",
          "talmudLocation": "Sotah 47a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-20",
          "talmudFullText": "From the time when Yosei ben Yo’ezer of Tzereida and Yosei ben Yehuda of Jerusalem died, the clusters ceased,  i.e., they were the last of the clusters, as explained in the Talmud, as it is stated: “There is no cluster to eat; nor first-ripe fig that my soul desires” (Micah 7:1). The Mishnah continues in the same vein: Yoḥanan the High Priest took away the declaration of the tithe.  After his time, no one recited the passage about the elimination of tithes that had previously been said at the end of a three-year tithing cycle. He also nullified the actions of the awakeners and the strikers at the Temple."
        },
        {
          "verseLocation": "Micah 7:4",
          "verseText": "said to Rabbi Yehoshua ben Ḥananya: Man of thorns! For it says about you: “The best of them is as a brier”",
          "talmudLocation": "Eruvin 101a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/101a#section-10",
          "talmudFullText": "With regard to bundles of thorns used to seal a breach, the Talmud cites a related incident: A certain heretic once said to R' Yehoshua ben Ḥananya: Man of thorns! For it says about you: “The best of them is as a brier” (Micah 7:4), which indicates that even Israel’s best are merely thorns. He said to him: Fool, go down to the end of the verse: “The most upright is worse than a thorn hedge, ” a derogatory expression meant as praise. Rather, what is the meaning of the best of them is as a brier?  It means that just as these thorns protect a breach, so the best among us protect us. Alternatively: The best of them is as a brier [ḥedek] means that they grind [mehaddekin] the nations of the world into Gehenna, as it is stated: “Arise and thresh, O daughter of Zion, for I will make your horn iron, and I will make your hoofs brass, and you shall beat in pieces [vahadikot] many peoples;  and you shall devote their gain to God, and their substance to the God of the whole earth” (Micah 4:13)."
        },
        {
          "verseLocation": "Micah 7:5",
          "verseText": "which is written: “Trust not in a companion, do not put your confidence in an intimate friend”",
          "talmudLocation": "Chagigah 16a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/16a#section-15",
          "talmudFullText": "Apropos this Sage, the Talmud cites another statement of his: R' Yehuda ben Naḥmani, the disseminator of Reish Lakish, interpreted a verse homiletically: What is the meaning of that which is written: “Trust not in a companion, do not put your confidence in an intimate friend” (Micah 7:5)? If the evil inclination says to you: Sin, and God will forgive, do not trust it, since it is stated: “Trust not in a companion [rei’a]. ” And rei’a is referring to none other than the evil [ra] inclination, as it is stated: “For the inclination of the heart of man is evil [ra]” (Genesis 8:21)."
        },
        {
          "verseLocation": "Micah 7:5",
          "verseText": "testify against him, as it is stated: “Guard the doors of your mouth from she who lies in your bosom”",
          "talmudLocation": "Chagigah 16a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/16a#section-17",
          "talmudFullText": "And the rabbis say: A person’s soul shall itself testify against him, as it is stated: “Guard the doors of your mouth from she who lies in your bosom” (Micah 7:5). What thing lies in a person’s bosom? You must say it is his soul. R' Zerika said:  The two ministering angels who accompany him,  i.e., each individual, they testify against him, as it is stated: “For He will command His angels over you, to guard you in all your ways” (Psalms 91:11). And the rabbis say: A person’s limbs testify against him, as it is stated: “Therefore you are My witnesses, says YHWH, and I am God” (Isaiah 43:12), which indicates that each individual becomes his own witness and testifies against himself on the Day of Judgment."
        },
        {
          "verseLocation": "Micah 7:5",
          "verseText": "testify against him, as it is stated: “Keep the doors of your mouth from her who lies in your bosom”",
          "talmudLocation": "Taanit 11a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/11a#section-10",
          "talmudFullText": "R' Ḥidka said: A person’s soul will testify against him, as it is stated: “Keep the doors of your mouth from her who lies in your bosom” (Micah 7:5). And some say: A man’s limbs will testify against him, as it is stated: “You are My witnesses, says YHWH” (Isaiah 43:10)."
        },
        {
          "verseLocation": "Micah 7:14",
          "verseText": "let them feed [ yiru ] in Bashan and Gilad as in the days of old”",
          "talmudLocation": "Pesachim 68a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/68a#section-12",
          "talmudFullText": "Rather, Rava said:  This verse should be understood in accordance with what Rav Ḥananel said that Rav said. For Rav Ḥananel said that Rav said: In the future, the righteous will resurrect the dead. It is written here: “Then shall the lambs feed [vera’u] as in their pasture, ” the lambs serving as an allusion to the righteous, and it is written there:  “Tend your people with your staff, the flock of your heritage, who dwell alone in the wood, in the midst of Carmel; let them feed [yiru] in Bashan and Gilad as in the days of old” (Micah 7:14)."
        },
        {
          "verseLocation": "Micah 7:18",
          "verseText": "all his transgressions are removed from him, as it is stated: “He pardons iniquity and overlooks transgression”",
          "talmudLocation": "Megillah 28a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/28a#section-14",
          "talmudFullText": "He also said: Nor was I ever inflexible in exacting a measure of retribution against those who wronged me. This is referring to conduct such as that which Rava said: Anyone who overlooks exacting a measure of retribution against those who wronged him, all his transgressions are removed from him, as it is stated: “He pardons iniquity and overlooks transgression” (Micah 7:18), which is homiletically read as saying: For whom does He pardon iniquity? For he who overlooks transgressions that others have committed against him."
        },
        {
          "verseLocation": "Micah 7:18",
          "verseText": "as it is stated: “He bears [ noseh ] sin and forgives transgression”",
          "talmudLocation": "Rosh Hashanah 17a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-12",
          "talmudFullText": "§ It was taught in the baraita: Beit Hillel say:  He who is “and abundant in kindness” (Exodus 34:6) tilts the scales in favor of kindness,  so that middling people will not have to pass through Gehenna. The Talmud asks: How does He do this? R' Eliezer says: He pushes down on the side of the merits, tipping the scale in their favor, as it is stated: “He will again have compassion upon us; He will push down our iniquities” (Micah 7:19). R' Yosei bar Ḥanina said: He bears,  i.e., raises, the side of the sins, as it is stated: “He bears [noseh] sin and forgives transgression” (Micah 7:18)."
        },
        {
          "verseLocation": "Micah 7:18",
          "verseText": "for all his sins, as it is stated: “He bears sin and forgives transgression”",
          "talmudLocation": "Rosh Hashanah 17a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-14",
          "talmudFullText": "Rava understood this verse differently and said:  With regard to whoever forgoes his reckonings with others for injustices done to him, the heavenly court in turn forgoes punishment for all his sins, as it is stated: “He bears sin and forgives transgression” (Micah 7:18). Whose sins does He bear?  The sins of one who forgoes his reckonings with others for injustices committed against him."
        },
        {
          "verseLocation": "Micah 7:18",
          "verseText": "for the remnant of His inheritance”",
          "talmudLocation": "Rosh Hashanah 17a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-16",
          "talmudFullText": "That same verse continues: “He bears sins and forgives transgression for the remnant of His inheritance” (Micah 7:18). Rav Aḥa bar Ḥanina said:  This is like the fat tail that has a thorn in it,  i.e., something good that contains something bad. God forgives and pardons only “for the remnant of His inheritance, ” but not for all His inheritance. "
        },
        {
          "verseLocation": "Micah 7:19",
          "verseText": "as it is stated: “He will again have compassion upon us; He will push down our iniquities”",
          "talmudLocation": "Rosh Hashanah 17a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-12",
          "talmudFullText": "§ It was taught in the baraita: Beit Hillel say:  He who is “and abundant in kindness” (Exodus 34:6) tilts the scales in favor of kindness,  so that middling people will not have to pass through Gehenna. The Talmud asks: How does He do this? R' Eliezer says: He pushes down on the side of the merits, tipping the scale in their favor, as it is stated: “He will again have compassion upon us; He will push down our iniquities” (Micah 7:19). R' Yosei bar Ḥanina said: He bears,  i.e., raises, the side of the sins, as it is stated: “He bears [noseh] sin and forgives transgression” (Micah 7:18)."
        }
      ]
    }
  ]
}