{
  "bookName": "Nehemiah",
  "totalEntries": 52,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Nehemiah 1:1",
          "verseText": "nations of the world are counted from Tishrei, as it is stated: “The words of Nehemiah, son of Hachaliah. And it came to pass in the month Kislev, in the twentieth year,",
          "talmudLocation": "Rosh Hashanah 3a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/3a#section-14",
          "talmudFullText": "§ <b>Rav Ḥisda said: They taught</b> that the years of a king’s rule are counted from the first of Nisan <b>only with regard to the</b> Jewish <b>kings of Israel, but</b> the years of <b>the kings of the</b> non-Jew <b>nations of the world are counted from Tishrei, as it is stated: “The words of Nehemiah, son of Hachaliah. And it came to pass in the month Kislev, in the twentieth year, </b> as I was in Shushan the capital” (Nehemiah 1:1). <b>And it is written: “And it came to pass in the month Nisan, in the twentieth year of Artaxerxes</b> the king, that wine was before him, and I took up the wine, and gave it to the king” (Nehemiah 2:1)."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Nehemiah 2:1",
          "verseText": "And it is written: “And it came to pass in the month Nisan, in the twentieth year of Artaxerxes",
          "talmudLocation": "Rosh Hashanah 3a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/3a#section-14",
          "talmudFullText": "§ <b>Rav Ḥisda said: They taught</b> that the years of a king’s rule are counted from the first of Nisan <b>only with regard to the</b> Jewish <b>kings of Israel, but</b> the years of <b>the kings of the</b> non-Jew <b>nations of the world are counted from Tishrei, as it is stated: “The words of Nehemiah, son of Hachaliah. And it came to pass in the month Kislev, in the twentieth year, </b> as I was in Shushan the capital” (Nehemiah 1:1). <b>And it is written: “And it came to pass in the month Nisan, in the twentieth year of Artaxerxes</b> the king, that wine was before him, and I took up the wine, and gave it to the king” (Nehemiah 2:1)."
        },
        {
          "verseLocation": "Nehemiah 2:6",
          "verseText": "“And the king said to me, the consort [ shegal ] also sitting by him:",
          "talmudLocation": "Rosh Hashanah 4a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/4a#section-6",
          "talmudFullText": "<b>Rav Yosef said, and some say</b> that it was <b>R' Yitzḥak</b> who said: <b>From where do we</b> derive <b>that</b> Cyrus <b>became corrupt? From here, </b> as it is written: <b>“And the king said to me, the consort [<i>shegal</i>] also sitting by him: </b> For how long shall your journey be? And when will you return? So it pleased the king to send me, and I set him a time” (Nehemiah 2:6). <b>What is</b> the meaning of the word <b><i>shegal</i></b> in the verse? <b>Rabba bar Lima said in the name of Rav: </b> It means <b>a she-dog</b> that sat next to him, which he used for sexual sex."
        },
        {
          "verseLocation": "Nehemiah 2:8",
          "verseText": "“And a letter to Asaph the keeper of the king’s park,",
          "talmudLocation": "Arakhin 6a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/6a#section-4",
          "talmudFullText": "<b>Rav Yosef raises an objection</b> to the ruling of the <i>baraita</i> as interpreted by R' Yoḥanan, that with regard to the beginning of the building of the Temple nothing is accepted from non-Jews. Nehemiah requested from the king of Persia: <b>“And a letter to Asaph the keeper of the king’s park, </b> that he may give me timber to make beams for the gates of the castle that pertains to the house” (Nehemiah 2:8). Here Nehemiah clearly asked for material from non-Jews. <b>Abaye said to</b> Rav Yosef: Actions taken by <b>the government are different, as</b> the government <b>does not retract</b> its decisions. <b>As Shmuel says: If the government says: I will uproot mountains, it will uproot mountains and not retract</b> what it said."
        },
        {
          "verseLocation": "Nehemiah 2:19",
          "verseText": "As it is written: “And Sanballat the Horonite and Tobiah the servant, the Ammonite, heard”",
          "talmudLocation": "Kiddushin 70a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/70a#section-3",
          "talmudFullText": "The Mishnah taught that <b><i>mamzerim</i></b> were among those who ascended from Babylonia. The Talmud asks: <b>From where do we</b> derive this? The Talmud answers: <b>As it is written: “And Sanballat the Horonite and Tobiah the servant, the Ammonite, heard”</b> (Nehemiah 2:19), <b>and</b> elsewhere <b>it is written</b> with regard to Tobiah the Ammonite: <b>“For there were many in Judah sworn to him because he was the son-in-law of Shecaniah the son of Arah; and his son Jehohanan had taken the daughter of Meshullam the son of Berechiah”</b> (Nehemiah 6:18). The Talmud proceeds to explain: This <i>tanna</i> <b>holds</b> that in the case of <b>a non-Jew or a slave who had sex with a Jewish woman, the offspring is a <i>mamzer</i>. </b> Since Tobiah the Ammonite, a non-Jew, married a Jewish woman, as did his son, there were clearly <i>mamzerim</i> among those who ascended."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Nehemiah 4:15",
          "verseText": "“And we perform the work, and half of them grasp their spears from dawn until the emergence of the stars”",
          "talmudLocation": "Berakhot 2b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/2b#section-8",
          "talmudFullText": "The Talmud <b>raises a contradiction</b> from the <i>Tosefta</i>: <b>From when does one begin to recite</b> <i>Shema</i> <b>in the evening? From the time when people enter to eat their bread on Shabbat eve. </b> This is <b>the statement of R' Meir. </b> As they do in our Mishnah, <b>the Rabbis say: From the time when the priests are eligible to partake of their <i>teruma</i>, a sign for which is the emergence of the stars. And although there is no</b> explicit <b>proof</b> that the emergence of the stars is when one may begin to recite the evening <i>Shema</i>, <b>there is an allusion</b> in the book of Nehemiah to the fact that the emergence of the stars is generally considered the beginning of the night. As <b>it is stated</b> with regard to the building of the walls of Jerusalem: <b>“And we perform the work, and half of them grasp their spears from dawn until the emergence of the stars”</b> (Nehemiah 4:15). <b>And it says: “That in the night they may be a guard to us, and may labor in the day”</b> (Nehemiah 4:16). From here we ascertain that the day ends with the emergence of the stars."
        },
        {
          "verseLocation": "Nehemiah 4:15",
          "verseText": "“So we labored in the work; and half of them held the spears from the rising of the morning till the stars appeared”",
          "talmudLocation": "Megillah 20b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/20b#section-4",
          "talmudFullText": "<b>Rather, R' Zeira said: </b> We derive this <i>halakha</i> <b>from here, </b> as it is stated: <b>“So we labored in the work; and half of them held the spears from the rising of the morning till the stars appeared”</b> (Nehemiah 4:15), where “rising of the morning” means daybreak, <b>and</b> the next verse <b>states: “So that in the night they may be a guard to us; </b> and labor in the day” (Nehemiah 4:16). This demonstrates that the day begins with the dawn."
        },
        {
          "verseLocation": "Nehemiah 4:16",
          "verseText": "And it says: “That in the night they may be a guard to us, and may labor in the day”",
          "talmudLocation": "Berakhot 2b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/2b#section-8",
          "talmudFullText": "The Talmud <b>raises a contradiction</b> from the <i>Tosefta</i>: <b>From when does one begin to recite</b> <i>Shema</i> <b>in the evening? From the time when people enter to eat their bread on Shabbat eve. </b> This is <b>the statement of R' Meir. </b> As they do in our Mishnah, <b>the Rabbis say: From the time when the priests are eligible to partake of their <i>teruma</i>, a sign for which is the emergence of the stars. And although there is no</b> explicit <b>proof</b> that the emergence of the stars is when one may begin to recite the evening <i>Shema</i>, <b>there is an allusion</b> in the book of Nehemiah to the fact that the emergence of the stars is generally considered the beginning of the night. As <b>it is stated</b> with regard to the building of the walls of Jerusalem: <b>“And we perform the work, and half of them grasp their spears from dawn until the emergence of the stars”</b> (Nehemiah 4:15). <b>And it says: “That in the night they may be a guard to us, and may labor in the day”</b> (Nehemiah 4:16). From here we ascertain that the day ends with the emergence of the stars."
        },
        {
          "verseLocation": "Nehemiah 4:16",
          "verseText": "states: “So that in the night they may be a guard to us;",
          "talmudLocation": "Megillah 20b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/20b#section-4",
          "talmudFullText": "<b>Rather, R' Zeira said: </b> We derive this <i>halakha</i> <b>from here, </b> as it is stated: <b>“So we labored in the work; and half of them held the spears from the rising of the morning till the stars appeared”</b> (Nehemiah 4:15), where “rising of the morning” means daybreak, <b>and</b> the next verse <b>states: “So that in the night they may be a guard to us; </b> and labor in the day” (Nehemiah 4:16). This demonstrates that the day begins with the dawn."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Nehemiah 5:15",
          "verseText": "predecessors, as it is stated: “But the former governors who were before me placed burdens upon the people, and took from them for bread and wine beyond forty shekels",
          "talmudLocation": "Sanhedrin 93b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93b#section-17",
          "talmudFullText": "<b>Rav Yosef says: </b> Nehemiah was punished <b>because he spoke in denigration of</b> his <b>predecessors, as it is stated: “But the former governors who were before me placed burdens upon the people, and took from them for bread and wine beyond forty shekels</b> of silver; even their servants ruled over the people; but I did not do so, due to the fear of God” (Nehemiah 5:15). <b>And he related</b> these disparaging statements <b>even about Daniel, who was greater than he</b> was."
        },
        {
          "verseLocation": "Nehemiah 5:19",
          "verseText": "and, for example: “Remember me, my God, for good”",
          "talmudLocation": "Rosh Hashanah 32b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/32b#section-4",
          "talmudFullText": "The Talmud states: <b>One does not recite</b> a verse dealing with <b>the remembrance of an individual, even</b> if it is <b>for good, for example: “Remember me, O Lord, when You show favor to Your people”</b> (Psalms 106:4), <b>and, for example: “Remember me, my God, for good”</b> (Nehemiah 5:19)."
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "Nehemiah 6:18",
          "verseText": "“For there were many in Judah sworn to him because he was the son-in-law of Shecaniah the son of Arah; and his son Jehohanan had taken the daughter of Meshullam the son of Berechiah”",
          "talmudLocation": "Kiddushin 70a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/70a#section-3",
          "talmudFullText": "The Mishnah taught that <b><i>mamzerim</i></b> were among those who ascended from Babylonia. The Talmud asks: <b>From where do we</b> derive this? The Talmud answers: <b>As it is written: “And Sanballat the Horonite and Tobiah the servant, the Ammonite, heard”</b> (Nehemiah 2:19), <b>and</b> elsewhere <b>it is written</b> with regard to Tobiah the Ammonite: <b>“For there were many in Judah sworn to him because he was the son-in-law of Shecaniah the son of Arah; and his son Jehohanan had taken the daughter of Meshullam the son of Berechiah”</b> (Nehemiah 6:18). The Talmud proceeds to explain: This <i>tanna</i> <b>holds</b> that in the case of <b>a non-Jew or a slave who had sex with a Jewish woman, the offspring is a <i>mamzer</i>. </b> Since Tobiah the Ammonite, a non-Jew, married a Jewish woman, as did his son, there were clearly <i>mamzerim</i> among those who ascended."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Nehemiah 7:7",
          "verseText": "it is written: “Who came with Zerubbabel, Jeshua, Nehemiah, Azariah, Raamiah, Nahmani, Mordecai, Bilshan”",
          "talmudLocation": "Megillah 16b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16b#section-18",
          "talmudFullText": "<b>Rav Yosef said: Studying Torah is greater than saving lives, as initially, </b> when listing the Jewish leaders who came to Eretz Yisrael, <b>Mordecai was mentioned after four</b> other people, <b>but at the end</b> he was listed <b>after five. </b> This is taken to indicate that his involvement in governmental affairs instead of in Torah study lowered his stature one notch. The Talmud proves this: <b>At first it is written: “Who came with Zerubbabel, Jeshua, Nehemiah, Seraiah, Reelaiah, Mordecai, Bilshan”</b> (Ezra 2:2); <b>but in the end</b> in a later list <b>it is written: “Who came with Zerubbabel, Jeshua, Nehemiah, Azariah, Raamiah, Nahmani, Mordecai, Bilshan”</b> (Nehemiah 7:7)."
        },
        {
          "verseLocation": "Nehemiah 7:7",
          "verseText": "which is written with regard to Mordekhai: “Bilshan”",
          "talmudLocation": "Menachot 65a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/65a#section-3",
          "talmudFullText": "The Talmud answers: <b>Rather, </b> Petaḥya was unique <b>as</b> he not only knew all seventy languages, but also had the ability to <b>combine</b> various <b>languages and interpret</b> them. <b>This is</b> the meaning of that <b>which is written with regard to Mordekhai: “Bilshan”</b> (Nehemiah 7:7). Bilshan is interpreted as another name for Mordekhai, as he would combine [<i>balil</i>] languages [<i>lashon</i>]."
        },
        {
          "verseLocation": "Nehemiah 7:61",
          "verseText": "from here: “And these were they that ascended from Tel Melah, Tel Harsha, Cherub, Addon, and Immer; but they could not tell their fathers’ houses, nor their offspring, whether they were of Israel”",
          "talmudLocation": "Kiddushin 70a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/70a#section-5",
          "talmudFullText": "<b>Rather, </b> the proof that <i>mamzerim</i> were among those who ascended from Babylonia is <b>from here: “And these were they that ascended from Tel Melah, Tel Harsha, Cherub, Addon, and Immer; but they could not tell their fathers’ houses, nor their offspring, whether they were of Israel”</b> (Nehemiah 7:61). The Talmud explains that these names are to be interpreted as follows: <b>“Tel Melah”; these are people whose</b> licentious <b>actions were similar to the act of Sodom, which was turned into a mound of salt [<i>tel melaḥ</i>]. “Tel Harsha”; this</b> is referring to one <b>who calls</b> a man <b>father, and his mother silences him, </b> as the word <i>ḥarsha</i> is similar to <i>maḥarishto</i>, meaning: Silences him. In any event, the statement that there were those who acted licentiously, as did the people of Sodom, means that there were <i>mamzerim</i> among them."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "Nehemiah 8:3",
          "verseText": "from here: “And the ears of all the people were attentive to the book of the law”",
          "talmudLocation": "Sotah 39a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/39a#section-2",
          "talmudFullText": "§ <b>Rava bar Rav Huna says: Once a Torah scroll has been opened, it is prohibited to converse, even about a matter of <i>halakha</i>. As it is stated: </b> “And Ezra opened the book in the sight of all the people, for he was above all the people, <b>and when he opened it, all the people stood up”</b> (Nehemiah 8:5), <b>and standing</b> is referring to <b>nothing other</b> than <b>silence, as it is stated: “And shall I wait, because they do not speak, because they stand still, and answer no more? ”</b> (Job 32:16). <b>R' Zeira</b> said that <b>Rav Ḥisda said: </b> The prohibition against conversing is derived <b>from here: “And the ears of all the people were attentive to the book of the law”</b> (Nehemiah 8:3). They were not listening to any other voice."
        },
        {
          "verseLocation": "Nehemiah 8:3",
          "verseText": "“And he read there before the broad place that was before the Gate of the Water”",
          "talmudLocation": "Sotah 41a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/41a#section-1",
          "talmudFullText": "<b>“And he read there before the broad place that was before the Gate of the Water”</b> (Nehemiah 8:3). According to this opinion, the High Priest would read from the Torah in the Temple courtyard. <b>Rav Ḥisda says</b> in response: The <i>baraita</i> also means that the reading takes place <b>in the women’s courtyard. </b>"
        },
        {
          "verseLocation": "Nehemiah 8:3",
          "verseText": "“And he read from it before the wide road that was before the Gate of the Water”",
          "talmudLocation": "Yoma 69b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/69b#section-2",
          "talmudFullText": "§ The Talmud clarifies: <b>And where was</b> this statement <b>of Rav Ḥisda</b> originally <b>stated? </b> It was stated <b>in relation to the following: </b> The rabbis <b>raised an objection</b> based on that <b>which was taught</b> in a <i>baraita</i>: <b>Where did they read</b> the Torah scroll in fulfillment of the mitzva of assembly, in which the Torah is publicly read on the <i>Sukkot</i> following the Sabbatical Year? It was read <b>in the</b> Temple <b>courtyard. R' Eliezer ben Ya’akov says: </b> It is read <b>on the Temple Mount, as it is stated</b> concerning the public reading performed by Ezra: <b>“And he read from it before the wide road that was before the Gate of the Water”</b> (Nehemiah 8:3). <b>And Rav Ḥisda said: </b> The courtyard referred to by the first <i>tanna</i> is <b>the women’s courtyard. </b>"
        },
        {
          "verseLocation": "Nehemiah 8:4",
          "verseText": "who stood to his left, as it is stated: “And Ezra the Scribe stood upon a platform of wood, which they had made for the purpose, and beside him stood Mattithiah, and Shema, and Anaiah, and Uriah, and Hilkiah, and Maaseiah, on his right hand, and on his left hand, Pedaiah, and Mishael, and Malchiah, and Hashum, and Hashbadanah, Zechariah, Meshullam”",
          "talmudLocation": "Megillah 23a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/23a#section-9",
          "talmudFullText": "<b>Ya’akov of Mina said to Rav Yehuda: Corresponding to whom were these six</b> readers <b>on Yom Kippur</b> instituted? Rav Yehuda <b>said to him: </b> The number six <b>corresponds to the six</b> people <b>who stood to Ezra’s right and the six</b> people <b>who stood to his left, as it is stated: “And Ezra the Scribe stood upon a platform of wood, which they had made for the purpose, and beside him stood Mattithiah, and Shema, and Anaiah, and Uriah, and Hilkiah, and Maaseiah, on his right hand, and on his left hand, Pedaiah, and Mishael, and Malchiah, and Hashum, and Hashbadanah, Zechariah, Meshullam”</b> (Nehemiah 8:4)."
        },
        {
          "verseLocation": "Nehemiah 8:5",
          "verseText": "and when he opened it, all the people stood up”",
          "talmudLocation": "Sotah 39a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/39a#section-2",
          "talmudFullText": "§ <b>Rava bar Rav Huna says: Once a Torah scroll has been opened, it is prohibited to converse, even about a matter of <i>halakha</i>. As it is stated: </b> “And Ezra opened the book in the sight of all the people, for he was above all the people, <b>and when he opened it, all the people stood up”</b> (Nehemiah 8:5), <b>and standing</b> is referring to <b>nothing other</b> than <b>silence, as it is stated: “And shall I wait, because they do not speak, because they stand still, and answer no more? ”</b> (Job 32:16). <b>R' Zeira</b> said that <b>Rav Ḥisda said: </b> The prohibition against conversing is derived <b>from here: “And the ears of all the people were attentive to the book of the law”</b> (Nehemiah 8:3). They were not listening to any other voice."
        },
        {
          "verseLocation": "Nehemiah 8:6",
          "verseText": "“And Ezra blessed the Lord, the great God”",
          "talmudLocation": "Yoma 69b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/69b#section-3",
          "talmudFullText": "Apropos the verse in Nehemiah, the Talmud interprets an adjacent verse homiletically. It is stated: <b>“And Ezra blessed YHWH, the great God”</b> (Nehemiah 8:6). The Talmud asks: <b>What is</b> the meaning of <b>“great”</b> here? <b>Rav Yosef said</b> that <b>Rav said: </b> It means <b>that he ascribed greatness to Him by</b> enunciating God’s <b>explicit name. Rav Giddel said: </b> He established that one should say at the conclusion of every blessing: <b>“Blessed be YHWH, God of Israel, from eternity to eternity”</b> (I Chronicles 16:36)."
        },
        {
          "verseLocation": "Nehemiah 8:8",
          "verseText": "“And they read in the book, the Torah of God, distinctly; and they gave the sense, and they caused them to understand the reading”",
          "talmudLocation": "Megillah 3a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/3a#section-7",
          "talmudFullText": "The Talmud asks: <b>Was the translation of the Torah</b> really <b>composed by Onkelos the convert? Didn’t Rav Ika bar Avin say</b> that <b>Rav Ḥananel said</b> that <b>Rav said: What is</b> the meaning of that <b>which is written</b> with respect to the days of Ezra: <b>“And they read in the book, the Torah of God, distinctly; and they gave the sense, and they caused them to understand the reading”</b> (Nehemiah 8:8)? The verse should be understood as follows: <b>“And they read in the book, the Torah of God, ” this is the</b> scriptural <b>text; “distinctly, ” this is the translation, </b> indicating that they immediately translated the text into Aramaic, as was customary during public Torah readings."
        },
        {
          "verseLocation": "Nehemiah 8:8",
          "verseText": "which is written: “And they read in the book, in the Torah of God, distinctly; and they gave the sense, and caused them to understand the reading”",
          "talmudLocation": "Nedarim 37b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/37b#section-5",
          "talmudFullText": "This is <b>as Rav Ika bar Avin said</b> that <b>Rav Ḥananel said</b> that <b>Rav said: What is</b> the meaning of that <b>which is written: “And they read in the book, in the Torah of God, distinctly; and they gave the sense, and caused them to understand the reading”</b> (Nehemiah 8:8)? The Talmud explains: <b>“They read in the book, in the Torah of God”; that is the Bible. “Distinctly”; that is</b> the Aramaic <b>translation. “And they gave the sense”; these are the</b> division into <b>verses. “And caused them to understand the reading”; this is punctuation</b> of the text with <b>cantillation notes, </b> which facilitate the understanding of the verses. <b>And some say: These are the traditions</b> that determine the proper vocalization of the Bible. Rav holds that the cantillation notes are an integral part of Torah study."
        },
        {
          "verseLocation": "Nehemiah 8:10",
          "verseText": "“Go your way, eat the fat and drink the sweet, and send portions to him for whom nothing is prepared, for this day is holy to our Lord; and do not be grieved, for the joy of the Lord is your strength”",
          "talmudLocation": "Beitzah 15b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/beitzah/15b#section-13",
          "talmudFullText": "<b>At the time of</b> the remaining students’ <b>departure</b> at the conclusion of R' Eliezer’s lecture, <b>he said to them</b> the verse: <b>“Go your way, eat the fat and drink the sweet, and send portions to him for whom nothing is prepared, for this day is holy to our Lord; and do not be grieved, for the joy of YHWH is your strength”</b> (Nehemiah 8:10)."
        },
        {
          "verseLocation": "Nehemiah 8:10",
          "verseText": "to him for whom nothing is prepared”",
          "talmudLocation": "Beitzah 15b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/beitzah/15b#section-17",
          "talmudFullText": "§ Since the <i>baraita</i> mentions the verse from Nehemiah, the Talmud poses the following question: <b>What is</b> the meaning of: “Send portions <b>to him for whom nothing is prepared”</b> (Nehemiah 8:10)? <b>Rav Ḥisda said: </b> Send to one who does not have food of his own prepared for Shabbat that follows the Festival because <b>he did not prepare a joining of cooked foods</b> and must therefore rely on others. <b>Some say</b> that he said the following: It is necessary to provide food for <b>one who did not have</b> an opportunity <b>to prepare a joining of cooked foods</b> on the eve of the Festival; <b>but one who had</b> an opportunity <b>to prepare a joining of cooked foods and did not prepare</b> one <b>is negligent, </b> and there is no obligation to care for him."
        },
        {
          "verseLocation": "Nehemiah 8:15",
          "verseText": "from here: “Go forth to the mount and fetch olive branches, and branches of wild olive, and myrtle branches, and palm branches, and the boughs of a dense-leaved tree",
          "talmudLocation": "Sukkah 12a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/12a#section-6",
          "talmudFullText": "<b>Rav Ḥisda said</b> that proof can be cited <b>from here: “Go forth to the mount and fetch olive branches, and branches of wild olive, and myrtle branches, and palm branches, and the boughs of a dense-leaved tree</b> in order to make <i>sukkot</i> as written” (Nehemiah 8:15). From this verse, the materials for <i>sukka</i> roofing can be derived."
        },
        {
          "verseLocation": "Nehemiah 8:15",
          "verseText": "it says: “Go forth unto the mount, and fetch olive branches, and pine branches, and myrtle branches, and palm branches, and branches of a dense-leaved tree, to make sukkot , as it is written”",
          "talmudLocation": "Sukkah 37a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/37a#section-1",
          "talmudFullText": "According to your reasoning, if <b>one did not find</b> any of the <b>four species</b> to roof his <i>sukka</i>, <b>he will sit idly</b> and fail to fulfill the mitzva of <i>sukka</i>; <b>and the Torah states: “You shall reside in <i>sukkot</i></b> for seven days” (Leviticus 23:42), meaning <b>a <i>sukka</i> of any material. Likewise, in</b> the book of <b>Ezra, </b> which can refer also to the book of Nehemiah, <b>it says: “Go forth unto the mount, and fetch olive branches, and pine branches, and myrtle branches, and palm branches, and branches of a dense-leaved tree, to make <i>sukkot</i>, as it is written”</b> (Nehemiah 8:15). Apparently, a <i>sukka</i> may be constructed even with materials other than the four species."
        },
        {
          "verseLocation": "Nehemiah 8:17",
          "verseText": "the children of Israel had not done so. And there was very great joy”",
          "talmudLocation": "Arakhin 32b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/32b#section-9",
          "talmudFullText": "§ The Talmud asks: <b>What is the reasoning of the one who says</b> that the <b>initial consecration</b> of Eretz Yisrael <b>consecrated</b> it <b>for its time, but did not consecrate</b> it <b>forever? As</b> it is taught in a <i>baraita</i>: <b>It is written</b> with regard to the return from Babylonia: <b>“And all the congregation of those that were coming back out of the captivity made <i>sukkot</i>, and dwelt in <i>sukkot</i>, for since the days of Joshua, son of Nun, </b> unto that day <b>the children of Israel had not done so. And there was very great joy”</b> (Nehemiah 8:17). Now, is it <b>possible</b> that King <b>David came and</b> the Jews in his time and all subsequent generations <b>did not make <i>sukkot</i>, until Ezra came? </b>"
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "Nehemiah 9:3",
          "verseText": "praying, as it is stated: “And they read in the book of the Torah of the Lord their God one quarter of the day, and a quarter of the day they confessed, and they prostrated themselves",
          "talmudLocation": "Megillah 30b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/30b#section-7",
          "talmudFullText": "The Talmud asks: <b>What does</b> the community <b>do</b> on a public fast day? <b>Abaye said: From the morning until the middle of the day, </b> the community gathers in the synagogue, and the leaders <b>examine the affairs of the town</b> to determine whether and how the people’s conduct needs to be improved. <b>From the middle of the day until the evening, a quarter of the day</b> is spent <b>reading</b> from the Torah <b>and reading the <i>haftara</i>, and a quarter of the day</b> is spent <b>praying, as it is stated: “And they read in the book of the Torah of YHWH their God one quarter of the day, and a quarter of the day they confessed, and they prostrated themselves</b> before YHWH their God” (Nehemiah 9:3)."
        },
        {
          "verseLocation": "Nehemiah 9:3",
          "verseText": "for mercy, as it is stated: “And they stood up in their place and they read in the book of the Torah of the Lord their God a fourth part of the day; and another fourth part they confessed, and prostrated themselves before the Lord their God”",
          "talmudLocation": "Taanit 12b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/12b#section-14",
          "talmudFullText": "The Talmud asks: <b>How do they act</b> on a fast day? <b>Abaye said: From the morning until the middle of the day they examine the affairs of the town</b> by checking if there are any deficiencies or corruptions in the city, moral or otherwise, and attempt to fix them, as these problems may have been the cause of the Divine punishment. <b>From this</b> point <b>forward, </b> for <b>a quarter of the day they read</b> a portion <b>from the Torah and</b> a portion from <b>the Prophets</b> [<i>haftara</i>]. <b>From this</b> point <b>forward, they pray</b> and petition <b>for mercy, as it is stated: “And they stood up in their place and they read in the book of the Torah of YHWH their God a 4th part of the day; and another 4th part they confessed, and prostrated themselves before YHWH their God”</b> (Nehemiah 9:3)."
        },
        {
          "verseLocation": "Nehemiah 9:4",
          "verseText": "“And they cried in a loud voice to the Lord their God”",
          "talmudLocation": "Sanhedrin 64a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/64a#section-3",
          "talmudFullText": "The Talmud suggests: <b>Come</b> and <b>hear</b> another proof, from the verse: <b>“And they cried in a loud voice to YHWH their God”</b> (Nehemiah 9:4). <b>What did they say</b> in that prayer? <b>Rav Yehuda says, and some say</b> it is <b>Rav Yonatan</b> who says: <b>Woe, woe [<i>baya</i>, <i>baya</i>], this</b> evil inclination for idol worship <b>is what destroyed the Temple, and burned the Sanctuary, and murdered the righteous ones, and caused the Jewish people to be exiled from their land. And it still dances among us, </b> i.e., it still affects us. <b>Didn’t You give it to us solely for</b> the purpose of our <b>receiving reward</b> for overcoming it? <b>We do not want it, nor do we not want its reward. </b> Evidently, the Jewish people were drawn to idol worship itself, and they did not worship idols only in order to engage in forbidden sexual sex. The Talmud answers: This also occurred <b>after</b> the Jewish people <b>became attached to</b> idol worship."
        },
        {
          "verseLocation": "Nehemiah 9:4",
          "verseText": "God",
          "talmudLocation": "Yoma 69b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/69b#section-6",
          "talmudFullText": "The Talmud recounts the event described in the verses: The verse states: <b>And they cried with a loud voice to YHWH</b> their <b>God</b> (Nehemiah 9:4). <b>What was said? Rav said, and some say</b> it was <b>R' Yoḥanan</b> who said: <b>Woe, woe. It is this, </b> i.e., the evil inclination for idol worship, <b>that destroyed the Temple, and burned its Sanctuary, and murdered all the righteous ones, and caused the Jewish people to be exiled from their land. And it still dances among us, </b> i.e., it still affects us. <b>Didn’t You give it to us solely for the purpose of</b> our <b>receiving reward</b> for overcoming it? <b>We do not want it, and we do not want its reward. </b> We are prepared to forgo the potential rewards for overcoming the evil inclination as long as it departs from us."
        },
        {
          "verseLocation": "Nehemiah 9:5",
          "verseText": "are included",
          "talmudLocation": "Berakhot 53b:29",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/53b#section-29",
          "talmudFullText": "The Talmud responds: This is subject to <b>a tannaitic dispute, as it was taught</b> in a <i>baraita</i>: <b>Both the one who recites a blessing and the one who answers</b> amen <b>are included</b> among those who “stand up and bless” (Nehemiah 9:5), but <b>they hurry to</b> reward, i.e., <b>the one who recites the blessing, more than</b> they hurry to reward, i.e., <b>the one who answers amen. </b>"
        },
        {
          "verseLocation": "Nehemiah 9:5",
          "verseText": "that one does not answer amen in the Temple? As it is stated: “Stand up and bless the Lord, your God, from everlasting to everlasting”",
          "talmudLocation": "Berakhot 63a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/63a#section-4",
          "talmudFullText": "The Talmud explains: <b>Why</b> were they insistent upon this formula <b>to that extent? Because one does not answer amen in the Temple. </b> Because there is a unique response to the blessings in the Temple, a unique formula for their conclusion was instituted. <b>From where</b> is it derived <b>that one does not answer amen in the Temple? As it is stated: “Stand up and bless YHWH, your God, from everlasting to everlasting”</b> (Nehemiah 9:5), which refers to the conclusion. <b>The verse</b> in Nehemiah <b>continues: “And let them say: Blessed be Your glorious name, that is exalted above all blessing and praise”</b> (Nehemiah 9:5). The response is exalted above other blessings."
        },
        {
          "verseLocation": "Nehemiah 9:5",
          "verseText": "Both the one who recites a blessing and the one who answers amen are included",
          "talmudLocation": "Nazir 66b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/66b#section-3",
          "talmudFullText": "The Talmud responds: This <b>is</b> a dispute between <b><i>tanna’im</i>, as it is taught</b> in a <i>baraita</i>: <b>Both the one who recites a blessing and the one who answers amen are included</b> among those who “stand up and bless” (Nehemiah 9:5), <b>but one hurries to first</b> reward <b>the one who recites the blessing. </b> This <i>baraita</i> apparently holds that reciting the blessing is greater than answering amen."
        },
        {
          "verseLocation": "Nehemiah 9:5",
          "verseText": "that one does not answer amen in the Temple? As it is stated: “Stand up and bless the Lord, your God, from everlasting to everlasting”",
          "talmudLocation": "Sotah 40b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/40b#section-2",
          "talmudFullText": "<b>A baraita states: From where</b> is it derived <b>that one does not answer amen in the Temple? As it is stated: “Stand up and bless YHWH, your God, from everlasting to everlasting”</b> (Nehemiah 9:5). This blessing is recited instead of amen in the Temple. <b>And from where</b> is it derived <b>that for each and every blessing</b> in the Temple the people respond with these words of <b>praise? As it is stated: “And let them say: Blessed be Your glorious name, which is exalted above all blessing and praise”</b> (Nehemiah 9:5). This verse indicates that <b>for each and every blessing, </b> you should <b>give Him praise. </b> However, those present do not respond amen."
        },
        {
          "verseLocation": "Nehemiah 9:5",
          "verseText": "that one does not answer amen in the Temple? As it is stated: “Stand up and bless the Lord, your God, from everlasting to everlasting, and let them say: Blessed be Your glorious Name, that is exalted above all blessing and praise”",
          "talmudLocation": "Taanit 16b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/16b#section-12",
          "talmudFullText": "<b>However, in the Temple they would recite: Blessed be YHWH, God of Israel, from everlasting to everlasting. Blessed</b> are You, Lord, <b>Redeemer of Israel, and they would not answer amen after him. And why</b> did the practice differ <b>so much? Because one does not answer amen in the Temple. And from where</b> is it derived <b>that one does not answer amen in the Temple? As it is stated: “Stand up and bless YHWH, your God, from everlasting to everlasting, and let them say: Blessed be Your glorious Name, that is exalted above all blessing and praise”</b> (Nehemiah 9:5). As stated above, this verse indicates that <b>for every blessing, </b> you should <b>give it</b> its own <b>praise. </b>"
        },
        {
          "verseLocation": "Nehemiah 9:5",
          "verseText": "As it is stated: “Stand up and bless the Lord, your God, from everlasting to everlasting, and let them say: Blessed be Your glorious name, that is exalted above all blessing and praise”",
          "talmudLocation": "Taanit 16b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/16b#section-7",
          "talmudFullText": "The Talmud answers: <b>As it is stated: “Stand up and bless YHWH, your God, from everlasting to everlasting, and let them say: Blessed be Your glorious name, that is exalted above all blessing and praise”</b> (Nehemiah 9:5). One <b>might</b> have thought that <b>for all blessings there should be only one praise, </b> i.e., all blessings are answered with amen. Therefore, <b>the verse states: “That is exalted above all [<i>al kol</i>] blessing and praise, ”</b> which indicates that <b>for every [<i>al kol</i>] blessing, </b> you should <b>give it</b> its own <b>praise. </b>"
        },
        {
          "verseLocation": "Nehemiah 9:6",
          "verseText": "the place of prayer, as it is written: “And the hosts of heaven bow down to You”",
          "talmudLocation": "Bava Batra 25a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/25a#section-6",
          "talmudFullText": "<b>Rather, what</b> is the meaning of <b>frequent? </b> It means <b>frequent with the Shekhina, </b> i.e., the Shekhina is found on the western side, and therefore it is inappropriate to set up a tannery there with its foul odors. <b>As R' Yehoshua ben Levi says: Come and let us be grateful to our ancestors who revealed</b> to us <b>the place of prayer, as it is written: “And the hosts of heaven bow down to You”</b> (Nehemiah 9:6). Since the celestial bodies move from east to west, they bow in that direction, which indicates that the Shekhina is in the west."
        },
        {
          "verseLocation": "Nehemiah 9:6",
          "verseText": "which is written: “You are the Lord, even You alone, You have made heaven…",
          "talmudLocation": "Bava Batra 25a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/25a#section-8",
          "talmudFullText": "The Talmud comments: <b>And R' Oshaya holds</b> that <b>the Shekhina</b> is found <b>in every place, as R' Oshaya says: What</b> is the meaning of that <b>which is written: “You are YHWH, even You alone, You have made heaven…</b>You preserve them all alive and the hosts of heaven bow down to You” (Nehemiah 9:6)? This indicates that <b>Your messengers are not like the messengers of flesh and blood. The messengers of flesh and blood return to the place from where they were sent</b> to report on <b>their mission. But Your messengers return</b> and report on <b>their mission from the</b> very same <b>place</b> to <b>which they are sent, as it is stated “Can you send forth lightnings, that they may go out and say to you: Here we are? ”</b> (Job 38:35). The verse <b>does not state: They will come and say, </b> i.e., they do not return to their point of departure, <b>but: “They may go out and say, ”</b> which <b>teaches that the Shekhina</b> is found <b>in every place. </b>"
        },
        {
          "verseLocation": "Nehemiah 9:6",
          "verseText": "in order to greet its Creator, as it is stated: “And the hosts of heaven worship You”",
          "talmudLocation": "Sanhedrin 91b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/91b#section-5",
          "talmudFullText": "R' Yehuda HaNasi <b>said to him: </b> The sun always sets in the west <b>in order to greet its Creator, as it is stated: “And the hosts of heaven worship You”</b> (Nehemiah 9:6). Setting is a form of worship; it is as though the sun is bowing to God. The Shekhina rests in the west, as is evident from the fact that the Holy of Holies in the Temple, in which the Ark, the resting place of the Shekhina, is located in the west. Antoninos <b>said to him: </b> If so, <b>let</b> the sun <b>come until the midpoint of the sky, </b> set slightly <b>and greet</b> its Creator, and return <b>and enter</b> its place of origin in the east and set there. R' Yehuda HaNasi answered him: The sun sets in the west <b>due to workers and due to travelers, </b> as, if the sun did not proceed from east to west with the light of day gradually waning, they would not know that it is time to return home or to find an inn."
        },
        {
          "verseLocation": "Nehemiah 9:7",
          "verseText": "“You are the Lord, God, Who chose Abram",
          "talmudLocation": "Berakhot 13a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/13a#section-13",
          "talmudFullText": "<b>R' Yosei bar Avin, and some say R' Yosei bar Zevida, raised an objection</b> to the statements of bar Kappara and R' Eliezer based on what is said in the recounting of the history of the Jewish people: <b>“You are YHWH, God, Who chose Abram</b> and took him out of Ur Kasdim and made his name Abraham” (Nehemiah 9:7). Here the Bible refers to him as Abram."
        },
        {
          "verseLocation": "Nehemiah 9:32",
          "verseText": "“The great, the mighty, and the awesome God”",
          "talmudLocation": "Yoma 69b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/69b#section-13",
          "talmudFullText": "The Talmud returns to its discussion of the verse in Nehemiah cited above: <b>In the West, </b> i.e., Eretz Yisrael, <b>they taught</b> the debate concerning the verse “YHWH, the great God” <b>as follows: Rav Giddel said: “Great”</b> means <b>that he ascribed greatness to Him by</b> enunciating God’s <b>explicit name. And Rav Mattana said: </b> They reinserted the following appellations of God into their prayers: <b>“The great, the mighty, and the awesome God”</b> (Nehemiah 9:32)."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "Nehemiah 10:33",
          "verseText": "as it is stated: “And we also established mitzvot upon ourselves, to charge ourselves yearly with the third part of a shekel for the service of the House of our God”",
          "talmudLocation": "Bava Batra 9a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/9a#section-12",
          "talmudFullText": "<b>Rav Asi says: A person should never prevent himself from giving</b> at least <b>one-3rd of a shekel a year</b> in charity, <b>as it is stated: “And we also established mitzvot upon ourselves, to charge ourselves yearly with the 3rd part of a shekel for the service of the House of our God”</b> (Nehemiah 10:33). <b>And Rav Asi says: Charity is equivalent to all the</b> other <b>mitzvot</b> combined, <b>as it is stated</b> in that verse: <b>“We also established mitzvot upon ourselves. ” A mitzva is not written here, but</b> rather <b>mitzvot, </b> in the plural, thereby teaching that this mitzva is equivalent to all the other mitzvot."
        },
        {
          "verseLocation": "Nehemiah 10:35",
          "verseText": "states: “And we cast lots for the wood offering”",
          "talmudLocation": "Menachot 106b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/106b#section-17",
          "talmudFullText": "<strong>Talmud: </strong> With regard to one who pledges to donate wood, <b>A baraita states</b> in a <i>baraita</i>: The verse states: “And when one brings a meal offering [<i>korban minḥa</i>]<b>”</b> (Leviticus 2:1). The superfluous word “<b><i>korban</i></b>” <b>teaches that one can voluntarily give wood</b> as an offering for the altar. <b>And how much</b> wood must one bring if he does not specify an amount? <b>Two logs. And</b> the support for the fact that wood can be brought as a voluntary offering is <b>as</b> the verse <b>states: “And we cast lots for the wood offering”</b> (Nehemiah 10:35). <b>R'</b> Yehuda HaNasi <b>says: </b> This voluntary donation of <b>wood is an offering</b> like a meal offering, <b>and</b> therefore it <b>requires salt and requires bringing</b> to the corner of the altar, like a meal offering."
        },
        {
          "verseLocation": "Nehemiah 10:35",
          "verseText": "states: “And we cast lots for the wood offering”",
          "talmudLocation": "Menachot 20b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/20b#section-3",
          "talmudFullText": "This is <b>as it is taught</b> in a <i>baraita</i>: The verse states: “And when one brings <b>a meal offering [<i>korban minḥa</i>]”</b> (Leviticus 2:1). The superfluous word <i>korban</i> <b>teaches that one can voluntarily give wood</b> as an offering for the altar. <b>And how much</b> wood must one bring if he does not specify an amount? <b>Two logs. And</b> the support for the fact that wood can be brought as a voluntary offering is from a verse, <b>as</b> the verse <b>states: “And we cast lots for the wood offering”</b> (Nehemiah 10:35). <b>R'</b> Yehuda HaNasi <b>says: </b> This voluntary donation of <b>wood is</b> an offering like <b>a meal offering, and</b> therefore it <b>requires salt and requires bringing</b> to the corner of the altar, like a meal offering."
        },
        {
          "verseLocation": "Nehemiah 10:35",
          "verseText": "as it is stated: “And we cast lots, the priests, the Levites and the people, for the wood offering, to bring it into the house of our God, according to our fathers’ houses, at appointed times year by year, to burn upon the altar of the Lord our God, as it is written in the Torah”",
          "talmudLocation": "Taanit 28a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/28a#section-6",
          "talmudFullText": "<b>And the prophets among them stipulated as follows, that even</b> if the entire <b>chamber</b> were <b>full of wood, </b> the descendants of <b>these</b> families <b>would donate wood from their own</b> property on these specific days, <b>as it is stated: “And we cast lots, the priests, the Levites and the people, for the wood offering, to bring it into the house of our God, according to our fathers’ houses, at appointed times year by year, to burn upon the altar of YHWH our God, as it is written in the Torah”</b> (Nehemiah 10:35). Although these donations were not always necessary, it was established that all generations would observe these days."
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "Nehemiah 11:2",
          "verseText": "that dwelling in cities is difficult? As it is stated: “And the people blessed all the men who willingly offered themselves to dwell in Jerusalem”",
          "talmudLocation": "Ketubot 110b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/110b#section-4",
          "talmudFullText": "The Talmud answers: <b>This supports</b> the opinion of <b>R' Yosei bar Ḥanina, as R' Yosei bar Ḥanina said: From where</b> is it derived <b>that dwelling in cities is difficult? As it is stated: “And the people blessed all the men who willingly offered themselves to dwell in Jerusalem”</b> (Nehemiah 11:2). This shows that living in a city is difficult, due to the noise and the general hubbub of an urban area."
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "Nehemiah 12:31",
          "verseText": "“And I placed two large thanks-offerings, and we went in procession to the right upon the wall”",
          "talmudLocation": "Shevuot 15a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/15a#section-6",
          "talmudFullText": "§ The Mishnah teaches: <b>And with two thanks-offerings. </b> A <i>tanna</i> <b>taught</b> in a <i>baraita</i>: <b>And</b> with regard to the <b>two thanks-offerings that are mentioned</b> here, the reference is <b>to their loaves, but not to their flesh. </b> An animal thanks-offering is accompanied by forty loaves of bread that are brought as a meal-offering. Ten loaves are leavened, and the remainder is comprised of ten each of three types of unleavened bread. The Talmud asks: <b>From where are these matters</b> derived? <b>Rav Ḥisda said: As the verse states</b> with regard to the consecration of the wall of Jerusalem in the days of Ezra: <b>“And I placed two large thanks-offerings, and we went in procession to the right upon the wall”</b> (Nehemiah 12:31)."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "Nehemiah 13:15",
          "verseText": "as it is written: “In those days I saw in Judea some treading winepresses on Shabbat and bringing in heaps",
          "talmudLocation": "Shabbat 123b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/123b#section-13",
          "talmudFullText": "<b>R' Ḥanina said: This Mishnah was taught in the days of Nehemiah, son of Hacaliah, </b> a period when many stringent decrees were issued with regard to Shabbat prohibitions, <b>as it is written: “In those days I saw in Judea some treading winepresses on Shabbat and bringing in heaps</b> of grain and lading donkeys with them; as also wine, grapes, figs, and all manner of burdens which are brought into Jerusalem on the Shabbat day. I forewarned them on that day when they sold food” (Nehemiah 13:15). Since the people treated the sanctity of Shabbat with disdain, Nehemiah instituted many stringencies with regard to all the <i>halakhot</i> of Shabbat in order to educate the people to observe Shabbat."
        },
        {
          "verseLocation": "Nehemiah 13:25",
          "verseText": "As it is written: “And I contended with them, and cursed them, and beat some of them, and pulled out their hair, and made them take oath",
          "talmudLocation": "Moed Katan 16a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16a#section-10",
          "talmudFullText": "<b>And from where do we</b> derive <b>that we may contend with</b> such a person, <b>and curse</b> him, <b>and beat</b> him, <b>and pull out</b> his <b>hair, and make</b> him <b>take an oath</b> in order to prevent him from sinning? <b>As it is written: “And I contended with them, and cursed them, and beat some of them, and pulled out their hair, and made them take oath</b> by God” (Nehemiah 13:25)."
        },
        {
          "verseLocation": "Nehemiah 13:31",
          "verseText": "as it is stated: “Remember me, God, for good”",
          "talmudLocation": "Sanhedrin 93b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93b#section-16",
          "talmudFullText": "§ Apropos books of the Bible named for a prominent person, the Talmud asks: <b>Now</b> with regard to <b>all the matters of</b> the book of <b>Ezra, Nehemiah, son of Hacaliah, said them</b> and wrote most of them; <b>and</b> with regard to <b>Nehemiah, son of Hacaliah, what is the reason</b> that <b>a book was not called by his name? </b> Over the course of many generations, extending many years after the talmudic period, the book that is today named for Nehemiah was not a separate book and was included in the book of Ezra. <b>R' Yirmeya bar Abba says: </b> The book was not named for Nehemiah <b>because he took credit for himself</b> and boasted about his good deeds, <b>as it is stated: “Remember me, God, for good”</b> (Nehemiah 13:31). The Talmud asks: Is that a shortcoming? King <b>David also said: “Remember me, Lord, when You show favor to Your people; visit me with Your salvation”</b> (Psalms 106:4). The Talmud answers: <b>David was asking for compassion</b> and formulated his words as a prayer. Nehemiah stated them as a fact and a demand."
        }
      ]
    }
  ]
}