{
  "bookName": "Zechariah",
  "totalEntries": 79,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Zechariah 1:5",
          "verseText": "as it is stated: “Your fathers, where are they, and the prophets; do they live forever?”",
          "talmudLocation": "Sanhedrin 105a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105a#section-2",
          "talmudFullText": "§ With regard to the verse: <b>“Why is this people of Jerusalem slid back in perpetual backsliding? ”</b> (Jeremiah 8:5), <b>Rav says: The congregation of Israel answered</b> with <b>a convincing response to the prophet. The prophet said to the Jewish people: Repent, </b> as <b>your ancestors sinned, </b> and <b>where are they? They said</b> to the prophets: <b>And your prophets who did not sin, where are they? </b> They too died, <b>as it is stated: “Your fathers, where are they, and the prophets; do they live forever? ”</b> (Zechariah 1:5). The prophet <b>said to</b> the Jewish people: <b>Your ancestors reconsidered and conceded</b> that the admonitions of the prophets were fulfilled, <b>as it is stated: “By my words and My statutes, which I commanded My servants the prophets, </b> did they not overtake your fathers? And they repented and said: As YHWH of hosts intended to do to us, according to our ways, and according to our doings, so has He dealt with us” (Zechariah 1:6)."
        },
        {
          "verseLocation": "Zechariah 1:6",
          "verseText": "as it is stated: “By my words and My statutes, which I commanded My servants the prophets,",
          "talmudLocation": "Sanhedrin 105a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105a#section-2",
          "talmudFullText": "§ With regard to the verse: <b>“Why is this people of Jerusalem slid back in perpetual backsliding? ”</b> (Jeremiah 8:5), <b>Rav says: The congregation of Israel answered</b> with <b>a convincing response to the prophet. The prophet said to the Jewish people: Repent, </b> as <b>your ancestors sinned, </b> and <b>where are they? They said</b> to the prophets: <b>And your prophets who did not sin, where are they? </b> They too died, <b>as it is stated: “Your fathers, where are they, and the prophets; do they live forever? ”</b> (Zechariah 1:5). The prophet <b>said to</b> the Jewish people: <b>Your ancestors reconsidered and conceded</b> that the admonitions of the prophets were fulfilled, <b>as it is stated: “By my words and My statutes, which I commanded My servants the prophets, </b> did they not overtake your fathers? And they repented and said: As YHWH of hosts intended to do to us, according to our ways, and according to our doings, so has He dealt with us” (Zechariah 1:6)."
        },
        {
          "verseLocation": "Zechariah 1:7",
          "verseText": "“On the twenty-fourth day of the eleventh month, which is the month of Shevat”",
          "talmudLocation": "Rosh Hashanah 7a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/7a#section-8",
          "talmudFullText": "<b>Rather, Ravina said: This matter we did not learn from the Torah of Moses, our teacher; </b> rather, <b>we learned it from the texts of the tradition, </b> i.e., the Prophets and Writings: <b>“On the twenty-4th day of the eleventh month, which is the month of Shevat”</b> (Zechariah 1:7). If Shevat is the eleventh month, Nisan must be the first month. <b>Rabba bar Ulla said: </b> It is derived <b>from here, </b> as it is stated: <b>“So Esther was taken to the king Ahasuerus into his royal house in the 10th month, which is the month of Tevet”</b> (Esther 2:16)."
        },
        {
          "verseLocation": "Zechariah 1:8",
          "verseText": "was she called Hadassah? On account of the righteous, who are called myrtles [ hadassim ], and so it states: “And he stood among the myrtles [ hahadassim ]”",
          "talmudLocation": "Megillah 13a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-10",
          "talmudFullText": "The verse states: <b>“And he had brought up Hadassah, </b> that is, Esther” (Esther 2:7). <b>She is referred to as “Hadassah” and she is referred to as “Esther. ”</b> What was her real name? <b>It is taught</b> in a <i>baraita</i> that the rabbis differed in their opinion as to which was in fact her name and which one was a description: <b>R' Meir says: Esther was her</b> real <b>name. Why</b> then <b>was she called Hadassah? On account of the righteous, who are called myrtles [<i>hadassim</i>], and so it states: “And he stood among the myrtles [<i>hahadassim</i>]”</b> (Zechariah 1:8)."
        },
        {
          "verseLocation": "Zechariah 1:8",
          "verseText": "which is written: “I saw the night, and behold, a man riding upon a red horse, and he stood among the myrtle bushes that were in the depths”",
          "talmudLocation": "Sanhedrin 93a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93a#section-4",
          "talmudFullText": "<b>R' Yoḥanan says: What</b> is the meaning of that <b>which is written: “I saw the night, and behold, a man riding upon a red horse, and he stood among the myrtle bushes that were in the depths”</b> (Zechariah 1:8)? <b>What</b> is the meaning of the phrase <b>“I saw the night”? God sought to transform the entire world into night</b> and destroy it, as there were no righteous people. <b>“And behold, a man riding”; </b> the word <b>“man”</b> is referring to <b>no</b> one <b>but God as it is stated: “YHWH is a man of war, YHWH is His name”</b> (Exodus 15:3). <b>“Upon a red horse”</b> alludes to the fact that <b>God sought to transform the whole world into blood. </b>"
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Zechariah 2:3",
          "verseText": "“The Lord then showed me four craftsmen”",
          "talmudLocation": "Sukkah 52b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52b#section-11",
          "talmudFullText": "§ Apropos the end of days, the Talmud cites another verse and interprets it homiletically. It is stated: <b>“YHWH then showed me four craftsmen”</b> (Zechariah 2:3). <b>Who are these four craftsmen? Rav Ḥana bar Bizna said</b> that <b>R' Shimon Ḥasida said: </b> They are <b>Messiah ben David, Messiah ben Yosef, Elijah, and the righteous</b> High <b>Priest, </b> who will serve in the Messianic era. <b>Rav Sheshet raised an objection: If so, </b> if that is the identity of the four craftsmen, then <b>that which is written</b> in the previous verse: <b>“And he said to me: These are the horns that scattered Judea”</b> (Zechariah 2:4), is difficult; <b>these</b> four in the first verse <b>are coming for their enemies, </b> and are not redeemers."
        },
        {
          "verseLocation": "Zechariah 2:4",
          "verseText": "“And he said to me: These are the horns that scattered Judea”",
          "talmudLocation": "Sukkah 52b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52b#section-11",
          "talmudFullText": "§ Apropos the end of days, the Talmud cites another verse and interprets it homiletically. It is stated: <b>“YHWH then showed me four craftsmen”</b> (Zechariah 2:3). <b>Who are these four craftsmen? Rav Ḥana bar Bizna said</b> that <b>R' Shimon Ḥasida said: </b> They are <b>Messiah ben David, Messiah ben Yosef, Elijah, and the righteous</b> High <b>Priest, </b> who will serve in the Messianic era. <b>Rav Sheshet raised an objection: If so, </b> if that is the identity of the four craftsmen, then <b>that which is written</b> in the previous verse: <b>“And he said to me: These are the horns that scattered Judea”</b> (Zechariah 2:4), is difficult; <b>these</b> four in the first verse <b>are coming for their enemies, </b> and are not redeemers."
        },
        {
          "verseLocation": "Zechariah 2:5",
          "verseText": "with a measuring rope in his hand”",
          "talmudLocation": "Eruvin 58a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/58a#section-8",
          "talmudFullText": "<b>It was taught</b> in a <i>baraita</i> that <b>R' Yehoshua ben Ḥananya said: You have nothing better for measuring than iron chains, </b> as they do not stretch. <b>But what shall we do, as the Torah states: </b> “I lifted up my eyes again and looked, and behold a man <b>with a measuring rope in his hand”</b> (Zechariah 2:5), from which it is derived that measurements must be made with a rope."
        },
        {
          "verseLocation": "Zechariah 2:7",
          "verseText": "in every place? As it is stated: “And behold the angel who spoke with me went forth, and another angel went out to meet him”",
          "talmudLocation": "Bava Batra 25a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/25a#section-9",
          "talmudFullText": "The Talmud comments: <b>And R' Yishmael, too, holds</b> that <b>the Shekhina</b> is <b>in every place, as</b> one of the rabbis of <b>the school of R' Yishmael taught: From where</b> is it derived <b>that the Shekhina</b> is <b>in every place? As it is stated: “And behold the angel who spoke with me went forth, and another angel went out to meet him”</b> (Zechariah 2:7). Although both angels were coming from the Shekhina, the verse <b>does not state: After him, but: “To meet him, ”</b> which <b>teaches that the Shekhina</b> is <b>in every place, </b> and therefore the angels depart for their missions from every place."
        },
        {
          "verseLocation": "Zechariah 2:9",
          "verseText": "will be for her a wall of fire round about; and I will be the glory in her midst”",
          "talmudLocation": "Bava Kamma 60b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/60b#section-14",
          "talmudFullText": "<b>I, </b> God, <b>kindled a fire in Zion, as it is stated: </b> “YHWH has accomplished His fury, He has poured out His fierce anger; <b>and He has kindled a fire in Zion, which has devoured its foundations”</b> (Lamentations 4:11). <b>And I will build it with fire</b> in the <b>future, as it is stated: “For I, </b> says YHWH, <b>will be for her a wall of fire round about; and I will be the glory in her midst”</b> (Zechariah 2:9)."
        },
        {
          "verseLocation": "Zechariah 2:10",
          "verseText": "all of them, as it is written: “For I have spread you abroad as the four winds of the heaven,",
          "talmudLocation": "Avodah Zarah 10b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/10b#section-13",
          "talmudFullText": "<b>Ketia, son of Shalom, said to them: </b> It is unwise to do so, for two reasons. <b>One</b> is <b>that you cannot</b> destroy <b>all of them, as it is written: “For I have spread you abroad as the four winds of the heaven, </b> says YHWH” (Zechariah 2:10). He clarified: <b>What is it saying? Shall we say that</b> the verse means that God has <b>scattered them to the four winds</b> of the world? If so, <b>this</b> phrase: <b>“As the four winds, ”</b> is inaccurate, since <b>it should have</b> said: <b>To the four winds. Rather, </b> this is what the verse is saying: <b>Just as the world cannot</b> exist <b>without winds, so too, the world cannot</b> exist <b>without the Jewish people, </b> and they will never be destroyed. <b>And furthermore, </b> if you attempt to carry out the destruction of the Jews, <b>they will call you the severed kingdom, </b> as the Roman Empire would be devoid of Jews, but Jews would exist in other locations."
        },
        {
          "verseLocation": "Zechariah 2:10",
          "verseText": "Rabbi Yehoshua ben Levi said that the verse states: “For I have spread you abroad as the four winds of the heaven, says the Lord”",
          "talmudLocation": "Taanit 3b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/3b#section-2",
          "talmudFullText": "The Talmud asks: <b>However, </b> with regard to <b>winds, from where do we</b> derive that <b>it is not withheld</b> but perpetually blows? <b>R' Yehoshua ben Levi said that the verse states: “For I have spread you abroad as the four winds of the heaven, says YHWH”</b> (Zechariah 2:10). He clarifies: <b>What is</b> God <b>saying to them? If we say</b> that <b>this is what God is saying to the Jewish people: I have scattered you to the four winds of the world; if so, </b> why did He say <b>“as the four</b> winds”? He <b>should have</b> said: <b>To the four</b> winds. <b>Rather, this is what</b> God <b>is saying: Just as the world cannot</b> exist <b>without winds, so too, the world cannot</b> exist <b>without the Jewish people. </b> This interpretation of the verse is based on the claim that the winds never cease."
        },
        {
          "verseLocation": "Zechariah 2:11",
          "verseText": "as though he is residing in Eretz Yisrael, as it is stated: “Ho Zion, escape, you who dwells with the daughter of Babylon”",
          "talmudLocation": "Ketubot 111a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/111a#section-15",
          "talmudFullText": "<b>Rav Yehuda said: </b> With regard to <b>anyone who resides in Babylon, </b> it is <b>as though he is residing in Eretz Yisrael, as it is stated: “Ho Zion, escape, you who dwells with the daughter of Babylon”</b> (Zechariah 2:11). This verse equates the two countries. <b>Abaye said: We have a tradition</b> that <b>Babylonia will not see the pangs of the Messiah, </b> i.e., it will be spared the suffering that will be prevalent at the time of his arrival. Abaye <b>interpreted</b> this statement in reference <b>to</b> the city of <b>Hutzal deVinyamin</b> in Babylonia, <b>and</b> as a result people <b>call it Karna deShizavta, </b> Horn of Salvation, as its residents will not endure the travails of the time of the Messiah."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Zechariah 3:1",
          "verseText": "Joshua the High Priest, his garments were singed, as it is stated: “And He showed me Joshua the High Priest, standing before the angel of the Lord,",
          "talmudLocation": "Sanhedrin 93a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93a#section-16",
          "talmudFullText": "<b>They took</b> the three of <b>them down</b> and <b>cast them</b> into the furnace. <b>They were burned, </b> and as for <b>Joshua the High Priest, his garments were singed, as it is stated: “And He showed me Joshua the High Priest, standing before the angel of YHWH, </b> and Satan was standing at his right to thwart him” (Zechariah 3:1). <b>And it is written: “And YHWH said to Satan, YHWH shall rebuke you, </b> Satan, YHWH Who has chosen Jerusalem shall rebuke you; is this man not a firebrand plucked from fire? ” (Zechariah 3:2). This is an allusion to the fact that he was delivered from the fiery furnace, although he was slightly singed."
        },
        {
          "verseLocation": "Zechariah 3:2",
          "verseText": "“And the Lord said to the Satan: The Lord rebukes you,",
          "talmudLocation": "Berakhot 51a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/51a#section-15",
          "talmudFullText": "The Talmud asks: <b>And if one encounters</b> women returning from a funeral, <b>what is his remedy? </b> The Talmud answers: <b>Let him jump four cubits from where he stands; if there is a river, let him cross it; if there is another path, let him go down it; if there is a wall, let him stand behind it; and if not, he should turn his face around and recite</b> the verse: <b>“And YHWH said to the Satan: YHWH rebukes you, </b> Satan, YHWH that has chosen Jerusalem rebukes you; is not this man a brand plucked from the fire? ” (Zechariah 3:2), <b>until they pass him. </b>"
        },
        {
          "verseLocation": "Zechariah 3:2",
          "verseText": "And it is written: “And the Lord said to Satan, the Lord shall rebuke you,",
          "talmudLocation": "Sanhedrin 93a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93a#section-16",
          "talmudFullText": "<b>They took</b> the three of <b>them down</b> and <b>cast them</b> into the furnace. <b>They were burned, </b> and as for <b>Joshua the High Priest, his garments were singed, as it is stated: “And He showed me Joshua the High Priest, standing before the angel of YHWH, </b> and Satan was standing at his right to thwart him” (Zechariah 3:1). <b>And it is written: “And YHWH said to Satan, YHWH shall rebuke you, </b> Satan, YHWH Who has chosen Jerusalem shall rebuke you; is this man not a firebrand plucked from fire? ” (Zechariah 3:2). This is an allusion to the fact that he was delivered from the fiery furnace, although he was slightly singed."
        },
        {
          "verseLocation": "Zechariah 3:3",
          "verseText": "priesthood, and he did not reprimand them, as it is stated: “And Joshua was clothed in filthy garments,",
          "talmudLocation": "Sanhedrin 93a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93a#section-18",
          "talmudFullText": "The Talmud asks: <b>What is the reason</b> that Joshua the High Priest <b>was punished</b> and was cast into the furnace? <b>Rav Pappa says: </b> It was due to the fact <b>that his sons would marry women who were not fit for</b> marriage into the <b>priesthood, and he did not reprimand them, as it is stated: “And Joshua was clothed in filthy garments, </b> and he stood before the angel” (Zechariah 3:3). <b>And was it the</b> typical <b>manner of Joshua to wear filthy garments? Rather</b> this verse <b>teaches</b> an allusion <b>that his sons would marry women who were not fit for</b> marriage into the <b>priesthood, and he did not reprimand them. </b> That is why he appeared with soiled garments in the vision of the prophet Zechariah."
        },
        {
          "verseLocation": "Zechariah 3:8",
          "verseText": "says: “Hear now, Joshua the High Priest, you and your colleagues",
          "talmudLocation": "Horayot 13a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/13a#section-12",
          "talmudFullText": "<b>A High Priest precedes a prophet, as it is stated: “And let Zadok the priest and Nathan the prophet anoint him there”</b> (I Kings 1:34); <b>Zadok</b> is written <b>before Natan. And</b> similarly, the prophet <b>says: “Hear now, Joshua the High Priest, you and your colleagues</b> who sit before you, for they are men that are a sign; for behold, I will bring forth My servant Zemah” (Zechariah 3:8). One <b>might</b> have thought that these colleagues <b>were laymen. </b> Therefore, <b>the verse states: “For they are men that are a sign, ” and “sign”</b> means <b>nothing other than a prophet, as it is stated: “And he gives you a sign or a wonder”</b> (Deuteronomy 13:2)."
        },
        {
          "verseLocation": "Zechariah 3:8",
          "verseText": "of the evil eye. Rabbi Yehoshua says: They drowned in the spittle. And the Rabbis say: They ascended to Eretz Yisrael and married women and fathered sons and daughters, as it is stated: “Hear now, Joshua the High Priest, you and your fellows who sit before you, for they are men of wonder”",
          "talmudLocation": "Sanhedrin 93a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93a#section-7",
          "talmudFullText": "The Talmud comments: This amoraic dispute is <b>parallel to</b> a dispute between <b><i>tanna’im</i>. R' Eliezer says: They died</b> as the result <b>of the evil eye. R' Yehoshua says: They drowned in the spittle. And the Rabbis say: They ascended to Eretz Yisrael and married women and fathered sons and daughters, as it is stated: “Hear now, Joshua the High Priest, you and your fellows who sit before you, for they are men of wonder”</b> (Zechariah 3:8). <b>Who are the people who had a wonder performed for them</b> in that generation? <b>You must say that</b> it is <b>Hananiah, Mishael, and Azariah. </b>"
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Zechariah 4:3",
          "verseText": "“And two olive trees by it,",
          "talmudLocation": "Sanhedrin 24a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/24a#section-13",
          "talmudFullText": "Similarly, it is stated: <b>“Then he said to me: These are the two anointed ones, that stand</b> by YHWH of the whole earth” (Zechariah 4:14), and it is stated: <b>“And two olive trees by it, </b> one upon the right side of the bowl, and the other upon its left side” (Zechariah 4:3). With regard to the expression <b>“anointed ones, ” R' Yitzḥak says: These are</b> the <b>Torah scholars in Eretz Yisrael, who are pleasant to each other in</b> discussions of <b><i>halakha</i> like olive oil, </b> which is not bitter. The verse <b>“and two olive trees by it”</b> should be interpreted as follows: <b>These are</b> the <b>Torah scholars in Babylonia, who are bitter to each other in</b> discussions of <b><i>halakha</i> like an olive. </b>"
        },
        {
          "verseLocation": "Zechariah 4:10",
          "verseText": "which is written: “For who plunders the day of small things”",
          "talmudLocation": "Sotah 48b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/48b#section-20",
          "talmudFullText": "<b>And this is what R' Elazar said: What is</b> the meaning of that <b>which is written: “For who plunders the day of small things”</b> (Zechariah 4:10)? <b>What caused the table, </b> i.e., the reward, <b>of the righteous to be plundered, </b> meaning wasted, <b>in the future? </b> It was <b>the</b> small-mindedness <b>they possessed. </b> And what is this small-mindedness? <b>That they did not believe in God, </b> with a complete faith. <b>Rava said: </b> Who plunders the day of small things? <b>These are the small children of the wicked ones of the Jewish people, </b> who die young,"
        },
        {
          "verseLocation": "Zechariah 4:14",
          "verseText": "“Then he said to me: These are the two anointed ones, that stand",
          "talmudLocation": "Sanhedrin 24a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/24a#section-13",
          "talmudFullText": "Similarly, it is stated: <b>“Then he said to me: These are the two anointed ones, that stand</b> by YHWH of the whole earth” (Zechariah 4:14), and it is stated: <b>“And two olive trees by it, </b> one upon the right side of the bowl, and the other upon its left side” (Zechariah 4:3). With regard to the expression <b>“anointed ones, ” R' Yitzḥak says: These are</b> the <b>Torah scholars in Eretz Yisrael, who are pleasant to each other in</b> discussions of <b><i>halakha</i> like olive oil, </b> which is not bitter. The verse <b>“and two olive trees by it”</b> should be interpreted as follows: <b>These are</b> the <b>Torah scholars in Babylonia, who are bitter to each other in</b> discussions of <b><i>halakha</i> like an olive. </b>"
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Zechariah 5:2",
          "verseText": "son of Iddo, came and explained it, as it is written: “And he said to me: What do you see? And I said: I see a flying [ afa ] scroll; the length of it is twenty cubits, and the breadth of it is ten cubits”",
          "talmudLocation": "Eruvin 21a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/21a#section-17",
          "talmudFullText": "But nonetheless, Ezekiel did not explain the extent of the Torah, <b>until Zechariah, </b> son of Berechiah, <b>son of Iddo, came and explained it, as it is written: “And he said to me: What do you see? And I said: I see a flying [<i>afa</i>] scroll; the length of it is twenty cubits, and the breadth of it is ten cubits”</b> (Zechariah 5:2). Since the scroll was flying, the implication is that it had two equal sides, <b>so that when you open it, it is twenty by twenty</b> cubits. <b>And it is written: “And it was written inside and outside, ”</b> i.e., on both sides. <b>And when you peel them apart</b> and separate the two sides, <b>how much is it? </b> Its entire area <b>amounts to forty by twenty</b> cubits, or eight hundred of God’s cubits."
        },
        {
          "verseLocation": "Zechariah 5:2",
          "verseText": "as it is written: “And He said to me: What do you see? And I said: I see a flying scroll”",
          "talmudLocation": "Gittin 60a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/60a#section-16",
          "talmudFullText": "The Talmud asks: <b>And</b> according to <b>the other</b> Sage, Reish Lakish, <b>as well, isn’t it written: “With the scroll of the book that is written for me, ”</b> indicating that the Torah was given scroll by scroll? How does he explain this verse? The Talmud answers: <b>That</b> verse teaches that <b>the entire Torah is called a scroll. </b> This is indicated in another verse as well, <b>as it is written: “And He said to me: What do you see? And I said: I see a flying scroll”</b> (Zechariah 5:2)."
        },
        {
          "verseLocation": "Zechariah 5:8",
          "verseText": "absorbs sound. As it is written: “And he said: This is the evil one. And he cast it down into the midst of the measure, and he cast a stone of lead upon its opening”",
          "talmudLocation": "Sanhedrin 64a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/64a#section-7",
          "talmudFullText": "<b>The prophet said to them: Throw it into a container</b> made <b>of lead and cover it with lead, as</b> lead <b>absorbs sound. As it is written: “And he said: This is the evil one. And he cast it down into the midst of the measure, and he cast a stone of lead upon its opening”</b> (Zechariah 5:8). They followed this advice and were freed of the evil inclination for idol worship."
        },
        {
          "verseLocation": "Zechariah 5:8",
          "verseText": "of lead and seal the opening with lead, since lead absorbs sound. As it is stated: “And he said: This is the evil one. And he cast it down into the midst of the measure, and he cast a stone of lead upon its opening”",
          "talmudLocation": "Yoma 69b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/69b#section-10",
          "talmudFullText": "<b>When they caught hold of it one of its hairs fell, and it let out a shriek</b> of pain <b>that was heard for four hundred parasangs. They said: What</b> should <b>we do</b> to kill it? <b>Perhaps, Heaven forfend, they will have mercy upon him from Heaven, </b> since it cries out so much. <b>The prophet said to them: Throw it into a container</b> made <b>of lead and seal the opening with lead, since lead absorbs sound. As it is stated: “And he said: This is the evil one. And he cast it down into the midst of the measure, and he cast a stone of lead upon its opening”</b> (Zechariah 5:8). They followed this advice and were freed of the evil inclination for idol worship."
        },
        {
          "verseLocation": "Zechariah 5:8",
          "verseText": "“And he said: This is the evil one”",
          "talmudLocation": "Yoma 69b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/69b#section-9",
          "talmudFullText": "In response to the indication of divine acceptance, <b>they observed a fast for three days and three nights, and He delivered</b> the evil inclination <b>to them. A form of a fiery lion cub came forth from the chamber of the Holy of Holies. </b> Zechariah <b>the prophet said to the Jewish people: This is the</b> evil <b>inclination for idol worship, as it is stated</b> in the verse that refers to this event: <b>“And he said: This is the evil one”</b> (Zechariah 5:8). The use of the word “this” indicates that the evil inclination was perceived in a physical form."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Zechariah 7:1",
          "verseText": "from here: “On the fourth day of the ninth month, in Kislev”",
          "talmudLocation": "Rosh Hashanah 7a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/7a#section-9",
          "talmudFullText": "<b>Rav Kahana said: </b> It is derived <b>from here: “On the 4th day of the 9th month, in Kislev”</b> (Zechariah 7:1). <b>Rav Aḥa bar Ya’akov said: </b> It is derived <b>from here, </b> as it is stated: <b>“And the scribes of the king were called at that time in the 3rd month, that is the month of Sivan”</b> (Esther 8:9). <b>Rav Ashi said: </b> It is derived <b>from here: “He cast <i>pur</i>, that is, the lot, before Haman from day to day, and from month to month, to the twelfth month, that is, the month of Adar”</b> (Esther 3:7). <b>And if you wish, say</b> that it is derived <b>from here: “In the first month, that is, the month of Nisan”</b> (Esther 3:7)."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "Zechariah 8:4",
          "verseText": "Zechariah it is written: “There shall yet be elderly men and elderly women sitting in the streets of Jerusalem”",
          "talmudLocation": "Makkot 24b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/24b#section-4",
          "talmudFullText": "<b>In</b> the prophecy of <b>Uriah it is written: “Therefore, for your sake Zion shall be plowed as a field, </b> and Jerusalem shall become rubble, and the Temple Mount as the high places of a forest” (Micah 3:12), where foxes are found. There is a rabbinic tradition that this was prophesied by Uriah. <b>In</b> the prophecy of <b>Zechariah it is written: “There shall yet be elderly men and elderly women sitting in the streets of Jerusalem”</b> (Zechariah 8:4). <b>Until the prophecy of Uriah</b> with regard to the destruction of the city <b>was fulfilled I was afraid that the prophecy of Zechariah would not be fulfilled, </b> as the two prophecies are linked. <b>Now that the prophecy of Uriah was fulfilled, it</b> is <b>evident that the prophecy of Zechariah</b> remains <b>valid. </b> The Talmud adds: The rabbis <b>said to him, </b> employing <b>this formulation: Akiva, you have comforted us; Akiva, you have comforted us. </b>"
        },
        {
          "verseLocation": "Zechariah 8:4",
          "verseText": "Rabbi Shmuel bar Naḥmani said that Rabbi Yonatan said: In the future the righteous will resurrect the dead, as it is stated: “Old men and old women shall yet again dwell in the streets of Jerusalem, and every man with his staff in his hand for very age”",
          "talmudLocation": "Pesachim 68a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/68a#section-14",
          "talmudFullText": "This idea is derived from a different source as well. <b>R' Shmuel bar Naḥmani said that R' Yonatan said: In the future the righteous will resurrect the dead, as it is stated: “Old men and old women shall yet again dwell in the streets of Jerusalem, and every man with his staff in his hand for very age”</b> (Zechariah 8:4). <b>And</b> the staff will then be used as it was used by Gehazi when Elisha sent him to bring the son of the Shunamite woman back to life, as <b>it is written: “And you shall lay my staff on the face of the child”</b> (II Kings 4:29)."
        },
        {
          "verseLocation": "Zechariah 8:6",
          "verseText": "“So says the Lord of hosts: If it be wondrous in the eyes of the remnant of this people in those days, it should also be wondrous in My eyes”",
          "talmudLocation": "Sukkah 52a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52a#section-4",
          "talmudFullText": "The Talmud answers: This can be understood <b>as R' Yehuda taught: In the future, </b> at the end of days, <b>God will bring the evil inclination and slaughter it in the presence of the righteous and in the presence of the wicked. </b> For <b>the righteous</b> the evil inclination <b>appears to them as a high mountain, and</b> for <b>the wicked</b> it <b>appears</b> to <b>them as</b> a mere <b>strand of hair. These weep and those weep. The righteous weep and say: How were we able to overcome so high a mountain? And the wicked weep and say: How were we unable to overcome this strand of hair? And even God will wonder with them, as it is stated</b> with regard to the eulogy: <b>“So says YHWH of hosts: If it be wondrous in the eyes of the remnant of this people in those days, it should also be wondrous in My eyes”</b> (Zechariah 8:6)."
        },
        {
          "verseLocation": "Zechariah 8:10",
          "verseText": "“Neither was there any peace to him that went out or came in",
          "talmudLocation": "Chagigah 10a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/10a#section-2",
          "talmudFullText": "Since the Talmud mentioned a Torah scholar who abandons the study of Torah, it cites a relevant verse: <b>“Neither was there any peace to him that went out or came in</b> due to the adversary” (Zechariah 8:10). <b>Rav said: Once a person leaves</b> the study <b>of <i>halakha</i>, </b> i.e., Mishnah and Talmud, even <b>for</b> the study <b>of the Torah</b> itself, <b>he will no longer have peace. </b> The verses of the Torah are often obscure and it is difficult to learn <i>halakha</i> directly from them without the aid of the interpretations of the Talmud."
        },
        {
          "verseLocation": "Zechariah 8:10",
          "verseText": "as well, as it is stated: “For before these days there was no hire for man, nor any hire for beast; nor was there peace from the oppressor to him who exits and to him who enters”",
          "talmudLocation": "Sanhedrin 98a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98a#section-3",
          "talmudFullText": "§ <b>And R' Abba says: You have no</b> more <b>explicit</b> manifestation of the <b>end</b> of days <b>than this</b> following phenomenon, <b>as it is stated: “But you, mountains of Israel, you shall give your branches, and yield your fruit to My people of Israel, </b> for they will soon be coming” (Ezekiel 36:8). When produce will grow in abundance in Eretz Yisrael, it is an indication that the Messiah will be coming soon. <b>R' Eliezer says: </b> You have no greater manifestation of the end of days <b>than this</b> following phenomenon <b>as well, as it is stated: “For before these days there was no hire for man, nor any hire for beast; nor was there peace from the oppressor to him who exits and to him who enters”</b> (Zechariah 8:10). When there are no wages for work and no rent paid for use of one’s animal, that is an indication that the coming of the Messiah is at hand."
        },
        {
          "verseLocation": "Zechariah 8:16",
          "verseText": "as it is stated: “Execute the judgment of truth and peace in your gates”",
          "talmudLocation": "Sanhedrin 6b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/6b#section-6",
          "talmudFullText": "<b>R' Yehoshua ben Korḥa says: </b> It is <b>a mitzva to mediate</b> a dispute, <b>as it is stated: “Execute the judgment of truth and peace in your gates”</b> (Zechariah 8:16). <b>Is it not that in the place where there is</b> strict <b>judgment there is no</b> true <b>peace, and in a place where there is</b> true <b>peace, there is no</b> strict <b>judgment? Rather, which is the judgment that has peace within it? You must say: This is mediation, </b> as both sides are satisfied with the result."
        },
        {
          "verseLocation": "Zechariah 8:19",
          "verseText": "to the house of Judah”",
          "talmudLocation": "Rosh Hashanah 18b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/18b#section-1",
          "talmudFullText": "<b>As Rav Ḥana bar Bizna said</b> that <b>R' Shimon Ḥasida said: What is</b> the meaning of that <b>which is written: “Thus said YHWH of hosts: The fast of the 4th month, and the fast of the 5th, and fast of the 7th, and the fast of the 10th, shall become times of joy and gladness, </b> and cheerful seasons, <b>to the house of Judah”</b> (Zechariah 8:19). <b>It calls them</b> days of <b>“fast” and it calls them</b> “times of <b>joy and gladness. ”</b> How so? <b>When there is peace</b> in the world, <b>they will be</b> times of <b>joy and gladness, </b> on which eulogies and fasting are forbidden; but when <b>there is no peace, </b> they are days of <b>fasting. </b> In a time when there is no peace, why are messengers not sent out also for the 4th and 10th months, so that people can know when to observe the fasts?"
        },
        {
          "verseLocation": "Zechariah 8:19",
          "verseText": "from here: “Love truth and peace”",
          "talmudLocation": "Sukkah 32b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/32b#section-16",
          "talmudFullText": "The Talmud suggests: <b>And say</b> the verse is referring to <b>oleander, </b> which has both characteristics. <b>Abaye said: </b> It is written with regard to the Torah: <b>“Its ways are ways of pleasantness”</b> (Proverbs 3:17), <b>and</b> that <b>is not</b> the case with the oleander tree, because it is a poisonous plant and its sharp, thorn-like leaves pierce the hand of one holding it. <b>Rava said: </b> The unfitness of the oleander is derived <b>from here: “Love truth and peace”</b> (Zechariah 8:19), and poisonous plants that pierce are antithetical to peace."
        },
        {
          "verseLocation": "Zechariah 8:19",
          "verseText": "practiced affection and camaraderie between them, to fulfill that which is stated: “Love truth and peace”",
          "talmudLocation": "Yevamot 14b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/14b#section-10",
          "talmudFullText": "Despite the fact that these <i>halakhot</i> entail important ramifications depending on whether or not these women were married or fit for marriage, or whether their offspring are fit for marriage, <b>Beit Shammai did not refrain from marrying women from Beit Hillel, nor did Beit Hillel</b> refrain from marrying women <b>from Beit Shammai. </b> This serves <b>to teach you that</b> they <b>practiced affection and camaraderie between them, to fulfill that which is stated: “Love truth and peace”</b> (Zechariah 8:19). <b>R' Shimon says: They did refrain in the certain</b> cases, <b>but they did not refrain in the uncertain</b> cases. In other words, Beit Hillel were not worried that any ordinary woman from Beit Shammai might be one of those of uncertain status."
        },
        {
          "verseLocation": "Zechariah 8:23",
          "verseText": "As it is stated: “Thus says the Lord of hosts: In those days it shall come to pass, that ten men shall take hold, out of all the languages of the nations, shall even take hold of the corner of the garment of him that is a Jew, saying: We will go with you,",
          "talmudLocation": "Shabbat 32b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/32b#section-6",
          "talmudFullText": "Since the Talmud discussed the importance of the mitzva of ritual fringes, it cites that which <b>Reish Lakish said: Anyone who is vigilant in</b> performing the mitzva of <b>ritual fringes merits</b> that <b>two thousand eight hundred servants will serve him</b> in the World-to-Come. <b>As it is stated: “Thus says YHWH of hosts: In those days it shall come to pass, that ten men shall take hold, out of all the languages of the nations, shall even take hold of the corner of the garment of him that is a Jew, saying: We will go with you, </b> for we have heard that God is with you” (Zechariah 8:23). On each corner of a Jewish person’s garment with ritual fringes, ten people from each of the seventy nations will take hold. That totals seven hundred people on each corner; 2,800 people altogether."
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "Zechariah 9:6",
          "verseText": "this is as it is written: “And a mamzer shall dwell in Ashdod”",
          "talmudLocation": "Kiddushin 72b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/72b#section-13",
          "talmudFullText": "The Talmud comments: <b>Granted, according to R' Meir, </b> who maintains that <i>mamzerim</i> will not be purified, <b>this is as it is written: “And a <i>mamzer</i> shall dwell in Ashdod”</b> (Zechariah 9:6), indicating that they will have their own isolated living area. <b>But according to R' Yosei, what</b> is the meaning of the phrase <b>“And a <i>mamzer</i> shall dwell in Ashdod”? </b> The Talmud answers: He understands that verse <b>as Rav Yosef would translate</b> it: <b>The Jewish people shall dwell in tranquility in their land, where they were</b> formerly <b>like strangers, </b> reading <i>mamzer</i> as <i>me’am zar</i>, from a strange people."
        },
        {
          "verseLocation": "Zechariah 9:7",
          "verseText": "which is written: “And I will take away his blood out of his mouth, and his detestable things from between his teeth, and he also shall be a remnant for our God;",
          "talmudLocation": "Megillah 6a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/6a#section-13",
          "talmudFullText": "<b>R' Yosei bar Ḥanina said: What is</b> the meaning of that <b>which is written: “And I will take away his blood out of his mouth, and his detestable things from between his teeth, and he also shall be a remnant for our God; </b> and he shall be as a chief in Judah, and Ekron as a Jebusite” (Zechariah 9:7)? The verse should be understood as follows: <b>“And I will take away his blood out of his mouth”; this is</b> referring to <b>their house of altars, </b> where they sacrifice offerings. <b>“And his detestable things from between his teeth”; this is</b> referring to <b>their house of piles, </b> where they heap their ritual stones."
        },
        {
          "verseLocation": "Zechariah 9:9",
          "verseText": "One who sees a donkey in a dream should anticipate salvation, as it is said: “Behold, your king comes unto you; he is triumphant, and victorious, lowly, and riding upon a donkey”",
          "talmudLocation": "Berakhot 56b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/56b#section-18",
          "talmudFullText": "<b>One who sees a donkey in a dream should anticipate salvation, as it is said: “Behold, your king comes unto you; he is triumphant, and victorious, lowly, and riding upon a donkey”</b> (Zechariah 9:9). <b>One who sees a cat in a dream in a place where</b> in Aramaic <b>they call it <i>shunra</i>, a nice song [<i>shira na’a</i>] will be composed for him. </b> If he sees a cat in a place where they call cats <b><i>shinra</i>, it is a sign that he will undergo a change for the worse [<i>shinui ra</i>]. One who sees grapes in a dream</b> and they were <b>white</b> or light colored, regardless of <b>whether</b> it was <b>in their season or not in their season, it is a good</b> sign. One who sees <b>black</b> grapes <b>in their season, it is a good</b> omen. However, one who sees black grapes when it was <b>not in their season, it is a bad</b> omen. <b>One who sees a white horse in a dream, </b> regardless of <b>whether</b> the horse was <b>walking or running, it is a good</b> omen <b>for him. </b> One who sees a <b>red</b> horse <b>walking, it is a good</b> omen; <b>running, it is a bad</b> omen."
        },
        {
          "verseLocation": "Zechariah 9:9",
          "verseText": "lowly and riding upon a donkey",
          "talmudLocation": "Sanhedrin 98a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98a#section-13",
          "talmudFullText": "<b>R' Alexandri says: R' Yehoshua ben Levi raises a contradiction</b> between two depictions of the coming of the Messiah. <b>It is written: “There came with the clouds of heaven, one like unto a son of man…</b>and there was given him dominion and glory and a kingdom…his dominion is an everlasting dominion” (Daniel 7:13–14). <b>And it is written: </b> “Behold, your king will come to you; he is just and victorious; <b>lowly and riding upon a donkey</b> and upon a colt, the foal of a donkey” (Zechariah 9:9). R' Alexandri explains: <b>If</b> the Jewish people <b>merit</b> redemption, the Messiah will come in a miraculous manner <b>with the clouds of heaven. If they do not merit</b> redemption, the Messiah will come <b>lowly and riding upon a donkey. </b>"
        },
        {
          "verseLocation": "Zechariah 9:9",
          "verseText": "and said: “Rejoice greatly, daughter of Zion; shout, daughter of Jerusalem; behold, your king will come to you; he is just and victorious; lowly and riding upon a donkey and upon a colt, the foal of a donkey”",
          "talmudLocation": "Sanhedrin 99a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/99a#section-4",
          "talmudFullText": "<b>Rav Yosef says: May the Master forgive R' Hillel</b> for stating matters with no basis. With regard to <b>Hezekiah, when was</b> his reign? It was <b>during the First Temple</b> period. <b>Whereas Zechariah</b> ben Berechiah, the prophet, <b>prophesied during the Second Temple</b> period <b>and said: “Rejoice greatly, daughter of Zion; shout, daughter of Jerusalem; behold, your king will come to you; he is just and victorious; lowly and riding upon a donkey and upon a colt, the foal of a donkey”</b> (Zechariah 9:9). In the generations after Hezekiah, there are prophecies about both redemption and the coming of the Messiah."
        },
        {
          "verseLocation": "Zechariah 9:12",
          "verseText": "as it is stated: “Return to the stronghold, you prisoners of hope; even today do I declare that I will render double [ mishne ] unto you”",
          "talmudLocation": "Sanhedrin 22a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-3",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> (<i>Tosefta</i> 4:5): <b>R'</b> Yehuda HaNasi <b>says: Initially, the Torah was given to the Jewish people in this script, </b> <i>Ashurit</i>, which is in use today. <b>Once</b> the Jewish people <b>sinned, it turned into an impairment for them</b> and they began writing with a different script, <i>Libona’a</i>. <b>Once they repented, </b> the first script <b>was returned to them, </b> and they resumed writing with <i>Ashurit</i> script, <b>as it is stated: “Return to the stronghold, you prisoners of hope; even today do I declare that I will render double [<i>mishne</i>] unto you”</b> (Zechariah 9:12), meaning that God restored to the Jewish people this script that had been changed [<i>nishtanna</i>]."
        },
        {
          "verseLocation": "Zechariah 9:14",
          "verseText": "and will go with whirlwinds of the south”",
          "talmudLocation": "Rosh Hashanah 32b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/32b#section-3",
          "talmudFullText": "The Talmud qualifies the Mishnah’s ruling. <b>However, if one comes to recite</b> verses of <b>Kingship, remembrance, and <i>shofar</i></b> with a theme <b>of the punishment of non-Jews, one may recite</b> them. The Talmud offers examples of these verses: With regard to the verses of <b>Kingship, for example: “YHWH reigns, let the peoples tremble”</b> (Psalms 99:1), <b>and, for example: “YHWH is King for ever and ever; the nations are perished out of His land”</b> (Psalms 10:16). With regard to <b>remembrance, for example: “Remember, O Lord, against the children of Edom</b> the day of Jerusalem, who said: Raze it, raze it, to its very foundation” (Psalms 137:7). With regard to the verses of <b><i>shofar</i>, for example: “And YHWH God will sound the</b> <i>shofar</i>, <b>and will go with whirlwinds of the south”</b> (Zechariah 9:14), <b>and it is written: “YHWH of hosts will defend them”</b> (Zechariah 9:15), i.e., God will defend the Jewish people against their enemies."
        },
        {
          "verseLocation": "Zechariah 9:15",
          "verseText": "It is stated: “And they shall be filled like the basins, like the corners of the altar”",
          "talmudLocation": "Pesachim 87a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87a#section-10",
          "talmudFullText": "The Talmud interprets each phrase of this verse: <b>“We whose sons are as plants”</b> indicates they are healthy and undamaged; <b>these are the young men of Israel who have not tasted the taste of sin. “Whose daughters are as corner pillars”</b> indicates that they are filled and sealed; <b>these are the virgins of Israel, who bind</b> and seal <b>their openings</b> exclusively <b>for their husbands. And similarly, </b> another verse demonstrates that a corner refers to something full: <b>It is stated: “And they shall be filled like the basins, like the corners of the altar”</b> (Zechariah 9:15). <b>If you wish, say</b> an alternative support for this idea <b>from here: “Our corners are full, affording all manner of store”</b> (Psalms 144:13)."
        },
        {
          "verseLocation": "Zechariah 9:15",
          "verseText": "and it is written: “The Lord of hosts will defend them”",
          "talmudLocation": "Rosh Hashanah 32b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/32b#section-3",
          "talmudFullText": "The Talmud qualifies the Mishnah’s ruling. <b>However, if one comes to recite</b> verses of <b>Kingship, remembrance, and <i>shofar</i></b> with a theme <b>of the punishment of non-Jews, one may recite</b> them. The Talmud offers examples of these verses: With regard to the verses of <b>Kingship, for example: “YHWH reigns, let the peoples tremble”</b> (Psalms 99:1), <b>and, for example: “YHWH is King for ever and ever; the nations are perished out of His land”</b> (Psalms 10:16). With regard to <b>remembrance, for example: “Remember, O Lord, against the children of Edom</b> the day of Jerusalem, who said: Raze it, raze it, to its very foundation” (Psalms 137:7). With regard to the verses of <b><i>shofar</i>, for example: “And YHWH God will sound the</b> <i>shofar</i>, <b>and will go with whirlwinds of the south”</b> (Zechariah 9:14), <b>and it is written: “YHWH of hosts will defend them”</b> (Zechariah 9:15), i.e., God will defend the Jewish people against their enemies."
        },
        {
          "verseLocation": "Zechariah 9:15",
          "verseText": "as it is written: “And they shall be filled like the basins, like the corners of the altar”",
          "talmudLocation": "Zevachim 54b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/54b#section-2",
          "talmudFullText": "Rav could answer: This means <b>that he places something under</b> the frame, in the place where there is to be no base, <b>and</b> after the poured mixture has dried he <b>removes it, </b> leaving the space empty. <b>As if you do not say so, </b> how will you explain <b>that which Rav Kahana says: The stone</b> interiors <b>of the corners were hollow, </b> i.e., there were gaps between the stones, <b>as it is written: “And they shall be filled like the basins, like the corners of the altar”</b> (Zechariah 9:15)? The verse compares the corners to hollow basins. <b>Here too, </b> doesn’t <b>God state</b> that the altar must be made of <b>“unhewn stones”? </b> If so, how could the corners be hollow? <b>Rather, </b> it must be <b>that he places something, </b> e.g., sticks and twigs, <b>under</b> the frame and pours the mixture for the corners over it, <b>and</b> when it has hardened, <b>removes</b> the sticks and twigs, leaving the corners somewhat hollow. <b>Here too, he places something under</b> the frame <b>and</b> later <b>removes it. </b>"
        },
        {
          "verseLocation": "Zechariah 9:16",
          "verseText": "“the stones of a crown, glittering over His land”",
          "talmudLocation": "Megillah 12a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-14",
          "talmudFullText": "The verse continues: “Upon a pavement of <b><i>bahat</i> and marble”</b> (Esther 1:6). <b>R' Asi said</b> with regard to the definition of <i>bahat</i>: These are <b>stones that ingratiate themselves with their owners, </b> as they are precious stones that people are willing to spend large amounts of money to acquire. <b>And similarly, it states</b> elsewhere that the Jewish people will be likened to precious stones: “And YHWH their God shall save them in that day as the flock of His people; for they shall be as <b>“the stones of a crown, glittering over His land”</b> (Zechariah 9:16)."
        },
        {
          "verseLocation": "Zechariah 9:17",
          "verseText": "is closed like a virgin, wine opens it, as it is stated: “And new wine opens [ yenovev ] the virgins”",
          "talmudLocation": "Bava Batra 12b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/12b#section-8",
          "talmudFullText": "The Talmud continues to discuss the meaning of <i>nevuv</i>, <b>Rav Huna, son of Rav Yehoshua, says: </b> With regard to <b>one who is accustomed to wine, although his heart, </b> i.e., his mind, <b>is closed like a virgin, wine opens it, as it is stated: “And new wine opens [<i>yenovev</i>] the virgins”</b> (Zechariah 9:17). The word <i>yenovev</i> is used here in the sense of clearing out a space: Even if one’s heart and mind are closed, wine will open them to understanding."
        },
        {
          "verseLocation": "Zechariah 9:17",
          "verseText": "not wine? But isn’t it written: “ Tirosh shall make the young women flourish [ yenovev ]”",
          "talmudLocation": "Yoma 76b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/76b#section-3",
          "talmudFullText": "The Talmud returns to the meaning of the word <i>tirosh</i>: <b>Is <i>tirosh</i> wine? Isn’t it taught</b> in a <i>baraita</i>: <b>One</b> who <b>vows</b> not to benefit <b>from <i>tirosh</i> is not allowed sweet foods, </b> e.g., sweet fruits, <b>but is allowed wine. </b> Therefore, <i>tirosh</i> is not wine but sweet food. The Talmud rejects this: <b>And is</b> <i>tirosh</i> <b>not wine? But isn’t it written: “<i>Tirosh</i> shall make the young women flourish [<i>yenovev</i>]”</b> (Zechariah 9:17). The word <i>yenovev</i> comes from the word <i>niv</i>, speech. Consequently, <i>tirosh</i> is a food that tempts the heart and mouth of the drinker, even of virgins, who are modest and reticent. Since sweet foods do not have this effect, <i>tirosh</i> must be wine. The Talmud replies: This is not a proof, since we could explain it otherwise: <b>Something that comes from <i>tirosh</i>, </b> such as wine, <b>causes virgins to come forth; </b> <i>tirosh</i> itself means sweet grapes. Perhaps wine is called <i>tirosh</i> only by extension because it is made from <i>tirosh</i>."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "Zechariah 10:1",
          "verseText": "for the sake of an individual? As it is written: “Ask of the Lord rain at the time of the last rain; even of the Lord who makes thunderclouds, and He will give them showers of rain; for a man grass in the field”",
          "talmudLocation": "Taanit 9b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/9b#section-3",
          "talmudFullText": "§ The Talmud returns to the issue of rain. <b>And Reish Lakish also maintains</b> that <b>rain</b> can fall <b>for the sake of an individual, as Reish Lakish said: From where</b> is it derived <b>that rain</b> falls even <b>for the sake of an individual? As it is written: “Ask of YHWH rain at the time of the last rain; even of YHWH who makes thunderclouds, and He will give them showers of rain; for a man grass in the field”</b> (Zechariah 10:1)."
        },
        {
          "verseLocation": "Zechariah 10:2",
          "verseText": "say: “And the dreams speak falsely”",
          "talmudLocation": "Berakhot 55b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/55b#section-14",
          "talmudFullText": "The Talmud relates: <b>Shmuel, when he would see a bad dream, </b> would <b>say: “And the dreams speak falsely”</b> (Zechariah 10:2). <b>When he would see a good dream, </b> he would <b>say: And do dreams speak falsely? Isn’t it written: “I speak with him in a dream”</b> (Numbers 12:6)?"
        },
        {
          "verseLocation": "Zechariah 10:4",
          "verseText": "its kings, as it is stated: “Out of them shall come forth the cornerstone, out of them the stake,",
          "talmudLocation": "Chullin 56b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/56b#section-14",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i>: <b>R' Meir would say</b> that the verse: <b>“Has He not made you, and established you? ”</b> teaches that the Jewish people is <b>a city with everything in it. Out of it</b> come <b>its priests, out of it</b> come <b>its prophets, out of it</b> come <b>its chiefs, out of it</b> come <b>its kings, as it is stated: “Out of them shall come forth the cornerstone, out of them the stake, </b> out of them the battle bow, out of them every master together” (Zechariah 10:4)."
        },
        {
          "verseLocation": "Zechariah 10:8",
          "verseText": "the Messiah is coming, as it is stated: “I will hiss [ eshreka ] for them, and gather them”",
          "talmudLocation": "Chullin 63a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/63a#section-10",
          "talmudFullText": "<b>R' Yoḥanan says: Why is it called the <i>raḥam</i>? </b> Because <b>when the <i>raḥam</i> comes</b> to Eretz Yisrael, <b>mercy [<i>raḥamim</i>] comes to the world, </b> as it appears at the beginning of the winter. <b>Rav Beivai bar Abaye said: And it is</b> a sign of rain only <b>when it sits on something and makes a <i>sherakrak</i></b> sound. And it <b>is learned</b> as a tradition <b>that if it sits on the ground and hisses [<i>veshareik</i>], </b> this is a sign that <b>the Messiah is coming, as it is stated: “I will hiss [<i>eshreka</i>] for them, and gather them”</b> (Zechariah 10:8)."
        },
        {
          "verseLocation": "Zechariah 10:11",
          "verseText": "“And He shall pass through the sea with affliction and shall strike the waves in the sea”",
          "talmudLocation": "Sanhedrin 103b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-15",
          "talmudFullText": "With regard to that which is written: <b>“And He shall pass through the sea with affliction and shall strike the waves in the sea”</b> (Zechariah 10:11), <b>R' Yoḥanan says: This</b> affliction is a reference to <b>the idol of Micah, </b> as Micah passed through the sea during the exodus from Egypt. <b>It is taught</b> in a <i>baraita</i> that <b>R' Natan says: </b> The distance <b>from Gerav, </b> where Micah resided, <b>to Shiloh, </b> where the Tabernacle was at that time, <b>was three <i>mil</i>, and the smoke from the arrangement</b> of wood on the altar in Shiloh <b>and the smoke</b> from the worship <b>of the idol of Micah would intermingle with each other. </b>"
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "Zechariah 11:1",
          "verseText": "I know about you that you will ultimately be destroyed, and Zechariah, son of Ido, has already prophesied concerning you: “Open your doors, O Lebanon, that the fire may devour your cedars”",
          "talmudLocation": "Yoma 39b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/39b#section-6",
          "talmudFullText": "<b>And the doors of the Sanctuary opened by themselves</b> as a sign that they would soon be opened by enemies, <b>until Rabban Yoḥanan ben Zakkai scolded them. He said to</b> the Sanctuary: <b>Sanctuary, Sanctuary, why do you frighten yourself</b> with these signs? <b>I know about you that you will ultimately be destroyed, and Zechariah, son of Ido, has already prophesied concerning you: “Open your doors, O Lebanon, that the fire may devour your cedars”</b> (Zechariah 11:1), Lebanon being an appellation for the Temple."
        },
        {
          "verseLocation": "Zechariah 11:7",
          "verseText": "which is written: “And I took for myself two staves; the one I called Graciousness, and the other I called Binders”",
          "talmudLocation": "Sanhedrin 24a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/24a#section-12",
          "talmudFullText": "This demonstrates what <b>R' Oshaya says: What</b> is the meaning of that <b>which is written: “And I took for myself two staves; the one I called Graciousness, and the other I called Binders”</b> (Zechariah 11:7)? <b>“Graciousness”; these are</b> the <b>Torah scholars in Eretz Yisrael, who are gracious to one another in</b> discussions of <b><i>halakha</i>. </b> They treat each other with honor and love, as demonstrated in the statements of Reish Lakish and R' Yehuda HaNasi. <b>“Binders [<i>ḥovelim</i>]”; these are</b> the <b>Torah scholars in Babylonia, who injure [<i>shemeḥabbelim</i>] each other in</b> discussions of <b><i>halakha</i>, </b> i.e., they speak harshly to each other when they disagree."
        },
        {
          "verseLocation": "Zechariah 11:8",
          "verseText": "from here: “For My soul became impatient of them, and their soul also grew in disgust [ baḥala ] toward Me”",
          "talmudLocation": "Niddah 47a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/47a#section-13",
          "talmudFullText": "The Talmud adds: <b>And if you wish, say</b> instead that the source is <b>from here: “For My soul became impatient of them, and their soul also grew in disgust [<i>baḥala</i>] toward Me”</b> (Zechariah 11:8). The verse indicates that this word denotes growth. As for the 3rd term in the Mishnah, <b>a ripe fig [<i>tzemel</i>], </b> it is <b>as one would say: </b> A fruit <b>has come forth complete [<i>yatzeta mele’a</i>]. </b>"
        },
        {
          "verseLocation": "Zechariah 11:8",
          "verseText": "Moses died all of them disappeared. As it is stated: “And I cut off the three shepherds in one month”",
          "talmudLocation": "Taanit 9a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/9a#section-12",
          "talmudFullText": "The <i>baraita</i> continues: <b>Both</b> the well and the clouds of glory <b>returned in the merit of Moses. </b> However, when <b>Moses died all of them disappeared. As it is stated: “And I cut off the three shepherds in one month”</b> (Zechariah 11:8). <b>But did</b> the three shepherds really <b>die in one month? Didn’t Miriam die in</b> the month of <b>Nisan, and Aaron in Av and Moses in Adar? Rather, </b> this verse <b>teaches</b> us <b>that</b> with the death of Moses the <b>three good gifts that were given through their agency were annulled, and</b> all three gifts <b>disappeared in one month, </b> which made it seem as though all three leaders had died at the same time."
        },
        {
          "verseLocation": "Zechariah 11:8",
          "verseText": "in a dream: “And I cut off the three shepherds in one month”",
          "talmudLocation": "Taanit 9b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/9b#section-1",
          "talmudFullText": "A verse <b>was read to</b> Rav Pappa <b>in a dream: “And I cut off the three shepherds in one month”</b> (Zechariah 11:8). <b>The next day, when they took their leave from him, </b> Rav Pappa <b>said to them: May the Rabbis go in peace, </b> a hint that this would be their final parting. Rav Pappa thought that the three rabbis would die as punishment for their behavior and he would never see them again."
        },
        {
          "verseLocation": "Zechariah 11:12",
          "verseText": "which is written: “And I said to them: If it is good in your eyes, give me my hire; and if not, refrain. And they weighed for my hire thirty pieces of silver”",
          "talmudLocation": "Chullin 92a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/92a#section-20",
          "talmudFullText": "<b>Abaye said: And most of the</b> fifteen righteous individuals in Babylonia <b>are found in the synagogue under the upper room. And this is</b> the meaning of that <b>which is written: “And I said to them: If it is good in your eyes, give me my hire; and if not, refrain. And they weighed for my hire thirty pieces of silver”</b> (Zechariah 11:12)."
        },
        {
          "verseLocation": "Zechariah 11:13",
          "verseText": "“And I took the thirty pieces of silver and cast them into the treasury, in the house of the Lord”",
          "talmudLocation": "Chullin 92a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/92a#section-19",
          "talmudFullText": "The verse states: <b>“A <i>ḥomer</i> of barley, and a half-<i>ḥomer</i> of barley. ”</b> A <i>ḥomer</i> equals thirty <i>se’a</i>, and a half-<i>ḥomer</i> equals fifteen <i>se’a</i>, totaling forty-five <i>se’a</i>; <b>these are the forty-five righteous</b> individuals <b>in whose</b> merit <b>the world</b> continues to <b>exist. And</b> although the verse alludes to the fact that thirty of these righteous individuals are in one place and fifteen are elsewhere, <b>I do not know if thirty are here</b> in Babylonia <b>and fifteen are in Eretz Yisrael, or if thirty are in Eretz Yisrael and fifteen are here</b> in Babylonia. <b>When it says</b> in a different verse: <b>“And I took the thirty pieces of silver and cast them into the treasury, in the house of YHWH”</b> (Zechariah 11:13), <b>you must say</b> that <b>thirty</b> of the righteous individuals are <b>in Eretz Yisrael and fifteen are here</b> in Babylonia."
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "Zechariah 12:9",
          "verseText": "which is written: “And it shall come to pass in that day, that I will seek to destroy all the nations”",
          "talmudLocation": "Avodah Zarah 4a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-6",
          "talmudFullText": "<b>And this is</b> the same as that <b>which R' Alexandri says: What</b> is the meaning of that <b>which is written: “And it shall come to pass in that day, that I will seek to destroy all the nations”</b> (Zechariah 12:9)? <b>“I will seek” from whom? </b> Does God need to seek permission? Rather, <b>God says: I will seek</b> and search <b>in their records [<i>benigeni</i>]; if they have merit, I will redeem them, and if not, I will destroy them. </b>"
        },
        {
          "verseLocation": "Zechariah 12:10",
          "verseText": "“And they shall look unto Me because they have thrust him through; and they shall mourn for him, as one mourns for his only son”",
          "talmudLocation": "Sukkah 52a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52a#section-3",
          "talmudFullText": "The Talmud asks: <b>Granted, according to the one who said</b> that the lament is for <b>Messiah ben Yosef who was killed, this</b> would be the meaning of that <b>which is written</b> in that context: <b>“And they shall look unto Me because they have thrust him through; and they shall mourn for him, as one mourns for his only son”</b> (Zechariah 12:10). <b>However, according to the one who said</b> that the eulogy is <b>for the evil inclination that was killed, </b> does one <b>need to conduct a eulogy</b> for <b>this? </b> On the contrary, <b>one should conduct a celebration. Why, </b> then, <b>did they cry? </b>"
        },
        {
          "verseLocation": "Zechariah 12:11",
          "verseText": "As it is written: “On that day shall there be a great mourning in Jerusalem, like the mourning of Hadadrimmon in the valley of Megiddon”",
          "talmudLocation": "Megillah 3a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/3a#section-9",
          "talmudFullText": "The Talmud asks: <b>What is different</b> about the translation of Prophets? Why is it that when Onkelos revealed the translation <b>of the Torah, </b> Eretz Yisrael <b>did not quake, and</b> when he revealed the translation <b>of the Prophets, it quaked? </b> The Talmud explains: <b>The</b> meaning of <b>matters</b> discussed <b>in the Torah is clear, </b> and therefore its Aramaic translation did not reveal the meaning of passages that had not been understood previously. Conversely, in <b>the Prophets, there are matters that are clear and there are matters that are obscure, </b> and the Aramaic translation revealed the meaning of obscure passages. The Talmud cites an example of an obscure verse that is clarified by the Aramaic translation: <b>As it is written: “On that day shall there be a great mourning in Jerusalem, like the mourning of Hadadrimmon in the valley of Megiddon”</b> (Zechariah 12:11)."
        },
        {
          "verseLocation": "Zechariah 12:11",
          "verseText": "“On that day shall there be a great mourning in Jerusalem, like the mourning of Hadadrimmon in the valley of Megiddon”",
          "talmudLocation": "Moed Katan 28b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/28b#section-17",
          "talmudFullText": "<b>R' Akiva answered and said: </b> The verse states: <b>“On that day shall there be a great mourning in Jerusalem, like the mourning of Hadadrimmon in the valley of Megiddon”</b> (Zechariah 12:11). The Talmud comments: With regard to this verse, <b>Rav Yosef said: Had it not been for the</b> Aramaic <b>translation of this verse, we would not have known what it is saying, </b> as nowhere in the Bible do we find this incident involving Hadadrimmon."
        },
        {
          "verseLocation": "Zechariah 12:12",
          "verseText": "“The land will eulogize, each family separately; the family of the house of David separately, and their women separately,",
          "talmudLocation": "Sukkah 52a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52a#section-1",
          "talmudFullText": "It is stated: <b>“The land will eulogize, each family separately; the family of the house of David separately, and their women separately, </b> the family of the house of Nathan separately, and their women separately” (Zechariah 12:12). This indicates that at the end of days a great eulogy will be organized during which men and women will be separate. <b>They said: And are</b> these <b>matters not</b> inferred <b><i>a fortiori</i>? If in the future, </b> at the end of days referred to in this prophecy, <b>when</b> people <b>are involved in</b> a great <b>eulogy and</b> consequently <b>the evil inclination does not dominate them, </b> as typically during mourning inappropriate thoughts and conduct are less likely, and nevertheless <b>the Torah says: Men separately and women separately; </b> then <b>now that they are involved in</b> the <b>Celebration</b> of the Drawing of the Water, <b>and</b> as such <b>the evil inclination dominates them, </b> since celebration lends itself to levity, <b>all the more so</b> should men and women be separate."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "Zechariah 13:1",
          "verseText": "As it is stated: “On that day there shall be a fountain opened for the house of David and to the inhabitants of Jerusalem for purification and for sprinkling”",
          "talmudLocation": "Yoma 78a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/78a#section-1",
          "talmudFullText": "<b>in the future, will bubble from under the threshold of the Temple. From this</b> point <b>forward, </b> the spring <b>will grow in strength and rise until it reaches the opening of David’s house, </b> i.e., his grave, which is outside of Jerusalem. <b>When it reaches the opening of David’s house, it will become a flowing river in which <i>zavim</i> and <i>zavot</i>, menstruating women, and women after childbirth will bathe</b> to purify themselves. <b>As it is stated: “On that day there shall be a fountain opened for the house of David and to the inhabitants of Jerusalem for purification and for sprinkling”</b> (Zechariah 13:1)."
        },
        {
          "verseLocation": "Zechariah 13:6",
          "verseText": "as it is written: “And one shall say to him: What are these wounds between your arms? Then he shall answer: Those with which I was wounded in the house of my friends”",
          "talmudLocation": "Makkot 22b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/22b#section-3",
          "talmudFullText": "The Mishnah teaches: <b>R' Yehuda says: </b> He is flogged with <b>a full forty</b> lashes, with the additional lash administered between his shoulders. <b>R' Yitzḥak says: What is the reason</b> for the opinion <b>of R' Yehuda? </b> It is <b>as it is written: “And one shall say to him: What are these wounds between your arms? Then he shall answer: Those with which I was wounded in the house of my friends”</b> (Zechariah 13:6). R' Yehuda understands that this verse is referring to one with wounds from lashes administered between his arms, indicating that there is one lash administered between the shoulders. <b>And</b> how do <b>the Rabbis, </b> who hold that one is flogged only thirty-nine lashes, explain this verse? They explain that <b>this</b> verse <b>is written with regard to schoolchildren</b> struck by their teacher for laxity in their studies, and is not referring to lashes administered by the court."
        },
        {
          "verseLocation": "Zechariah 13:8",
          "verseText": "is stated: “And it shall come to pass that in all the land, says the Lord, two parts shall be excised and die, but the third shall remain in it”",
          "talmudLocation": "Sanhedrin 111a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/111a#section-3",
          "talmudFullText": "With regard to <b>that</b> which <b>is stated: “And it shall come to pass that in all the land, says YHWH, two parts shall be excised and die, but the 3rd shall remain in it”</b> (Zechariah 13:8), <b>Reish Lakish says: </b> “The 3rd” means that only <b>one-3rd</b> of the descendants <b>of Shem, </b> son of Noah, will remain, and everyone else will die. <b>R' Yoḥanan said to</b> Reish Lakish: <b>It is not satisfactory to</b> God, <b>their Master, that you said this about them, </b> that the overwhelming majority of the world will be destroyed. <b>Rather, even</b> as many as <b>one-3rd</b> of the descendants <b>of Noah, </b> one-3rd of the population of the world, will remain."
        },
        {
          "verseLocation": "Zechariah 13:9",
          "verseText": "as it is stated: “And I will bring the third part through the fire, and will refine them as silver is refined, and will try them as gold is tried; they shall call on My name, and I will answer them”",
          "talmudLocation": "Rosh Hashanah 17a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-1",
          "talmudFullText": "<b>and they will cry out</b> in their pain <b>and</b> eventually <b>ascend</b> from there, <b>as it is stated: “And I will bring the 3rd part through the fire, and will refine them as silver is refined, and will try them as gold is tried; they shall call on My name, and I will answer them”</b> (Zechariah 13:9). This is referring to the members of the 3rd group, who require refinement and cleansing. <b>And about them, Hannah said: “YHWH kills, and gives life; he brings down to the grave, and brings up”</b> (I Samuel 2:6)."
        },
        {
          "verseLocation": "Zechariah 13:9",
          "verseText": "But isn’t it written: “And I will bring the third part through the fire”",
          "talmudLocation": "Rosh Hashanah 17a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/17a#section-7",
          "talmudFullText": "<b>The Master said</b> in the <i>baraita</i> above: It stated that <b>Beit Hillel say: </b> He Who is <b>“and abundant in kindness”</b> (Exodus 34:6) <b>tilts</b> the scales <b>in favor of kindness, </b> so that middling people will not have to pass through Gehenna. The Talmud asks: <b>But isn’t it written: “And I will bring the 3rd part through the fire”</b> (Zechariah 13:9), implying that there is a 3rd group, which is sent to Gehenna temporarily? The Talmud answers: <b>There, </b> the verse is referring to <b>the rebellious Jews</b> who have sinned <b>with their bodies. </b>"
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "Zechariah 14:4",
          "verseText": "But isn’t it written: “And on that day His feet will stand on the Mount of Olives”",
          "talmudLocation": "Sukkah 5a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/5a#section-2",
          "talmudFullText": "The Talmud asks: <b>And did the Shekhina never descend below</b> ten handbreadths? <b>But isn’t it written: “And God descended onto Mount Sinai”</b> (Exodus 19:20)? <b>The Talmud answers: Although God descended below, He always remained <b>ten handbreadths above</b> the ground. Since from ten handbreadths and above it is a separate domain, in fact, the Shekhina never descended to the domain of this world. <b>The Talmud asks: <b>But isn’t it written: “And on that day His feet will stand on the Mount of Olives”</b> (Zechariah 14:4)? The Talmud answers: Here, too, He will remain <b>ten handbreadths above</b> the ground."
        },
        {
          "verseLocation": "Zechariah 14:6",
          "verseText": "heavy clouds [ yekarot ] and thickness [ vekippaon ]”",
          "talmudLocation": "Pesachim 50a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/50a#section-3",
          "talmudFullText": "Incidental to the discussion of leaving Jerusalem and its surrounding area, the Talmud cites expositions of a prophetic passage, including a statement that God will eventually expand the boundaries of Jerusalem. The verse states: <b>“And it shall come to pass on that day that there shall not be light, </b> but <b>heavy clouds [<i>yekarot</i>] and thickness [<i>vekippaon</i>]”</b> (Zechariah 14:6). The Talmud asks: <b>What is</b> the meaning of the expression <b>“<i>yekarot vekippaon</i>”? </b>"
        },
        {
          "verseLocation": "Zechariah 14:9",
          "verseText": "“And the Lord shall be King over all the earth, on that day shall the Lord be one and His name one”",
          "talmudLocation": "Pesachim 50a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/50a#section-16",
          "talmudFullText": "The Talmud cites another verse from the prophecy at the end of the book of Zechariah: <b>“And YHWH shall be King over all the earth, on that day shall YHWH be one and His name one”</b> (Zechariah 14:9). The Talmud asks: <b>Is that to say that now He is not one? </b>"
        },
        {
          "verseLocation": "Zechariah 14:10",
          "verseText": "future, the Holy One, Blessed be He, will raise Jerusalem three parasangs upward; as it is stated: “And it shall be lifted up and inhabited in its place”",
          "talmudLocation": "Bava Batra 75b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75b#section-5",
          "talmudFullText": "<b>And Rabba says</b> that <b>R' Yoḥanan says: </b> In the <b>future, God will raise Jerusalem three parasangs upward; as it is stated: “And it shall be lifted up and inhabited in its place”</b> (Zechariah 14:10). <b>What</b> is the meaning of the phrase <b>“in its place”? </b> It means <b>equivalent to its place, </b> i.e., Jerusalem will be raised to a height whose measure in parasangs corresponds to the measure of its area in square parasangs. The Talmud asks: <b>And from where</b> is it derived <b>that the place</b> of Jerusalem <b>was</b> an area of <b>three</b> square <b>parasangs? Rabba said</b> that <b>a certain elder said to me: I saw the initial Jerusalem, </b> when it was still extant, <b>and</b> its area <b>was three</b> square <b>parasangs. </b>"
        },
        {
          "verseLocation": "Zechariah 14:20",
          "verseText": "“On that day there shall be upon the bells of the horses [ metzillot hasus ]: Holy unto the Lord”",
          "talmudLocation": "Pesachim 50a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/50a#section-9",
          "talmudFullText": "The Talmud continues to expound the section of the book of Zechariah cited above. The verse states: <b>“On that day there shall be upon the bells of the horses [<i>metzillot hasus</i>]: Holy unto YHWH”</b> (Zechariah 14:20). The Talmud asks: <b>What is</b> the meaning of the expression <b><i>metzillot hasus</i>? </b>"
        },
        {
          "verseLocation": "Zechariah 14:21",
          "verseText": "there shall no longer be a merchant [ kena’ani ] in the house of the Lord of hosts”",
          "talmudLocation": "Pesachim 50a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/50a#section-14",
          "talmudFullText": "The Talmud goes on to ask: <b>Granted, according to the one who said</b> that this expression refers to <b>spoils, this is as it is written</b> in the next verse: <b>“And</b> on that day <b>there shall no longer be a merchant [<i>kena’ani</i>] in the house of YHWH of hosts”</b> (Zechariah 14:21), as he will no longer be needed. <b>However, according to the ones who said these</b> other <b>two</b> explanations, <b>what</b> is the meaning of the expression: <b>“There shall no longer be a merchant”? R' Yirmeya said: </b> The word <i>kena’ani</i> is in fact a contraction of the phrase: <b>There is no poor person here [<i>ein kan ani</i>]. </b> In other words, there will no longer be poor people, and therefore the Jews themselves will be able to donate whatever is needed in the Temple (Maharsha)."
        }
      ]
    }
  ]
}