{
  "bookName": "Zephaniah",
  "totalEntries": 32,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Zephaniah 1:1",
          "verseText": "“The word of the Lord which came to Zephaniah the son of Cushi, the son of Gedaliah”",
          "talmudLocation": "Megillah 15a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-3",
          "talmudFullText": "It was taught in a baraita:  With regard to anyone whose actions and the actions of his ancestors are obscured and not explained, and the verse mentioned one of them favorably, for example,  the way in which Zephaniah the prophet is introduced: “The word of YHWH which came to Zephaniah the son of Cushi, the son of Gedaliah” (Zephaniah 1:1), it is known that not only was he a righteous man,  he was also the son of a righteous man. And conversely, whenever the verse mentioned one of them unfavorably, for example,  in the verse that introduces Ishmael as the one who killed Gedaliah, which states: “And it came to pass in the 7th month that Ishmael the son of Nethaniah, the son of Elishama” (Jeremiah 41:1), it is known that not only was he a wicked man,  he was also the son of a wicked man. "
        },
        {
          "verseLocation": "Zephaniah 1:12",
          "verseText": "at that time I will search Jerusalem with lamps”",
          "talmudLocation": "Pesachim 7b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/7b#section-15",
          "talmudFullText": "And searching is derived from lamps by means of juxtaposition, as it is written:  “And it shall come to pass that at that time I will search Jerusalem with lamps” (Zephaniah 1:12). And finally, the word lamps is derived from lamp by means of juxtaposition, as it is written: “The spirit of man is the lamp of God, searching all the inward parts” (Proverbs 20:27). Together these verses indicate that the search for leaven must be conducted by the light of the lamp."
        },
        {
          "verseLocation": "Zephaniah 1:12",
          "verseText": "And it says: “At that time I will search Jerusalem with lamps”",
          "talmudLocation": "Pesachim 8a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/8a#section-1",
          "talmudFullText": "because the light of a lamp is effective for searching. And even though there is no proof for this matter, there is an allusion to this matter, as it is stated: “Seven days leaven shall not be found in your houses” (Exodus 12:19), and it says: “And he searched, starting with the eldest,  and ending with the youngest; and the goblet was found in Benjamin’s sack…” (Genesis 44:12). And it says: “At that time I will search Jerusalem with lamps” (Zephaniah 1:12), and it says: “The spirit of man is the lamp of God, searching all the inward parts” (Proverbs 20:27)."
        },
        {
          "verseLocation": "Zephaniah 1:15",
          "verseText": "“That day is a day of wrath”",
          "talmudLocation": "Avodah Zarah 18b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/18b#section-14",
          "talmudFullText": "Rav Ketina says:  Concerning anyone who scoffs, his sustenance is lessened, as it is stated: “He stretches out his hand with scorners” (Hosea 7:5), meaning that God withdraws His providence from scoffers and does not provide for them. R' Shimon ben Lakish says: Anyone who scoffs falls into Gehenna, as it is stated: “A proud and haughty man, scorner is his name, he acts in arrogant wrath” (Proverbs 21:24). And wrath means nothing other than Gehenna, as it is stated with regard to the Day of Judgment: “That day is a day of wrath” (Zephaniah 1:15)."
        },
        {
          "verseLocation": "Zephaniah 1:15",
          "verseText": "And wrath means nothing other than Gehenna, as it is stated: “That day is a day of wrath”",
          "talmudLocation": "Avodah Zarah 18b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/18b#section-15",
          "talmudFullText": "R' Oshaya says,  based on the same verse: Anyone who is haughty falls into Gehenna, as it is stated: “A proud and haughty man, scorner is his name, he acts in arrogant wrath” (Proverbs 21:24). And wrath means nothing other than Gehenna, as it is stated: “That day is a day of wrath” (Zephaniah 1:15). R' Ḥanilai bar Ḥanilai says: Anyone who scoffs causes extermination to be wrought upon the world, as it is stated: “Now therefore do not be scoffers, lest your suffering be made strong; for an extermination wholly determined have I heard from YHWH, the God of hosts, upon the whole land” (Isaiah 28:22)."
        },
        {
          "verseLocation": "Zephaniah 1:15",
          "verseText": "it is written: “That day is a day of wrath”",
          "talmudLocation": "Bava Batra 10a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/10a#section-16",
          "talmudFullText": "R' Ḥiyya bar Abba says: R' Yoḥanan raises a contradiction between two texts. In one place it is written: “Riches profit not on the day of wrath, but charity delivers from death” (Proverbs 11:4), and elsewhere it is written: “Treasures of wickedness profit nothing, but charity delivers from death” (Proverbs 10:2). Why is it necessary to have these two verses about charity,  that it delivers from death? R' Ḥiyya bar Abba continues: One verse serves to teach that charity delivers from an unnatural death in this world, and one verse serves to teach that charity delivers from the judgment of Gehenna in the World-to-Come. And in which of the verses is that charity which delivers from the judgment of Gehenna mentioned? It is in that verse in which “wrath” is written, as with regard to the day of judgment it is written: “That day is a day of wrath” (Zephaniah 1:15). And which type of charity is that which delivers from an unnatural death? "
        },
        {
          "verseLocation": "Zephaniah 1:15",
          "verseText": "And wrath means nothing other than Gehenna, as it is stated: “That day is a day of wrath”",
          "talmudLocation": "Bava Batra 10b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/10b#section-10",
          "talmudFullText": "Rabban Gamliel answered and said: “Righteousness exalts a nation”; these are the people of Israel, as it is written: “And who is like your people Israel,  one nation on the earth. ” “But the kindness of the peoples is sin” means that all the acts of charity and kindness that the nations of the world perform is counted as a sin for them, since they perform them only in order to act haughtily through them, and whoever acts haughtily falls into Gehenna, as it is stated: “The proud and haughty one, scorner is his name, acts in arrogant wrath” (Proverbs 21:24). And wrath means nothing other than Gehenna, as it is stated: “That day is a day of wrath” (Zephaniah 1:15)."
        },
        {
          "verseLocation": "Zephaniah 1:15",
          "verseText": "and it is written there: “That day is a day of wrath [ evra ]”",
          "talmudLocation": "Bava Batra 116a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/116a#section-4",
          "talmudFullText": "§ The Talmud presents a related statement. R' Yoḥanan says in the name of R' Shimon ben Yoḥai:  Concerning anyone who does not leave behind a son to inherit from him, God is filled with wrath [evra] toward him,  as it is written here:  “If a man die, and he has no son, then you shall pass his inheritance [veha’avartem] to his daughter” (Numbers 27:8), and it is written there: “That day is a day of wrath [evra]” (Zephaniah 1:15). The words “veha’avartem” and “evra” share common root letters, whereby R' Shimon ben Yoḥai interprets that God’s wrath may be the result of the inheritance passing to a daughter rather than a son."
        },
        {
          "verseLocation": "Zephaniah 1:15",
          "verseText": "wrath, as it is stated: “That day is a day of wrath [ evra ]”",
          "talmudLocation": "Bava Batra 141a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/141a#section-2",
          "talmudFullText": "§ The Mishnah teaches: With regard to one who says: If my wife gives birth to a male the offspring shall receive one hundred dinars, if she in fact gave birth to a male, the offspring receives one hundred dinars. If he says: If my wife gives birth to a female the offspring shall receive two hundred dinars, if she in fact gave birth to a female, the offspring receives two hundred dinars. The Talmud asks: Is this to say that for him a daughter is preferable to a son? But this seems to contradict what R' Yoḥanan says in the name of R' Shimon ben Yoḥai:  With regard to anyone who does not leave behind a son to inherit from him, God is filled with wrath upon him, as it is stated:  “If a man dies, and has no son, then you shall cause his inheritance to pass [veha’avartem] to his daughter” (Numbers 27:8). The term ha’avara means nothing other than wrath, as it is stated: “That day is a day of wrath [evra]” (Zephaniah 1:15)."
        },
        {
          "verseLocation": "Zephaniah 1:15",
          "verseText": "“That day will be a day of wrath,",
          "talmudLocation": "Shabbat 118a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/118a#section-7",
          "talmudFullText": "R' Shimon ben Pazi said that R' Yehoshua ben Levi said in the name of bar Kappara: Anyone who fulfills the obligation to eat three meals on Shabbat is rescued from three punishments: From the pangs of the Messiah,  i.e., the suffering that precedes the advent of Messiah, and from the judgment of Gehenna, and from the war of Gog and Magog.  The Talmud derives that one is rescued from the pangs of Messiah by means of a verbal analogy. It is written here,  with regard to Shabbat, day:  “Eat it today” (Exodus 16:25). And it is written there,  with regard to Messiah, day: “Behold, I am sending you Elijah the prophet before the coming of the great and awesome day of God” (Malachi 3:23). The Talmud derives that one is rescued from the judgment of Gehenna by means of a verbal analogy. It is written here,  with regard to Shabbat, day,  as cited above. And it is written there,  day: “That day will be a day of wrath,  a day of trouble and distress, a day of destruction and desolation, a day of darkness and blackness, a day of cloud and thick fog” (Zephaniah 1:15), which is interpreted as referring to the punishment of Gehenna. The Talmud derives that one is rescued from the war of Gog and Magog by means of a verbal analogy. It is written here,  with regard to Shabbat, day. And it is written there,  with regard to the War of Gog and Magog, day: “And it shall be on that day, on the day that Gog arrives on the land of Israel” (Ezekiel 38:18)."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Zephaniah 2:1",
          "verseText": "“Gather yourselves together and gather [ hitkosheshu vakoshu ]”",
          "talmudLocation": "Bava Batra 60b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/60b#section-3",
          "talmudFullText": "The Talmud asks: At the outset what did R' Yannai hold, and ultimately, what did he hold?  The Talmud replies: At the outset, he held that the general public is amenable to having the tree there, as they sit in its shade. Once he saw that they were preventing someone else who owned a tree from keeping his, he understood that it was only out of respect that they did not object to his tree being there. He therefore sent someone to cut it down. The Talmud asks: But why did he tell the man to return the next day? Let him say to him: Go cut down your tree, and then I will cut mine down. The Talmud answers: Because of the statement of Reish Lakish, who said:  The verse states: “Gather yourselves together and gather [hitkosheshu vakoshu]” (Zephaniah 2:1), and this can be explained homiletically to mean: Adorn [keshot] yourself and afterward adorn others,  i.e., act properly before requiring others to do so."
        },
        {
          "verseLocation": "Zephaniah 2:1",
          "verseText": "But isn’t it written: “Gather yourselves together, and gather [ hitkosheshu vakoshu ]”",
          "talmudLocation": "Bava Metzia 107b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/107b#section-15",
          "talmudFullText": "The Talmud relates another incident: Rabba bar Rav Huna had a certain forest on the bank of a river. They said to him: Let the Master cut down the trees on the riverbank in accordance with the above statement. Rabba bar Rav Huna said to them:  Let those above and below me along the river cut down their trees first, and then I will cut down my trees. I will achieve nothing by cutting down my trees on my own. The Talmud asks: How can he do so,  i.e., wait for others to act? But isn’t it written: “Gather yourselves together, and gather [hitkosheshu vakoshu]” (Zephaniah 2:1), and Reish Lakish says concerning this: Adorn [keshot] yourself and afterward adorn others.  Therefore, one must first perform the required action himself before offering advice to others."
        },
        {
          "verseLocation": "Zephaniah 2:1",
          "verseText": "But isn’t it written: “Gather yourselves together, yea, gather together [ hitkosheshu vakoshu ]”",
          "talmudLocation": "Sanhedrin 18a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/18a#section-11",
          "talmudFullText": "Talmud:  The Mishnah teaches that the High Priest judges others as a member of a court. The Talmud asks: Isn’t that obvious?  Why would one think that he would be unfit to serve as a judge? The Talmud answers: It was necessary for the Mishnah to mention the latter clause: And others judge him,  and therefore, it taught the related halakha with it. The Talmud objects: This is also obvious; if others do not judge him, how can he judge others? But isn’t it written: “Gather yourselves together, yea, gather together [hitkosheshu vakoshu]” (Zephaniah 2:1); and Reish Lakish says:  This verse teaches a moral principle: Adorn [kashet] yourself first, and then adorn others,  i.e., one who is not subject to judgment may not judge others."
        },
        {
          "verseLocation": "Zephaniah 2:1",
          "verseText": "If they do not judge him, how can he judge? But isn’t it written: “Gather yourselves together, yea, gather together [ hitkosheshu vakoshu ]”",
          "talmudLocation": "Sanhedrin 19a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19a#section-15",
          "talmudFullText": "§ The Mishnah teaches: A king does not judge and is not judged. Rav Yosef says: They taught this halakha only with regard to the kings of Israel,  who were violent and disobedient of Torah laws, but with regard to the kings of the house of David,  the king judges and is judged, as it is written: “O house of David, so says YHWH: Execute justice in the morning” (Jeremiah 21:12). If they do not judge him, how can he judge? But isn’t it written: “Gather yourselves together, yea, gather together [hitkosheshu vakoshu]” (Zephaniah 2:1), and Reish Lakish says:  This verse teaches a moral principle: Adorn [kashet] yourself first, and then adorn others,  i.e., one who is not subject to judgment may not judge others. Since it is understood from the verse in Jeremiah that kings from the Davidic dynasty can judge others, it is implicit that they can also be judged."
        },
        {
          "verseLocation": "Zephaniah 2:3",
          "verseText": "When Rabbi Ami reached this verse, he cried: “Seek righteousness, seek humility; perhaps you shall be hidden on the day of the Lord’s anger”",
          "talmudLocation": "Chagigah 4b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/4b#section-10",
          "talmudFullText": "When R' Ami reached this verse, he cried: “Let him put his mouth in the dust, perhaps there may be hope” (Lamentations 3:29). He said:  A sinner suffers through all this punishment and only perhaps there may be hope? When R' Ami reached this verse, he cried: “Seek righteousness, seek humility; perhaps you shall be hidden on the day of YHWH’s anger”(Zephaniah 2:3). He said: All of this is expected of each individual, and only perhaps God’s anger may be hidden? Likewise, when R' Asi reached this verse, he cried: “Hate the evil, and love the good, and establish justice in the gate; perhaps YHWH, the God of hosts, will be gracious” (Amos 5:15). He said: All of this, and only perhaps? "
        },
        {
          "verseLocation": "Zephaniah 2:3",
          "verseText": "which is written: “Seek the Lord, all the humble of the earth, that have executed [ pa’alu ] His justice”",
          "talmudLocation": "Yevamot 78b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/78b#section-20",
          "talmudFullText": "The Talmud questions this understanding: On one hand, God demands retribution because Saul was not eulogized properly, while on the other hand, He demands retribution because Saul himself put to death the Gibeonites.  The Talmud answers: Yes,  this is how it should be. As Reish Lakish said: What is the meaning of that which is written: “Seek YHWH, all the humble of the earth, that have executed [pa’alu] His justice” (Zephaniah 2:3)? Where mention is made of the justice to be carried out against a person, his good deeds [pa’alo] should be mentioned there as well."
        },
        {
          "verseLocation": "Zephaniah 2:4",
          "verseText": "Rabbi Abbahu said: “And Ekron shall be uprooted”",
          "talmudLocation": "Megillah 6a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/6a#section-12",
          "talmudFullText": "§ The Talmud continues its discussion with regard to identifying places mentioned in the Bible. R' Abbahu said: “And Ekron shall be uprooted” (Zephaniah 2:4). This is an allusion to Caesarea, daughter of Edom, which is situated among the sands.  Caesarea was primarily populated by Greeks and Romans, and it served as the seat of Roman rule when the Romans, who are identified with Edom in Jewish literature, ruled Eretz Yisrael. And it was a spike stuck in the side of the Jewish people already in the days of the Greeks,  as it was an obstacle to the spread of Jewish settlement. When the Hasmonean monarchy prevailed and triumphed over them, they called it: The captured tower of Shir. "
        },
        {
          "verseLocation": "Zephaniah 2:4",
          "verseText": "Pamyas. “Ekron shall be uprooted”",
          "talmudLocation": "Megillah 6a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/6a#section-15",
          "talmudFullText": "R' Yitzḥak said:  “And the children of Dan went up and fought against Leshem” (Joshua 19:47); this is referring to the city that was known in the Talmudic period as Pamyas. “Ekron shall be uprooted” (Zephaniah 2:4); this is referring to Caesarea, the daughter of Edom, which was a metropolis [metropolin],  i.e., a capital city, of kings. There are those who say this means that kings were raised there, and there are those who say it means that kings were appointed from there,  meaning the kings of Edom were appointed from among the residents of this city."
        },
        {
          "verseLocation": "Zephaniah 2:14",
          "verseText": "destruction on the threshold, as it is stated: “Voices shall sing in the windows; desolation shall be in the doorposts; for its cedar work shall be uncovered”",
          "talmudLocation": "Sotah 48a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/48a#section-16",
          "talmudFullText": "Rav said:  The ear that hears song should be uprooted,  as it is prohibited to listen to music after the destruction of the Temple. Rava said:  If there is song in a house there will be destruction on the threshold, as it is stated: “Voices shall sing in the windows; desolation shall be in the doorposts; for its cedar work shall be uncovered” (Zephaniah 2:14). The word “uncovered” [era] could be read to mean: Its city [ira]."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Zephaniah 3:6",
          "verseText": "the Jewish people, as it is stated: “I have cut off nations, their corners are desolate; I have made their streets waste”",
          "talmudLocation": "Yevamot 63a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/63a#section-11",
          "talmudFullText": "R' Elazar bar Avina said: Calamity befalls the world only due to the sins of the Jewish people, as it is stated: “I have cut off nations, their corners are desolate; I have made their streets waste” (Zephaniah 3:6), and it is written: “I said: Surely you will fear Me, you will receive correction” (Zephaniah 3:7). This indicates that other nations were punished so that the Jewish people would mend their ways."
        },
        {
          "verseLocation": "Zephaniah 3:7",
          "verseText": "and it is written: “I said: Surely you will fear Me, you will receive correction”",
          "talmudLocation": "Yevamot 63a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/63a#section-11",
          "talmudFullText": "R' Elazar bar Avina said: Calamity befalls the world only due to the sins of the Jewish people, as it is stated: “I have cut off nations, their corners are desolate; I have made their streets waste” (Zephaniah 3:6), and it is written: “I said: Surely you will fear Me, you will receive correction” (Zephaniah 3:7). This indicates that other nations were punished so that the Jewish people would mend their ways."
        },
        {
          "verseLocation": "Zephaniah 3:9",
          "verseText": "“For then will I turn to the peoples a pure language,",
          "talmudLocation": "Avodah Zarah 24a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/24a#section-16",
          "talmudFullText": "Rav Yosef said: What is the verse from which it is derived that they will convert? The verse states: “For then will I turn to the peoples a pure language,  that they may all call upon the name of YHWH, to serve Him with one consent” (Zephaniah 3:9). This verse indicates that all nations will worship God. Abaye said to him: But perhaps it is only from idol worship that they will withdraw,  while they will still engage in forbidden sexual sex, including bestiality? Rav Yosef said to him:  That cannot be, as it is written at the conclusion of the verse: “To serve Him with one consent, ” which indicates that the non-Jews will accept all of God’s mitzvot."
        },
        {
          "verseLocation": "Zephaniah 3:9",
          "verseText": "will convert, as it is stated: “For then will I turn to the peoples a pure language,",
          "talmudLocation": "Berakhot 57b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/57b#section-20",
          "talmudFullText": "We learned in the Mishnah that one who sees a place from which idolatry was eradicated should recite the blessing: Blessed…Who eradicated idolatry from our land. On this topic A baraita states in the Tosefta: One who sees the idol called Mercury [Markulis] recites: Blessed…who has shown patience to those who violate His will,  as each day new rocks would be thrown upon the pile constructed in Mercury’ honor (Tosafot). One who sees a place from which idolatry was eradicated should recite: Blessed…Who eradicated idolatry from our land. And just as it was eradicated from this place, so too may it be eradicated from all places of Israel, and restore the hearts of their worshippers to worship You. Outside of Eretz Yisrael, one need not recite: And restore the hearts of their worshippers to worship You, since it is predominantly populated by non-Jews. R' Shimon ben Elazar says: Even outside of Eretz Yisrael one is required to recite that formula because in the end of days all nations will convert, as it is stated: “For then will I turn to the peoples a pure language,  that they may all call upon the Name of YHWH, to serve Him with one consent” (Zephaniah 3:9)."
        },
        {
          "verseLocation": "Zephaniah 3:11",
          "verseText": "the Jewish people, as it is stated: “For then I will remove from your midst your proudly exulting ones”",
          "talmudLocation": "Sanhedrin 98a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98a#section-7",
          "talmudFullText": "Ze’eiri says that R' Ḥanina says: The son of David will not come until the arrogant will cease to exist from among the Jewish people, as it is stated: “For then I will remove from your midst your proudly exulting ones” (Zephaniah 3:11), and it is written afterward: “And I will leave in your midst a poor and lowly people, and they shall take refuge in the name of YHWH” (Zephaniah 3:12)."
        },
        {
          "verseLocation": "Zephaniah 3:12",
          "verseText": "“And I will leave in your midst a poor and lowly people, and they shall take refuge in the name of the Lord”",
          "talmudLocation": "Sanhedrin 98a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98a#section-7",
          "talmudFullText": "Ze’eiri says that R' Ḥanina says: The son of David will not come until the arrogant will cease to exist from among the Jewish people, as it is stated: “For then I will remove from your midst your proudly exulting ones” (Zephaniah 3:11), and it is written afterward: “And I will leave in your midst a poor and lowly people, and they shall take refuge in the name of YHWH” (Zephaniah 3:12)."
        },
        {
          "verseLocation": "Zephaniah 3:13",
          "verseText": "as it is written: “The remnant of Israel shall not do iniquity, nor speak lies, neither shall a deceitful tongue be found in their mouth”",
          "talmudLocation": "Bava Metzia 106b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/106b#section-17",
          "talmudFullText": "Talmud:  Rav Ḥisda said: What is the reason of the ruling of Rabban Shimon ben Gamliel?  The landowner has apparently suffered no loss from the cultivator’s actions. His reasoning is as it is written: “The remnant of Israel shall not do iniquity, nor speak lies, neither shall a deceitful tongue be found in their mouth” (Zephaniah 3:13). In other words, one may not retract from an obligation accepted upon oneself, even if no one suffers as a result."
        },
        {
          "verseLocation": "Zephaniah 3:13",
          "verseText": "Abaye said: It is written: “The remnant of Israel shall not do iniquity, nor speak lies”",
          "talmudLocation": "Kiddushin 45b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/45b#section-5",
          "talmudFullText": "The Talmud assumes that the father did not desire this betrothal. Why? Abaye said: It is written: “The remnant of Israel shall not do iniquity, nor speak lies” (Zephaniah 3:13). The father had agreed that she would marry his wife’s relative, and he would stand by his word. Since the betrothal of his minor daughter is dependent on his desire, there is no concern that the father desired his relative’s betrothal. Rava said a different reason: There is a presumption that a person does not take the trouble of preparing a meal and then cause it to be lost.  Since he prepared a festive meal in honor of his daughter’s betrothal to his wife’s relative, he would not desire a betrothal that would render his efforts for naught."
        },
        {
          "verseLocation": "Zephaniah 3:13",
          "verseText": "release him, as it is written: “The remnant of Israel will not do iniquity nor speak lies”",
          "talmudLocation": "Pesachim 91a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/91a#section-4",
          "talmudFullText": "Talmud:  The Mishnah teaches that the Paschal lamb may be slaughtered on behalf of a prisoner only if he is included in a group with other people. Rabba bar Huna said that R' Yoḥanan said: They taught this only if he is in a prison belonging to non-Jews; but if he is in a prison belonging to Jews, one slaughters on his behalf even if he is by himself and not included in a group with other people. Since they promised him they would release him they will certainly release him, as it is written: “The remnant of Israel will not do iniquity nor speak lies” (Zephaniah 3:13). Therefore, there is no concern that on the night of Passover he will not be able to partake of the Paschal lamb."
        },
        {
          "verseLocation": "Zephaniah 3:15",
          "verseText": "as it is written: “The Lord has removed your judgments; cast out your enemy”",
          "talmudLocation": "Sanhedrin 98a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98a#section-9",
          "talmudFullText": "Ulla says: Jerusalem is redeemed only by means of righteousness, as it is stated: “Zion shall be redeemed with justice and those who return to it with righteousness” (Isaiah 1:27). Rav Pappa says: If the arrogant will cease to exist, the Persian sorcerers will cease to exist as well. If the deceitful judges will cease to exist, the royal officers [gazirpatei] and taskmasters will cease to exist. Rav Pappa elaborates: If the arrogant will cease, the Persian sorcerers will cease, as it is written: “And I will purge away your dross [sigayikh] as with lye, and I will remove all your alloy [bedilayikh]. ” When the arrogant [sigim] are purged, the sorcerers, who are separated [muvdalim] from the fear of God, will also cease. And if the deceitful judges cease to exist, the royal officers and taskmasters will cease to exist, as it is written: “YHWH has removed your judgments; cast out your enemy” (Zephaniah 3:15)."
        },
        {
          "verseLocation": "Zephaniah 3:15",
          "verseText": "cease, as it is written: “The Lord has removed your judgment, cast out your enemy”",
          "talmudLocation": "Shabbat 139a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/139a#section-8",
          "talmudFullText": "He said: If the deceitful judges cease, the royal officers and taskmasters will cease, as it is written: “YHWH has removed your judgment, cast out your enemy” (Zephaniah 3:15)."
        },
        {
          "verseLocation": "Zephaniah 3:18",
          "verseText": "according to Rabbi Yehuda, the verse states: “Those who are destroyed [ nugei ] far from the Festivals, I shall gather from you,",
          "talmudLocation": "Berakhot 28a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/28a#section-18",
          "talmudFullText": "R' Yehoshua ben Levi said:  With regard to anyone who recites the additional prayer after seven hours of the day, according to R' Yehuda, the verse states: “Those who are destroyed [nugei] far from the Festivals, I shall gather from you,  they who carried for you the burden of insult” (Zephaniah 3:18). From where may it be inferred that nugei is an expression of destruction? As Rav Yosef translated the verse into Aramaic: Destruction comes upon the enemies of the house of Israel,  a euphemism for Israel itself, for they have delayed the times of the Festivals in Jerusalem.  This proves both that nugei means destruction and that destruction comes upon those who fail to fulfill a mitzva at its appointed time."
        },
        {
          "verseLocation": "Zephaniah 3:18",
          "verseText": "according to Rabbi Yehuda, the verse states: “Those who are in sorrow [ nugei ] far from the Festivals, I shall gather from you,",
          "talmudLocation": "Berakhot 28a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/28a#section-19",
          "talmudFullText": "Similarly, R' Elazar said: Regarding anyone who recites the morning prayer after four hours of the day, according to R' Yehuda, the verse states: “Those who are in sorrow [nugei] far from the Festivals, I shall gather from you,  they who carried for you the burden of insult” (Zephaniah 3:18). From where may it be inferred that nugei is an expression of sorrow? As it is written: “My soul drips in sorrow [tuga]” (Psalms 119:28). Rav Naḥman bar Yitzḥak said:  The proof that nugei indicates suffering is from here: “Her virgins are sorrowed [nugot] and she is embittered” (Lamentations 1:4)."
        }
      ]
    }
  ]
}