{
  "bookName": "1 Chronicles",
  "totalEntries": 109,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "1 Chronicles 1:27",
          "verseText": "“Abram is Abraham”",
          "talmudLocation": "Berakhot 13a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/13a#section-4",
          "talmudFullText": "Having mentioned the changing of Jacob’s name, the Talmud addresses the changing of the names of Abraham and Sarah. What is the meaning of changing Abram’s name to Abraham? As it is stated: <b>“Abram is Abraham”</b> (I Chronicles 1:27)."
        },
        {
          "verseLocation": "1 Chronicles 1:27",
          "verseText": "“Abram, this is [ hu ] Abraham”",
          "talmudLocation": "Megillah 11a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-18",
          "talmudFullText": "The Talmud continues: The word <i>hu</i> is also used to recognize sustained righteousness. <b>“Abram, this is [<i>hu</i>] Abraham”</b> (I Chronicles 1:27); this indicates that Abraham didn’t change, as <b>he</b> remained <b>in his righteousness from beginning to end. </b> Similarly, <b>“This is [<i>hu</i>] Aaron and Moses”</b> (Exodus 6:26); <b>they remained in their righteousness from</b> the <b>beginning</b> of their life <b>to</b> the <b>end</b> of their life. Similarly, with respect to David: <b>“And David, this was [<i>hu</i>] the youngest”</b> (I Samuel 17:14), indicates that <b>he remained in his humility from beginning to end. Just as in his youth, </b> when he was still an ordinary individual, <b>he humbled himself before anyone who was greater than him in Torah, so too, in his kingship, he humbled himself before anyone who was greater than him in wisdom. </b>"
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "1 Chronicles 2:6",
          "verseText": "it is written: “And the sons of Zerah were Zimri and Ethan and Heman and Calcol and Dara, five of them in all”",
          "talmudLocation": "Sanhedrin 44b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44b#section-8",
          "talmudFullText": "§ The Mishnah teaches: <b>From where</b> is it derived <b>that</b> Achan’s <b>confession achieved atonement for him? A baraita states</b> likewise in a <i>baraita</i>: <b>From where</b> is it derived <b>that</b> Achan’s <b>confession achieved atonement</b> for him? <b>As it is stated: “And Joshua said: Why have you brought trouble on us? YHWH shall trouble you this day”</b> (Joshua 7:25). Joshua said to Achan: <b>On this day</b> of your judgment <b>you are troubled, but you will not be troubled in the World-to-Come. And</b> elsewhere <b>it is written: “And the sons of Zerah were Zimri and Ethan and Heman and Calcol and Dara, five of them in all”</b> (I Chronicles 2:6). <b>What</b> do the words <b>“five of them in all”</b> serve to teach? <b>All five</b> sons <b>are</b> destined <b>to</b> receive a share in <b>the World-to-Come. </b> According to the rabbis, Zimri is Achan, son of Zerah, as will be explained. Since Achan has a share in the World-to-Come, his confession must have achieved atonement for him."
        },
        {
          "verseLocation": "1 Chronicles 2:6",
          "verseText": "it is written: “Zimri,”",
          "talmudLocation": "Sanhedrin 44b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/44b#section-9",
          "talmudFullText": "In one place, among the five sons of Zerah, <b>it is written: “Zimri, ”</b> without any mention of Achan (I Chronicles 2:6), <b>and</b> in another place <b>it is written: </b> “And Joshua took <b>Achan, </b> son of Zerah” (Joshua 7:24). <b>Rav and Shmuel</b> both say that Zimri and Achan are one and the same, but they disagree about his real name. <b>One</b> of them <b>says: His</b> real <b>name was Achan. Why</b> then <b>was he called Zimri? </b> He was called Zimri <b>because he acted like Zimri, </b> i.e., just as Zimri had sex with a Midianite woman, Achan had sex with a betrothed young woman. <b>And</b> the other <b>one says: His</b> real <b>name was Zimri. Why</b> then <b>was he called Achan? </b> He was called Achan <b>because he acted like a snake [<i>she’iken</i>]</b> and caused the punishment <b>of the sins of the Jewish people. </b>"
        },
        {
          "verseLocation": "1 Chronicles 2:8",
          "verseText": "“And the sons of Ethan: Azariah”",
          "talmudLocation": "Bava Batra 143b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/143b#section-6",
          "talmudFullText": "<b>Abaye said: Come</b> and <b>hear</b> a proof that one does refer to a single son using the plural term sons, as it is written: <b>“And the sons of Dan: Hushim”</b> (Genesis 46:23). <b>Rava said to</b> Abaye: <b>Perhaps</b> this verse should be understood <b>as the school of Ḥizkiyya taught, </b> that Hushim is not the name of Dan’s son but <b>that they, </b> Dan’s sons, <b>were as numerous as</b> the <b>groups [<i>ḥushim</i>] of reeds. Rather, Rava said: </b> One can prove this usage of the term sons in the verse: <b>“And the sons of Pallu: Eliab”</b> (Numbers 26:8). <b>Rav Yosef said: </b> This can be proven from another verse: <b>“And the sons of Ethan: Azariah”</b> (I Chronicles 2:8)."
        },
        {
          "verseLocation": "1 Chronicles 2:16",
          "verseText": "the daughter of Nahash? Was she not the daughter of Yishai, as it is written: “And their sisters were Zeruiah and Abigail”",
          "talmudLocation": "Bava Batra 17a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/17a#section-6",
          "talmudFullText": "<b>A baraita states</b> in a <i>baraita</i>: There were <b>four</b> people <b>who died</b> only <b>because of the counsel of the</b> primordial <b>snake, </b> in the wake of which all of humanity became mortal, and not on account of any personal sin. <b>And they are: Benjamin, son of Jacob; Amram, father of Moses; Yishai, father of David; and Chileab, son of David. And all of these are known through tradition except for Yishai, father of David, with regard to</b> whom <b>it is written explicitly: “And Absalom placed Amasa over the army instead of Joab, and Amasa was the son of a man whose name was Ithra the Israelite, who had sex with Abigail, daughter of Nahash, the sister of Zeruiah, mother of Joab”</b> (II Samuel 17:25). <b>But was</b> Abigail <b>the daughter of Nahash? Was she not the daughter of Yishai, as it is written: “And their sisters were Zeruiah and Abigail”</b> (I Chronicles 2:16)? <b>Rather, </b> she was called “daughter of Nahash” to indicate that <b>she was the daughter of one who died</b> only <b>because of the counsel of the snake. </b>"
        },
        {
          "verseLocation": "1 Chronicles 2:17",
          "verseText": "“Jether the Ishmaelite”",
          "talmudLocation": "Yevamot 77a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/77a#section-1",
          "talmudFullText": "<b>Doeg raised before them all those objections</b> from the others who are disqualified from entering into the congregation, and <b>they were silent, </b> not knowing how to respond. Doeg then <b>wanted to proclaim</b> that David was disqualified from entering into the congregation. He was <b>immediately</b> answered. Here it says: <b>“Now Amasa was the son of a man, whose name was Jithra the Israelite, that went into Abigal the daughter of Nahash”</b> (II Samuel 17:25), <b>and</b> yet elsewhere <b>it is written</b> that Amasa’s father was named <b>“Jether the Ishmaelite”</b> (I Chronicles 2:17). <b>Rava said: </b> This <b>teaches that he girded his sword like Ishmael, </b> i.e., like an Arab, <b>and said: Whoever does not accept this <i>halakha</i></b> and act accordingly <b>shall be stabbed with the sword. This is</b> the tradition that <b>I received from the court of Samuel from Rama: An Ammonite</b> man is prohibited from entering into the congregation, <b>but not an Ammonite woman; a Moabite</b> man is prohibited from entering into the congregation, <b>but not a Moabite woman. </b>"
        },
        {
          "verseLocation": "1 Chronicles 2:18",
          "verseText": "“And Caleb, the son of Hezron, begot children of Azubah his wife, and of Jerioth, and these were her sons: Jesher, and Shobab, and Ardon”",
          "talmudLocation": "Sotah 11b:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11b#section-23",
          "talmudFullText": "The Talmud discusses the family of Caleb: In Chronicles it says: <b>“And Caleb, the son of Hezron, begot children of Azubah his wife, and of Jerioth, and these were her sons: Jesher, and Shobab, and Ardon”</b> (I Chronicles 2:18). The Talmud asks: Was Caleb actually the <b>son of Hezron? Wasn’t he</b> the <b>son of Jephunneh, </b> as the verse states in Numbers 13:6? The Talmud answers: He was the son of Hezron, but he is called “son of Jephunneh” as an appellation indicating that he was <b>a son who turned away [<i>sheppana</i>] from the counsel of the spies. </b>"
        },
        {
          "verseLocation": "1 Chronicles 2:18",
          "verseText": "begot children [ holid ]",
          "talmudLocation": "Sotah 12a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/12a#section-2",
          "talmudFullText": "The verse states: “And Caleb, the son of Hezron, begot children of Azubah his wife, and of Jerioth, and these were her sons: Jesher, and Shobab, and Ardon” (I Chronicles 2:18). The Talmud analyzes the verse: The verse refers to the wife of Caleb by the name <b>Azubah. </b> The rabbis teach that <b>this</b> is <b>Miriam. And why is she called Azubah? As everyone initially abandoned her [<i>azavuha</i>]</b> and did not want to marry her because she was sickly and unattractive. The verse additionally states: “And Caleb, the son of Hezron, <b>begot children [<i>holid</i>]</b> of Azubah his wife” (I Chronicles 2:18). The Talmud asks: Why use the term “<i>holid</i>,” begot children? <b>But</b> doesn’t this verse state that <b>he married her? R' Yoḥanan says: </b> This teaches us that with regard to <b>anyone who marries a woman for the sake of Heaven, </b> as he married her due to her righteousness without concern for her appearance, <b>the verse ascribes him</b> credit <b>as if he gave birth to her. </b>"
        },
        {
          "verseLocation": "1 Chronicles 2:18",
          "verseText": "he the son of Kenaz? He was the son of Hezron, as it is written: “And Caleb, son of Hezron, begot children of Azubah",
          "talmudLocation": "Temurah 16a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/16a#section-13",
          "talmudFullText": "The Talmud further asks: <b>But still, </b> was <b>he the son of Kenaz? He was the son of Hezron, as it is written: “And Caleb, son of Hezron, begot children of Azubah</b> his wife, and of Jerioth, and these were her sons: Jesher, and Shobab, and Ardon” (I Chronicles 2:18). <b>Rava said: </b> Caleb was actually the son of Hezron, but after his father passed away his mother remarried Kenaz, and consequently <b>he was the stepson of Kenaz. </b> Othniel, son of Kenaz, was therefore his maternal half brother."
        },
        {
          "verseLocation": "1 Chronicles 2:19",
          "verseText": "also comes from Miriam, as it is written: “And Azubah,” the wife of Caleb, “died, and Caleb took to him Ephrath, who bore him Hur”",
          "talmudLocation": "Sotah 11b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11b#section-22",
          "talmudFullText": "The verse relates the midwives’ reward: <b>“And it came to pass, because the midwives feared God, that He made them houses”</b> (Exodus 1:21). <b>Rav and Shmuel</b> disagree as to the precise interpretation of these houses: <b>One says</b> that God made <b>the houses of</b> the <b>priesthood and</b> the <b>Levites</b> descend from the midwives, <b>and one says</b> that God made the <b>houses of royalty</b> descend from them. <b>The one who says</b> that it is referring to the <b>houses of</b> the <b>priesthood and</b> the <b>Levites</b> is referring to <b>Aaron and Moses, </b> who were sons of Jochebed. <b>And the one who says</b> that it is referring to <b>houses of royalty</b> is referring to <b>David, </b> who <b>also comes from Miriam, as it is written: “And Azubah, ” the wife of Caleb, “died, and Caleb took to him Ephrath, who bore him Hur”</b> (I Chronicles 2:19) and, as will be explained further, Ephrath is Miriam. <b>And it is written: “David was the son of that Ephrathite</b> of Bethlehem in Judah” (I Samuel 17:12). Therefore, he was a descendant of Miriam."
        },
        {
          "verseLocation": "1 Chronicles 2:21",
          "verseText": "from here: “And afterward Hezron went in to the daughter of Machir, the father of Gilead…and she bore him Segub”",
          "talmudLocation": "Yevamot 62b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/62b#section-7",
          "talmudFullText": "<b>Rather, </b> the proof is <b>from here: “And afterward Hezron went in to the daughter of Machir, the father of Gilead…and she bore him Segub”</b> (I Chronicles 2:21), <b>and it is written: “Out of Machir came down governors”</b> (Judges 5:14), <b>and it is written: “Judah is my governor”</b> (Psalms 60:9). Consequently, the governors, who were from the tribe of Judah, were also called the sons of Machir, who was from the tribe of Manasseh. This must be because they were the children of Machir’s daughter and Hezron, indicating that grandchildren are considered like children."
        },
        {
          "verseLocation": "1 Chronicles 2:22",
          "verseText": "states: “And Seguv begot Yair, who had twenty-three cities in the land of Gilead”",
          "talmudLocation": "Bava Batra 111b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/111b#section-15",
          "talmudFullText": "R' Yishmael continues. <b>And</b> the verse in the Writings <b>states: “And Seguv begot Yair, who had twenty-three cities in the land of Gilead”</b> (I Chronicles 2:22)."
        },
        {
          "verseLocation": "1 Chronicles 2:22",
          "verseText": "“And Seguv begot Yair”",
          "talmudLocation": "Bava Batra 112a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/112a#section-5",
          "talmudFullText": "<b>And if you would say</b> that Pinehas did not inherit this land from his wife, but from his mother, as <b>it was Elazar, </b> his father, <b>who married a woman</b> who inherited land, <b>and she</b> subsequently <b>died, and</b> her son <b>Pinehas inherited</b> from <b>her</b> so that this verse proves the inheritance of a son and not that of a husband; therefore, <b>come</b> and <b>hear</b> a proof from the verse: <b>“And Seguv begot Yair”</b> (I Chronicles 2:22)."
        },
        {
          "verseLocation": "1 Chronicles 2:22",
          "verseText": "As it is stated: “And Seguv begot Yair, who had twenty three cities in the land of Gilead”",
          "talmudLocation": "Bava Batra 113a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/113a#section-6",
          "talmudFullText": "§ <b>R' Abbahu says</b> that <b>R' Yoḥanan says</b> that <b>R' Yannai says</b> that <b>R'</b> Yehuda HaNasi <b>says, and</b> some <b>determined it</b> was <b>in the name of R' Yehoshua ben Korḥa: From where</b> is it derived <b>that a husband</b> who inherits from his wife does not <b>take in</b> inheritance the property <b>due</b> to the deceased <b>as</b> he does the property she <b>possessed? </b> Instead of the husband inheriting the property that was due to her, that property is inherited by her other relatives, such as her son, or other relatives of her father. <b>As it is stated: “And Seguv begot Yair, who had twenty three cities in the land of Gilead”</b> (I Chronicles 2:22). The Talmud asks: <b>From where</b> did <b>Yair have</b> land <b>that</b> his father, <b>Seguv, did not have? Rather, </b> this <b>teaches that Seguv married a woman and she died in the lifetime of her</b> potential <b>legators, and her legators</b> then <b>died, and Yair, </b> her son, not Seguv, her husband, <b>inherited</b> these inheritances from <b>her. </b>"
        },
        {
          "verseLocation": "1 Chronicles 2:55",
          "verseText": "in the Chamber of Hewn Stone. As it is stated: “And the families of the scribes who dwelt in Jabez; the Tirathites, the Shimeathites, the Sucathites. These were the Kenites who came of Hammath, father of the house of Rechab”",
          "talmudLocation": "Sanhedrin 104a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/104a#section-2",
          "talmudFullText": "<b>And</b> the fact that it <b>draws near the distant</b> is derived <b>from Yitro, as R' Yoḥanan says: In reward</b> for Yitro telling his daughters: <b>“Call him, that he may eat bread”</b> (Exodus 2:20), inviting Moses to join them for a meal, Yitro’s <b>descendants were privileged and sat</b> as scribes in session with the Sanhedrin <b>in the Chamber of Hewn Stone. As it is stated: “And the families of the scribes who dwelt in Jabez; the Tirathites, the Shimeathites, the Sucathites. These were the Kenites who came of Hammath, father of the house of Rechab”</b> (I Chronicles 2:55). <b>And it is written there</b> with regard to the identity of the Kenites: <b>“And the children of the Kenite, Moses’ father-in-law, went up from the city of the palm trees with the children of Judah into the wilderness of Judah, which is in the south of Arad; and they went and dwelt with the people”</b> (Judges 1:16)."
        },
        {
          "verseLocation": "1 Chronicles 2:55",
          "verseText": "in the Chamber of Hewn Stone, as it is stated: “And the families of the scribes who dwelt in Jabez; the Tirathites, the Shimeathites, the Sucathites. These were the Kenites who came of Hammath the father of the house of Rechab”",
          "talmudLocation": "Sanhedrin 106a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106a#section-4",
          "talmudFullText": "The Talmud comments: <b>And that is what R' Ḥiyya bar Abba says</b> that <b>R' Simai says: Three were</b> associates <b>in that counsel, and they are: Balaam, Job, and Yitro. Balaam, who advised</b> to drown the newborn males, <b>was killed. Job, who was silent</b> and was reluctant to express his opinion, <b>was sentenced to</b> suffer <b>afflictions. And Yitro, who fled</b> after he disagreed with that counsel and Pharaoh sought to kill him, <b>his descendants were privileged to sit</b> as scribes in session with the Sanhedrin <b>in the Chamber of Hewn Stone, as it is stated: “And the families of the scribes who dwelt in Jabez; the Tirathites, the Shimeathites, the Sucathites. These were the Kenites who came of Hammath the father of the house of Rechab”</b> (I Chronicles 2:55). <b>And it is written there</b> with regard to the identity of the Kenites: <b>“And the children of the Kenite, Moses’ father-in-law, went up from the city of the palm trees”</b> (Judges 1:16)."
        },
        {
          "verseLocation": "1 Chronicles 2:55",
          "verseText": "in the Chamber of Hewn Stone, as it is stated: “And the families of scribes who dwelt at Jabez, Tirathites, Shimeathites, and Sucathites, these were the Kenites who descended from Hammath, the father of the house of Rechab”",
          "talmudLocation": "Sotah 11a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/11a#section-13",
          "talmudFullText": "R' Ḥiyya bar Abba teaches what occurred to each of them: <b>Balaam, who advised</b> Pharaoh to kill all sons born to the Jewish people, <b>was</b> punished by being <b>killed</b> in the war with Midian (see Numbers 31:8). <b>Job, who was silent</b> and neither advised nor protested, <b>was punished by suffering, </b> as detailed in the eponymous book in the Bible. <b>Yitro, who ran away</b> as a sign of protest, <b>merited that</b> some <b>of his children’s children sat</b> in the Sanhedrin <b>in the Chamber of Hewn Stone, as it is stated: “And the families of scribes who dwelt at Jabez, Tirathites, Shimeathites, and Sucathites, these were the Kenites who descended from Hammath, the father of the house of Rechab”</b> (I Chronicles 2:55). <b>And it is written: “The children of the Kenite, Moses’ father-in-law”</b> (Judges 1:16). This teaches that the Kenites, descendants of Yitro, the father-in-law of Moses, dwelt at Jabez [Yabetz], referring to the place where the Jewish people go for advice [<i>eitza</i>], i.e., the Chamber of Hewn Stone."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "1 Chronicles 3:15",
          "verseText": "But isn’t it written: “And the sons of Josiah: The firstborn Johanan, the second Jehoiakim, the third Zedekiah, the fourth Shallum”",
          "talmudLocation": "Horayot 11b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/11b#section-15",
          "talmudFullText": "The <i>baraita</i> teaches: <b>And</b> they anointed <b>Jehoahaz due to Jehoiakim, who was two years older than he</b> was. The Talmud asks: <b>And was</b> Jehoiakim <b>older than</b> Jehoahaz? <b>But isn’t it written: “And the sons of Josiah: The firstborn Johanan, the second Jehoiakim, the 3rd Zedekiah, the 4th Shallum”</b> (I Chronicles 3:15), <b>and R' Yoḥanan says: He is Shallum, he is Zedekiah; </b> these are two names for one person. Likewise, <b>he is Johanan, he is Jehoahaz, </b> who is mentioned in the book of Kings. Since Jehoahaz was the eldest, why was it necessary to anoint him? The Talmud answers: <b>Actually, Jehoiakim</b> was <b>older</b> than Jehoahaz. <b>And what</b> is the meaning of the term <b>“firstborn”</b> written with regard to Jehoahaz? It means that his status was like that of <b>a firstborn</b> in terms of ascent <b>to the kingship. </b>"
        },
        {
          "verseLocation": "1 Chronicles 3:15",
          "verseText": "But isn’t it written: “And the sons of Josiah: The firstborn Johanan, the second Jehoiakim, the third Zedekiah, the fourth Shallum”",
          "talmudLocation": "Keritot 5b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/5b#section-11",
          "talmudFullText": "It was further stated in the <i>baraita</i>: <b>And Jehoahaz, </b> son of Josiah, was anointed <b>due to</b> the competition from <b>Jehoiakim, his brother, who was two years older than him. </b> The Talmud asks: <b>And was</b> Jehoiakim in fact <b>older</b> than Jehoahaz? <b>But isn’t it written: “And the sons of Josiah: The firstborn Johanan, the second Jehoiakim, the 3rd Zedekiah, the 4th Shallum”</b> (I Chronicles 3:15); <b>and R' Yoḥanan says: </b> The one who is called Johanan in that verse <b>is</b> also called <b>Jehoahaz, </b> and the one who <b>is</b> called <b>Zedekiah is</b> the same as the one called <b>Shallum. </b> If so, Jehoahaz is the eldest son, not Jehoiakim. Why, then, was it necessary to anoint Jehoahaz?"
        },
        {
          "verseLocation": "1 Chronicles 3:17",
          "verseText": "was exiled it is written: “And the sons of Jeconiah, the same is Assir, Shealtiel his son”",
          "talmudLocation": "Sanhedrin 37b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/37b#section-14",
          "talmudFullText": "<b>R' Yoḥanan says: Exile atones for all</b> transgressions and renders a sinner like a new person, <b>as it is stated</b> concerning the king Jeconiah, a descendant of King David: <b>“So says YHWH: Write you this man childless, a man that shall not prosper in his days; for no man of his seed shall prosper, sitting upon the throne of David, and ruling anymore in Judah”</b> (Jeremiah 22:30). <b>And after</b> Jeconiah <b>was exiled it is written: “And the sons of Jeconiah, the same is Assir, Shealtiel his son”</b> (I Chronicles 3:17). The verse employs the plural “sons of” although he had only one son, Shealtiel. <b>“Assir, ”</b> literally, prisoner, teaches <b>that his mother conceived him in prison. “Shealtiel, ”</b> literally, planted by God, teaches <b>that God planted him in a way atypical of</b> most <b>plants [<i>hanishtalin</i>], </b> i.e., people. It <b>is learned</b> as a tradition <b>that a woman does not conceive</b> when she is <b>standing</b> during sex,"
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "1 Chronicles 4:5",
          "verseText": "“And Ashhur the father of Tekoa had two wives, Helah and Naarah”",
          "talmudLocation": "Sotah 12a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/12a#section-5",
          "talmudFullText": "The Talmud interprets an additional verse as referring to Caleb. It is stated: <b>“And Ashhur the father of Tekoa had two wives, Helah and Naarah”</b> (I Chronicles 4:5). <b>Ashhur is Caleb. And why was he called Ashhur? Because his face became blackened [<i>husheḥaru</i>] from</b> the extensive <b>fasts</b> that he accepted upon himself so that he would not be entrapped by the counsel of the spies. <b>“The father of”</b> is also referring to Caleb, <b>as he became like a father to</b> his wife. The next word in the verse, <b>“Tekoa, ”</b> is an additional reference to Caleb, <b>as he attached [<i>taka</i>] his heart to his Father in Heaven. </b>"
        },
        {
          "verseLocation": "1 Chronicles 4:7",
          "verseText": "“And the children of Helah were Zereth [ Tzeret ] and Zohar and Ethnan”",
          "talmudLocation": "Sotah 12a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/12a#section-7",
          "talmudFullText": "The Talmud expounds the following verse as referring to Miriam: <b>“And the children of Helah were Zereth [<i>Tzeret</i>] and Zohar and Ethnan”</b> (I Chronicles 4:7). She was now called <b>“<i>Tzeret</i>, ” for she became</b> so beautiful that she was like <b>a rival [<i>tzara</i>] to other</b> women, as they were jealous of her beauty. She is called <b>“Zohar, ” as her face</b> shined <b>like</b> the sun does at <b>noon [<i>tzohorayim</i>]. </b> She is called <b>“Ethnan, ” as any</b> man <b>that saw her</b> would be aroused so much that he <b>would bring a gift [<i>etnan</i>] to his wife</b> to entice her."
        },
        {
          "verseLocation": "1 Chronicles 4:10",
          "verseText": "that God answered him? As it is written: “And Jabez called on the God of Israel, saying: If You will bless me indeed, and enlarge my border, and that Your hand may be with me, and that You will work deliverance from evil, that it may not pain me! And God granted him that which he requested”",
          "talmudLocation": "Temurah 16a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/16a#section-15",
          "talmudFullText": "The Talmud asks: <b>And from where do we</b> derive <b>that God answered him? As it is written: “And Jabez called on the God of Israel, saying: If You will bless me indeed, and enlarge my border, and that Your hand may be with me, and that You will work deliverance from evil, that it may not pain me! And God granted him that which he requested”</b> (I Chronicles 4:10)."
        },
        {
          "verseLocation": "1 Chronicles 4:18",
          "verseText": "“And his wife HaYehudiyya bore Jered the father of Gedor, and Heber the father of Soco, and Jekuthiel the father of Zanoah. And these are the sons of Bithiah the daughter of Pharaoh, whom Mered took”",
          "talmudLocation": "Megillah 13a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-3",
          "talmudFullText": "§ Incidental to the exposition of the word <i>Yehudi</i> as one who repudiates idolatry, the Talmud relates that <b>when R' Shimon ben Pazi introduced</b> his exposition of <b>the book of Chronicles, he</b> addressed the book of Chronicles and <b>said as follows: All of your words are one, and we know how to expound them. </b> This introduction made reference to the fact that the book of Chronicles cannot always be interpreted literally but requires exposition, as the same individual might be called by various different names, as in the following verse: <b>“And his wife <i>HaYehudiyya</i> bore Jered the father of Gedor, and Heber the father of Soco, and Jekuthiel the father of Zanoah. And these are the sons of Bithiah the daughter of Pharaoh, whom Mered took”</b> (I Chronicles 4:18)."
        },
        {
          "verseLocation": "1 Chronicles 4:18",
          "verseText": "and these are the sons of Bithiah, daughter of Pharaoh, whom Mered took”",
          "talmudLocation": "Sanhedrin 19b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-15",
          "talmudFullText": "<b>R' Yoḥanan says: </b> Proof for the aforementioned statement can be derived <b>from here: “And his wife Hajehudijah gave birth to Jered the father of Gedor, </b> and Heber the father of Soco, and Jekuthiel the father of Zanoah, <b>and these are the sons of Bithiah, daughter of Pharaoh, whom Mered took”</b> (I Chronicles 4:18). <b>Mered is Caleb, and why was his name called Mered? Because he rebelled [<i>marad</i>] against the counsel of the spies. </b> And according to the midrash, Jered, Heber, and Jekuthiel all refer to Moses our teacher. <b>And did Bithiah give birth</b> to Moses? <b>But didn’t Jochebed give birth</b> to him? <b>Rather, Jochebed gave birth</b> to him <b>and Bithiah raised</b> him. <b>Therefore, he was called by her name</b> as though she had given birth to him."
        },
        {
          "verseLocation": "1 Chronicles 4:22",
          "verseText": "“Joash and Saraph,",
          "talmudLocation": "Bava Batra 91b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/91b#section-7",
          "talmudFullText": "The Talmud returns to its discussion of the story of Ruth. <b>It is written: “Mahlon and Chilion”</b> (Ruth 1:2), <b>and it is written</b> elsewhere: <b>“Joash and Saraph, </b> who had dominion in Moab” (I Chronicles 4:22). Apparently, both names refer to the same individuals who married Moabite wives. <b>Rav and Shmuel</b> disagreed with regard to their true names. <b>One says: Their</b> given <b>names were Mahlon and Chilion, and why were they called</b> by the <b>names Saraph and Joash? </b> One was called <b>Joash [<i>yoash</i>] because they despaired [<i>nitya’ashu</i>] of the redemption</b> of Eretz Yisrael, as they established themselves in Moab and lived there for many years. The other was called <b>Saraph, because they were liable</b> to receive the punishment of <b>burning [<i>sereifa</i>] for</b> their sins against <b>God, </b> because they left their community."
        },
        {
          "verseLocation": "1 Chronicles 4:22",
          "verseText": "which is written: “And Jokim, and the men of Cozeba, and Joash, and Saraph, who had dominion in Moab, and Jashubi Lehem. And the matters are ancient”",
          "talmudLocation": "Bava Batra 91b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/91b#section-9",
          "talmudFullText": "The Talmud notes: It <b>is taught</b> in a <i>baraita</i> <b>in accordance with the one who says</b> that <b>their</b> given <b>names were Mahlon and Chilion. As it is taught</b> in a <i>baraita</i>: <b>What</b> is the meaning of that <b>which is written: “And Jokim, and the men of Cozeba, and Joash, and Saraph, who had dominion in Moab, and Jashubi Lehem. And the matters are ancient”</b> (I Chronicles 4:22)? <b>“And Jokim, ” this</b> refers to <b>Joshua, who established [<i>shehekim</i>]</b> and kept the <b>oath with people of Gibeon</b> (see Joshua, chapter 9). <b>“And the men of Cozeba, ” these are the men of Gibeon, who lied [<i>shekizevu</i>] to Joshua</b> by saying that they came from a distant land. <b>“And Joash, and Saraph, ” these are Mahlon and Chilion. And why were they called</b> by the <b>names Joash and Saraph? </b> One was called <b>Joash because they despaired [<i>shenitya’ashu</i>] of the redemption; </b> the other was called <b>Saraph because they were liable</b> to receive the punishment of <b>burning [<i>sereifa</i>] for</b> their sins against <b>God. </b>"
        },
        {
          "verseLocation": "1 Chronicles 4:23",
          "verseText": "“These were the potters, and those who dwelt among plantations and hedges; there they dwelt occupied in the king’s work”",
          "talmudLocation": "Bava Batra 91b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/91b#section-11",
          "talmudFullText": "The Talmud cites a <i>baraita</i> that analyzes the next verse: <b>“These were the potters, and those who dwelt among plantations and hedges; there they dwelt occupied in the king’s work”</b> (I Chronicles 4:23). <b>“These were the potters [<i>yotzerim</i>], ” these are the sons of Jonadab, son of Rechab, who kept [<i>natzeru</i>] their father’s oath. </b>"
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "1 Chronicles 5:1",
          "verseText": "“But, inasmuch as he defiled his father’s couch,",
          "talmudLocation": "Bava Batra 123a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/123a#section-11",
          "talmudFullText": "§ <b>R' Ḥelbo asked R' Shmuel bar Naḥmani: What did Jacob see that he took</b> the status as <b>firstborn from Reuben and gave it to Joseph? </b> The Talmud wonders: What does he mean, <b>what did</b> he <b>see? </b> The matter is <b>written</b> explicitly: <b>“But, inasmuch as he defiled his father’s couch, </b> his birthright was given to the sons of Joseph” (I Chronicles 5:1). <b>Rather, </b> R' Ḥelbo’s question was: <b>What did he see that he gave it</b> specifically <b>to Joseph? </b>"
        },
        {
          "verseLocation": "1 Chronicles 5:1",
          "verseText": "states: “And the sons of Reuben the firstborn of Israel, for he was the firstborn; but, inasmuch as he defiled his father’s couch, his birthright [ bekhorato ] was given to the sons of Joseph the son of Israel, yet not so that he was to be reckoned in the genealogy as firstborn”",
          "talmudLocation": "Bava Batra 123a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/123a#section-4",
          "talmudFullText": "The <i>baraita</i> reinforces this statement by citing additional verses: <b>And</b> the verse <b>states: “And the sons of Reuben the firstborn of Israel, for he was the firstborn; but, inasmuch as he defiled his father’s couch, his birthright [<i>bekhorato</i>] was given to the sons of Joseph the son of Israel, yet not so that he was to be reckoned in the genealogy as firstborn”</b> (I Chronicles 5:1). <b>And</b> the following verse <b>states: “For Judah prevailed above his brothers, and the prince came of him; but the birthright [<i>vehabekhora</i>] was Joseph’s”</b> (I Chronicles 5:2)."
        },
        {
          "verseLocation": "1 Chronicles 5:1",
          "verseText": "but, since he defiled his father’s bed, his birthright was given to the sons of Joseph,",
          "talmudLocation": "Berakhot 7b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/7b#section-8",
          "talmudFullText": "<b>While my son, </b> Reuben, <b>even though Joseph took his birthright from him by force, as it is written: </b> “And the sons of Reuben the firstborn of Israel, for he was the firstborn; <b>but, since he defiled his father’s bed, his birthright was given to the sons of Joseph, </b> son of Israel” (I Chronicles 5:1). <b>Nevertheless, he was not jealous of him, as it is written</b> when Joseph’s brothers sought to kill him: <b>“And Reuben heard and he saved him from their hands, </b> saying ‘Let us not take his life’” (Genesis 37:21)."
        },
        {
          "verseLocation": "1 Chronicles 5:2",
          "verseText": "states: “For Judah prevailed above his brothers, and the prince came of him; but the birthright [ vehabekhora ] was Joseph’s”",
          "talmudLocation": "Bava Batra 123a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/123a#section-4",
          "talmudFullText": "The <i>baraita</i> reinforces this statement by citing additional verses: <b>And</b> the verse <b>states: “And the sons of Reuben the firstborn of Israel, for he was the firstborn; but, inasmuch as he defiled his father’s couch, his birthright [<i>bekhorato</i>] was given to the sons of Joseph the son of Israel, yet not so that he was to be reckoned in the genealogy as firstborn”</b> (I Chronicles 5:1). <b>And</b> the following verse <b>states: “For Judah prevailed above his brothers, and the prince came of him; but the birthright [<i>vehabekhora</i>] was Joseph’s”</b> (I Chronicles 5:2)."
        },
        {
          "verseLocation": "1 Chronicles 5:12",
          "verseText": "and Yanai and Shafat in the Bashan”",
          "talmudLocation": "Pesachim 68a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/68a#section-13",
          "talmudFullText": "<b>“Bashan” is</b> an allusion to the prophet <b>Elisha, who came from the Bashan. </b> How do we know that Elisha came from Bashan? <b>As it is stated: </b> “Joel the chief, and Shafam the next, <b>and Yanai and Shafat in the Bashan”</b> (I Chronicles 5:12), <b>and it is written: “Here is Elisha ben Shafat who poured water on the hands of Elijah”</b> (II Kings 3:11). <b>“Gilad” is</b> an allusion to <b>Elijah, as it is stated: “And Elijah the Tishbite, who was of the inhabitants of Gilad, said”</b> (I Kings 17:1). Based on the similarity of the verses and the verbal analogy between the two instances of the word “feed,” we learn that in the future the righteous will be like Elijah and Elisha, who resurrected the dead."
        },
        {
          "verseLocation": "1 Chronicles 5:25",
          "verseText": "their fathers, and went astray after",
          "talmudLocation": "Meilah 18b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/meilah/18b#section-1",
          "talmudFullText": "<b>their fathers, and went astray after</b> the gods of the peoples of the land, whom God destroyed before them” (I Chronicles 5:25). Likewise, one who misuses consecrated property deviates from the purpose for which the particular item was meant to be used."
        },
        {
          "verseLocation": "1 Chronicles 5:25",
          "verseText": "to idol worship,",
          "talmudLocation": "Meilah 19a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/meilah/19a#section-7",
          "talmudFullText": "<b>When God compared</b> misuse <b>to idol worship, </b> in the verse: “And they broke faith with the God of their fathers” (I Chronicles 5:25), this teaches <b>that</b> one is not liable for idol worship <b>until there is a change</b> effected <b>by</b> his act, as the idolater changes his worship of God for worship of idols. <b>With regard to consecrated</b> property <b>as well, </b> if the item is susceptible to damage, a person does not become liable for misuse <b>until</b> the act of misuse changes the item from being available for use for sacred purposes to being available for use only for non-sacred purposes, as in a case <b>where</b> he <b>chops</b> non-sacred wood <b>with</b> a consecrated <b>ax and</b> concurrently <b>damages</b> the ax, as the consecrated property is thereby <b>damaged. </b>"
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "1 Chronicles 7:22",
          "verseText": "and it is written: “And Ephraim their father mourned many days, and his brothers came to comfort him”",
          "talmudLocation": "Sanhedrin 92b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92b#section-6",
          "talmudFullText": "<b>Rav says: These were the descendants of Ephraim who calculated</b> the time <b>of the end</b> of the enslavement and the redemption from Egypt <b>and erred</b> in their calculation. They left before the appointed time and were killed, <b>as it is stated: “And the sons of Ephraim; Shuthelah, and Bered his son, and Tahath his son, and Eleadah his son, and Tahath his son. And Zabad his son, and Shuthelah his son, and Ezer and Elead whom the men of Gath that were born in the land slew, </b> because they came down to take their cattle” (I Chronicles 7:20–21), <b>and it is written: “And Ephraim their father mourned many days, and his brothers came to comfort him”</b> (I Chronicles 7:22)."
        },
        {
          "verseLocation": "1 Chronicles 7:27",
          "verseText": "“Nun his son, Joshua his son”",
          "talmudLocation": "Megillah 14b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-13",
          "talmudFullText": "Rav Naḥman responded to Eina the Elder and <b>said to him: Eina the Elder, and some say</b> that he said to him: <b>Blackened pot, </b> i.e., my colleague in Torah, who has toiled and blackened his face in Torah study, <b>from me and from you the matter may be concluded, </b> i.e., the explanation lies in a combination of our two statements. <b>For</b> Rahab <b>converted and married Joshua, </b> and therefore Huldah descended from both Joshua and Rahab. The Talmud raises a difficulty: <b>But did Joshua have any descendants? But isn’t it written</b> in the genealogical list of the tribe of Ephraim: <b>“Nun his son, Joshua his son”</b> (I Chronicles 7:27)? The listing does not continue any further, implying that Joshua had no sons. The Talmud answers: Indeed, <b>he did not have sons, </b> but <b>he did have daughters. </b>"
        },
        {
          "verseLocation": "1 Chronicles 7:27",
          "verseText": "“Nun his son, Joshua his son”",
          "talmudLocation": "Pesachim 119b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/119b#section-6",
          "talmudFullText": "Jacob will <b>say to Moses: Take</b> the cup <b>and recite the blessing. </b> Moses will <b>say to them: I will not recite the blessing, as I did not merit to enter Eretz Yisrael, neither in my life nor in my death. </b> Moses will <b>say to Joshua: Take</b> the cup <b>and recite the blessing. </b> Joshua will <b>say to them: I will not recite the blessing, as I did not merit to</b> have <b>a son. </b> The proof for this is <b>that it is written: “Joshua the son of Nun”</b> (Numbers 14:6), and in the genealogical list of Ephraim it states: <b>“Nun his son, Joshua his son”</b> (I Chronicles 7:27). Since the verse does not mention any children of Joshua, evidently he had no sons."
        },
        {
          "verseLocation": "1 Chronicles 7:40",
          "verseText": "“Reckoned by lineage for service in war”",
          "talmudLocation": "Kiddushin 76b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/76b#section-14",
          "talmudFullText": "The Mishnah teaches that <b>R' Ḥanina ben Antigonus</b> says: Even the descendants of one who was written in the army list of the Jewish king does not have their lineage investigated. <b>Rav Yehuda says</b> that <b>Shmuel says: </b> The reference is to one who was written <b>in</b> the list of <b>the military troops of the House of David, </b> who were all of pure lineage. <b>Rav Yosef said: What is the verse</b> from which it is derived? The phrase is: <b>“Reckoned by lineage for service in war”</b> (I Chronicles 7:40). The Talmud asks: <b>And what is the reason</b> for this requirement that they be of unflawed lineage? <b>Rav Yehuda says</b> that <b>Rav says: </b> It is <b>in order that their merit and the merit of their ancestors will help them</b> in battle."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "1 Chronicles 8:12",
          "verseText": "as it is written: “And the sons of Elpaal: Eber, and Misham, and Shemed, who built Ono and Lod, with its hamlets”",
          "talmudLocation": "Megillah 4a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/4a#section-2",
          "talmudFullText": "The Talmud asks: <b>Did Joshua</b>, son of Nun, really <b>build these</b> cities? <b>Didn’t Elpaal build them</b> at a later date, <b>as it is written: “And the sons of Elpaal: Eber, and Misham, and Shemed, who built Ono and Lod, with its hamlets”</b> (I Chronicles 8:12)? The Talmud counters: <b>According to your reasoning, </b> that this verse proves that these cities were built later, you can also say that <b>Asa, </b> king of Judah, <b>built them, as it is written: “And he, </b> Asa, <b>built fortified cities in Judah”</b> (see II Chronicles 14:5). Therefore, it is apparent that these cities were built more than once."
        },
        {
          "verseLocation": "1 Chronicles 8:34",
          "verseText": "This is what is written: “And the son of Jonathan was Meriv-Baal”",
          "talmudLocation": "Shabbat 56b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/56b#section-2",
          "talmudFullText": "<b>This is what is written: “And the son of Jonathan was Meriv-Baal”</b> (I Chronicles 8:34). The Talmud asks: <b>And was Meriv-Baal his name? Wasn’t his name Mephibosheth? However, since he entered into a quarrel [<i>meriva</i>] with his Master [<i>ba’al</i>], </b> i.e., God, and complained about God having saved David, <b>a bat kol emerged and said to him: Quarrelsome</b> one, <b>the son of a quarrelsome</b> one; you are just like your father, Saul. The Talmud explains: <b>Quarrelsome</b> one; <b>that which we</b> just <b>said</b> that Mephibosheth complained to God about His salvation of David. <b>The son of a quarrelsome</b> one; <b>as it is written: “And Saul came to a city of Amalek and quarreled in the valley”</b> (I Samuel 15:5). And <b>R' Mani said: </b> Saul quarreled with God <b>with regard to matters of the valley, </b> saying: For the murder of even a single person, there is a commandment to break the neck of a heifer in a valley to atone for the crime (see Deuteronomy 21:1–9); why then must all these Amalekites be killed?"
        },
        {
          "verseLocation": "1 Chronicles 8:38",
          "verseText": "Azel",
          "talmudLocation": "Pesachim 62b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/62b#section-16",
          "talmudFullText": "<b>Mar Zutra said: </b> The Book of Genealogies’ exposition of Chronicles was so extensive that it was said, in exaggeration, that the verses <b>from</b> the word <b>Azel</b> mentioned in the verse: “And Azel had six sons and these are their names: Azrikam, Bocru, and Ishmael and Sheariah and Obadia and Hanan; all these were the sons of Azel” (I Chronicles 8:38), <b>to</b> the word <b>Azel</b> mentioned in a different verse with the identical wording: “And Azel had six sons and these are their names: Azrikam, Bocru, and Ishmael and Sheariah and Obadia and Hanan; these were the sons of Azel” (I Chronicles 9:44), <b>bore four hundred camels of expositions</b> written about these verses."
        },
        {
          "verseLocation": "1 Chronicles 8:40",
          "verseText": "“And the sons of Ulam were mighty men of valor, archers, and had many sons and sons’ sons”",
          "talmudLocation": "Niddah 31a:25",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/31a#section-25",
          "talmudFullText": "This statement is also derived from the following verse: <b>“And the sons of Ulam were mighty men of valor, archers, and had many sons and sons’ sons”</b> (I Chronicles 8:40). <b>Is it in a person’s power to have many sons and sons’ sons? Rather, because</b>"
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "1 Chronicles 9:22",
          "verseText": "Moses instituted for the Jews eight priestly watches, four from Elazar and four from Itamar. And David and Samuel came and established them as twenty-four, as it is stated: “Whom David and Samuel the seer ordained in their set office”",
          "talmudLocation": "Taanit 27a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/27a#section-8",
          "talmudFullText": "The Talmud <b>raises an objection</b> against this opinion from a <i>baraita</i>. <b>Moses instituted for the Jews eight priestly watches, four from Elazar and four from Itamar. And David and Samuel came and established them as twenty-four, as it is stated: “Whom David and Samuel the seer ordained in their set office”</b> (I Chronicles 9:22). This <i>baraita</i> indicates that David and Samuel together established the twenty-four watches. The Talmud explains: <b>This is what</b> the <i>baraita</i> <b>is saying: Through their ordination by David and Samuel of Rama</b> the priestly watches incrementally increased in number until <b>they established them as twenty-four. </b>"
        },
        {
          "verseLocation": "1 Chronicles 9:44",
          "verseText": "Azel",
          "talmudLocation": "Pesachim 62b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/62b#section-16",
          "talmudFullText": "<b>Mar Zutra said: </b> The Book of Genealogies’ exposition of Chronicles was so extensive that it was said, in exaggeration, that the verses <b>from</b> the word <b>Azel</b> mentioned in the verse: “And Azel had six sons and these are their names: Azrikam, Bocru, and Ishmael and Sheariah and Obadia and Hanan; all these were the sons of Azel” (I Chronicles 8:38), <b>to</b> the word <b>Azel</b> mentioned in a different verse with the identical wording: “And Azel had six sons and these are their names: Azrikam, Bocru, and Ishmael and Sheariah and Obadia and Hanan; these were the sons of Azel” (I Chronicles 9:44), <b>bore four hundred camels of expositions</b> written about these verses."
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "1 Chronicles 11:8",
          "verseText": "“And Joab kept alive the rest of the city”",
          "talmudLocation": "Sanhedrin 49a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/49a#section-16",
          "talmudFullText": "The verse states with regard to Joab: <b>“And he was buried in his own house, in the wilderness”</b> (I Kings 2:34). The Talmud asks: <b>Is that to say</b> that Joab’s <b>house</b> was <b>a wilderness? Rav Yehuda says</b> that <b>Rav says: </b> Joab’s house was <b>like the wilderness; just as the wilderness is</b> freely <b>open to all, so too, Joab’s house</b> was freely <b>open to all, </b> as he generously opened his house to the poor and made them feel like members of the household. <b>Alternatively, </b> Joab’s house was <b>like the wilderness; just as the wilderness is clean of theft and sexual immorality, </b> as it is uninhabited, <b>so too, Joab’s house was clean of theft and sexual immorality, </b> owing to his righteousness. As for the verse: <b>“And Joab kept alive the rest of the city”</b> (I Chronicles 11:8), <b>Rav Yehuda says: </b> Not only would Joab feed the poor, but <b>he would even give them</b> treats of types of <b>small fish</b> so they would lack for nothing."
        },
        {
          "verseLocation": "1 Chronicles 11:13",
          "verseText": "where was a plot of ground full of barley;",
          "talmudLocation": "Bava Kamma 60b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/60b#section-22",
          "talmudFullText": "The Talmud discusses the different explanations: <b>Granted, according to the one who says</b> that David was asking whether he could take the stacks of barley and <b>exchange</b> them, i.e., repay the owners of the barley, with stacks of lentils, <b>this is as it is written</b> in <b>one verse: </b> “And the Philistines were gathered together into a troop, <b>where was a plot of ground full of lentils; </b> and the people fled from the Philistines” (II Samuel 23:11), <b>and it is written</b> in <b>one</b> other <b>verse: </b> “He was with David at Pas Dammim, and there the Philistines were gathered together to battle, <b>where was a plot of ground full of barley; </b> and the people fled from before the Philistines” (I Chronicles 11:13). This apparent contradiction can be reconciled by saying that there were two fields, one of barley and one of lentils."
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "1 Chronicles 12:19",
          "verseText": "peace, peace be unto you, and peace be to your helpers”",
          "talmudLocation": "Berakhot 55b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/55b#section-10",
          "talmudFullText": "<b>And three</b> mentions of <b>peace, as it is written: </b><b><b>“Peace, peace, to him that is far off and to him that is near, says YHWH that creates the expression of the lips; and I will heal him”</b> (Isaiah 57:19); <b><b>“Then the spirit clothed Amasai, </b> who was chief of the captains: Yours are we, David, and on your side, you son of Yishai; <b><b>peace, peace be unto you, and peace be to your helpers”</b> (I Chronicles 12:19); <b>and: <b>“Thus you shall say: All hail and peace be both unto you, </b><b><b>and peace be to your house, </b> and peace be unto all that you have” (I Samuel 25:6)."
        },
        {
          "verseLocation": "1 Chronicles 12:19",
          "verseText": "to a king? As it is stated: “And the spirit clothed Amasai, who was chief of the captains,",
          "talmudLocation": "Gittin 62a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/62a#section-15",
          "talmudFullText": "Rav Huna and Rav Ḥisda <b>said to him</b> further: <b>And from where do you</b> know <b>that we must double the greeting</b> of <i>shalom</i> extended <b>to kings? He said to them: As Rav Yehuda says</b> that <b>Rav says: From where</b> is it derived <b>that one must double the greeting</b> of <i>shalom</i> extended <b>to a king? As it is stated: “And the spirit clothed Amasai, who was chief of the captains, </b> and he said: We are yours, David, and on your side, you son of Yishai; peace, peace be to you” (I Chronicles 12:19), indicating that a king is greeted with a doubled <i>shalom</i>."
        },
        {
          "verseLocation": "1 Chronicles 12:19",
          "verseText": "inspiration. It is written here: “And she clothed herself,” and it is written elsewhere: “And the spirit clothed Amasai”",
          "talmudLocation": "Megillah 14b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-9",
          "talmudFullText": "<b>Esther</b> was also a prophetess, <b>as it is written: “And it came to pass on the 3rd day that Esther clothed herself in royalty”</b> (Esther 5:1). <b>It should have said: </b> Esther clothed herself in <b>royal garments. Rather, </b> this alludes to the fact <b>that she clothed herself with a divine</b> spirit of <b>inspiration. It is written here: “And she clothed herself, ” and it is written elsewhere: “And the spirit clothed Amasai”</b> (I Chronicles 12:19). Just as there the reference is to being enclothed by a spirit, so too Esther was enclothed by a spirit of Holy Spirit."
        },
        {
          "verseLocation": "1 Chronicles 12:19",
          "verseText": "it is written here: “And she clothed herself,” and it is written elsewhere: “And the spirit clothed Amasai”",
          "talmudLocation": "Megillah 15a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-16",
          "talmudFullText": "The verse states: <b>“And it came to pass on the 3rd day, that Esther clothed herself in royalty”</b> (Esther 5:1). The Talmud asks: <b>It should have said: </b> Esther clothed herself in <b>royal garments. R' Elazar said</b> that <b>R' Ḥanina said: This teaches that she clothed herself with</b> a <b>divine</b> spirit of <b>inspiration, </b> as <b>it is written here: “And she clothed herself, ” and it is written elsewhere: “And the spirit clothed Amasai”</b> (I Chronicles 12:19). Just as there the reference is to the spirit of Holy Spirit, so too here, the term royalty is referring to the spirit of Holy Spirit."
        },
        {
          "verseLocation": "1 Chronicles 12:33",
          "verseText": "And he merits the understanding of Issachar, as it is written: “And of the children of Issachar, men that had understanding of the times, to know what Israel ought to do”",
          "talmudLocation": "Bava Kamma 17a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/17a#section-11",
          "talmudFullText": "<b>There are</b> some <b>who say</b> that the comparison should be understood in a different manner. <b>His enemies will fall before him</b> just <b>like</b> in the blessing given by Moses to the tribe of <b>Joseph, as it is written</b> in the blessing bestowed by Moses to the tribe of Joseph: “His horns are the horns of the wild-ox; <b>with them he shall gore the nations, even to the ends of the earth”</b> (Deuteronomy 33:17). <b>And he merits the understanding of Issachar, as it is written: “And of the children of Issachar, men that had understanding of the times, to know what Israel ought to do”</b> (I Chronicles 12:33)."
        },
        {
          "verseLocation": "1 Chronicles 12:33",
          "verseText": "and it is written: “And of the children of Issachar, men who had understanding of the times, to know what Israel ought to do; the heads of them were two hundred, and all their brethren were at their commandment”",
          "talmudLocation": "Eruvin 100b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/100b#section-19",
          "talmudFullText": "<b>While with regard to Leah, it is written: “And Leah went out to meet him, and said, You must come in to me, for indeed I have hired you</b> with my son’s mandrakes” (Genesis 30:16). Her reward for demanding that Jacob fulfill the conjugal mitzva with her was the birth of Issachar, <b>and it is written: “And of the children of Issachar, men who had understanding of the times, to know what Israel ought to do; the heads of them were two hundred, and all their brethren were at their commandment”</b> (I Chronicles 12:33)."
        },
        {
          "verseLocation": "1 Chronicles 12:33",
          "verseText": "And it is written: “And of the children of Issachar, men that had understanding of the times”",
          "talmudLocation": "Nedarim 20b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/20b#section-11",
          "talmudFullText": "<b>And</b> by contrast, <b>it is written: “Issachar is a large-boned donkey”</b> (Genesis 49:14). The rabbis transmitted a tradition that this is an allusion to the incident when Jacob came in from the field riding on a donkey, and Leah went out to greet him, saying: “You must come in to me; for I have hired you with my son’s mandrakes” (Genesis 30:16). Issachar was conceived from their subsequent sex. <b>And it is written: “And of the children of Issachar, men that had understanding of the times”</b> (I Chronicles 12:33). The descendants of Issachar were understanding men. It is derived from here that a woman who demands from her husband that he have sex with her has a positive effect on their children."
        },
        {
          "verseLocation": "1 Chronicles 12:33",
          "verseText": "as it is written: “And of the children of Issachar, men that had understanding of the times, to know what Israel should do”",
          "talmudLocation": "Yoma 26a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/26a#section-6",
          "talmudFullText": "Apropos this passage in Deuteronomy, <b>Rava said: You do not find a young Torah scholar who gives</b> halakhic <b>instruction unless he comes from the tribe of Levi or from the tribe of Issachar. </b> The assertion with regard to the tribe of <b>Levi</b> is <b>as it is written: “They shall teach Jacob Your ordinances</b> and Israel Your law” (Deuteronomy 33:10). And the assertion with regard to the tribe of <b>Issachar</b> is <b>as it is written: “And of the children of Issachar, men that had understanding of the times, to know what Israel should do”</b> (I Chronicles 12:33). The Talmud asks: <b>And say</b> that scholars come from the tribe of <b>Judah also, as it is written: “Judah is my lawgiver”</b> (Psalms 60:9). Rava answers: While it is true that the tribe of Judah also taught Torah, in my statement <b>I was speaking</b> only <b>of those who</b> can <b>draw conclusions according to the <i>halakha</i>. </b> Although Judah produces great scholars, men capable of translating abstract analysis of the Torah into legal principles come from the two tribes mentioned."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "1 Chronicles 13:9",
          "verseText": "as it is stated: “And when they came to the threshing floor of Chidon, Uzzah put forth his hand to hold the Ark;",
          "talmudLocation": "Sotah 35a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35a#section-16",
          "talmudFullText": "<b>And over this matter Uzzah was punished</b> for not taking proper care of the Ark, <b>as it is stated: “And when they came to the threshing floor of Chidon, Uzzah put forth his hand to hold the Ark; </b> for the oxen stumbled” (I Chronicles 13:9). <b>God said to him: Uzzah, </b> the Ark <b>carried its bearers</b> when it crossed the Jordan; <b>all the more so</b> is it <b>not</b> clear that it can carry <b>itself? </b>"
        },
        {
          "verseLocation": "1 Chronicles 13:9",
          "verseText": "Chidon”",
          "talmudLocation": "Sotah 35b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35b#section-5",
          "talmudFullText": "<b>It is written</b> that Uzzah died “when they came to the threshing floor of <b>Chidon”</b> (I Chronicles 13:9), <b>and</b> elsewhere <b>it is written</b> that it was “the threshing floor of <b>Nacon”</b> (II Samuel 6:6). <b>R' Yoḥanan says: At first</b> the Ark was similar to <b>a javelin [<i>kidon</i>], </b> as it caused Uzzah’s death. <b>But ultimately, </b> after the people asked for forgiveness, it was <b>established [<i>nakhon</i>], </b> i.e., placed, in the house of Obed Edom, where it was a source of blessing."
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "1 Chronicles 14:12",
          "verseText": "and they were burned with fire”",
          "talmudLocation": "Avodah Zarah 44a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/44a#section-10",
          "talmudFullText": "The Rabbis <b>said to him: </b> You seek to bring <b>proof from there? Doesn’t it state</b> with regard to the same incident: “And they left their gods there; and David gave an order, <b>and they were burned with fire”</b> (I Chronicles 14:12)? <b>And from</b> the fact <b>that it is not written</b> here: <b>And they burned them <i>vayyissa’em</i>, learn from it</b> that the word <b><i>vayyissa’em</i></b> is not referring to scattering in the wind, but rather it should be understood <b>literally, </b> i.e., David and his men took the idols away; and it does not mean that they demolished and scattered them."
        },
        {
          "verseLocation": "1 Chronicles 14:12",
          "verseText": "and David gave an order, and they were burned with fire”",
          "talmudLocation": "Avodah Zarah 44a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/44a#section-12",
          "talmudFullText": "The Talmud answers <b>in accordance with</b> the resolution <b>of Rav Huna, as Rav Huna raises a contradiction</b> between the verses, as follows: <b>It is written: </b> “And they left their gods there; <b>and David gave an order, and they were burned with fire”</b> (I Chronicles 14:12), <b>and it is</b> also <b>written: “And</b> David and his men <b>took them away”</b> (II Samuel 5:21)."
        }
      ]
    },
    {
      "chapterNumber": 15,
      "citations": [
        {
          "verseLocation": "1 Chronicles 15:22",
          "verseText": "from here: “And Chenaniah, chief of the Levites…he was master of lifting, because he was skillful”",
          "talmudLocation": "Arakhin 11a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/11a#section-16",
          "talmudFullText": "The Talmud presents another source for the requirement that the song of the Levites must accompany the sacrificial service in the Temple. <b>Ḥizkiyya says</b> that this obligation is derived <b>from here: “And Chenaniah, chief of the Levites…he was master of lifting, because he was skillful”</b> (I Chronicles 15:22). <b>Do not read</b> it as <b>“he was master [<i>yasor</i>]</b> of lifting,” <b>but</b> as: <b>He shall sing [<i>yashir</i>]</b> with the lifting of his voice."
        },
        {
          "verseLocation": "1 Chronicles 15:26",
          "verseText": "“seven oxen and seven rams”",
          "talmudLocation": "Sotah 35b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/35b#section-3",
          "talmudFullText": "With regard to David’s journey with the Ark to Jerusalem, the verse states: <b>“And when they who carried the Ark of YHWH had gone six paces, he sacrificed an ox and a fatling”</b> (II Samuel 6:13). <b>And it is written</b> elsewhere that he sacrificed <b>“seven oxen and seven rams”</b> (I Chronicles 15:26). <b>Rav Pappa bar Shmuel says: For each and every step</b> David took, he sacrificed <b>an ox and a fatling, </b> and <b>for every six steps</b> that he took, he sacrificed <b>seven oxen and seven rams. </b>"
        }
      ]
    },
    {
      "chapterNumber": 16,
      "citations": [
        {
          "verseLocation": "1 Chronicles 16:5",
          "verseText": "the verse states: “And Asaph with the cymbals, sounding aloud”",
          "talmudLocation": "Arakhin 13b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/13b#section-5",
          "talmudFullText": "The Mishnah teaches that one plays no fewer <b>than nine harps</b> and one may add up to an infinite number, <b>and the cymbal</b> was played <b>alone</b> and none may be added to it. The Talmud asks: <b>From where is this matter</b> derived? <b>Rav Asi says that</b> it is as <b>the verse states: “And Asaph with the cymbals, sounding aloud”</b> (I Chronicles 16:5), which indicates that only one Levite played the cymbals. The Talmud asks: The word <b>cymbals</b> is in the plural, indicating that <b>there were two; </b> why, then, does the Mishnah say that there is only one cymbal? The Talmud answers: <b>Since</b> two cymbals <b>perform one act and one person plays them</b> by banging them together, the Mishnah <b>calls them one</b> instrument."
        },
        {
          "verseLocation": "1 Chronicles 16:22",
          "verseText": "which is written: “Do not touch My anointed ones and do My prophets no harm”",
          "talmudLocation": "Shabbat 119b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/119b#section-10",
          "talmudFullText": "<b>Rav Yehuda said</b> that <b>Rav said: What</b> is the meaning of that <b>which is written: “Do not touch My anointed ones and do My prophets no harm”</b> (I Chronicles 16:22)? <b>“Do not touch My anointed ones, ” these are the schoolchildren, </b> who are as precious and important as kings and priests (Maharsha); <b>“and do not harm My prophets, ” these are Torah scholars. Reish Lakish said in the name of R' Yehuda Nesia: The world only exists because of the breath, </b> i.e., reciting Torah, <b>of schoolchildren. Rav Pappa said to Abaye: My</b> Torah study <b>and yours, what</b> is its status? Why is the Torah study of adults worth less? He <b>said to him: The breath</b> of adults, <b>which is</b> tainted by <b>sin, is not similar to the breath</b> of children, <b>which is not</b> tainted by <b>sin. And Reish Lakish said in the name of R' Yehuda Nesia: One may not interrupt schoolchildren</b> from studying Torah, <b>even in order to build the Temple. And Reish Lakish said to R' Yehuda Nesia: I have received from my ancestors, and some say</b> that he said to him: I have received <b>from your ancestors as follows: Any city in which there are no schoolchildren</b> studying Torah, they <b>destroy it. Ravina said: </b> They leave <b>it desolate. </b>"
        },
        {
          "verseLocation": "1 Chronicles 16:27",
          "verseText": "But is there crying before the Holy One, Blessed be He? Didn’t Rav Pappa say: There is no sadness before the Holy One, Blessed be He, as it is stated: “Honor and majesty are before Him; strength and gladness are in His place”",
          "talmudLocation": "Chagigah 5b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/5b#section-11",
          "talmudFullText": "The Talmud asks: <b>But is there crying before God? Didn’t Rav Pappa say: There is no sadness before God as it is stated: “Honor and majesty are before Him; strength and gladness are in His place”</b> (I Chronicles 16:27)? The Talmud responds: This is <b>not difficult. This</b> statement, that God cries, is referring to <b>the innermost chambers, </b> where He can cry in secret, whereas <b>this</b> statement, that He does not cry, is referring to <b>the outer chambers. </b>"
        },
        {
          "verseLocation": "1 Chronicles 16:34",
          "verseText": "thanksgiving,",
          "talmudLocation": "Megillah 10b:25",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-25",
          "talmudFullText": "R' Yehoshua ben Levi asked: <b>Does God, </b> in fact <b>rejoice over the downfall of the wicked? But it is written: “As they went out before the army, and say: Give thanks to YHWH, for His kindness endures forever”</b> (II Chronicles 20:21), <b>and R' Yoḥanan said: For what</b> reason were the words: <b>“for He is good” not stated in this</b> statement of <b>thanksgiving, </b> as the classic formulation is: “Give thanks to YHWH; for He is good; for His kindness endures forever” (I Chronicles 16:34)? <b>Because God does not rejoice over the downfall of the wicked. </b> Since this song was sung in the aftermath of a military victory, which involved the downfall of the wicked, the name of God was not mentioned for the good."
        },
        {
          "verseLocation": "1 Chronicles 16:36",
          "verseText": "“Blessed be the Lord, God of Israel, from eternity to eternity”",
          "talmudLocation": "Yoma 69b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/69b#section-3",
          "talmudFullText": "Apropos the verse in Nehemiah, the Talmud interprets an adjacent verse homiletically. It is stated: <b>“And Ezra blessed YHWH, the great God”</b> (Nehemiah 8:6). The Talmud asks: <b>What is</b> the meaning of <b>“great”</b> here? <b>Rav Yosef said</b> that <b>Rav said: </b> It means <b>that he ascribed greatness to Him by</b> enunciating God’s <b>explicit name. Rav Giddel said: </b> He established that one should say at the conclusion of every blessing: <b>“Blessed be YHWH, God of Israel, from eternity to eternity”</b> (I Chronicles 16:36)."
        }
      ]
    },
    {
      "chapterNumber": 17,
      "citations": [
        {
          "verseLocation": "1 Chronicles 17:16",
          "verseText": "only for kings of the House of David, as it is stated: “Then King David went in and sat before the Lord”",
          "talmudLocation": "Yoma 69b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/69b#section-1",
          "talmudFullText": "<b>Sitting in the</b> Temple <b>courtyard is</b> permitted <b>only for kings of the House of David, as it is stated: “Then King David went in and sat before YHWH”</b> (I Chronicles 17:16)? How, then, could the High Priest have been sitting? The Talmud explains: <b>As Rav Ḥisda said</b> in a similar context: This took place not in the Israelite courtyard, where the prohibition against sitting applies, but <b>in the women’s courtyard. Here, too, </b> the reading was <b>in the women’s courtyard, </b> where it is permitted to sit."
        },
        {
          "verseLocation": "1 Chronicles 17:21",
          "verseText": "Israel, as it is written: “And who is like your people Israel, one nation on the earth?”",
          "talmudLocation": "Bava Batra 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/10b#section-7",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i>: <b>Rabban Yoḥanan ben Zakkai said to his students: My sons, what is</b> the meaning of <b>that which the verse states: “Righteousness exalts a nation, but the kindness of the peoples is sin”</b> (Proverbs 14:34)? <b>R' Eliezer answered and said: “Righteousness exalts a nation”; these are</b> the people of <b>Israel, as it is written: “And who is like your people Israel, one nation on the earth? ”</b> (I Chronicles 17:21). <b>“But the kindness of the peoples is sin, ”</b> meaning that <b>all the</b> acts of <b>charity and kindness that the nations of the world perform are</b> counted as <b>a sin for them, since they perform them only to elevate themselves</b> in prestige, <b>as it is stated: “That they may sacrifice offerings of pleasing aroma to the God of heaven, and pray for the life of the king and of his sons”</b> (Ezra 6:10). Even though they donated offerings, they did so only for their own benefit."
        },
        {
          "verseLocation": "1 Chronicles 17:21",
          "verseText": "“Who is like Your people, Israel, one nation in the land?”",
          "talmudLocation": "Berakhot 6a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/6a#section-20",
          "talmudFullText": "<b>Rav Naḥman bar Yitzḥak said to Rav Ḥiyya bar Avin: What is written in the tefillin of the Master of the world? Rav Ḥiyya bar Avin replied: </b> It is written: <b>“Who is like Your people, Israel, one nation in the land? ”</b> (I Chronicles 17:21). God’s tefillin serve to connect Him, in a sense, to the world, the essence of which is Israel."
        },
        {
          "verseLocation": "1 Chronicles 17:21",
          "verseText": "“And who is like Your people, Israel, one nation in the land?”",
          "talmudLocation": "Chagigah 3b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/3b#section-1",
          "talmudFullText": "<b>“And who is like Your people, Israel, one nation in the land? ”</b> (I Chronicles 17:21)."
        }
      ]
    },
    {
      "chapterNumber": 19,
      "citations": [
        {
          "verseLocation": "1 Chronicles 19:18",
          "verseText": "it is written: “Shophach”",
          "talmudLocation": "Sotah 42b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-11",
          "talmudFullText": "§ According to the Mishnah, the priest would say: <b>The Ammonites came championed by Shobach</b> (see II Samuel, chapter 10). In one account, his name <b>is written: “Shobach”</b> (II Samuel 10:18), <b>and</b> in another place <b>it is written: “Shophach”</b> (I Chronicles 19:18). <b>Rav and Shmuel</b> engaged in a dispute concerning this matter. <b>One</b> of them <b>said: His name was Shophach, and why is he called</b> by the <b>name Shobach? </b> It is <b>because he was built like a dovecote [<i>shovakh</i>], </b> as he was exceptionally tall. <b>And one</b> of them <b>said: His name was Shobach, and why is he called</b> by the <b>name Shophach? </b> It is <b>because anyone who would see him</b> would become terrified and his courage would be <b>spilled [<i>nishpakh</i>] before him like</b> water from <b>a jug. </b>"
        }
      ]
    },
    {
      "chapterNumber": 21,
      "citations": [
        {
          "verseLocation": "1 Chronicles 21:1",
          "verseText": "“Satan stood up against Israel",
          "talmudLocation": "Berakhot 62b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-11",
          "talmudFullText": "As for David’s statement to Saul: <b>“If it be YHWH that has incited you against me, let Him accept an offering”</b> (I Samuel 26:19), <b>R' Elazar said</b> that <b>God said to David: Do you call Me an inciter? </b> In retribution, <b>I will cause you to fail in a matter that even schoolchildren know, as it is written: “When you take the sum of the children of Israel, according to their number, then shall they give every man a ransom for his soul</b> unto YHWH, when you number them; that there be no plague among them, when you number them” (Exodus 30:12). <b>Immediately</b> after God said this to David, <b>“Satan stood up against Israel</b> and incited David to number Israel” (I Chronicles 21:1). Moreover, <b>it is written: </b> “And again the anger of YHWH was kindled against Israel, <b>and He incited David against them, saying: Go, number Israel and Judea”</b> (II Samuel 24:1). The proportional response to David’s calling God an inciter was that He incited David. <b>And when he counted them, he did not take a ransom from them, </b> and he was punished, <b>as it is written: “So YHWH sent a pestilence upon Israel from the morning even to the appointed time”</b> (II Samuel 24:15)."
        },
        {
          "verseLocation": "1 Chronicles 21:15",
          "verseText": "“The Lord beheld, and He repented him",
          "talmudLocation": "Berakhot 62b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-14",
          "talmudFullText": "On a parallel note, it is said: <b>“YHWH beheld, and He repented him</b> of the evil” (I Chronicles 21:15). The Talmud asks: <b>What did YHWH behold? </b>"
        },
        {
          "verseLocation": "1 Chronicles 21:25",
          "verseText": "to his son, and raised a contradiction between verses: It is written: “So David gave to Ornan…",
          "talmudLocation": "Zevachim 116b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/116b#section-11",
          "talmudFullText": "With regard to the contradiction between the verses that relate the sum of shekels paid by David, the Talmud says that <b>Rava</b> was <b>teaching</b> these verses <b>to his son, and raised a contradiction between verses: It is written: “So David gave to Ornan…</b>six hundred shekels of gold by weight” (I Chronicles 21:25), <b>and it is written: “So David bought…</b>fifty shekels of silver” (II Samuel 24:24). <b>How</b> can <b>these</b> texts be reconciled? David would <b>collect from each tribe</b> of the twelve tribes <b>fifty</b> shekels, <b>which are</b> a sum of <b>six hundred</b> shekels."
        }
      ]
    },
    {
      "chapterNumber": 22,
      "citations": [
        {
          "verseLocation": "1 Chronicles 22:1",
          "verseText": "“Then David said: This is the House of the Lord God, and this is the altar of burnt offering for Israel”",
          "talmudLocation": "Zevachim 62a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/62a#section-3",
          "talmudFullText": "<b>Rather, Rav Yosef said: </b> The size of the altar in the First Temple was ideal, but in the Second Temple era there was a need to expand the altar, and they <b>found a verse and interpreted</b> it as follows. The verse states: <b>“Then David said: This is the House of YHWH God, and this is the altar of burnt offering for Israel”</b> (I Chronicles 22:1). The verse juxtaposes the House, i.e., the Temple, with the altar, which indicates that the altar is <b>like</b> the <b>Temple: Just as</b> the <b>House</b> was <b>sixty cubits</b> (see I Kings 6:2), <b>so too, </b> the <b>altar</b> may be extended up to a length of <b>sixty cubits. </b>"
        }
      ]
    },
    {
      "chapterNumber": 23,
      "citations": [
        {
          "verseLocation": "1 Chronicles 23:13",
          "verseText": "from here: “The sons of Amram, Aaron and Moses; and Aaron was separated, that he should be sanctified as most holy”",
          "talmudLocation": "Gittin 59b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/59b#section-8",
          "talmudFullText": "<b>Rav Ashi said</b> that this <i>halakha</i> is derived <b>from here: “The sons of Amram, Aaron and Moses; and Aaron was separated, that he should be sanctified as most holy”</b> (I Chronicles 23:13). This indicates that Aaron and his descendants, the priests, are considered to be holier than the rest of the tribe of Levi. Consequently, they are given precedence in public Torah readings."
        },
        {
          "verseLocation": "1 Chronicles 23:13",
          "verseText": "A priest precedes a Levite, as it is stated: “The sons of Amram: Aaron and Moses, and Aaron was separated that he should be sanctified as the most sacred”",
          "talmudLocation": "Horayot 13a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/13a#section-18",
          "talmudFullText": "<strong>Talmud: </strong> <b>A priest precedes a Levite, as it is stated: “The sons of Amram: Aaron and Moses, and Aaron was separated that he should be sanctified as the most sacred”</b> (I Chronicles 23:13). <b>A Levite precedes an Israelite, as it is stated: “At that time YHWH separated the tribe of Levi, </b> to bear the Ark of the Covenant of YHWH, to stand before YHWH to minister unto Him, and to bless in His name, unto this day” (Deuteronomy 10:8)."
        },
        {
          "verseLocation": "1 Chronicles 23:13",
          "verseText": "between the priests and the Levites, as it is written: “The sons of Amram: Aaron and Moses; and Aaron was separated, that he should be sanctified as most holy,",
          "talmudLocation": "Pesachim 104a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/104a#section-10",
          "talmudFullText": "<b>They say</b> in answer to this question: The distinction between <b>priests, Levites, and Israelites is two matters, </b> i.e., it counts as two separate distinctions. One distinction is <b>between Levites and Israelites, as it is written: “At that time YHWH separated the tribe of Levi</b> to bear the Ark of the covenant of YHWH” (Deuteronomy 10:8). A further distinction is that <b>between the priests and the Levites, as it is written: “The sons of Amram: Aaron and Moses; and Aaron was separated, that he should be sanctified as most holy, </b> he and his sons forever” (I Chronicles 23:13)."
        },
        {
          "verseLocation": "1 Chronicles 23:14",
          "verseText": "as it is stated: “But as for Moses the man of God, his sons are named among the tribe of Levi”",
          "talmudLocation": "Zevachim 102a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/102a#section-8",
          "talmudFullText": "<b>And the Rabbis say: Moses became a priest</b> for <b>the seven days of inauguration alone, </b> and after that his priesthood expired. <b>And some say: </b> The <b>priesthood expired only for the descendants of Moses, </b> but Moses himself remained a priest, <b>as it is stated: “But as for Moses the man of God, his sons are named among the tribe of Levi”</b> (I Chronicles 23:14). This verse indicates that it was his sons who were Levites, but he himself remained a priest. <b>And</b> so too the verse <b>states: “Moses and Aaron among His priests, and Samuel among them that call upon His name, </b> did call upon YHWH, and He answered them” (Psalms 99:6)."
        },
        {
          "verseLocation": "1 Chronicles 23:15",
          "verseText": "the son of Manasseh; but wasn’t he the son of Moses, as it is written: “The sons of Moses: Gershom and Eliezer”",
          "talmudLocation": "Bava Batra 109b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/109b#section-8",
          "talmudFullText": "The Talmud asks further: <b>But</b> is it <b>so</b> that <b>his name</b> was indeed <b>Levi; but wasn’t Jonathan his name, as it is stated: “And Jonathan, the son of Gershom, the son of Manasseh, he and his sons were priests to the tribe of the Danites”</b> (Judges 18:30)? Rava bar Rav Ḥanan <b>said to him: And according to your reasoning, </b> that his name was not Levi but he was from the tribe of Levi, there is also a difficulty from that same verse: <b>But</b> is it <b>so</b> that <b>he</b> was <b>the son of Manasseh; but wasn’t he the son of Moses, as it is written: “The sons of Moses: Gershom and Eliezer”</b> (I Chronicles 23:15)?"
        },
        {
          "verseLocation": "1 Chronicles 23:15",
          "verseText": "from Moses as it is written: “The sons of Moses, Gershom and Eliezer”",
          "talmudLocation": "Yevamot 61b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/61b#section-18",
          "talmudFullText": "§ The Mishnah states that <b>Beit Shammai say</b> that one fulfills the mitzva to be fruitful and multiply when he has <b>two males. </b> The Talmud asks: <b>What is the reason of Beit Shammai? </b> The Talmud answers: <b>We learn</b> this <b>from Moses as it is written: “The sons of Moses, Gershom and Eliezer”</b> (I Chronicles 23:15). Since Moses did not have any other children, two sons must be sufficient to fulfill the mitzva. <b>And</b> the reason of <b>Beit Hillel</b> is that <b>we learn from the creation of the world, </b> as mankind was created male and female. The Talmud asks: <b>And Beit Shammai, let them learn from the creation of the world</b> as well. The Talmud answers that Beit Shammai could say to you: <b>We do not derive</b> a case where it is <b>possible</b>"
        }
      ]
    },
    {
      "chapterNumber": 24,
      "citations": [
        {
          "verseLocation": "1 Chronicles 24:4",
          "verseText": "as it is stated: “And there were more chief men found of the sons of Elazar than of the sons of Itamar, and they were divided thus: Of the sons of Elazar there were sixteen heads of fathers’ houses, and of the sons of Itamar, according to their fathers’ houses, eight”",
          "talmudLocation": "Taanit 27a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/27a#section-9",
          "talmudFullText": "<b>It is taught</b> in <b>another</b> <i>baraita</i>: <b>Moses instituted for the Jews sixteen priestly watches, eight from Elazar and eight from Itamar. And when the descendants of Elazar grew more numerous than the descendants of Itamar, he divided</b> the descendants of Elazar <b>and established them</b> together with the descendants of Itamar <b>as twenty-four</b> watches, <b>as it is stated: “And there were more chief men found of the sons of Elazar than of the sons of Itamar, and they were divided thus: Of the sons of Elazar there were sixteen heads of fathers’ houses, and of the sons of Itamar, according to their fathers’ houses, eight”</b> (I Chronicles 24:4). <b>And it says: “One father’s house taken for Elazar, and proportionately for Itamar”</b> (I Chronicles 24:6)."
        },
        {
          "verseLocation": "1 Chronicles 24:6",
          "verseText": "And it says: “One father’s house taken for Elazar, and proportionately for Itamar”",
          "talmudLocation": "Taanit 27a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/27a#section-9",
          "talmudFullText": "<b>It is taught</b> in <b>another</b> <i>baraita</i>: <b>Moses instituted for the Jews sixteen priestly watches, eight from Elazar and eight from Itamar. And when the descendants of Elazar grew more numerous than the descendants of Itamar, he divided</b> the descendants of Elazar <b>and established them</b> together with the descendants of Itamar <b>as twenty-four</b> watches, <b>as it is stated: “And there were more chief men found of the sons of Elazar than of the sons of Itamar, and they were divided thus: Of the sons of Elazar there were sixteen heads of fathers’ houses, and of the sons of Itamar, according to their fathers’ houses, eight”</b> (I Chronicles 24:4). <b>And it says: “One father’s house taken for Elazar, and proportionately for Itamar”</b> (I Chronicles 24:6)."
        }
      ]
    },
    {
      "chapterNumber": 26,
      "citations": [
        {
          "verseLocation": "1 Chronicles 26:8",
          "verseText": "“All these were of the sons of Oved-edom; they and their sons and their brethren, able men in strength for the service; sixty-two of Oved-edom”",
          "talmudLocation": "Berakhot 64a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/64a#section-1",
          "talmudFullText": "<b>as it is stated: </b> “And Oved-edom had <b>sons…Peulletai the 8th, ” and</b> in the continuation of the same verse <b>it is written: “For God blessed him”</b> (I Chronicles 26:4–5); apparently, these eight children were the blessing, as it is stated: <b>“All these were of the sons of Oved-edom; they and their sons and their brethren, able men in strength for the service; sixty-two of Oved-edom”</b> (I Chronicles 26:8). Each of the nine women gave birth to six sons, for a total of fifty-four. If one adds the original eight, there were sixty-two altogether."
        },
        {
          "verseLocation": "1 Chronicles 26:18",
          "verseText": "“at the Parbar [ laParbar ]”",
          "talmudLocation": "Tamid 27a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/tamid/27a#section-7",
          "talmudFullText": "The Talmud asks: <b>What</b> is the meaning of the term <b>“at the <i>Parbar</i> [<i>laParbar</i>]”</b> (I Chronicles 26:18)? <b>Rabba bar Rav Sheila said: </b> This term is a contraction of two Aramaic words, and it is <b>like one who says: Toward the outside [<i>kelapei bar</i>]. </b>"
        },
        {
          "verseLocation": "1 Chronicles 26:18",
          "verseText": "two at the precinct”",
          "talmudLocation": "Zevachim 55b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/55b#section-11",
          "talmudFullText": "The Talmud asks: <b>What</b> is the <i>halakha</i> with regard to the area <b>behind the Hall of the Ark Cover, </b> i.e., behind the Sanctuary, from where one could not see the entrance of the Temple courtyard or the two wickets? The Talmud answers: <b>Come</b> and <b>hear, as Rami bar Rav Yehuda says</b> that <b>Rav says: There was a small niche behind the Hall of the Ark Cover, </b> which was <b>eight cubits high. </b> The function of this niche was <b>in order to render fit the entire</b> Temple <b>courtyard for the eating of offerings of the most sacred order, and</b> to render fit all of the Temple courtyard <b>for the slaughter of offerings of lesser sanctity. And this is as it is written: </b> “For the precinct westward, four at the causeway, and <b>two at the precinct”</b> (I Chronicles 26:18). <b>What</b> is the meaning of the term: <b>“For the precinct [<i>laparbar</i>]”? Rabba bar Rav Sheila said: </b> It is <b>like one who says: Facing outward [<i>kelappei bar</i>]. </b>"
        },
        {
          "verseLocation": "1 Chronicles 26:24",
          "verseText": "as it is stated: “And Shebuel, the son of Gershom, the son of Moses, was ruler over the treasuries”",
          "talmudLocation": "Bava Batra 110a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/110a#section-6",
          "talmudFullText": "The Talmud continues its discussion of that episode. Later, <b>when</b> King <b>David saw that money was excessively precious to</b> Jonathan, <b>he appointed him</b> as director <b>of the treasuries</b> of the Temple, <b>as it is stated: “And Shebuel, the son of Gershom, the son of Moses, was ruler over the treasuries”</b> (I Chronicles 26:24). The Talmud asks: <b>And was his name</b> really <b>Shebuel; but wasn’t his name Jonathan? R' Yoḥanan says: </b> He is called Shebuel in order to allude to the fact <b>that</b> he repented and <b>returned to God [<i>shav la’el</i> ] with all his heart. </b>"
        },
        {
          "verseLocation": "1 Chronicles 26:31",
          "verseText": "“In the fortieth year of the reign of David they were sought for, and there were found among them mighty men of valor at Jazer of Gilead”",
          "talmudLocation": "Taanit 27a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/27a#section-7",
          "talmudFullText": "<b>Rav Ḥama bar Gurya said</b> that <b>Rav said: Moses</b> initially <b>instituted for the Jews eight priestly watches, four from</b> the descendants of <b>Elazar and four from</b> the descendants of <b>Itamar. Samuel came and established them as sixteen, </b> and <b>David came and established them as twenty-four, as it is stated, </b> after the watches are listed: <b>“In the fortieth year of the reign of David they were sought for, and there were found among them mighty men of valor at Jazer of Gilead”</b> (I Chronicles 26:31)."
        }
      ]
    },
    {
      "chapterNumber": 27,
      "citations": [
        {
          "verseLocation": "1 Chronicles 27:1",
          "verseText": "“In any matter of the courses, which came in and went out month by month throughout all the months of the year”",
          "talmudLocation": "Ketubot 62a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/62a#section-1",
          "talmudFullText": "The Talmud explains its query: Although a man can legally make any agreement with his wife to limit her conjugal rights, <b>how much</b> is an acceptable <b>manner for this matter? Rav said: </b> The husband may spend <b>a month here, </b> in the study hall, <b>and</b> then must spend <b>a month at home. </b> The allusion to this is <b>as it is stated</b> with regard to reserve units serving in King David’s army: <b>“In any matter of the courses, which came in and went out month by month throughout all the months of the year”</b> (I Chronicles 27:1). <b>And R' Yoḥanan said: </b> He may spend <b>one month here, </b> in the study hall, <b>and</b> then <b>two</b> months <b>in his home, as it is stated</b> with regard to workers who worked in the construction of the Temple: <b>“A month they were in Lebanon, and two months at home”</b> (I Kings 5:28)."
        },
        {
          "verseLocation": "1 Chronicles 27:34",
          "verseText": "As it is written: “And after Ahitophel was Benayahu son of Yehoyada and Evyatar, and the general of the king’s army, Yoav”",
          "talmudLocation": "Berakhot 3b:31",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/3b#section-31",
          "talmudFullText": "<b>Rav Yosef said: </b> Upon <b>what verse</b> is this <i>aggada</i> based? <b>As it is written: “And after Ahitophel was Benayahu son of Yehoyada and Evyatar, and the general of the king’s army, Yoav”</b> (I Chronicles 27:34)."
        }
      ]
    },
    {
      "chapterNumber": 28,
      "citations": [
        {
          "verseLocation": "1 Chronicles 28:2",
          "verseText": "from here: “Then King David stood up upon his feet, and said: Hear me, my brethren, and my people”",
          "talmudLocation": "Sotah 40a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/40a#section-14",
          "talmudFullText": "<b>Rav Naḥman said</b> that this principle is derived <b>from here: “Then King David stood up upon his feet, and said: Hear me, my brethren, and my people”</b> (I Chronicles 28:2). Evidently, King David stood up to address the people rather than remain seated. <b>If</b> he said <b>“my brethren, ” why</b> did he say <b>“my people”? And if</b> he said <b>“my people” why</b> did he say <b>“my brethren”? R' Elazar says: David said to the Jewish people: If you listen to me, you are my brethren. And if</b> you do <b>not</b> listen to me willingly, <b>you are my people</b> and I am your king, <b>and I will rule over you</b> by force <b>with a staff. </b> This shows that if the nation acted properly, David would relate to them respectfully."
        },
        {
          "verseLocation": "1 Chronicles 28:11",
          "verseText": "Sanctuary? The Sanctuary is different, as it is written: “Then David gave to Solomon his son the pattern of the Entrance Hall of the Temple, and of its houses, and of its treasuries, and of its upper rooms, and of its inner chambers, and of the place of the ark cover”",
          "talmudLocation": "Pesachim 86a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/86a#section-4",
          "talmudFullText": "<b>Rav Yosef said: Can a person get up and ask</b> based on the <b>Sanctuary? The Sanctuary is different, as it is written: “Then David gave to Solomon his son the pattern of the Entrance Hall of the Temple, and of its houses, and of its treasuries, and of its upper rooms, and of its inner chambers, and of the place of the ark cover”</b> (I Chronicles 28:11), <b>and it is written</b> with regard to the plans for the construction of the Temple: <b>“All this is put in writing by the hand of YHWH, Who has instructed me”</b> (I Chronicles 28:19). Therefore, the general rules of sanctity of roofs do not apply to the Sanctuary, as the details of its construction were determined through Holy Spirit."
        },
        {
          "verseLocation": "1 Chronicles 28:19",
          "verseText": "“All this in writing, as the Lord has made me wise by His hand upon me,",
          "talmudLocation": "Bekhorot 17b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/17b#section-4",
          "talmudFullText": "The Talmud suggests: <b>Come</b> and <b>hear</b> a proof <b>from the measurements of</b> the <b>vessels</b> and <b>from the measurements of</b> the <b>altar</b> of the Temple. Since the Torah gives precise measurements for them, this indicates that it is possible to measure precisely. The Talmud rejects this proof as well: <b>It is different there, as God says: Do</b> it, <b>and to whatever extent you can fulfill</b> His directives, this <b>finds favor</b> in His eyes, as the verse states: <b>“All this in writing, as YHWH has made me wise by His hand upon me, </b> even all the works of this pattern” (I Chronicles 28:19)."
        },
        {
          "verseLocation": "1 Chronicles 28:19",
          "verseText": "“All was in writing, from the hand of the Lord, which He gave me to understand”",
          "talmudLocation": "Chullin 83b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/83b#section-6",
          "talmudFullText": "The Talmud continues: <b>And here, </b> with regard to a bird offering, whose blood is presented on the altar, it is <b>not possible</b> for one to cover the blood with earth from beneath it. As <b>how should one perform</b> the covering of the blood? If one suggests that <b>he should place</b> earth on the altar <b>and nullify</b> that earth to the altar such that it will never be removed from there, this is unfeasible, since by nullifying the earth to the altar, <b>he is adding to the structure</b> of the altar. <b>And it is written</b> with regard to the construction of the Temple: <b>“All was in writing, from the hand of YHWH, which He gave me to understand”</b> (I Chronicles 28:19), indicating that the dimensions of the Temple and all the vessels within were given prophetically and are therefore not subject to change."
        },
        {
          "verseLocation": "1 Chronicles 28:19",
          "verseText": "“All this do I give you in writing as God has made me wise by His hand upon me,",
          "talmudLocation": "Eruvin 104a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/104a#section-8",
          "talmudFullText": "<b>Rav Aḥa, son of Rava, said to Rav Ashi: This salt, what are the circumstances? If one negates it</b> vis-à-vis the ramp so that it becomes part of the ramp, <b>he</b> effectively <b>adds to the structure</b> of the Temple, <b>and it states</b> with regard to the Temple: <b>“All this do I give you in writing as God has made me wise by His hand upon me, </b> even all the works of this pattern” (I Chronicles 28:19). This verse indicates that all the details of the Temple structure were determined through prophecy and may not be changed in any way, even on a weekday."
        },
        {
          "verseLocation": "1 Chronicles 28:19",
          "verseText": "“All this is put in writing by the hand of the Lord, Who has instructed me”",
          "talmudLocation": "Pesachim 86a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/86a#section-4",
          "talmudFullText": "<b>Rav Yosef said: Can a person get up and ask</b> based on the <b>Sanctuary? The Sanctuary is different, as it is written: “Then David gave to Solomon his son the pattern of the Entrance Hall of the Temple, and of its houses, and of its treasuries, and of its upper rooms, and of its inner chambers, and of the place of the ark cover”</b> (I Chronicles 28:11), <b>and it is written</b> with regard to the plans for the construction of the Temple: <b>“All this is put in writing by the hand of YHWH, Who has instructed me”</b> (I Chronicles 28:19). Therefore, the general rules of sanctity of roofs do not apply to the Sanctuary, as the details of its construction were determined through Holy Spirit."
        },
        {
          "verseLocation": "1 Chronicles 28:19",
          "verseText": "the Lord has made me wise by His hand upon me,",
          "talmudLocation": "Sukkah 51b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/51b#section-12",
          "talmudFullText": "The Talmud asks: <b>How could one do so, </b> i.e., alter the structure of the Temple? <b>But isn’t it written</b> with regard to the Temple: <b>“All this</b> I give you <b>in writing, </b> as <b>YHWH has made me wise by His hand upon me, </b> even all the works of this pattern” (I Chronicles 28:19), meaning that all the structural plans of the Temple were divinely inspired; how could the rabbis institute changes?"
        },
        {
          "verseLocation": "1 Chronicles 28:19",
          "verseText": "“All in writing, as the Lord has made me wise by His hand upon me, even all the works of this pattern”",
          "talmudLocation": "Zevachim 33a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/33a#section-5",
          "talmudFullText": "The Talmud suggests: <b>But let an opening [<i>pishpash</i>] be made</b> in the northern courtyard wall facing the altar, where the metzora can insert his hands. The Talmud explains: <b>Abaye and Rava both say</b> that such structural changes cannot be made to the Temple, since the verse states with regard to the Temple construction: <b>“All in writing, as YHWH has made me wise by His hand upon me, even all the works of this pattern”</b> (I Chronicles 28:19)."
        },
        {
          "verseLocation": "1 Chronicles 28:19",
          "verseText": "“All this in writing, as the Lord has made me wise by His hand upon me,",
          "talmudLocation": "Zevachim 62a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/62a#section-2",
          "talmudFullText": "The Talmud relates that after reconsidering the reason for the expansion of the altar, <b>Rav Yosef said: Is this not as it is taught</b> in a <i>baraita</i> with regard to the verse: <b>“And they set the altar upon its bases”</b> (Ezra 3:3), which teaches <b>that</b> in the Second Temple the size of the altar <b>reached its full measure, </b> i.e., that it was the ideal size, whereas in the First Temple it was not the ideal size? The Talmud asks: <b>But isn’t it written</b> with regard to the instructions David gave Solomon about how to build the Temple: <b>“All this in writing, as YHWH has made me wise by His hand upon me, </b> even all the works of this pattern” (I Chronicles 28:19), indicating that the design of the First Temple was dictated by God?"
        }
      ]
    },
    {
      "chapterNumber": 29,
      "citations": [
        {
          "verseLocation": "1 Chronicles 29:11",
          "verseText": "“And You are exalted as head above all”",
          "talmudLocation": "Bava Batra 91b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/91b#section-2",
          "talmudFullText": "With regard to leaders, the Talmud adds that it is stated in praise of God: <b>“And You are exalted as head above all”</b> (I Chronicles 29:11). <b>Rav Ḥanan bar Rava says</b> that <b>Rav says: Even</b> one with the most insignificant position of authority, e.g., <b>an appointee over irrigation, is appointed by Heaven. </b>"
        },
        {
          "verseLocation": "1 Chronicles 29:11",
          "verseText": "“Yours, O Lord, is the greatness, power,",
          "talmudLocation": "Berakhot 58a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/58a#section-14",
          "talmudFullText": "<b>As</b> they <b>considered the sentence, </b> R' Sheila praised God for saving him from danger: <b>“Yours, O Lord, is the greatness, power, </b> glory, triumph, and majesty; for all that is in heaven and on earth is Yours; Yours is the kingdom, O Lord, and You are exalted as head above all” (I Chronicles 29:11). <b>They asked him: What did you say? He told them: This is what I said: Blessed is Merciful One who grants kingdom on earth</b> that is a <b>microcosm of the kingdom in heaven, and granted you dominion and love of justice. They said to him: </b> Indeed, the <b>honor of royalty is so dear to you. They gave him a staff</b> to symbolize his license to sit in judgment and <b>said to him: Judge. </b>"
        },
        {
          "verseLocation": "1 Chronicles 29:19",
          "verseText": "the bira for which I have made provision”",
          "talmudLocation": "Yoma 2a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/2a#section-7",
          "talmudFullText": "The Talmud asks with regard to the terminology of the Mishnah: <b>What is</b> the meaning of the term <b><i>bira</i></b> cited there? <b>Rabba bar bar Ḥana said</b> that <b>R' Yoḥanan said: There was a place on the Temple Mount and its name is <i>bira</i>, </b> and the Chamber of the Stone House was adjacent to it. <b>And Reish Lakish said: The entire Temple is called <i>bira</i>, as it is stated</b> in the prayer of David: “To Solomon my son grant a wholesome heart, to observe your commandments, your admonitions, and your statutes, to fulfill them all, and to build <b>the <i>bira</i> for which I have made provision”</b> (I Chronicles 29:19)."
        },
        {
          "verseLocation": "1 Chronicles 29:19",
          "verseText": "the Temple [ bira ] for which I have made provision”",
          "talmudLocation": "Zevachim 104b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/104b#section-2",
          "talmudFullText": "<strong>Talmud: </strong> The Mishnah teaches that if offerings of a type that are burned were disqualified, they are burned in a place of burning called the <i>bira</i>. The Talmud asks: <b>What</b> is the <b><i>bira</i>? Rabba bar bar Ḥana says</b> that <b>R' Yoḥanan says: There is a place on the Temple Mount, and its name is <i>bira</i>, </b> and this is where they would burn these offerings. <b>And Reish Lakish says: The entire Temple is called</b> the <b><i>bira</i>, as it is stated</b> in the prayer of David: “And give unto Solomon my son a whole heart, to keep Your commandments, Your testimonies, and Your statutes, and to do all this, and to build <b>the Temple [<i>bira</i>] for which I have made provision”</b> (I Chronicles 29:19)."
        },
        {
          "verseLocation": "1 Chronicles 29:22",
          "verseText": "and anointed him unto the Lord to be leader, and Tzadok",
          "talmudLocation": "Sanhedrin 21a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21a#section-1",
          "talmudFullText": "“And they made Solomon, son of David, king the second time, <b>and anointed him unto YHWH to be leader, and Tzadok</b> to be priest” (I Chronicles 29:22). This verse <b>compares a leader, </b> referring to King Solomon, <b>to Tzadok, </b> the High Priest: <b>Just as</b> for <b>Tzadok, half</b> of the shewbread given to the priests is <b>for him, </b> the High Priest, <b>and half</b> is <b>for</b> all <b>his brothers, </b> the other priests, <b>so too</b> for <b>the leader, half</b> is <b>for him and half</b> is <b>for his brothers, </b> the rest of the army."
        },
        {
          "verseLocation": "1 Chronicles 29:23",
          "verseText": "the earthly worlds, as it is stated: “Then Solomon sat upon the throne of the Lord as king”",
          "talmudLocation": "Megillah 11b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-2",
          "talmudFullText": "The Talmud asks: This works out <b>well according to the one who said</b> that Solomon was first <b>a king and</b> then <b>a commoner, </b> never returning to the throne. <b>But according to the one who said that he was</b> first <b>a king and</b> then <b>a commoner, and</b> then afterward he returned again to be <b>a king, what can be said</b> to explain why he is not mentioned in the list of kings who ruled over the entire world? The Talmud answers: <b>There was something else about Solomon</b> that makes it impossible to compare him to the others, <b>for he ruled over</b> the inhabitants of <b>the heavenly worlds, </b> i.e., demons and spirits, <b>as well as</b> the human inhabitants of <b>the earthly worlds, as it is stated: “Then Solomon sat upon the throne of YHWH as king”</b> (I Chronicles 29:23), which indicates that his reign extended even to the heavenly worlds, with King Solomon sitting upon the throne of YHWH, and therefore he cannot be compared to the others, who merely ruled on earth."
        },
        {
          "verseLocation": "1 Chronicles 29:23",
          "verseText": "a king, as it is stated: “Then Solomon sat on the throne [ kisei ] of the Lord as king”",
          "talmudLocation": "Sanhedrin 20b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/20b#section-12",
          "talmudFullText": "<b>When</b> the verse <b>states: “The hand upon the throne [<i>kes</i>] of YHWH: YHWH will have war with Amalek</b> from generation to generation” (Exodus 17:16), <b>you must say</b> that this means they are obligated <b>to establish a king for themselves first, </b> before waging war with Amalek, <b>and</b> the verse is interpreted as follows: <b>“Throne</b> of YHWH” <b>is nothing other than</b> a symbolic name for <b>a king, as it is stated: “Then Solomon sat on the throne [<i>kisei</i>] of YHWH as king”</b> (I Chronicles 29:23), indicating that a king sits on “the throne of YHWH. ”"
        },
        {
          "verseLocation": "1 Chronicles 29:23",
          "verseText": "as it is stated: “Then Solomon sat on the throne of the Lord”",
          "talmudLocation": "Sanhedrin 20b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/20b#section-15",
          "talmudFullText": "§ The Talmud cites another tradition about Solomon’s kingdom. <b>Reish Lakish says: Initially, Solomon ruled</b> even <b>over the supernal</b> worlds, <b>as it is stated: “Then Solomon sat on the throne of YHWH”</b> (I Chronicles 29:23), indicating that his kingdom was like YHWH’s kingdom, reigning over all worlds. <b>But ultimately, </b> after he married foreign wives, <b>he ruled over</b> only <b>the lower</b> worlds, <b>as it is stated: “For he had dominion over all the region on this side of the river, from Tiphsah even to Gaza”</b> (I Kings 5:4)."
        }
      ]
    },
    {
      "chapterNumber": 35,
      "citations": [
        {
          "verseLocation": "1 Chronicles 35:3",
          "verseText": "As it is stated: “And he said to the Levites who taught all of Israel, who were sacred to the Lord: Put the sacred Ark in the house that Solomon, son of David, king of Israel, built. There shall no more be a burden upon your shoulders; now serve the Lord your God, and His people Israel”",
          "talmudLocation": "Yoma 52b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/52b#section-13",
          "talmudFullText": "The Talmud cites the source for the tradition that Josiah buried the Ark. <b>As it is stated: “And he said to the Levites who taught all of Israel, who were sacred to YHWH: Put the sacred Ark in the house that Solomon, son of David, king of Israel, built. There shall no more be a burden upon your shoulders; now serve YHWH your God, and His people Israel”</b> (I Chronicles 35:3). In other words, from now onward the Levites will no longer carry the Ark on their shoulders, and they should dedicate themselves to their service of singing and locking the gates of the Temple."
        }
      ]
    }
  ]
}