{
  "bookName": "2 Chronicles",
  "totalEntries": 110,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "2 Chronicles 1:13",
          "verseText": "the verse states: “And Solomon came to the high place that was at Gibeon, Jerusalem”",
          "talmudLocation": "Yoma 53a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/53a#section-21",
          "talmudFullText": "§ The Mishnah teaches that the High Priest <b>exits and comes</b> out <b>the way</b> that <b>he entered, </b> i.e., he does not turn around, but walks backward with his face toward the Ark. The Talmud asks: <b>From where are these matters</b> derived; what is the source in the Torah for this <i>halakha</i>? <b>R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said</b> that <b>the verse states: “And Solomon came to the high place that was at Gibeon, Jerusalem”</b> (II Chronicles 1:13). <b>Now, what does Gibeon have to do with Jerusalem? </b> Either he came to Gibeon or to Jerusalem; these are two different places."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "2 Chronicles 2:3",
          "verseText": "This is an ordinance forever for Israel”",
          "talmudLocation": "Menachot 110a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/110a#section-9",
          "talmudFullText": "§ The Talmud cites another verse that is interpreted in a similar vein. King Solomon said to Hiram of Tyre: “Behold, I am about to build a house for the name of YHWH my God, to dedicate it to Him, and to burn before Him incense of sweet spices, and for the continual shewbread, and for the burnt offerings morning and evening, on the <i>Shabbatot</i>, and on the New Moons, and on the Festivals of YHWH our God. <b>This is an ordinance forever for Israel”</b> (II Chronicles 2:3). Since the Temple was eventually destroyed, what did Solomon mean when he said that it is “an ordinance forever”? <b>Rav Giddel says</b> that <b>Rav says: This</b> is referring to the <b>altar</b> that remains <b>built</b> in Heaven even after the earthly Temple was destroyed, <b>and</b> the angel <b>Michael, the great minister, stands and sacrifices an offering upon it. </b>"
        },
        {
          "verseLocation": "2 Chronicles 2:13",
          "verseText": "from the house of Dan,",
          "talmudLocation": "Arakhin 16b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/16b#section-20",
          "talmudFullText": "<b>And the Master says: </b> Hiram’s <b>mother</b> was also <b>from the house of Dan, </b> as the verse states about him: “The son of a woman of the daughters of Dan” (II Chronicles 2:13). <b>And it is written</b> with regard to those who constructed the Tabernacle: <b>“And with him was Oholiab, the son of Ahisamach, of the tribe of Dan, </b> a craftsman, and a skillful workman, and a weaver in colors, in blue, and in purple, and in scarlet, and fine linen” (Exodus 38:23). This teaches that Hiram continued in the craft of brass work, the craft of his father’s family and also of his mother’s family from Dan."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "2 Chronicles 3:2",
          "verseText": "And it says: “And he began to build",
          "talmudLocation": "Rosh Hashanah 3a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/3a#section-13",
          "talmudFullText": "<b>And it says: “And it came to pass in the second year, in the second month, </b> on the twentieth day of the month, that the cloud was taken up from off the Tabernacle of the testimony” (Numbers 10:11). <b>And it says: “In the 3rd month, after the children of Israel had gone out</b> of the land of Egypt, the same day they came into the wilderness of Sinai” (Exodus 19:1). <b>And it says: “And he began to build</b> in the second month, in the second, in the 4th year of his reign” (II Chronicles 3:2). This list of verses summarizes R' Yoḥanan’s explanation."
        },
        {
          "verseLocation": "2 Chronicles 3:2",
          "verseText": "“And he began to build in the second month, in the second, in the fourth year of his reign”",
          "talmudLocation": "Rosh Hashanah 3a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/3a#section-8",
          "talmudFullText": "<b>Rather, R' Elazar said: </b> It is <b>from here</b> that it is derived that the years of a king’s rule are counted from Nisan, as it is stated: <b>“And he began to build in the second month, in the second, in the 4th year of his reign”</b> (II Chronicles 3:2). <b>What is</b> the meaning of the words <b>“the second”? Doesn’t it</b> mean <b>second to the month from which</b> Solomon’s <b>reign is counted? </b> This is clear proof that the years of a king’s rule are counted from the first month, i.e., the month of Nisan."
        },
        {
          "verseLocation": "2 Chronicles 3:2",
          "verseText": "in the fourth year of his reign”",
          "talmudLocation": "Zevachim 119a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/119a#section-2",
          "talmudFullText": "<b>And with regard to</b> the construction of the Temple in the time of <b>Solomon, it is written: “And he began to build it</b> in the second day of the second month, <b>in the 4th year of his reign”</b> (II Chronicles 3:2), which was the 480th year following the Exodus (see I Kings 6:1). When the forty years in the wilderness, the fourteen years that the Tabernacle stood in Gilgal, and the fifty-seven years that the Tabernacle stood in Nov and Gibeon, which totals 111 years, are subtracted from the 480, there <b>remain for Shiloh 370 less one</b> years in which the Tabernacle stood there."
        },
        {
          "verseLocation": "2 Chronicles 3:6",
          "verseText": "and parvayim gold",
          "talmudLocation": "Yoma 44b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/44b#section-17",
          "talmudFullText": "§ The Mishnah states: <b>On every</b> other <b>day, it was</b> of <b>greenish gold</b> but on this day it was of a red gold. <b>Rav Ḥisda said: There are seven</b> types <b>of gold</b> mentioned in the Bible: <b>Gold, and good gold, and gold of Ophir</b> (I Kings 10:11), <b>and glistering gold</b> (I Kings 10:18), <b>and <i>shaḥut</i> gold</b> (I Kings 10:17), <b>and closed gold</b> (I Kings 10:21), <b>and <i>parvayim</i> gold</b> (II Chronicles 3:6). The Talmud explains the reason for these names: There is a distinction between <b>gold and good gold, as it is written</b> in the verse: <b>“And the gold of that land is good”</b> (Genesis 2:12), which indicates the existence of gold of a higher quality. <b>Gold of Ophir</b> is gold <b>that comes from Ophir. Glistering [<i>mufaz</i>] gold</b> is so named"
        },
        {
          "verseLocation": "2 Chronicles 3:10",
          "verseText": "form of children,",
          "talmudLocation": "Bava Batra 99a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/99a#section-7",
          "talmudFullText": "The Talmud asks: <b>And according to the one who says</b> they stood as described in the verse: <b>“And their faces were toward the House, ” isn’t it written: “With their faces one toward the other”</b> (Exodus 25:20). How does he explain the meaning of this verse? The Talmud answers: <b>They were angled sideways</b> so that they turned both to each other and toward the Sanctuary, <b>as it is taught</b> in a <i>baraita</i>: <b>Onkelos the Convert said</b> that the <b>cherubs were</b> of the <b>form of children, </b> as the verse states: “And in the Holy of Holies he made two cherubim of the form of children; and they overlaid them with gold” (II Chronicles 3:10), <b>and their faces were angled sideways</b> toward the Ark of the Covenant, <b>like a student taking leave of his teacher. </b>"
        },
        {
          "verseLocation": "2 Chronicles 3:13",
          "verseText": "one toward the other, isn’t it written: “And their faces were toward the House”",
          "talmudLocation": "Bava Batra 99a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/99a#section-6",
          "talmudFullText": "§ Continuing its focus on the cherubs, the Talmud asks: <b>How were</b> the cherubs <b>standing? R' Yoḥanan and R' Elazar</b> disagree about this. <b>One says: Their faces</b> were turned <b>one toward the other. And one says: Their faces</b> were turned <b>toward the House, </b> i.e., the Sanctuary. The Talmud asks: <b>But according to the one who says</b> that <b>their faces</b> were turned <b>one toward the other, isn’t it written: “And their faces were toward the House”</b> (II Chronicles 3:13)? How does he explain the meaning of this verse? The Talmud answers: This is <b>not difficult, </b> as their faces miraculously changed directions in reflection of the Jewish people’s relationship to God. <b>Here, </b> when it states that the cherubs faced each other, it was <b>when the Jewish people do the will of God. There, </b> the verse that describes that the cherubs faced the Sanctuary and not toward each other, was <b>when the Jewish people do not do the will of God. </b>"
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "2 Chronicles 4:4",
          "verseText": "“It stood upon twelve oxen, three looking toward the north, and three looking toward the west, and three looking toward the south, and three looking toward the east; and the sea was set upon them above, and all their hinder parts were inward”",
          "talmudLocation": "Yoma 58b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/58b#section-12",
          "talmudFullText": "<b>As Rami bar Yeḥezkel said: </b> A verse describes <b>the sea, </b> the basin <b>that Solomon built, </b> in the following terms: <b>“It stood upon twelve oxen, three looking toward the north, and three looking toward the west, and three looking toward the south, and three looking toward the east; and the sea was set upon them above, and all their hinder parts were inward”</b> (II Chronicles 4:4). From the direction in which the text lists the groups of oxen under the basin, <b>you learn that all turns that you turn should be only to the right</b> and <b>to the east</b> side. Let us say that <b>this Sage, </b> R' Yosei HaGelili, <b>is of</b> the opinion that the ruling is in accordance with the opinion <b>of Rami bar Yeḥezkel, and this Sage, </b> R' Akiva, <b>is of</b> the opinion that the ruling is <b>not</b> in accordance with the opinion of <b>Rami bar Yeḥezkel. </b>"
        },
        {
          "verseLocation": "2 Chronicles 4:4",
          "verseText": "“It stood upon twelve oxen, three looking toward [ ponim ] the north, and three looking toward [ ponim ] the west, and three looking toward [ ponim ] the south, and three looking toward [ ponim ] the east”",
          "talmudLocation": "Zevachim 62b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/62b#section-8",
          "talmudFullText": "The Talmud challenges: The verse indicates only that after a person turns he is facing eastward. Why not <b>say</b> that the ramp was located in the north and the priest turns <b>left</b> and faces <b>eastward? </b> The Talmud answers: This possibility should <b>not enter your mind, as Rami bar Yeḥizkiya teaches: </b> A verse describes the <b>sea, </b> i.e., the Basin, <b>that Solomon built, </b> in the following terms: <b>“It stood upon twelve oxen, three looking toward [<i>ponim</i>] the north, and three looking toward [<i>ponim</i>] the west, and three looking toward [<i>ponim</i>] the south, and three looking toward [<i>ponim</i>] the east”</b> (II Chronicles 4:4). From the order of the directions in which the verse lists the groups of oxen under the Basin, it can be derived that <b>all the turns that you turn should be only to the right</b> and <b>to the east. </b>"
        },
        {
          "verseLocation": "2 Chronicles 4:7",
          "verseText": "as it is stated: “And he made the ten candelabra of gold according to the ordinance concerning them; and he set them in the Sanctuary, five on the right, and five on the left”",
          "talmudLocation": "Menachot 98b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/98b#section-7",
          "talmudFullText": "Similarly, <b>A baraita states: </b> King <b>Solomon built ten</b> additional <b>candelabra, </b> modeled after the one that Moses crafted, <b>as it is stated: “And he made the ten candelabra of gold according to the ordinance concerning them; and he set them in the Sanctuary, five on the right, and five on the left”</b> (II Chronicles 4:7)."
        },
        {
          "verseLocation": "2 Chronicles 4:8",
          "verseText": "“He made also ten tables, and placed them in the Sanctuary, five on the right side, and five on the left”",
          "talmudLocation": "Menachot 98b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/98b#section-4",
          "talmudFullText": "§ <b>A baraita states: King Solomon built ten</b> additional <b>tables, </b> modeled after the one that Moses crafted, <b>as it is stated</b> in the description of the Temple constructed by Solomon: <b>“He made also ten tables, and placed them in the Sanctuary, five on the right side, and five on the left”</b> (II Chronicles 4:8)."
        },
        {
          "verseLocation": "2 Chronicles 4:16",
          "verseText": "“bright brass”",
          "talmudLocation": "Arakhin 10b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/10b#section-13",
          "talmudFullText": "The <i>baraita</i> concludes: <b>These two</b> copper <b>vessels, </b> the cymbal and the mortar, <b>were remnants from the First Temple and they were damaged and they</b> could <b>not be repaired</b> in an effective manner. <b>And</b> it was <b>with regard to</b> the copper vessels constructed for the First Temple that <b>David said: </b> “All these vessels, which Hiram made for King Solomon, in the House of YHWH, were of <b>burnished brass”</b> (I Kings 7:45), and, in a parallel verse, <b>“bright brass”</b> (II Chronicles 4:16). <b>And with regard to</b> these two items <b>it states</b> in the verse describing the vessels that Ezra brought to Jerusalem: <b>“And vessels of fine golden brass, two, precious as gold”</b> (Ezra 8:27)."
        },
        {
          "verseLocation": "2 Chronicles 4:19",
          "verseText": "the tables upon which was the shewbread”",
          "talmudLocation": "Menachot 99a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/99a#section-7",
          "talmudFullText": "<b>R' Elazar ben Shammua says: They would arrange</b> the shewbread <b>upon all</b> the tables, <b>as it is stated: </b> “And Solomon made all the vessels that were in the House of God, the golden altar as well, and <b>the tables upon which was the shewbread”</b> (II Chronicles 4:19). The plural form indicates that the shewbread was arranged on all the tables. <b>And they would kindle</b> the lamps <b>on all</b> the candelabra, <b>as it is stated</b> in the subsequent verse: <b>“And the candelabra with their lamps, which they should burn according to the ordinance before the Sanctuary, of pure gold”</b> (II Chronicles 4:20)."
        },
        {
          "verseLocation": "2 Chronicles 4:20",
          "verseText": "“And the candelabra with their lamps, which they should burn according to the ordinance before the Sanctuary, of pure gold”",
          "talmudLocation": "Menachot 99a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/99a#section-7",
          "talmudFullText": "<b>R' Elazar ben Shammua says: They would arrange</b> the shewbread <b>upon all</b> the tables, <b>as it is stated: </b> “And Solomon made all the vessels that were in the House of God, the golden altar as well, and <b>the tables upon which was the shewbread”</b> (II Chronicles 4:19). The plural form indicates that the shewbread was arranged on all the tables. <b>And they would kindle</b> the lamps <b>on all</b> the candelabra, <b>as it is stated</b> in the subsequent verse: <b>“And the candelabra with their lamps, which they should burn according to the ordinance before the Sanctuary, of pure gold”</b> (II Chronicles 4:20)."
        },
        {
          "verseLocation": "2 Chronicles 4:21",
          "verseText": "It is written: “And the flowers, and the lamps, and the tongs, of gold, and that perfect gold [ mikhlot zahav ]”",
          "talmudLocation": "Menachot 29a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/29a#section-5",
          "talmudFullText": "§ <b>It is written: “And the flowers, and the lamps, and the tongs, of gold, and that perfect gold [<i>mikhlot zahav</i>]”</b> (II Chronicles 4:21). The Talmud asks: <b>What</b> is meant by <b><i>mikhlot zahav</i>? Rav Ami says: </b> It is a reference to the fact <b>that</b> the Candelabrum and its vessels <b>exhausted [<i>kilattu</i>] all of Solomon’s pure [<i>sagur</i>] gold [<i>zahav</i>], </b> which was used in its fashioning in such great quantities. <b>As Rav Yehuda says</b> that <b>Rav said: Solomon made ten Candelabrums, and for each and every one he brought one thousand talents of gold, and they placed</b> the gold <b>in the furnace</b> to refine it <b>one thousand times, until they reduced</b> the gold <b>to</b> one <b>talent</b> for each Candelabrum, as it is stated: “Of a talent of pure gold shall it be made” (Exodus 25:39)."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "2 Chronicles 5:12",
          "verseText": "as it is stated: “And with them one hundred and twenty priests sounding with trumpets”",
          "talmudLocation": "Arakhin 13b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/13b#section-4",
          "talmudFullText": "§ The Mishnah teaches that one plays no fewer <b>than two trumpets, and one may add</b> to that number. The Talmud asks: <b>Until how many</b> trumpets may these additions be made? The Talmud answers that <b>Rav Huna says, and some say Rav Zavdi says</b> that <b>Rav Huna says: </b> They may play <b>up to 120</b> trumpets, <b>as it is stated: “And with them one hundred and twenty priests sounding with trumpets”</b> (II Chronicles 5:12)."
        },
        {
          "verseLocation": "2 Chronicles 5:13",
          "verseText": "from here: “It came to pass, when the trumpeters and singers were as one, to make one sound",
          "talmudLocation": "Arakhin 11b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/11b#section-1",
          "talmudFullText": "This indicates that God responded to Moses, who was a Levite, by commanding him <b>about matters</b> pertaining to the <b>voice, </b> i.e., that the Levites must accompany the sacrifices with song. <b>Rav Ashi says</b> that the obligation for the Levites to sing in the Temple is derived <b>from here: “It came to pass, when the trumpeters and singers were as one, to make one sound</b> to be heard in praising and thanking YHWH” (II Chronicles 5:13). This indicates that just as there is a requirement for trumpets to be sounded during the sacrifice of communal offerings (see Numbers 10:10), there is likewise a requirement for the Levites to sing."
        },
        {
          "verseLocation": "2 Chronicles 5:13",
          "verseText": "“It came to pass, when the trumpeters and singers were as one, to make one sound to be heard”",
          "talmudLocation": "Chullin 24b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/24b#section-1",
          "talmudFullText": "<b>“It came to pass, when the trumpeters and singers were as one, to make one sound to be heard”</b> (II Chronicles 5:13). This indicates that the Levites must be capable of singing in one voice, and one who is unable to do so is unfit for service."
        },
        {
          "verseLocation": "2 Chronicles 5:13",
          "verseText": "as it is written: “And it came to pass, when the trumpeters and the singers were as one to make one sound”",
          "talmudLocation": "Sukkah 51a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/51a#section-13",
          "talmudFullText": "The Talmud asks: <b>What is the rationale</b> for the opinion <b>of the one who said: </b> The <b>primary</b> essence of <b>song</b> is singing <b>with the mouth? </b> The Talmud answers: It is <b>as it is written: “And it came to pass, when the trumpeters and the singers were as one to make one sound”</b> (II Chronicles 5:13). Since the verse does not mention any musical instrument played with the singing other than the trumpets, and the trumpets were not sounded as accompaniment for the singers, apparently the primary essence of song is singing with the mouth. The trumpets were sounded in order to accompany the sacrifice of the daily and additional offerings with the requisite sounds of <i>tekia</i> and <i>terua</i>."
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "2 Chronicles 6:9",
          "verseText": "“Yet you shall not build the house”",
          "talmudLocation": "Megillah 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-7",
          "talmudFullText": "Similarly, the verse states: <b>“And it came to pass, when Samuel was old”</b> (I Samuel 8:1), and then it is written: <b>“And his sons did not walk in his ways”</b> (I Samuel 8:3). Also, it states: <b>“And it came to pass that David was successful in all his ways, and YHWH was with him”</b> (I Samuel 18:14), and only a few verses prior it is written: <b>“And Saul viewed David with suspicion”</b> (I Samuel 18:9). In another instance, the verse states: <b>“And it came to pass, when the king dwelt in his house”</b> (II Samuel 7:1). Here King David mentioned his desire to build a temple for God, but it is written elsewhere that he was told: <b>“Yet you shall not build the house”</b> (II Chronicles 6:9)."
        },
        {
          "verseLocation": "2 Chronicles 6:32",
          "verseText": "One who was standing in Jerusalem should focus his heart toward the Temple, as it is stated: “And they shall pray toward this house”",
          "talmudLocation": "Berakhot 30a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/30a#section-9",
          "talmudFullText": "<b>One who was standing</b> in prayer <b>in the Diaspora should focus his heart toward Eretz Yisrael, as it is stated: “And they shall pray to You by way of their land</b> which You have given to their fathers” (I Kings 8:48). <b><b>One who was standing in Eretz Yisrael should focus his heart toward Jerusalem, as it is stated: “And they shall pray to YHWH by way of the city that You have chosen”</b> (I Kings 8:44). <b><b>One who was standing in Jerusalem should focus his heart toward the Temple, as it is stated: “And they shall pray toward this house”</b> (II Chronicles 6:32). <b><b>One who was standing in the Temple should focus his heart toward the Holy of Holies, as it is stated: “And they shall pray toward this place”</b> (I Kings 8:35). <b><b>One who was standing in the Holy of Holies should focus his heart toward the seat of the ark-cover [<i>kapporet</i>], </b> atop the ark, the dwelling place of God’s glory. <br><b>One who was standing behind the seat of the ark-cover should visualize himself as if standing before the ark-cover</b> and turn toward it. <b><b>Consequently, </b> one <b>standing</b> in prayer <b>in the East turns to face west, </b> and one standing <b>in the West turns to face east. </b> One standing <b>in the South turns to face north, </b> and one standing <b>in the North turns to face south; Consequently, all of</b> the people of <b>Israel focus</b> themselves <b>focusing their hearts toward one place, </b> the Holy of Holies in the Temple."
        },
        {
          "verseLocation": "2 Chronicles 6:42",
          "verseText": "Once he said: “O Lord God, turn not away the face of Your anointed; remember the good deeds of David Your servant”",
          "talmudLocation": "Sanhedrin 107b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107b#section-4",
          "talmudFullText": "<b>Once he said: “O Lord God, turn not away the face of Your anointed; remember the good deeds of David Your servant”</b> (II Chronicles 6:42), <b>he was immediately answered, </b> and the gates opened (II Chronicles 7:1). <b>At that moment, the faces of all of David’s enemies turned</b> dark <b>like the</b> charred <b>bottom of a pot. And all of the Jewish people knew that God had forgiven him for that sin, </b> as it was only by David’s merit that Solomon’s prayer was answered."
        },
        {
          "verseLocation": "2 Chronicles 6:42",
          "verseText": "and he was not answered. When he said: “O Lord God, turn not away the face of Your anointed; remember the good deeds of David Your servant”",
          "talmudLocation": "Shabbat 30a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/30a#section-7",
          "talmudFullText": "<b>When Solomon built the Temple</b> and <b>sought to bring the Ark into the Holy of Holies, </b> the <b>gates clung together</b> and could not be opened. <b>Solomon uttered twenty-four songs</b> of praise, as in his prayer there are twenty-four expressions of prayer, song, etc. (I Kings 8), <b>and</b> his prayer <b>was not answered. He began and said: “Lift up your heads, O you gates, and be you lifted up, you everlasting doors; that the King of glory may come in”</b> (Psalms 24:7). Immediately, the gates <b>ran after him to swallow him, </b> as they thought that in the words: “King of glory” he was referring to himself, <b>and they said</b> to him: <b>“Who is the King of glory? ”</b> (Psalms 24:8). <b>He said to them: “YHWH strong and mighty, </b> YHWH mighty in battle” (Psalms 24:8). And <b>he said</b> again: <b>“Lift up your heads, O you gates, yea, lift them up, you everlasting doors; that the King of glory may come in. Who then is the King of glory? YHWH of hosts; He is the King of glory. Selah”</b> (Psalms 24:9–10), <b>and he was not answered. When he said: “O Lord God, turn not away the face of Your anointed; remember the good deeds of David Your servant”</b> (II Chronicles 6:42), <b>he was immediately answered, </b> and a fire descended from Heaven (II Chronicles 7:1). <b>At that moment, the faces of all of David’s enemies turned</b> dark <b>like the</b> charred <b>bottom of a pot. And</b> all of <b>Israel knew that God forgave him for that sin. And</b> if so, is it <b>not appropriate</b> what <b>Solomon said: “And I praised the dead that are already dead, ”</b> David, more than the living, Solomon, to whose request to open the gates of the Temple God did not respond?"
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "2 Chronicles 7:1",
          "verseText": "he was immediately answered,",
          "talmudLocation": "Sanhedrin 107b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107b#section-4",
          "talmudFullText": "<b>Once he said: “O Lord God, turn not away the face of Your anointed; remember the good deeds of David Your servant”</b> (II Chronicles 6:42), <b>he was immediately answered, </b> and the gates opened (II Chronicles 7:1). <b>At that moment, the faces of all of David’s enemies turned</b> dark <b>like the</b> charred <b>bottom of a pot. And all of the Jewish people knew that God had forgiven him for that sin, </b> as it was only by David’s merit that Solomon’s prayer was answered."
        },
        {
          "verseLocation": "2 Chronicles 7:1",
          "verseText": "he was immediately answered,",
          "talmudLocation": "Shabbat 30a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/30a#section-7",
          "talmudFullText": "<b>When Solomon built the Temple</b> and <b>sought to bring the Ark into the Holy of Holies, </b> the <b>gates clung together</b> and could not be opened. <b>Solomon uttered twenty-four songs</b> of praise, as in his prayer there are twenty-four expressions of prayer, song, etc. (I Kings 8), <b>and</b> his prayer <b>was not answered. He began and said: “Lift up your heads, O you gates, and be you lifted up, you everlasting doors; that the King of glory may come in”</b> (Psalms 24:7). Immediately, the gates <b>ran after him to swallow him, </b> as they thought that in the words: “King of glory” he was referring to himself, <b>and they said</b> to him: <b>“Who is the King of glory? ”</b> (Psalms 24:8). <b>He said to them: “YHWH strong and mighty, </b> YHWH mighty in battle” (Psalms 24:8). And <b>he said</b> again: <b>“Lift up your heads, O you gates, yea, lift them up, you everlasting doors; that the King of glory may come in. Who then is the King of glory? YHWH of hosts; He is the King of glory. Selah”</b> (Psalms 24:9–10), <b>and he was not answered. When he said: “O Lord God, turn not away the face of Your anointed; remember the good deeds of David Your servant”</b> (II Chronicles 6:42), <b>he was immediately answered, </b> and a fire descended from Heaven (II Chronicles 7:1). <b>At that moment, the faces of all of David’s enemies turned</b> dark <b>like the</b> charred <b>bottom of a pot. And</b> all of <b>Israel knew that God forgave him for that sin. And</b> if so, is it <b>not appropriate</b> what <b>Solomon said: “And I praised the dead that are already dead, ”</b> David, more than the living, Solomon, to whose request to open the gates of the Temple God did not respond?"
        },
        {
          "verseLocation": "2 Chronicles 7:3",
          "verseText": "“And when all the children of Israel saw how the fire came down, and the glory of the Lord upon the House, and they bowed with their faces to the ground upon the pavement, and prostrated themselves, and praised the Lord, saying: For He is good, for His steadfast love endures forever”",
          "talmudLocation": "Shevuot 16b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/16b#section-8",
          "talmudFullText": "The Talmud asks: <b>And what is the measure of</b> that <b>tarrying? R' Yitzḥak bar Naḥmani and one</b> other Sage <b>who was with him disagree about this. And who is</b> that other scholar? <b>R' Shimon ben Pazi. And some say</b> that it was <b>R' Shimon ben Pazi and one</b> other Sage <b>who was with him. And who is</b> that other scholar? <b>R' Yitzḥak bar Naḥmani. And some say</b> it was <b>R' Shimon bar Naḥmani. One</b> Sage <b>says: </b> It is as long <b>as</b> the time it takes <b>to recite this</b> following <b>verse</b> in its entirety, <b>and one</b> Sage <b>says: </b> It is as long <b>as</b> the time it takes to recite <b>from</b> the term <b>“and they bowed”</b> in the middle of that verse <b>until the end. </b> What is the verse? <b>“And when all the children of Israel saw how the fire came down, and the glory of YHWH upon the House, and they bowed with their faces to the ground upon the pavement, and prostrated themselves, and praised YHWH, saying: For He is good, for His steadfast love endures forever”</b> (II Chronicles 7:3)."
        },
        {
          "verseLocation": "2 Chronicles 7:3",
          "verseText": "combining periods of tarrying,",
          "talmudLocation": "Shevuot 17a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/17a#section-6",
          "talmudFullText": "<b>Rava raised a dilemma: What is</b> the <i>halakha</i> with regard to <b>combining periods of tarrying, </b> each of which is less than the amount of time necessary to recite the second portion of the verse mentioned above (II Chronicles 7:3)? If an impure person tarried in the Temple for less than the amount of time needed to bow down, and then started to leave, and then tarried again for less than the amount of time needed to bow down, do those two periods of tarrying combine together, so that if he tarried in total long enough to bow down, he is liable? The Talmud challenges: <b>Let</b> Rava <b>resolve</b> his dilemma <b>from his own</b> statement with regard to one who left the Temple with small steps, heel to toe, as such a person tarries intermittently between steps. The Talmud answers: <b>There</b> Rava is referring to one <b>who did not tarry</b> at all, walking continuously without interruption, albeit slowly. When Rava raised his dilemma here, it was with regard to one who stopped walking altogether and tarried."
        },
        {
          "verseLocation": "2 Chronicles 7:10",
          "verseText": "it is written: “And on the twenty-third day of the seventh month he sent the people away”",
          "talmudLocation": "Moed Katan 9a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/9a#section-21",
          "talmudFullText": "<b>They said to him: You have taught us, our teacher, </b> that <b>a disciple who takes leave of his teacher and</b> then <b>stays overnight in the same city must take leave of him an additional time, as it is stated</b> at the conclusion of the dedication of the Temple: <b>“On the 8th day he sent the people away, and they blessed the king”</b> (I Kings 8:66), <b>and</b> elsewhere <b>it is written: “And on the twenty-3rd day of the 7th month he sent the people away”</b> (II Chronicles 7:10). The 8th day in the verse is referring to the 8th Day of Assembly, the 22nd of the month of Tishrei, yet it says that he sent the people away on the next day, the twenty-3rd of the month."
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "2 Chronicles 9:20",
          "verseText": "But isn’t it written: “And all King Solomon’s drinking vessels were of gold, and all the vessels of the house of the forest of Lebanon were of pure gold;silver was nothing accounted of in the days of Solomon”",
          "talmudLocation": "Menachot 29a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/29a#section-6",
          "talmudFullText": "The Talmud asks: <b>Is that so</b> that all of Solomon’s gold was exhausted for the fashioning of the Candelabrum and its vessels? <b>But isn’t it written: “And all King Solomon’s drinking vessels were of gold, and all the vessels of the house of the forest of Lebanon were of pure gold; silver was nothing accounted of in the days of Solomon”</b> (II Chronicles 9:20)? The Talmud answers: <b>We are saying</b> that Solomon’s <b>pure gold</b> was exhausted for the fashioning of the Candelabrum, but not all of his gold."
        },
        {
          "verseLocation": "2 Chronicles 9:20",
          "verseText": "“Silver was not worth anything in the days of Solomon”",
          "talmudLocation": "Sanhedrin 21b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21b#section-14",
          "talmudFullText": "<b>R' Yitzḥak raises a contradiction: It is written</b> in one verse: <b>“Silver was not worth anything in the days of Solomon”</b> (II Chronicles 9:20), <b>and it is written</b> in another verse: <b>“And the king made silver in Jerusalem as stones”</b> (I Kings 10:27), i.e., gems. The Talmud responds: It is <b>not difficult: Here, </b> where silver was worthless, this was <b>before Solomon</b> sinfully <b>married Pharaoh’s daughter. There, </b> where the silver was valuable, this was <b>after Solomon married Pharaoh’s daughter. </b>"
        },
        {
          "verseLocation": "2 Chronicles 9:25",
          "verseText": "“And Solomon had four thousand stalls for horses",
          "talmudLocation": "Sanhedrin 21b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21b#section-13",
          "talmudFullText": "§ <b>Rav Yehuda raises a contradiction: It is written</b> in one verse: <b>“And Solomon had forty thousand stalls of horses for his chariots”</b> (I Kings 5:6), <b>and it is written</b> in another verse: <b>“And Solomon had four thousand stalls for horses</b> and chariots” (II Chronicles 9:25). <b>How</b> can <b>these</b> texts be reconciled? <b>If there were forty thousand large stables [<i>itztablaot</i>], each and every one</b> of them <b>had in it four thousand stalls, </b> or rows, <b>for horses. And</b> alternatively, <b>if there were four thousand large stables, each and every one had in it forty thousand stalls for horses. </b> Therefore the two verses are reconciled."
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "2 Chronicles 13:11",
          "verseText": "evening”",
          "talmudLocation": "Menachot 99a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/99a#section-6",
          "talmudFullText": "Likewise, <b>Solomon built ten candelabra, but</b> the priests <b>would kindle</b> the lamps <b>only on</b> the Candelabrum <b>of Moses. </b> This is derived from a verse, <b>as it is stated: </b> “And they burn unto YHWH every morning and every evening burnt offerings and sweet incense; the shewbread also they arrange in order upon the pure Table, and <b>the Candelabrum of gold with its lamps, to burn</b> every <b>evening”</b> (II Chronicles 13:11). The singular form indicates that the lamps were kindled on only one Candelabrum."
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "2 Chronicles 14:6",
          "verseText": "“And he said to Judah: Let us build these cities”",
          "talmudLocation": "Megillah 4a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/4a#section-4",
          "talmudFullText": "The Talmud comments: The language of the verse <b>is also precise</b> according to this explanation, <b>as it is written </b>with regard to Asa: <b>“And he said to Judah: Let us build these cities”</b> (II Chronicles 14:6), which proves <b>by inference that they had</b> already <b>been cities at the outset, </b> and that he did not build new cities. The Talmud concludes: Indeed, <b>learn from this</b> that it is so."
        }
      ]
    },
    {
      "chapterNumber": 15,
      "citations": [
        {
          "verseLocation": "2 Chronicles 15:3",
          "verseText": "alone is considered like one who does not have a God. As it is stated: “Now for long seasons Israel was without the true God,",
          "talmudLocation": "Avodah Zarah 17b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/17b#section-6",
          "talmudFullText": "The Talmud comments: <b>And</b> this is <b>in accordance with</b> a statement <b>of Rav Huna, as Rav Huna says: Anyone who occupies himself with Torah</b> study <b>alone is considered like one who does not have a God. As it is stated: “Now for long seasons Israel was without the true God, </b> and without a teaching priest, and without the Torah” (II Chronicles 15:3). <b>What</b> is meant by <b>“without the true God”? </b> This teaches <b>that anyone who engages in Torah</b> study <b>alone is considered like one who does not have</b> a true <b>God. </b>"
        }
      ]
    },
    {
      "chapterNumber": 16,
      "citations": [
        {
          "verseLocation": "2 Chronicles 16:9",
          "verseText": "is written: “For the eyes of the Lord run to and fro throughout the whole earth”",
          "talmudLocation": "Sanhedrin 38a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/38a#section-18",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> that <b>R' Meir would say: The dust</b> that served to form <b>Adam the first</b> man <b>was gathered from the entire world, as it is stated: </b> “When I was made in secret and wrought in the lowest places of the earth, <b>Your eyes did see my unshaped flesh”</b> (Psalms 139:15–16), <b>and</b> it <b>is written: “For the eyes of YHWH run to and fro throughout the whole earth”</b> (II Chronicles 16:9), indicating that this figure was formed from the whole earth, the place within the view of YHWH’s eyes. <b>Rav Oshaya says in the name of Rav: </b> With regard to <b>Adam the first</b> man,"
        },
        {
          "verseLocation": "2 Chronicles 16:14",
          "verseText": "“And they buried him in his own sepulchers, which he had hewn out for himself in the city of David, and laid him in the resting place, which was filled with perfumes and spices [ zenim ]",
          "talmudLocation": "Bava Kamma 16b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/16b#section-19",
          "talmudFullText": "The Talmud offers an interpretation of another verse about the burial of a king of Judea, King Asa: <b>“And they buried him in his own sepulchers, which he had hewn out for himself in the city of David, and laid him in the resting place, which was filled with perfumes and spices [<i>zenim</i>]</b> prepared by the perfumers’ art” (II Chronicles 16:14). <b>What</b> is meant by <b>“perfumes and spices”? R' Elazar says: </b> It means <b>many</b> different <b>types [<i>zinei</i>]</b> of perfumes. <b>R' Shmuel bar Naḥmani says: </b> The word <i>zenim</i> sounds similar to the word <i>zenut</i>, licentiousness, and should therefore be understood about types of <b>perfumes that anyone who smells them is led to licentiousness. </b>"
        }
      ]
    },
    {
      "chapterNumber": 18,
      "citations": [
        {
          "verseLocation": "2 Chronicles 18:2",
          "verseText": "as it is stated: “And Ahab slaughtered sheep and cattle for him in abundance, and for the people that were with him, and incited him to go up with him to Ramoth Gilead”",
          "talmudLocation": "Chullin 4b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/4b#section-8",
          "talmudFullText": "§ The Talmud analyzes <b>the</b> matter <b>itself: Rav Anan says</b> that <b>Shmuel says: </b> With regard to <b>a Jew</b> who is <b>a transgressor with regard to idol worship, it is permitted to eat from</b> what <b>he slaughters, as we found with regard to Jehoshaphat, king of Judea, who partook of the feast</b> prepared by <b>Ahab, </b> king of Israel, who was a transgressor with regard to idol worship, <b>as it is stated: “And Ahab slaughtered sheep and cattle for him in abundance, and for the people that were with him, and incited him to go up with him to Ramoth Gilead”</b> (II Chronicles 18:2)."
        },
        {
          "verseLocation": "2 Chronicles 18:10",
          "verseText": "as it is written: “And Zedekiah, son of Chenaanah, made for him horns of iron,",
          "talmudLocation": "Sanhedrin 89a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89a#section-15",
          "talmudFullText": "§ The Mishnah lists among those liable to be executed as a false prophet <b>one who prophesies that which</b> he <b>did not hear. </b> The Talmud comments: <b>For example, Zedekiah, son of Chenaanah, </b> who prophesied that Ahab should wage war against the kingdom of Aram and would be successful, <b>as it is written: “And Zedekiah, son of Chenaanah, made for him horns of iron, </b> and said: So says YHWH: With these shall you gore the Arameans, until they are consumed” (II Chronicles 18:10). The Talmud asks: <b>What was</b> Zedekiah, son of Chenaanah, <b>to do? </b> Why was he held responsible? After all, <b>the spirit of Naboth misled him, as it is written: “And YHWH said: Who shall entice Ahab, that he may go up and fall at Ramoth Gilead…and there came forth the spirit, and stood before YHWH, and said: I will entice him. And He said…You shall entice him, and shall prevail also; go forth, and do so”</b> (I Kings 22:20–22)."
        }
      ]
    },
    {
      "chapterNumber": 19,
      "citations": [
        {
          "verseLocation": "2 Chronicles 19:6",
          "verseText": "And similarly, with regard to Jehoshaphat it says: “And he said to the judges: Consider what you do; for you judge not for man, but for the Lord”",
          "talmudLocation": "Sanhedrin 6b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/6b#section-14",
          "talmudFullText": "<b>And the judges should know whom they are judging, and before Whom they are judging, and Who will ultimately exact payment from them, as it is stated: “God stands in the congregation of God”</b> (Psalms 82:1). <b>And similarly, with regard to Jehoshaphat it says: “And he said to the judges: Consider what you do; for you judge not for man, but for YHWH”</b> (II Chronicles 19:6). And <b>lest the judge say: What</b> value is there <b>for me with this suffering? </b> Why should I engage in such a burdensome and difficult task? <b>The verse states: “He is with you in giving judgment, ”</b> from which it is derived that in rendering his decision, <b>a judge has only that which his eyes see. </b> He is enjoined to render the best judgment possible based on the information he has available, and he is not accountable for anything else."
        },
        {
          "verseLocation": "2 Chronicles 19:11",
          "verseText": "the Levites, as it states: “And the officers, the Levites, before you”",
          "talmudLocation": "Yevamot 86b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/86b#section-7",
          "talmudFullText": "The Talmud asks with regard to the penalty imposed on Levites: <b>And from where do we</b> derive <b>that</b> the Levites <b>did not ascend in the days of Ezra? As it is written: “And I gathered them together to the river that runs to Ahava; and we encamped there</b> for <b>three days; and I viewed the people, and the priests, and found there none of the sons of Levi”</b> (Ezra 8:15). With regard to this, <b>Rav Ḥisda said: Initially they would establish officers</b> over the people <b>only from</b> among <b>the Levites, as it states: “And the officers, the Levites, before you”</b> (II Chronicles 19:11), but <b>now they establish officers only from</b> among the <b>Israelites, as it is stated: And the officers of the many at your heads. </b> This indicates that officers were appointed from: The many, meaning the largest group, ordinary Israelites."
        }
      ]
    },
    {
      "chapterNumber": 20,
      "citations": [
        {
          "verseLocation": "2 Chronicles 20:5",
          "verseText": "as it is written: “And Jehoshaphat stood in the congregation of Judah and Jerusalem before the new courtyard in the house of the Lord”",
          "talmudLocation": "Horayot 5b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/5b#section-14",
          "talmudFullText": "§ The Talmud elaborates on a matter raised earlier. <b>And R' Yehuda and R' Shimon, </b> who hold one tribe that performs a transgression liable, <b>from where do they</b> derive that <b>one tribe is characterized as a congregation? </b> The rabbis <b>say</b> that it is derived from a verse, <b>as it is written: “And Jehoshaphat stood in the congregation of Judah and Jerusalem before the new courtyard in the house of YHWH”</b> (II Chronicles 20:5). The Talmud asks: <b>What</b> is the meaning of <b>“new”</b> in this verse? <b>R' Yoḥanan says that</b> on that occasion <b>they introduced new matters and said: One</b> who was ritually impure <b>who immersed that day</b> and is waiting for nightfall for the purification process to be completed <b>may not enter</b> even <b>the Levite camp. </b> From the fact that the verse employs the term “congregation” in reference to Judah and Jerusalem, it can be inferred that one tribe is characterized as a congregation."
        },
        {
          "verseLocation": "2 Chronicles 20:5",
          "verseText": "as it is stated: “And Jehoshaphat stood in the congregation of Judea and Jerusalem, in the House of the Lord, before the new courtyard”",
          "talmudLocation": "Pesachim 92a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/92a#section-16",
          "talmudFullText": "<b>And</b> furthermore, <b>R' Yoḥanan said: By Torah law, there is not even a positive mitzva</b> that restricts one who has immersed that day and will become pure only upon nightfall from entering the Temple, <b>as it is stated: “And Jehoshaphat stood in the congregation of Judea and Jerusalem, in the House of YHWH, before the new courtyard”</b> (II Chronicles 20:5). <b>What</b> is indicated by identifying the courtyards as <b>the new courtyard? </b> It indicates <b>that they innovated something in it, and they said: One who has immersed on that day</b> but will become pure only upon nightfall <b>may not enter the Levite camp, </b> which includes the entire Temple Mount. This suggests that the prohibition is of rabbinic origin and is not a positive mitzva."
        },
        {
          "verseLocation": "2 Chronicles 20:5",
          "verseText": "before the new courtyard”",
          "talmudLocation": "Yevamot 7b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/7b#section-7",
          "talmudFullText": "R' Yoḥanan explains his claim: <b>As it is stated: “And Jehoshaphat stood in the congregation of Judah</b> and Jerusalem, in the House of YHWH, <b>before the new courtyard”</b> (II Chronicles 20:5). <b>What is</b> the meaning of <b>“the new courtyard”? R' Yoḥanan said: </b> This is referring to the place <b>where they issued new matters and said</b> that <b>one who immersed himself that day may not enter the camp of the Levites, </b> which in Jerusalem is the Temple Mount, despite the fact that by Torah law no such prohibition applies."
        },
        {
          "verseLocation": "2 Chronicles 20:5",
          "verseText": "as it is stated: “And Jehoshaphat stood in the congregation of Judea and Jerusalem, in the House of the Lord, before the new courtyard”",
          "talmudLocation": "Zevachim 32b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/32b#section-6",
          "talmudFullText": "<b>And R' Yoḥanan says: By Torah law, there is not even a positive mitzva</b> that restricts from entering the Temple courtyard one who has immersed that day and will become pure only upon nightfall, <b>as it is stated: “And Jehoshaphat stood in the congregation of Judea and Jerusalem, in the House of YHWH, before the new courtyard”</b> (II Chronicles 20:5). <b>What</b> is the meaning of <b>“the new courtyard”? R' Yoḥanan says: </b> This is referring to the place <b>in which they innovated many matters and said</b> that <b>one who immersed that day may not enter the camp of the Levites, </b> which in Jerusalem includes the entire Temple Mount. This indicates that the prohibition is of rabbinic origin, and by Torah law it is permitted for him to enter."
        },
        {
          "verseLocation": "2 Chronicles 20:21",
          "verseText": "rejoice over the downfall of the wicked? But it is written: “As they went out before the army, and say: Give thanks to the Lord, for His kindness endures forever”",
          "talmudLocation": "Megillah 10b:25",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-25",
          "talmudFullText": "R' Yehoshua ben Levi asked: <b>Does God, </b> in fact <b>rejoice over the downfall of the wicked? But it is written: “As they went out before the army, and say: Give thanks to YHWH, for His kindness endures forever”</b> (II Chronicles 20:21), <b>and R' Yoḥanan said: For what</b> reason were the words: <b>“for He is good” not stated in this</b> statement of <b>thanksgiving, </b> as the classic formulation is: “Give thanks to YHWH; for He is good; for His kindness endures forever” (I Chronicles 16:34)? <b>Because God does not rejoice over the downfall of the wicked. </b> Since this song was sung in the aftermath of a military victory, which involved the downfall of the wicked, the name of God was not mentioned for the good."
        },
        {
          "verseLocation": "2 Chronicles 20:21",
          "verseText": "as they went out before the army, and say: Give thanks to the Lord, for His mercy endures forever”",
          "talmudLocation": "Sanhedrin 39b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-4",
          "talmudFullText": "The Talmud asks: <b>But is God gladdened by the downfall of the wicked? Isn’t it written</b> in the verse describing the victory of the Jewish people in battle: “He appointed them that should sing unto YHWH, and praise in the beauty of holiness, <b>as they went out before the army, and say: Give thanks to YHWH, for His mercy endures forever”</b> (II Chronicles 20:21). <b>And R' Yonatan says: For what</b> reason <b>is it not stated in this praise: </b> “Give thanks to YHWH <b>for He is good, </b> for His mercy endures forever,” as is stated elsewhere, e.g., Psalms 118:1? This is <b>because God is not gladdened by the downfall of the wicked. </b>"
        }
      ]
    },
    {
      "chapterNumber": 21,
      "citations": [
        {
          "verseLocation": "2 Chronicles 21:3",
          "verseText": "Ḥizkiyya said: As the verse states: “And their father gave them great gifts, of silver, and of gold, and of precious things, with fortified cities in Judea”",
          "talmudLocation": "Bava Kamma 12a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/12a#section-10",
          "talmudFullText": "The reason behind the need for land to be like the “fortified cities in Judea” is that the <i>halakha</i> that one can acquire movable property together with land is derived from this verse, <b>as we learned</b> in a Mishnah (<i>Kiddushin</i> 26a): <b>Property that does not serve as a guarantee, </b> i.e., movable property, <b>is acquired together with property that does serve as a guarantee, </b> i.e., land, be it <b>through</b> the buyer giving <b>money</b> to the seller, by the seller giving the buyer <b>a bill</b> of sale, <b>or by</b> the buyer performing an act of <b>taking possession. </b> The Talmud asks: <b>From where is this matter</b> derived? <b>Ḥizkiyya said: As the verse states: “And their father gave them great gifts, of silver, and of gold, and of precious things, with fortified cities in Judea”</b> (II Chronicles 21:3). The verse indicates that the acquisition of the movable property was done together with that of the cities of Judea."
        },
        {
          "verseLocation": "2 Chronicles 21:3",
          "verseText": "land similar to “fortified cities in Judea”",
          "talmudLocation": "Bava Kamma 12a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/12a#section-9",
          "talmudFullText": "The Talmud rejects this: <b>Rav Ika, son of Rav Ami, said: According to everyone, </b> the legal status of <b>slaves is</b> generally <b>like</b> that of <b>land, and</b> therefore, <b>that which is taught</b> in the second <i>baraita</i>, that by taking possession of the slaves <b>he</b> also <b>acquires</b> the movable property, is <b>properly</b> understood. <b>And that which is taught</b> in the first <i>baraita</i>, that in such a case he <b>does not acquire</b> the movable property, the reason for this ruling is that the <i>tanna</i> of that <i>baraita</i> holds that in order for movable property to be acquired together with land, <b>we require</b> that he acquire <b>land similar to “fortified cities in Judea”</b> (II Chronicles 21:3), <b>which do not move around. </b> Slaves, even if their legal status is generally like that of land, do not fulfill this requirement."
        },
        {
          "verseLocation": "2 Chronicles 21:3",
          "verseText": "But isn’t it written: “And the kingdom he gave to Jehoram, because he was the firstborn”",
          "talmudLocation": "Horayot 11b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/11b#section-16",
          "talmudFullText": "The Talmud asks: <b>And do younger</b> sons <b>rule before elder</b> sons? <b>But isn’t it written: “And the kingdom he gave to Jehoram, because he was the firstborn”</b> (II Chronicles 21:3). The Talmud answers: <b>Jehoram was a surrogate for his ancestors</b> as he was suited to serve as king, so since he was firstborn, he ascended to the throne. <b>Jehoiakim was not a surrogate for his ancestors; </b> he was not suited to serve as king. Therefore, his brother ascended to the throne before him."
        },
        {
          "verseLocation": "2 Chronicles 21:3",
          "verseText": "“And he gave the kingdom to Jehoram, because he was the firstborn”",
          "talmudLocation": "Keritot 5b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/5b#section-12",
          "talmudFullText": "The Talmud answers: <b>Rather, Jehoiakim</b> was <b>actually older</b> than Jehoahaz. <b>And why</b> does the verse <b>call</b> Jehoahaz the <b>firstborn? </b> This is referring to the fact <b>that</b> Jehoahaz was the <b>firstborn with regard to the monarchy, </b> i.e., he became king first. The Talmud asks: <b>And do we establish the younger</b> son as king <b>before the older</b> son? <b>But isn’t it written</b> with regard to Jehoshaphat: <b>“And he gave the kingdom to Jehoram, because he was the firstborn”</b> (II Chronicles 21:3)? The Talmud answers: Jehoram <b>was</b> one <b>who filled the place of his fathers, </b> i.e., he was fit to serve as king, and therefore as he was firstborn he received the kingship, whereas Jehoiakim was deemed unworthy of the honor, despite being the oldest among his brothers."
        },
        {
          "verseLocation": "2 Chronicles 21:3",
          "verseText": "Doesn’t the verse state: “But the kingdom he gave to Jehoram because he was the firstborn”",
          "talmudLocation": "Ketubot 103b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/103b#section-6",
          "talmudFullText": "<b>Levi said: Need this be said? </b> After all, Gamliel was the firstborn. <b>R' Shimon, son of R'</b> Yehuda HaNasi, <b>said: </b> It is <b>necessary for you and for your limp. </b> The Talmud asks: <b>What did</b> R' Shimon find <b>difficult</b> with Levi’s question that caused him to scoff? <b>Doesn’t the verse state: “But the kingdom he gave to Jehoram because he was the firstborn”</b> (II Chronicles 21:3)? This indicates that the firstborn is the one who inherits his father’s appointment, and so Levi legitimately asked why R' Yehuda HaNasi had to leave specific instructions about this."
        },
        {
          "verseLocation": "2 Chronicles 21:3",
          "verseText": "with fortified cities in Judah”",
          "talmudLocation": "Kiddushin 26a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/26a#section-13",
          "talmudFullText": "§ The Mishnah further states that <b>property that does not serve as a guarantee, </b> i.e., movable property, can be acquired along with property that serves as a guarantee, i.e., land. The Talmud asks: <b>From where is this matter</b> derived? <b>Ḥizkiyya said</b> that <b>the verse states: “And their father gave them</b> great <b>gifts, </b> of silver, and of gold, and of precious things, <b>with fortified cities in Judah”</b> (II Chronicles 21:3). This indicates that he gave them movable items together with the cities. He did not need to give the items to them directly, as he was able to transfer these gifts by means of the cities he gave them."
        }
      ]
    },
    {
      "chapterNumber": 22,
      "citations": [
        {
          "verseLocation": "2 Chronicles 22:9",
          "verseText": "“And he sought Ahaziah, and they apprehended him, for he was hiding in Samaria”",
          "talmudLocation": "Sanhedrin 102b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-18",
          "talmudFullText": "With regard to the verse: <b>“And he sought Ahaziah, and they apprehended him, for he was hiding in Samaria”</b> (II Chronicles 22:9), <b>R' Levi says: </b> What would he do in hiding? <b>He would excise mentions</b> of God’s name in Torah scrolls <b>and write</b> the name of an object of <b>idol worship in their stead. </b>"
        }
      ]
    },
    {
      "chapterNumber": 23,
      "citations": [
        {
          "verseLocation": "2 Chronicles 23:11",
          "verseText": "“Then they brought out the king’s son, and put upon him the crown [ hanezer ] and the testimony,",
          "talmudLocation": "Avodah Zarah 44a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/44a#section-17",
          "talmudFullText": "Similarly, it is stated with regard to Joash: <b>“Then they brought out the king’s son, and put upon him the crown [<i>hanezer</i>] and the testimony, </b> and made him king” (II Chronicles 23:11). <b>“<i>Nezer</i>” is a crown. </b> What was the <b>“testimony”? Rav Yehuda says</b> that <b>Rav says: It is a testimony for</b> the progeny of <b>house of David that anyone who is fit for kingship, </b> the crown <b>fits him</b> properly; <b>and anyone who is unfit for kingship, </b> the crown <b>does not fit him</b> properly."
        }
      ]
    },
    {
      "chapterNumber": 24,
      "citations": [
        {
          "verseLocation": "2 Chronicles 24:14",
          "verseText": "“And when they had made an end, they brought the rest of the money before the king and Jehoiada, of which were made vessels for the house of the Lord, vessels with which to minister,",
          "talmudLocation": "Ketubot 106b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/106b#section-2",
          "talmudFullText": "Rav Huna <b>raised an objection to</b> this from a verse that deals with those in charge of maintaining the Temple structure: <b>“And when they had made an end, they brought the rest of the money before the king and Jehoiada, of which were made vessels for the house of YHWH, vessels with which to minister, </b> and buckets, and pans, and vessels of gold and silver” (II Chronicles 24:14). This indicates that vessels may be prepared with money consecrated for Temple maintenance."
        },
        {
          "verseLocation": "2 Chronicles 24:14",
          "verseText": "chamber, as it is stated: “The rest of the money”",
          "talmudLocation": "Ketubot 106b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/106b#section-6",
          "talmudFullText": "<b>The school of R' Yishmael taught: </b> The funding for the <b>service vessels</b> of the Temple <b>comes from the collection of the</b> Temple treasury <b>chamber, as it is stated: “The rest of the money”</b> (II Chronicles 24:14). <b>Which money has a remainder? You must say</b> that <b>this</b> is referring to <b>the collection of the chamber. </b> After the money was brought into the chamber, a certain portion of it would be set aside for the requirements of the offerings, while the remainder was used for other purposes."
        },
        {
          "verseLocation": "2 Chronicles 24:14",
          "verseText": "“the money”",
          "talmudLocation": "Ketubot 106b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/106b#section-7",
          "talmudFullText": "The Talmud asks: <b>But</b> one can <b>say</b> that <b>the remainder itself</b> was used for the Temple vessels, and the phrase “the rest of the money” does not refer to the funds of which there is a remainder, but to the remainder of the donations left in the chamber after the first collection was removed. The Talmud answers: This is <b>as Rava said</b> elsewhere, that the phrase <b>“the burnt-offering”</b> (Leviticus 6:5), with the definite article, is referring to <b>the first burnt-offering; so too, </b> the term <b>“the money”</b> (II Chronicles 24:14) is referring to <b>the first money, </b> i.e., the money removed from the collection of the chamber."
        }
      ]
    },
    {
      "chapterNumber": 25,
      "citations": [
        {
          "verseLocation": "2 Chronicles 25:14",
          "verseText": "he brought their gods and bowed to them, as it is stated: “And it came to pass after Amaziah came from striking the Edomites, that he brought the gods of the children of Seir and set them up to be his gods and prostrated himself before them, and burned incense to them”",
          "talmudLocation": "Sanhedrin 103a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103a#section-8",
          "talmudFullText": "<b>I smiled upon Amaziah and I delivered the kings of Edom into his hand. </b> In response, <b>he brought their gods and bowed to them, as it is stated: “And it came to pass after Amaziah came from striking the Edomites, that he brought the gods of the children of Seir and set them up to be his gods and prostrated himself before them, and burned incense to them”</b> (II Chronicles 25:14). The response to victory in war was the same, idol worship. They are incorrigible. <b>Rav Pappa says</b> that <b>this</b> is in accordance with the adage <b>that people say: I cried for the master and he did not know, I smiled for the master and he did not know; woe unto the master who does not know</b> the distinction <b>between good and bad. </b> The Jewish people also resorted to idol worship both when God rewarded them and when He afflicted them."
        }
      ]
    },
    {
      "chapterNumber": 26,
      "citations": [
        {
          "verseLocation": "2 Chronicles 26:5",
          "verseText": "“And he set himself to seek God in the days of Zechariah, who had an understanding of the vision of God”",
          "talmudLocation": "Sotah 48b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/48b#section-3",
          "talmudFullText": "<b>Rabba bar Shmuel raises an objection: </b> The verse states concerning Uzziah: <b>“And he set himself to seek God in the days of Zechariah, who had an understanding of the vision of God”</b> (II Chronicles 26:5). <b>What, is</b> the verse <b>not</b> stating that Uzziah would seek God by asking questions <b>of</b> the <b><i>Urim VeTummim</i>, </b> despite the fact that he lived after the time of Solomon? The Talmud rejects this claim: <b>No, </b> he would seek God by asking questions <b>of</b> the <b>prophets, </b> but not of the <i>Urim VeTummim</i>."
        },
        {
          "verseLocation": "2 Chronicles 26:16",
          "verseText": "“But when he was strong his heart became arrogant so that he did corruptly, and he trespassed against the Lord his God;",
          "talmudLocation": "Arakhin 16a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/16a#section-10",
          "talmudFullText": "<b>And for arrogance, as it is written</b> with regard to King Uzziah: <b>“But when he was strong his heart became arrogant so that he did corruptly, and he trespassed against YHWH his God; </b> for he went into the temple of YHWH to burn incense upon the altar of incense” (II Chronicles 26:16). And it states: “Then Uzziah was angry; and he had a censer in his hand to burn incense; and while he was angry with the priests, <b>the tzara'at broke forth in his forehead”</b> (II Chronicles 26:19)."
        },
        {
          "verseLocation": "2 Chronicles 26:16",
          "verseText": "in Uzziah, as it is written: “But when he was strong, his heart was lifted up to his destruction; for he transgressed against the Lord his God, and went into the Temple of the Lord to burn incense upon the altar of incense”",
          "talmudLocation": "Sanhedrin 48b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-16",
          "talmudFullText": "The curse of <b>“a metzora”</b> was fulfilled among Solomon’s descendants <b>in Uzziah, as it is written: “But when he was strong, his heart was lifted up to his destruction; for he transgressed against YHWH his God, and went into the Temple of YHWH to burn incense upon the altar of incense”</b> (II Chronicles 26:16). <b>And it is</b> also <b>written: “And tzara'at broke out on his forehead”</b> (II Chronicles 26:19)."
        },
        {
          "verseLocation": "2 Chronicles 26:19",
          "verseText": "the leprosy broke forth in his forehead”",
          "talmudLocation": "Arakhin 16a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/16a#section-10",
          "talmudFullText": "<b>And for arrogance, as it is written</b> with regard to King Uzziah: <b>“But when he was strong his heart became arrogant so that he did corruptly, and he trespassed against YHWH his God; </b> for he went into the temple of YHWH to burn incense upon the altar of incense” (II Chronicles 26:16). And it states: “Then Uzziah was angry; and he had a censer in his hand to burn incense; and while he was angry with the priests, <b>the tzara'at broke forth in his forehead”</b> (II Chronicles 26:19)."
        },
        {
          "verseLocation": "2 Chronicles 26:19",
          "verseText": "written: “And leprosy broke out on his forehead”",
          "talmudLocation": "Sanhedrin 48b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-16",
          "talmudFullText": "The curse of <b>“a metzora”</b> was fulfilled among Solomon’s descendants <b>in Uzziah, as it is written: “But when he was strong, his heart was lifted up to his destruction; for he transgressed against YHWH his God, and went into the Temple of YHWH to burn incense upon the altar of incense”</b> (II Chronicles 26:16). <b>And it is</b> also <b>written: “And tzara'at broke out on his forehead”</b> (II Chronicles 26:19)."
        }
      ]
    },
    {
      "chapterNumber": 28,
      "citations": [
        {
          "verseLocation": "2 Chronicles 28:15",
          "verseText": "“And the men that have been mentioned by name rose up, and took the captives, and with the spoil clothed all that were naked among them, and arrayed them, and shod them, and gave them to eat and to drink, and anointed them, and carried all the feeble of them upon donkeys, and brought them to Jericho, the city of palm trees, unto their brethren; then they returned to Samaria”",
          "talmudLocation": "Sotah 42a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42a#section-9",
          "talmudFullText": "The Torah dictates the priest’s address: <b>“And</b> he <b>shall say to them: Hear Israel, </b> you draw near today to battle against your enemies; let not your heart faint; fear not, nor be alarmed, and do not be terrified of them” (Deuteronomy 20:3). The priest expounds: <b>“Against your enemies” and not against your brothers. </b> This is <b>not</b> a war of the tribe of <b>Judah against Simon and not Simon against Benjamin, </b> such <b>that if you fall into their hands</b> your brothers <b>will have mercy on you, as it is stated</b> with regard to a war between Judah and Israel: <b>“And the men that have been mentioned by name rose up, and took the captives, and with the spoil clothed all that were naked among them, and arrayed them, and shod them, and gave them to eat and to drink, and anointed them, and carried all the feeble of them upon donkeys, and brought them to Jericho, the city of palm trees, unto their brethren; then they returned to Samaria”</b> (II Chronicles 28:15). Rather, <b>you are marching</b> to war <b>against your enemies, and if you fall into their hands, they</b> will <b>not have mercy on you. </b>"
        },
        {
          "verseLocation": "2 Chronicles 28:20",
          "verseText": "Pilneser”",
          "talmudLocation": "Sanhedrin 94a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94a#section-12",
          "talmudFullText": "The eight names of <b>Sennacherib</b> are <b>as it is written in his</b> regard among the kings of Assyria: <b>“Tiglath-Pileser”</b> (II Kings 15:29), <b>“</b>Tiglath-<b>Pilneser”</b> (II Chronicles 28:20), <b>“Shalmaneser”</b> (II Kings 17:3), <b>“Pul”</b> (II Kings 15:19), <b>“Sargon”</b> (Isaiah 20:1), and <b>“the great and noble Asenappar”</b> (Ezra 4:10). And the Talmud asks: <b>But isn’t there</b> an additional name, <b>Sennacherib [<i>Sanḥeriv</i>]? </b> The Talmud explains: That was not a given name; rather, it is an appellation based on the fact <b>that his speech is contentious [<i>siḥato riv</i>], </b> leading to quarrel and shame. <b>Alternatively, </b> he was called Sanḥeriv due to the fact <b>that he spoke [<i>saḥ</i>] and snorted out [<i>niḥer</i>]</b> contemptuous <b>statements vis-à-vis the Transcendent. </b>"
        },
        {
          "verseLocation": "2 Chronicles 28:22",
          "verseText": "in their wickedness from beginning to end. “This is [ hu ] the king Ahaz”",
          "talmudLocation": "Megillah 11a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-17",
          "talmudFullText": "The Talmud continues: <b>“This is [<i>hu</i>] Ahasuerus”</b> (Esther 1:1); the term <i>hu</i>, this is, comes to teach that <b>he</b> remained as he was <b>in his wickedness from beginning to end. </b> Similarly, wherever the words “this is” appear in this manner, the verse indicates that the individual under discussion remained the same from beginning to end, for example: <b>“This is [<i>hu</i>] Esau”</b> (Genesis 36:43); <b>he</b> remained <b>in his wickedness from beginning to end. “This is [<i>hu</i>] Dathan and Abiram”</b> (Numbers 26:9); <b>they</b> remained <b>in their wickedness from beginning to end. “This is [<i>hu</i>] the king Ahaz”</b> (II Chronicles 28:22); <b>he</b> remained <b>in his wickedness from beginning to end. </b>"
        },
        {
          "verseLocation": "2 Chronicles 28:23",
          "verseText": "to their gods, as it is stated: “He sacrificed to the gods of Damascus that smote him; and he said: Because the gods of the kings of Aram help them, I will sacrifice to them, and they will help me. But they were the ruin of him, and of all Israel”",
          "talmudLocation": "Sanhedrin 103a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103a#section-7",
          "talmudFullText": "<b>And R' Yoḥanan says in the name of R' Shimon ben Yoḥai: What</b> is the meaning of that <b>which is written: “If a wise man contends with a foolish man, whether he is angry or laughs, there is no rest”</b> (Proverbs 29:9)? <b>God said: I was angry with Ahaz and I delivered him into the hand of the kings of Damascus. He</b> then <b>sacrificed</b> offerings <b>and burned</b> incense <b>to their gods, as it is stated: “He sacrificed to the gods of Damascus that smote him; and he said: Because the gods of the kings of Aram help them, I will sacrifice to them, and they will help me. But they were the ruin of him, and of all Israel”</b> (II Chronicles 28:23). When God was angry with Israel and caused them to lose a war to prompt them to repent of their sins, their response was to worship idols."
        },
        {
          "verseLocation": "2 Chronicles 28:27",
          "verseText": "on a bed of ropes;",
          "talmudLocation": "Berakhot 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10b#section-7",
          "talmudFullText": "<b>With regard to three</b> actions the rabbis <b>agreed with him: </b> <b><b>He suppressed the Book of Remedies, and they agreed with him. </b> <br><b>He ground the copper snake</b> through which miracles were performed for Israel (Numbers 21:9), destroying it because it had been used in idol worship (II Kings 18:4), <b>and they agreed with him. </b> <br><b>He dragged the bones of his</b> evil <b>father, </b> King Ahaz, <b>on a bed of ropes; </b> meaning he did not accord his father a funeral fit for a king (II Chronicles 28:27), <b>and they agreed with him. </b>"
        }
      ]
    },
    {
      "chapterNumber": 29,
      "citations": [
        {
          "verseLocation": "2 Chronicles 29:16",
          "verseText": "derived their opinions from the same verse: “And the priests went into the inner part of the House of God, to cleanse it, and they brought out all the impurity that they found in the Temple of God into the courtyard of the House of God. And the Levites took it, to carry it out to the brook of Kidron”",
          "talmudLocation": "Eruvin 105a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/105a#section-1",
          "talmudFullText": "<b>R' Yoḥanan said: Both</b> of them, R' Shimon ben Nannas and R' Akiva, <b>derived their opinions from the same verse: “And the priests went into the inner part of the House of God, to cleanse it, and they brought out all the impurity that they found in the Temple of God into the courtyard of the House of God. And the Levites took it, to carry it out to the brook of Kidron”</b> (II Chronicles 29:16)."
        },
        {
          "verseLocation": "2 Chronicles 29:17",
          "verseText": "Isn’t it written: “On the sixteenth day of the first month”",
          "talmudLocation": "Arakhin 11b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/11b#section-12",
          "talmudFullText": "<b>Abaye said to</b> Rav Yosef: <b>And how can you say</b> that that day was the New Moon? <b>Isn’t it written: “On the sixteenth day of the first month”</b> (II Chronicles 29:17), and later, in that context, it states: <b>“And Hezekiah commanded to offer the burnt offering upon the altar”? </b>"
        },
        {
          "verseLocation": "2 Chronicles 29:19",
          "verseText": "“All the vessels, which King Ahaz in his reign did cast away when he acted treacherously, we have prepared and sanctified,",
          "talmudLocation": "Avodah Zarah 52b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/52b#section-6",
          "talmudFullText": "R' Yosei ben Shaul <b>raised an objection to</b> this ruling from a verse referring to vessels of the Temple that Ahaz had used for idol worship: <b>“All the vessels, which King Ahaz in his reign did cast away when he acted treacherously, we have prepared and sanctified, </b> and, behold, they are before the altar of YHWH” (II Chronicles 29:19). <b>What, is it not</b> the case that the term <b>“we have prepared”</b> means <b>that we immersed them</b> in a ritual bath, and the term <b>“sanctified”</b> means <b>that we sanctified them</b> to be used again in the Temple? This would indicate that the vessels may be used in the Temple even though they were used in idolatrous worship."
        },
        {
          "verseLocation": "2 Chronicles 29:19",
          "verseText": "as it is written: “And all the vessels, which King Ahaz in his reign did cast away when he acted treacherously, we have prepared and sanctified,",
          "talmudLocation": "Avodah Zarah 54b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/54b#section-1",
          "talmudFullText": "<b>But rather, </b> it is derived <b>from</b> the case of <b>vessels</b> of the Temple that Ahaz used for idol worship, <b>as it is written: “And all the vessels, which King Ahaz in his reign did cast away when he acted treacherously, we have prepared and sanctified, </b> and behold, they are before the altar of YHWH” (II Chronicles 29:19). <b>And the Master said: “We have prepared”</b> means <b>that we interred them; “and sanctified”</b> means <b>that we sanctified other</b> vessels <b>in their stead, </b> as the original vessels were prohibited. <b>But</b> how could Ahaz render the vessels of the Temple forbidden, as <b>a person does not render forbidden an item that is not his? </b>"
        },
        {
          "verseLocation": "2 Chronicles 29:27",
          "verseText": "as it is written: “And Hezekiah commanded to sacrifice the burnt-offering upon the altar. And when the burnt-offering began, the song of the Lord began also, and the trumpets, together with the instruments of David, king of Israel”",
          "talmudLocation": "Sukkah 51a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/51a#section-12",
          "talmudFullText": "The Talmud asks: <b>What is the rationale</b> for the opinion <b>of the one who said: </b> The <b>primary</b> essence of <b>song</b> is singing accompanied <b>by</b> musical <b>instruments? </b> The Talmud answers: It is <b>as it is written: “And Hezekiah commanded to sacrifice the burnt-offering upon the altar. And when the burnt-offering began, the song of YHWH began also, and the trumpets, together with the instruments of David, king of Israel”</b> (II Chronicles 29:27), indicating that the song of God that accompanies the offering is played by trumpets and other instruments."
        }
      ]
    },
    {
      "chapterNumber": 30,
      "citations": [
        {
          "verseLocation": "2 Chronicles 30:2",
          "verseText": "He intercalated Nisan in Nisan,",
          "talmudLocation": "Berakhot 10b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10b#section-8",
          "talmudFullText": "Yet, <b>with regard to three</b> other innovations, the rabbis of his generation <b>did not agree with him: </b> <b><b>He stopped up the waters of the Gihon, </b> the Pool of Siloam, diverting its water into the city by means of a tunnel (II Chronicles 32:30), <b>and they did not agree with him. </b> <br><b>He cut off the doors of the Sanctuary and sent them to the king of Assyria</b> (II Kings 18:16), <b>and they did not agree with him. </b> <b><b>He intercalated Nisan in Nisan, </b> creating a leap year by adding an extra month during the month of Nisan. That intercalation must be performed before the end of Adar (II Chronicles 30:2)."
        },
        {
          "verseLocation": "2 Chronicles 30:2",
          "verseText": "an incident involving Hezekiah, king of Judea, who intercalated the year due to ritual impurity",
          "talmudLocation": "Sanhedrin 12a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/12a#section-13",
          "talmudFullText": "<b>R' Yehuda says: </b> The court <b>may intercalate</b> the year due to ritual impurity. <b>R' Yehuda said: </b> There was <b>an incident involving Hezekiah, king of Judea, who intercalated the year due to ritual impurity</b> (II Chronicles 30:2). <b>And</b> after doing so, he <b>requested compassion for himself, as it is written: “For a multitude of the people, even many of Ephraim and Manasseh, Issachar and Zebulun, had not cleansed themselves, </b>"
        }
      ]
    },
    {
      "chapterNumber": 31,
      "citations": [
        {
          "verseLocation": "2 Chronicles 31:4",
          "verseText": "as it is stated: “And he commanded the people who dwelled in Jerusalem to give the portion of the priests and of the Levites, so that they may firmly adhere to the Torah of the Lord”",
          "talmudLocation": "Chullin 130b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/130b#section-5",
          "talmudFullText": "<b>And</b> this is <b>in accordance with that which Rav Shmuel bar Naḥmani</b> taught, <b>as Rav Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: From where</b> is it derived <b>that one does not give a gift</b> of the priesthood <b>to a priest</b> who is <b>an <i>am ha’aretz</i>? </b> It is derived from a verse, <b>as it is stated: “And he commanded the people who dwelled in Jerusalem to give the portion of the priests and of the Levites, so that they may firmly adhere to the Torah of YHWH”</b> (II Chronicles 31:4). This indicates that <b>anyone who firmly adheres to the Torah of YHWH has a portion, and one who does not firmly adhere to the Torah of YHWH does not have a portion. </b>"
        },
        {
          "verseLocation": "2 Chronicles 31:4",
          "verseText": "breast and thigh are not distributed through judges?",
          "talmudLocation": "Chullin 130b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/130b#section-7",
          "talmudFullText": "The Talmud analyzes this <i>baraita</i>: <b>With regard to what</b> matter is this <i>halakha</i> stated? <b>If we say</b> that it is <b>with regard to distributing</b> them <b>through judges, is that to say</b> that the <b>breast and thigh are not distributed through judges? </b> These are also called a “portion” (II Chronicles 31:4), and therefore the court determines to which priests they should be given, as stated above. <b>Rather, is it not</b> stated <b>with regard to extracting</b> them <b>through judges? </b> If so, one can infer from the <i>baraita</i> that gifts of the priesthood can be extracted in court by a priest, which contradicts the statement of Rav Ḥisda."
        },
        {
          "verseLocation": "2 Chronicles 31:4",
          "verseText": "as it is stated: “And he commanded the people who dwelled in Jerusalem to give the portion of the priests and of the Levites, so that they may firmly adhere to the Torah of the Lord”",
          "talmudLocation": "Sanhedrin 90b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/90b#section-4",
          "talmudFullText": "<b>R' Shmuel bar Naḥmani says</b> that <b>R' Yonatan says: From where</b> is it derived <b>that one does not give <i>teruma</i> to a priest</b> who is <b>an <i>am ha’aretz</i>? </b> It is derived from a verse, <b>as it is stated: “And he commanded the people who dwelled in Jerusalem to give the portion of the priests and of the Levites, so that they may firmly adhere to the Torah of YHWH”</b> (II Chronicles 31:4). <b>Everyone who firmly adheres to the Torah of YHWH has a portion, and anyone who does not firmly adhere to the Torah of YHWH does not have a portion. </b>"
        },
        {
          "verseLocation": "2 Chronicles 31:5",
          "verseText": "in abundance”",
          "talmudLocation": "Nedarim 55a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/55a#section-2",
          "talmudFullText": "<strong>Talmud: </strong> The Talmud asks: <b>Is this to say that</b> according to R' Meir, the term <b><i>dagan</i> means any</b> produce <b>that is</b> harvested at one time and <b>placed in a pile [<i>midgan</i>]? Rav Yosef raised an objection: </b> After King Hezekiah called upon the people to give <i>teruma</i> and tithes properly, the verse states: <b>“And as soon as the matter was publicized, the children of Israel gave in abundance the first fruits of <i>dagan</i>, wine, and oil, </b> and honey, <b>and of all the <i>tevua</i> of the field; </b> and the tithe of all that they brought <b>in abundance”</b> (II Chronicles 31:5). <b>And if you say</b> that <b><i>dagan</i> means any</b> produce <b>that is placed in a pile, what is</b> the meaning of the words <b>“As soon as the matter was publicized, </b> the children of Israel <b>gave in abundance</b> the first fruits of <i>dagan</i>…and of all the <i>tevua</i> of the field”? There is no need to list both <i>dagan</i> and all <i>tevua</i> of the field. <b>Abaye said: </b> <i>Tevua</i> comes <b>to include fruits of the tree and vegetables, </b> which they tithed although they are not included in <i>dagan</i>, as they are not harvested at one time and placed in a pile."
        }
      ]
    },
    {
      "chapterNumber": 32,
      "citations": [
        {
          "verseLocation": "2 Chronicles 32:1",
          "verseText": "“After these matters and this truth, Sennacherib, king of Assyria, came and entered Judea and encamped against the fortified cities and sought to breach them for himself”",
          "talmudLocation": "Sanhedrin 94b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94b#section-10",
          "talmudFullText": "The verse states: <b>“After these matters and this truth, Sennacherib, king of Assyria, came and entered Judea and encamped against the fortified cities and sought to breach them for himself”</b> (II Chronicles 32:1). The Talmud asks: Is <b>this gift [<i>rishna</i>], </b> the invasion of Sennacherib, appropriate compensation <b>for that gift [<i>pardashna</i>], </b> Hezekiah’s restoration of the Temple and the worship of God in Judea?"
        },
        {
          "verseLocation": "2 Chronicles 32:21",
          "verseText": "And when he came into the house of his God, his own offspring slew him there with a sword”",
          "talmudLocation": "Sanhedrin 95b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/95b#section-9",
          "talmudFullText": "<b>Rav Ashi says: It is also precise</b> in the formulation of the verse, <b>as it is written: </b> “Therefore shall the Master, YHWH of hosts, send <b>among his fat ones leanness”</b> (Isaiah 10:16), indicating that it was <b>the fat, </b> i.e., significant, <b>among them</b> who were afflicted. <b>Ravina says: </b> The language <b>is also precise</b> in the formulation of another verse, <b>as it is written: “And YHWH sent an angel, who obliterated the mighty men-at-arms and the leaders and captains in the camp</b> of the king of Assyria. So he returned shamefacedly to his own land. <b>And when he came into the house of his God, his own offspring slew him there with a sword”</b> (II Chronicles 32:21). The Talmud affirms: <b>Conclude from it</b> that the leaders of the regiment were the ones killed."
        },
        {
          "verseLocation": "2 Chronicles 32:30",
          "verseText": "He stopped up the waters of the Gihon,",
          "talmudLocation": "Berakhot 10b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/10b#section-8",
          "talmudFullText": "Yet, <b>with regard to three</b> other innovations, the rabbis of his generation <b>did not agree with him: </b> <b><b>He stopped up the waters of the Gihon, </b> the Pool of Siloam, diverting its water into the city by means of a tunnel (II Chronicles 32:30), <b>and they did not agree with him. </b> <br><b>He cut off the doors of the Sanctuary and sent them to the king of Assyria</b> (II Kings 18:16), <b>and they did not agree with him. </b> <b><b>He intercalated Nisan in Nisan, </b> creating a leap year by adding an extra month during the month of Nisan. That intercalation must be performed before the end of Adar (II Chronicles 30:2)."
        },
        {
          "verseLocation": "2 Chronicles 32:31",
          "verseText": "“to inquire of the wonder that was in the land”",
          "talmudLocation": "Sanhedrin 96a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/96a#section-10",
          "talmudFullText": "The Talmud asks: With regard to <b>these four paces</b> of Nebuchadnezzar, <b>what is</b> the incident to which the Talmud alludes? The Talmud answers that the incident is <b>as it is written: “At that time Merodach-Baladan, son of Baladan, king of Babylonia, sent a letter</b> and a gift to Hezekiah, as he had heard that he had been ill and was recovered” (Isaiah 39:1). The Talmud asks: <b>Due to</b> the fact that <b>Hezekiah had been ill and was recovered, he sent him a letter and a gift? </b> The Talmud answers: <b>Yes, </b> and he did so in order <b>“to inquire of the wonder that was in the land”</b> (II Chronicles 32:31). <b>As R' Yoḥanan says: </b> On <b>that day that</b> Hezekiah’s father, <b>Ahaz, died, </b> daylight lasted <b>two hours, </b> ten hours shorter than the standard day, so that the wicked Ahaz would be buried hurriedly, without the pomp typically accorded kings."
        },
        {
          "verseLocation": "2 Chronicles 32:33",
          "verseText": "states: “And Hezekiah lay with his ancestors, and they buried him in the best [ bema’ale ] of the sepulchers of the descendants of David”",
          "talmudLocation": "Bava Kamma 16b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/16b#section-18",
          "talmudFullText": "<b>And similarly, </b> the fact that the word <i>aliyya</i> is referring to superior-quality property is indicated by the verse that <b>states: “And Hezekiah lay with his ancestors, and they buried him in the best [<i>bema’ale</i>] of the sepulchers of the descendants of David”</b> (II Chronicles 32:33), <b>and R' Elazar says: </b> The term <b><i>bema’ale</i></b> means <b>beside the best of the family. And who are they? David and Solomon. </b>"
        },
        {
          "verseLocation": "2 Chronicles 32:33",
          "verseText": "“And they afforded him honor in his death”",
          "talmudLocation": "Bava Kamma 16b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/16b#section-24",
          "talmudFullText": "The Talmud, above, cited a verse concerning King Hezekiah’s burial. The Talmud cites the continuation of that verse: <b>“And they afforded him honor in his death”</b> (II Chronicles 32:33). This <b>teaches that they established a yeshiva at his grave</b> to study Torah there."
        },
        {
          "verseLocation": "2 Chronicles 32:33",
          "verseText": "“And afforded him [ lo ] honor in his death”",
          "talmudLocation": "Bava Kamma 17a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/17a#section-2",
          "talmudFullText": "<b>A baraita states</b> a <i>baraita</i> that offers another interpretation of the verse cited: <b>“And afforded him [<i>lo</i>] honor in his death”</b> (II Chronicles 32:33). <b>This</b> is referring to the honor given to <b>Hezekiah, king of Judea, that</b> at his burial <b>36, 000</b> men with <b>bared shoulders went out before him. </b> They removed their robes from their shoulders as a sign of mourning. The number 36,000 is alluded to by the numerical value of the word <i>lo</i>, which is thirty-six. This is <b>the statement of R' Yehuda. </b>"
        }
      ]
    },
    {
      "chapterNumber": 33,
      "citations": [
        {
          "verseLocation": "2 Chronicles 33:7",
          "verseText": "“an idol”",
          "talmudLocation": "Sanhedrin 103b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-7",
          "talmudFullText": "<b>It is written</b> that Manasseh crafted <b>“an idol”</b> (II Chronicles 33:7), <b>and it is written</b> that Manasseh crafted <b>“idols”</b> (II Chronicles 33:19). <b>R' Yoḥanan says: Initially, he crafted one face [<i>partzuf</i> ] for</b> the idol, <b>and ultimately, he crafted four faces for it so that the Shekhina would see</b> it from each side <b>and become angry. </b>"
        },
        {
          "verseLocation": "2 Chronicles 33:13",
          "verseText": "Rabbi Yehuda says: Manasseh has a share in the World-to-Come, as it is stated: “And he prayed to him and He was entreated of him,",
          "talmudLocation": "Sanhedrin 102b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-20",
          "talmudFullText": "§ The Mishnah teaches that <b>R' Yehuda says: Manasseh has a share in the World-to-Come, as it is stated: “And he prayed to him and He was entreated of him, </b> and heard his supplication and brought him back to Jerusalem unto his kingdom” (II Chronicles 33:13). <b>R' Yoḥanan says: And both of them, </b> R' Yehuda and the Rabbis, who disagree with regard to whether Manasseh has a share in the World-to-Come, <b>interpreted one</b> and the same <b>verse, as it is stated: “And I will make them into a horror for all the kingdoms of the earth, on account of Manasseh, son of Hezekiah”</b> (Jeremiah 15:4). One <b>Sage, </b> R' Yehuda, <b>holds</b> that <b>“on account of Manasseh”</b> means that the Jewish people will be judged harshly, <b>as</b> ultimately, one as wicked as Manasseh <b>repented, and they did not do</b> so. <b>And</b> one <b>Sage, </b> the Rabbis, <b>holds</b> that"
        },
        {
          "verseLocation": "2 Chronicles 33:13",
          "verseText": "which is written: “And he prayed to Him; and He made an opening for him”",
          "talmudLocation": "Sanhedrin 103a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103a#section-3",
          "talmudFullText": "<b>R' Yoḥanan says in the name of R' Shimon ben Yoḥai: What</b> is the meaning of that <b>which is written: “And he prayed to Him; and He made an opening for him”</b> (II Chronicles 33:13)? Instead: <b>And He received his entreaty, should have been</b> written. Rather, this <b>teaches that God crafted for him a type of opening in Heaven in order to accept him in repentance. </b> It was necessary for Manasseh to enter the World-to-Come in a clandestine manner, <b>due to the attribute of justice</b> that sought to prevent his entry by claiming that his sentence was irreversible."
        },
        {
          "verseLocation": "2 Chronicles 33:13",
          "verseText": "and heard his supplication and brought him back to Jerusalem unto his kingdom”",
          "talmudLocation": "Sanhedrin 90a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/90a#section-17",
          "talmudFullText": "<b>Three</b> prominent <b>kings</b> mentioned in the Bible <b>and four</b> prominent <b>commoners</b> who are described in the Bible as men of great wisdom <b>have no share in the World-to-Come. </b> The <b>three kings</b> are: <b>Jeroboam, </b> son of Nebat, and <b>Ahab, </b> both of whom were kings of Israel, <b>and Manasseh, </b> king of Judea. <b>R' Yehuda says: Manasseh has a share in the World-to-Come, as it is stated</b> concerning Manasseh: <b>“And he prayed to Him, </b> and He received his entreaty, <b>and heard his supplication and brought him back to Jerusalem unto his kingdom”</b> (II Chronicles 33:13), indicating that he repented wholeheartedly and effectively. The Rabbis <b>said to</b> R' Yehuda: He regretted his actions, and his repentance was effective to the extent that God <b>restored him to his kingdom, but</b> God <b>did not restore him to his</b> share in <b>life in the World-to-Come. </b> The <b>four commoners</b> are: <b>Balaam, </b> son of Beor; <b>Doeg</b> the Edomite; <b>Ahithophel; and Gehazi. </b>"
        },
        {
          "verseLocation": "2 Chronicles 33:19",
          "verseText": "“idols”",
          "talmudLocation": "Sanhedrin 103b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-7",
          "talmudFullText": "<b>It is written</b> that Manasseh crafted <b>“an idol”</b> (II Chronicles 33:7), <b>and it is written</b> that Manasseh crafted <b>“idols”</b> (II Chronicles 33:19). <b>R' Yoḥanan says: Initially, he crafted one face [<i>partzuf</i> ] for</b> the idol, <b>and ultimately, he crafted four faces for it so that the Shekhina would see</b> it from each side <b>and become angry. </b>"
        },
        {
          "verseLocation": "2 Chronicles 33:23",
          "verseText": "Amon engaged in sexual intercourse with his mother, as it is stated: “But Amon increased his guilt”",
          "talmudLocation": "Sanhedrin 103b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-11",
          "talmudFullText": "<b>Amon had sex with his mother, as it is stated: “But Amon increased his guilt”</b> (II Chronicles 33:23), indicating that he performed a greater and more disgraceful transgression than anyone else. <b>R' Yoḥanan and R' Elazar</b> disagreed about his transgression; <b>one says that he burned the Torah, and one says that he had sex with his mother. His mother said to him: Do you have any pleasure</b> by having sex <b>from the place from which you emerged? He said to her: I am doing</b> this <b>only to express insolence to my Creator, </b> not for my pleasure."
        }
      ]
    },
    {
      "chapterNumber": 35,
      "citations": [
        {
          "verseLocation": "2 Chronicles 35:3",
          "verseText": "sequestered them, as it is stated: “And he said to the Levites who taught all Israel, and who were sacred unto the Lord: Place the sacred Ark in the room that Solomon, son of David, king of Israel built; there shall be no more burden upon your shoulders. Now serve the Lord your God and His people Israel”",
          "talmudLocation": "Horayot 12a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/12a#section-2",
          "talmudFullText": "<b>And who sequestered</b> the Ark? <b>Josiah, king of Judea, sequestered it, as he saw that it is written in the Torah</b> in the portion of rebuke: <b>“YHWH will lead you, and your king</b> whom you shall establish over you, unto a nation that you have not known” (Deuteronomy 28:36). <b>He commanded and</b> the people <b>sequestered them, as it is stated: “And he said to the Levites who taught all Israel, and who were sacred unto YHWH: Place the sacred Ark in the room that Solomon, son of David, king of Israel built; there shall be no more burden upon your shoulders. Now serve YHWH your God and His people Israel”</b> (II Chronicles 35:3)."
        },
        {
          "verseLocation": "2 Chronicles 35:11",
          "verseText": "valid, and a verse supports me: “And they slaughtered the Paschal offering and the priests sprinkled with their hand, and the Levites flayed”",
          "talmudLocation": "Yoma 49a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/49a#section-2",
          "talmudFullText": "The Talmud asks: <b>But wasn’t Rav Sheshet</b> the <b>one who objected</b> on the basis of this very <i>baraita</i>? <b>As Rav Sheshet said to the interpreter of Rav Ḥisda: Raise the</b> following <b>dilemma before Rav Ḥisda: What</b> is the <i>halakha</i> with regard to <b>carrying</b> the blood performed <b>by a non-priest? He said to him: </b> It is <b>valid, and a verse supports me: “And they slaughtered the Paschal offering and the priests sprinkled with their hand, and the Levites flayed”</b> (II Chronicles 35:11). This verse indicates that the priests took the blood from the hands of the Levites, from which it can be inferred that the Levites carried the blood from the place of slaughtering to the place of sprinkling."
        },
        {
          "verseLocation": "2 Chronicles 35:11",
          "verseText": "“And they slaughtered the Paschal offering, and the priests sprinkled the blood, which they received of their hand, and the Levites flayed them”",
          "talmudLocation": "Zevachim 14a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/14a#section-20",
          "talmudFullText": "Rav Ḥisda <b>said to him: </b> The offering remains <b>fit, and a verse supports my</b> ruling: <b>“And they slaughtered the Paschal offering, and the priests sprinkled the blood, which they received of their hand, and the Levites flayed them”</b> (II Chronicles 35:11). Apparently, priests are required only for the sprinkling of the blood on the altar and later rites. Just as slaughter may be performed by non-priests, so can the collection and conveying of the blood be performed by them."
        },
        {
          "verseLocation": "2 Chronicles 35:13",
          "verseText": "proof of the matter, there is an allusion to the matter, as it is stated: “And they cooked the Paschal offering with fire according to the ordinance”",
          "talmudLocation": "Nedarim 49a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/49a#section-2",
          "talmudFullText": "<strong>Talmud: </strong> <b>It is taught</b> in a <i>baraita</i>: In the case of one who vowed that cooked foods are forbidden to him, <b>R' Yoshiya</b> maintains that he is <b>prohibited</b> from eating roasted foods. <b>And although there is no</b> biblical <b>proof of the matter, there is an allusion to the matter, as it is stated: “And they cooked the Paschal offering with fire according to the ordinance”</b> (II Chronicles 35:13). Since the Paschal offering must be roasted, it is evident that roasting can also be referred to as cooking."
        },
        {
          "verseLocation": "2 Chronicles 35:21",
          "verseText": "“But he sent ambassadors to him saying: What have I to do with you, king of Judea? I do not come against you this day, but against the house with which I am at war; and God has commanded me to make haste. Forbear from meddling with God, Who is with me, so that He will not destroy you”",
          "talmudLocation": "Taanit 22b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/22b#section-1",
          "talmudFullText": "<b>“But he sent ambassadors to him saying: What have I to do with you, king of Judea? I do not come against you this day, but against the house with which I am at war; and God has commanded me to make haste. Forbear from meddling with God, Who is with me, so that He will not destroy you”</b> (II Chronicles 35:21). This clearly shows that Pharaoh Neco had no intention of engaging Josiah in battle."
        },
        {
          "verseLocation": "2 Chronicles 35:23",
          "verseText": "it is written: “And the archers shot at King Josiah;",
          "talmudLocation": "Moed Katan 28b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/28b#section-21",
          "talmudFullText": "<b>And Rava</b> further <b>said to Rabba bar Mari: It is written with regard to Josiah: “Behold, therefore I will gather you unto your fathers, and you shall be gathered into your grave in peace”</b> (II Kings 22:20), <b>and</b> elsewhere <b>it is written: “And the archers shot at King Josiah; </b> and the king said to his servants, Get me away; for I am grievously wounded” (II Chronicles 35:23). <b>And</b> with regard to this verse <b>R' Yehuda said</b> that <b>Rav said: </b> With their many arrows, <b>they made</b> his body <b>like a sieve. </b>"
        },
        {
          "verseLocation": "2 Chronicles 35:23",
          "verseText": "in Josiah, as it is written: “And the archers shot at King Josiah”",
          "talmudLocation": "Sanhedrin 48b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/48b#section-18",
          "talmudFullText": "The curse of those who <b>“fall by the sword”</b> was fulfilled among Solomon’s descendants <b>in Josiah, as it is written: “And the archers shot at King Josiah”</b> (II Chronicles 35:23), <b>and Rav Yehuda says</b> that <b>Rav says: </b> They shot him with so many arrows <b>that they turned his whole body into a sieve. </b>"
        },
        {
          "verseLocation": "2 Chronicles 35:23",
          "verseText": "“And the archers shot at King Josiah and the king said to his servants: Move me away, for I am seriously wounded”",
          "talmudLocation": "Taanit 22b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/22b#section-3",
          "talmudFullText": "With regard to Josiah’s battle with Pharaoh Neco, the verse states: <b>“And the archers shot at King Josiah and the king said to his servants: Move me away, for I am seriously wounded”</b> (II Chronicles 35:23). <b>What is</b> the meaning of the phrase: <b>“For I am seriously wounded”? Rav Yehuda said</b> that <b>Rav said: </b> This <b>teaches that</b> the Egyptian archers <b>made his entire body like a sieve</b> from the many arrows they shot at him."
        }
      ]
    },
    {
      "chapterNumber": 36,
      "citations": [
        {
          "verseLocation": "2 Chronicles 36:8",
          "verseText": "because it is written concerning him: “And the rest of the acts of Jehoiakim and his abominations that he did, and that which was found on him”",
          "talmudLocation": "Sanhedrin 103b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-13",
          "talmudFullText": "§ <b>Rava said to Rabba bar Mari: For what</b> reason <b>did</b> the <i>tanna’im</i> <b>not enumerate Jehoiakim</b> among the kings who have no share in the World-to-Come? One would imagine that he has no share in the World-to-Come, <b>because it is written concerning him: “And the rest of the acts of Jehoiakim and his abominations that he did, and that which was found on him”</b> (II Chronicles 36:8). The Talmud explains: <b>What</b> is the meaning of the phrase <b>“and that which was found on him”? R' Yoḥanan and R' Elazar</b> disagree; <b>one says that he etched the name of idols on his penis</b> due to his devotion to them, <b>and one says that he etched the name of Heaven on his penis</b> in a display of contempt."
        },
        {
          "verseLocation": "2 Chronicles 36:10",
          "verseText": "“And brought him to Babylon”",
          "talmudLocation": "Keritot 5b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/5b#section-15",
          "talmudFullText": "The <i>baraita</i> explains: Why did the king of Babylonia, Nebuchadnezzar, call him by the name Zedekiah? The reason is <b>that</b> Nebuchadnezzar <b>said to him: God will justify [<i>yatzdik</i>] the judgment over you if you rebel against me, as it is stated</b> with regard to Nebuchadnezzar and Jehoiachin: <b>“And brought him to Babylon”</b> (II Chronicles 36:10), and with regard to Zedekiah it is stated: <b>“And he also rebelled against King Nebuchadnezzar, who had made him swear by God”</b> (II Chronicles 36:13)."
        },
        {
          "verseLocation": "2 Chronicles 36:10",
          "verseText": "Rabbi Eliezer says: The Ark was exiled to Babylonia, as it is stated: “And at the turn of the year King Nebuchadnezzar sent and brought him to Babylonia, along with the precious vessels of the House of the Lord”",
          "talmudLocation": "Yoma 53b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/53b#section-14",
          "talmudFullText": "<strong>Talmud: </strong> The Talmud comments with regard to the wording of the Mishnah: It does <b>not teach: After</b> the Ark <b>was buried, but: After</b> it <b>was taken. </b> If so, <b>we learned</b> this Mishnah <b>in accordance with</b> the opinion of <b>the one who said</b> that <b>the Ark was exiled to Babylonia</b> and was not buried in its place, <b>as it was taught</b> in a <i>baraita</i>: <b>R' Eliezer says: The Ark was exiled to Babylonia, as it is stated: “And at the turn of the year King Nebuchadnezzar sent and brought him to Babylonia, along with the precious vessels of the House of YHWH”</b> (II Chronicles 36:10). These precious vessels must include the Ark."
        },
        {
          "verseLocation": "2 Chronicles 36:13",
          "verseText": "He said to him: God will justify the judgment against you if you rebel against me; and it is written: “And he also rebelled against King Nebuchadnezzar, who had imposed upon him an oath by God”",
          "talmudLocation": "Horayot 11b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/11b#section-18",
          "talmudFullText": "<b>A baraita states: He is Shallum, he is Zedekiah. And why was he called Shallum? </b> It is <b>due to</b> the fact <b>that he was perfect [<i>meshullam</i>] is his actions. Some say: </b> He was called <b>Shallum because the kingdom of the house of David was concluded [<i>sheshalema</i>] during his days. And what</b> was <b>his</b> actual <b>name? Mattaniah</b> was <b>his name, as it is stated: “And the king of Babylon crowned Mattaniah his uncle in his stead, and changed his name to Zedekiah”</b> (II Kings 24:17). Why did Nebuchadnezzar call him Zedekiah? <b>He said to him: God will justify the judgment against you if you rebel against me; and it is written: “And he also rebelled against King Nebuchadnezzar, who had imposed upon him an oath by God”</b> (II Chronicles 36:13)."
        },
        {
          "verseLocation": "2 Chronicles 36:13",
          "verseText": "“And he also rebelled against King Nebuchadnezzar, who had made him swear by God”",
          "talmudLocation": "Keritot 5b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/5b#section-15",
          "talmudFullText": "The <i>baraita</i> explains: Why did the king of Babylonia, Nebuchadnezzar, call him by the name Zedekiah? The reason is <b>that</b> Nebuchadnezzar <b>said to him: God will justify [<i>yatzdik</i>] the judgment over you if you rebel against me, as it is stated</b> with regard to Nebuchadnezzar and Jehoiachin: <b>“And brought him to Babylon”</b> (II Chronicles 36:10), and with regard to Zedekiah it is stated: <b>“And he also rebelled against King Nebuchadnezzar, who had made him swear by God”</b> (II Chronicles 36:13)."
        },
        {
          "verseLocation": "2 Chronicles 36:13",
          "verseText": "“And he also rebelled against King Nebuchadnezzar, who had made him swear by God”",
          "talmudLocation": "Nedarim 65a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/65a#section-2",
          "talmudFullText": "The Talmud cites another proof that one may dissolve such a vow or oath only in the presence of the party affected by the vow or oath. It states with regard to King Zedekiah: <b>“And he also rebelled against King Nebuchadnezzar, who had made him swear by God”</b> (II Chronicles 36:13). The Talmud asks: <b>What</b> was <b>his rebellion? </b> The Talmud answers: <b>Zedekiah found Nebuchadnezzar eating a live rabbit, </b> and the latter was ashamed to be seen doing this. <b>He said to him: Take an oath to me that you will not reveal my</b> behavior <b>and this matter will not emerge</b> in public. Zedekiah <b>took an oath</b> to him."
        },
        {
          "verseLocation": "2 Chronicles 36:13",
          "verseText": "“And he also rebelled against Nebuchadnezzar who had administered an oath to him by God”",
          "talmudLocation": "Shevuot 36a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/36a#section-2",
          "talmudFullText": "<b>R' Abbahu says: From where</b> is it derived <b>with regard to <i>ala</i> that it is an oath? </b> It is derived <b>as it is stated: </b> “And he took from the seed of the monarchy…<b>and brought it into an <i>ala</i>”</b> (Ezekiel 17:13); <b>and it is stated</b> with regard to Zedekiah, who was from the seed of the monarchy: <b>“And he also rebelled against Nebuchadnezzar who had administered an oath to him by God”</b> (II Chronicles 36:13). This indicates that the <i>ala</i> is an oath."
        },
        {
          "verseLocation": "2 Chronicles 36:16",
          "verseText": "Rabbi Yehuda said: Jerusalem was destroyed only because they disparaged the Torah scholars in it, as it is stated: “And they mocked the messengers of God and disdained His words and taunted His prophets, until the wrath of God arose against His people, until it could not be healed”",
          "talmudLocation": "Shabbat 119b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/119b#section-9",
          "talmudFullText": "<b>Rav Amram, son</b> of <b>R' Shimon bar Abba, said</b> that <b>R' Shimon bar Abba said</b> that <b>R' Ḥanina said: Jerusalem was destroyed only because the people did not rebuke one another, as it is stated: “Her ministers were like stags that found no pasture, </b> and they walked without strength before their pursuer” (Lamentations 1:6). <b>Just as this stag</b> turns <b>its head toward the other’s tail</b> when it grazes, and each one feeds on its own, <b>so too, the Jewish people in that generation lowered their faces to the ground and did not rebuke one another. </b> <b><b>R' Yehuda said: Jerusalem was destroyed only because they disparaged the Torah scholars in it, as it is stated: “And they mocked the messengers of God and disdained His words and taunted His prophets, until the wrath of God arose against His people, until it could not be healed”</b> (II Chronicles 36:16). <b>What</b> is the meaning of: <b>Until it could not be healed? Rav Yehuda said</b> that <b>Rav said: </b> It means that <b>anyone who disparages Torah scholars cannot be healed from his wound. </b>"
        }
      ]
    }
  ]
}