{
  "bookName": "Daniel",
  "totalEntries": 114,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Daniel 1:4",
          "verseText": "“and he should teach them the books and the language of the Chaldeans”",
          "talmudLocation": "Chullin 24a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/24a#section-13",
          "talmudFullText": "<b>From here</b> it is derived that <b>a student who did not see a positive indication in his studies</b> after <b>five years will no longer see</b> a productive result from those studies. <b>R' Yosei says</b> that the period is <b>three years, as it is stated</b> with regard to Daniel and his cohort who instructed the king of Babylonia: <b>“And they should be raised three years”</b> (Daniel 1:5), <b>“and he should teach them the books and the language of the Chaldeans”</b> (Daniel 1:4)."
        },
        {
          "verseLocation": "Daniel 1:4",
          "verseText": "in whom was found no blemish, and well favored, and skillful in all wisdom, and discerning in knowledge, and perceptive in understanding, and who had strength in them to stand in the king’s palace, and whom they might teach the learning and the tongue of the Chaldeans”",
          "talmudLocation": "Sanhedrin 93b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93b#section-9",
          "talmudFullText": "Six virtues were ascribed to <b>Daniel, Hananiah, Mishael, and Azariah, as it is written in their</b> regard: “Youths <b>in whom was found no blemish, and well favored, and skillful in all wisdom, and discerning in knowledge, and perceptive in understanding, and who had strength in them to stand in the king’s palace, and whom they might teach the learning and the tongue of the Chaldeans”</b> (Daniel 1:4)."
        },
        {
          "verseLocation": "Daniel 1:5",
          "verseText": "“And they should be raised three years”",
          "talmudLocation": "Chullin 24a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/24a#section-13",
          "talmudFullText": "<b>From here</b> it is derived that <b>a student who did not see a positive indication in his studies</b> after <b>five years will no longer see</b> a productive result from those studies. <b>R' Yosei says</b> that the period is <b>three years, as it is stated</b> with regard to Daniel and his cohort who instructed the king of Babylonia: <b>“And they should be raised three years”</b> (Daniel 1:5), <b>“and he should teach them the books and the language of the Chaldeans”</b> (Daniel 1:4)."
        },
        {
          "verseLocation": "Daniel 1:5",
          "verseText": "as it is written: “And the king appointed [ vayman ] for them",
          "talmudLocation": "Sukkah 39b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/39b#section-4",
          "talmudFullText": "The Talmud continues. Rav Sheshet <b>raised the objection, and he</b> also <b>resolved it: </b> The rabbis <b>taught</b> this <i>halakha</i> in the Mishnah with regard to food in the amount <b>sufficient</b> for his <b>sustenance [<i>man</i>]. </b> These plants that the Mishnah excludes from the prohibition against purchase from an <i>am ha’aretz</i> are still subject to the three-meal limit. <b>And likewise, Rabba bar bar Ḥana said</b> that <b>R' Yoḥanan said: </b> The rabbis <b>taught</b> this <i>halakha</i> in the amount <b>sufficient</b> for his <b>sustenance [<i>man</i>]. From where may it be inferred that <i>man</i> is a term</b> meaning <b>sustenance? </b> It is <b>as it is written: “And the king appointed [<i>vayman</i>] for them</b> a daily portion of the king’s food” (Daniel 1:5)."
        },
        {
          "verseLocation": "Daniel 1:6",
          "verseText": "“Now among these were, of the descendants of Judah: Daniel, Hananiah, Mishael, and Azariah”",
          "talmudLocation": "Sanhedrin 93b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93b#section-11",
          "talmudFullText": "§ The Talmud explores more of their attributes. The verse states: <b>“Now among these were, of the descendants of Judah: Daniel, Hananiah, Mishael, and Azariah”</b> (Daniel 1:6). <b>R' Eliezer says: They were all of the descendants of Judah. And R' Shmuel bar Naḥmani says: Daniel was of the descendants of Judah, and Hananiah, Mishael, and Azariah were</b> descendants <b>of other tribes. </b>"
        },
        {
          "verseLocation": "Daniel 1:8",
          "verseText": "Isn’t it written: “But Daniel purposed in his heart that he would not defile himself with the king’s food, nor with the wine which he drank [ mishtav ]”",
          "talmudLocation": "Avodah Zarah 36a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/36a#section-6",
          "talmudFullText": "Rav claimed that R' Yehuda HaNasi and his court erred in permitting the oil of non-Jews, which Daniel had prohibited. <b>Rav said: If they, </b> R' Yehuda HaNasi and his court, <b>did not expound</b> the following verse, <b>will we not expound it? </b> We must certainly do so. <b>Isn’t it written: “But Daniel purposed in his heart that he would not defile himself with the king’s food, nor with the wine which he drank [<i>mishtav</i>]”</b> (Daniel 1:8)? The word <i>mishtav</i> is in the plural, indicating that <b>the verse speaks of two</b> types of <b>drinking: One is the drinking of wine, and one is the drinking of oil. </b> Accordingly, Daniel himself refrained from consuming oil of non-Jews, as he instituted this prohibition. Why does Shmuel reject this inference, which indicates that Daniel issued this decree?"
        },
        {
          "verseLocation": "Daniel 1:16",
          "verseText": "and gave them vegetables”",
          "talmudLocation": "Megillah 13a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-17",
          "talmudFullText": "<b>And R' Yoḥanan said</b> a 3rd understanding: He gave her <b>vegetables, </b> which did not pose a problem with regard to the kosher laws. <b>And so it states</b> with regard to the kindness done for Daniel and his associates: <b>“So the steward took away their food</b> and the wine that they should drink; <b>and gave them vegetables”</b> (Daniel 1:16)."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Daniel 2:18",
          "verseText": "from here: “That they might ask mercy of the God of Heaven concerning this secret”",
          "talmudLocation": "Taanit 8b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/8b#section-8",
          "talmudFullText": "The Talmud explains: <b>And from where do we</b> derive <b>that</b> one should not pray <b>for two</b> troubles simultaneously? <b>As it is written: “So we fasted and beseeched our God for this”</b> (Ezra 8:23). <b>From the fact</b> that the verse states: “For this,” it may be inferred <b>that there is another</b> trouble about which the people did not pray. <b>In the West, </b> Eretz Yisrael, <b>they say in the name of R' Ḥaggai</b> that this idea comes <b>from here: “That they might ask mercy of the God of Heaven concerning this secret”</b> (Daniel 2:18). <b>From the fact</b> that the verse states: “This secret,” it may be inferred <b>that there is another</b> trouble about which they did not pray."
        },
        {
          "verseLocation": "Daniel 2:21",
          "verseText": "possesses wisdom, as it is stated: “He gives wisdom unto the wise, and knowledge to they who know understanding”",
          "talmudLocation": "Berakhot 55a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/55a#section-14",
          "talmudFullText": "On a similar note, <b>R' Yoḥanan said: God only grants wisdom to one who</b> already <b>possesses wisdom, as it is stated: “He gives wisdom unto the wise, and knowledge to they who know understanding”</b> (Daniel 2:21). <b>Rav Taḥalifa, from the West, </b> Eretz Yisrael, <b>heard</b> this <b>and repeated it before R' Abbahu. </b> R' Abbahu <b>said to him: You learned</b> proof for this idea <b>from there; we learn it from here: As it is written</b> in praise of the builders of the Tabernacle: <b>“And in the hearts of all who are wise-hearted I have placed wisdom”</b> (Exodus 31:6)."
        },
        {
          "verseLocation": "Daniel 2:22",
          "verseText": "But isn’t it written: “He reveals deep and secret things, He knows what is in the darkness, and the light dwells with Him”",
          "talmudLocation": "Chagigah 12b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12b#section-15",
          "talmudFullText": "<b>And darkness and clouds and fog surround Him, as it is stated: “He made darkness His hiding place, His pavilion round about Him; darkness of waters, thick clouds of the skies”</b> (Psalms 18:12). The Talmud asks: <b>And is there darkness before Heaven, </b> i.e., before God? <b>But isn’t it written: “He reveals deep and secret things, He knows what is in the darkness, and the light dwells with Him”</b> (Daniel 2:22), demonstrating that only light, not darkness, is found with God? The Talmud answers: This is <b>not difficult. This</b> verse, which states that only light dwells with Him, is referring"
        },
        {
          "verseLocation": "Daniel 2:29",
          "verseText": "as it is stated: “As for you, O king, your thoughts came upon your bed,",
          "talmudLocation": "Berakhot 55b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/55b#section-21",
          "talmudFullText": "<b>R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: A person is shown</b> in his dream <b>only the thoughts of his heart</b> when he was awake, as evidenced by what Daniel said to Nebuchadnezzar, <b>as it is stated: “As for you, O king, your thoughts came upon your bed, </b> what should come to pass hereafter” (Daniel 2:29). <b>And if you wish, say</b> instead that it is derived <b>from here, </b> a related verse: <b>“And that you may know the thoughts of your</b> heart” (Daniel 2:30). How will you know the thoughts of your heart? By their being revealed to you in a dream. <b>Rava said: Know</b> that this is the case, <b>for one is neither shown a golden palm tree nor an elephant</b> going through <b>the eye of a needle</b> in a dream. In other words, dreams only contain images that enter a person’s mind."
        },
        {
          "verseLocation": "Daniel 2:30",
          "verseText": "“And that you may know the thoughts of your",
          "talmudLocation": "Berakhot 55b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/55b#section-21",
          "talmudFullText": "<b>R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: A person is shown</b> in his dream <b>only the thoughts of his heart</b> when he was awake, as evidenced by what Daniel said to Nebuchadnezzar, <b>as it is stated: “As for you, O king, your thoughts came upon your bed, </b> what should come to pass hereafter” (Daniel 2:29). <b>And if you wish, say</b> instead that it is derived <b>from here, </b> a related verse: <b>“And that you may know the thoughts of your</b> heart” (Daniel 2:30). How will you know the thoughts of your heart? By their being revealed to you in a dream. <b>Rava said: Know</b> that this is the case, <b>for one is neither shown a golden palm tree nor an elephant</b> going through <b>the eye of a needle</b> in a dream. In other words, dreams only contain images that enter a person’s mind."
        },
        {
          "verseLocation": "Daniel 2:32",
          "verseText": "nothing other than idol worship, as it is stated: “As for that image, its head [ reishei ] was of fine gold”",
          "talmudLocation": "Sanhedrin 107a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/107a#section-12",
          "talmudFullText": "<b>Rav Yehuda says</b> that <b>Rav says: Even during the time of his illness he fulfilled</b> the mitzva of <b>conjugal rights for eighteen</b> wives, <b>as it is stated: “I am weary with my groaning; every night I speak in my bed; I melt away my couch with tears”</b> (Psalms 6:7). Even when he was weary and groaning he still spoke in his bed, a euphemism for sex. <b>And Rav Yehuda says</b> that <b>Rav says: David sought to engage in idol worship</b> during Absalom’s coup, <b>as it is stated: “And it came to pass when David was at the top [<i>rosh</i>] of the ascent, where he would bow to God”</b> (II Samuel 15:32), <b>and <i>rosh</i></b> means <b>nothing other than idol worship, as it is stated: “As for that image, its head [<i>reishei</i>] was of fine gold”</b> (Daniel 2:32)."
        },
        {
          "verseLocation": "Daniel 2:37",
          "verseText": "which is sacred: “You, O king, king of kings, unto whom the God of heaven has given you the kingdom, the power, and the strength, and the glory”",
          "talmudLocation": "Shevuot 35b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/35b#section-19",
          "talmudFullText": "<b>All kings that are stated with regard to Daniel</b> are <b>non-sacred, except for this</b> one, <b>which is sacred: “You, O king, king of kings, unto whom the God of heaven has given you the kingdom, the power, and the strength, and the glory”</b> (Daniel 2:37)."
        },
        {
          "verseLocation": "Daniel 2:38",
          "verseText": "the brother of the wicked Nebuchadnezzar, who is called “head,” as it is stated: “You are the head of gold”",
          "talmudLocation": "Megillah 11a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-15",
          "talmudFullText": "The Talmud continues with its explanation of the book of Esther, beginning with a discussion of the name <b>Ahasuerus. Rav said: </b> The name should be viewed as a contraction: <b>The brother of the head [<i>aḥiv shel rosh</i>] and of the same character as the head [<i>ben gilo shel rosh</i>]. </b> Rav explains: <b>The brother of the head, </b> i.e., <b>the brother of the wicked Nebuchadnezzar, who is called “head, ” as it is stated: “You are the head of gold”</b> (Daniel 2:38). <b>Of the same character as the head, for he, </b> Nebuchadnezzar, <b>killed</b> the Jews, and <b>he, </b> Ahasuerus, <b>sought to kill</b> them. <b>He destroyed</b> the Temple, and <b>he sought to destroy</b> the foundations for the Temple laid by Zerubbabel, <b>as it is stated: “And in the reign of Ahasuerus, in the beginning of his reign, they wrote to him an accusation against the inhabitants of Judah and Jerusalem”</b> (Ezra 4:6), and he ordered that the construction of the Temple cease."
        },
        {
          "verseLocation": "Daniel 2:46",
          "verseText": "as it is written: “Then the king Nebuchadnezzar fell upon his face and worshipped Daniel",
          "talmudLocation": "Sanhedrin 93a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93a#section-11",
          "talmudFullText": "<b>And Nebuchadnezzar said: Daniel should go</b> away <b>from here so that</b> the people <b>will not say: </b> Nebuchadnezzar <b>burned his god in fire. And from where</b> is it derived <b>that</b> Nebuchadnezzar <b>worshipped</b> Daniel? It is derived from a verse, <b>as it is written: “Then the king Nebuchadnezzar fell upon his face and worshipped Daniel</b> and commanded that they should offer an offering and pleasing aromas to him” (Daniel 2:46)."
        },
        {
          "verseLocation": "Daniel 2:49",
          "verseText": "of Rabbi Yehuda ben Bava? As it is written: “But Daniel was in the gate of the king”",
          "talmudLocation": "Eruvin 73a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/73a#section-7",
          "talmudFullText": "<b>Rav said: What is the rationale</b> for the opinion <b>of R' Yehuda ben Bava? As it is written: “But Daniel was in the gate of the king”</b> (Daniel 2:49). The verse refers to Daniel’s function rather than to an actual location, indicating that wherever Daniel went, it was as though he was in the king’s gate. The same applies to any slave vis-à-vis his master."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Daniel 3:2",
          "verseText": "a verse, as it is written: “Then Nebuchadnezzar the king sent to gather together the satraps, the prefects and the governors, the counselors, the treasurers, the justices, the magistrates and all the rulers of the provinces”",
          "talmudLocation": "Sanhedrin 92b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92b#section-14",
          "talmudFullText": "<b>And</b> the knowledge that <b>all of</b> the miracles were performed is based on <b>tradition. And the four</b> ranks of officials from <b>monarchies</b> that were burned is related in <b>a verse, as it is written: “Then Nebuchadnezzar the king sent to gather together the satraps, the prefects and the governors, the counselors, the treasurers, the justices, the magistrates and all the rulers of the provinces”</b> (Daniel 3:2). <b>And it is written: “There are certain Jews…</b>they do not serve your gods, nor worship the golden image you have erected” (Daniel 3:12). <b>And it is written</b> in the verse after Hananiah, Mishael, and Azariah left the fiery furnace: <b>“And the satraps, the prefects, the governors, and the king’s counselors gathered and saw these men”</b> (Daniel 3:27) who emerged from the fire unscathed. Nebuchadnezzar sent to gather eight ranks of officials, and only four ranks witnessed Hananiah, Mishael, and Azariah emerge from the furnace. Apparently, the other four ranks were burned in the fire."
        },
        {
          "verseLocation": "Daniel 3:12",
          "verseText": "as it is written: “There are certain Jews [ Yehuda’in ]",
          "talmudLocation": "Megillah 13a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-2",
          "talmudFullText": "<b>R' Yoḥanan said</b> a different explanation of the verse: <b>Actually, </b> Mordecai <b>came from</b> the tribe of <b>Benjamin. Why, </b> then, <b>was he referred to as <i>Yehudi</i>? On account of</b> the fact <b>that he repudiated idol worship, for anyone who repudiates idolatry is called <i>Yehudi</i>. </b> It is understood here in the sense of <i>yiḥudi</i>, one who declares the oneness of God, <b>as it is written: “There are certain Jews [<i>Yehuda’in</i>]</b> whom thou hast appointed over the affairs of the province of Babylonia, Shadrach, Meshach, and Abed-Nego; these men, O king, have not regarded you: They serve not your gods, nor worship the golden image which you have set up” (Daniel 3:12). These three individuals were in fact Hananiah, Mishael, and Azariah, who were not all from the tribe of Judah but are referred to as <i>Yehuda’in</i> because they repudiated idol worship."
        },
        {
          "verseLocation": "Daniel 3:12",
          "verseText": "And it is written: “There are certain Jews…",
          "talmudLocation": "Sanhedrin 92b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92b#section-14",
          "talmudFullText": "<b>And</b> the knowledge that <b>all of</b> the miracles were performed is based on <b>tradition. And the four</b> ranks of officials from <b>monarchies</b> that were burned is related in <b>a verse, as it is written: “Then Nebuchadnezzar the king sent to gather together the satraps, the prefects and the governors, the counselors, the treasurers, the justices, the magistrates and all the rulers of the provinces”</b> (Daniel 3:2). <b>And it is written: “There are certain Jews…</b>they do not serve your gods, nor worship the golden image you have erected” (Daniel 3:12). <b>And it is written</b> in the verse after Hananiah, Mishael, and Azariah left the fiery furnace: <b>“And the satraps, the prefects, the governors, and the king’s counselors gathered and saw these men”</b> (Daniel 3:27) who emerged from the fire unscathed. Nebuchadnezzar sent to gather eight ranks of officials, and only four ranks witnessed Hananiah, Mishael, and Azariah emerge from the furnace. Apparently, the other four ranks were burned in the fire."
        },
        {
          "verseLocation": "Daniel 3:21",
          "verseText": "as it is stated: “Then these men were bound in their mantles, their tunics, and their hats,",
          "talmudLocation": "Sanhedrin 92b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92b#section-15",
          "talmudFullText": "<b>The school of R' Eliezer ben Ya’akov teaches: Even during a period of danger, a person should not deviate from his prominence</b> and demean himself, <b>as it is stated: “Then these men were bound in their mantles, their tunics, and their hats, </b> and their other garments, and they were cast into the blazing fiery furnace” (Daniel 3:21). Even when cast into the furnace, they donned garments befitting their station."
        },
        {
          "verseLocation": "Daniel 3:25",
          "verseText": "The righteous are greater than the ministering angels, as it is stated: “He answered and said: I see four men unbound, walking in the midst of the fire, and they have no hurt; and the appearance of the fourth is like a son of the gods”",
          "talmudLocation": "Sanhedrin 93a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93a#section-1",
          "talmudFullText": "<b>The righteous are greater than the ministering angels, as it is stated: “He answered and said: I see four men unbound, walking in the midst of the fire, and they have no hurt; and the appearance of the 4th is like a son of the gods”</b> (Daniel 3:25). Nebuchadnezzar saw three righteous people and an angel in the fire of the furnace and noted the presence of the righteous people before noting the presence of the angel."
        },
        {
          "verseLocation": "Daniel 3:25",
          "verseText": "Granted, according to the one who says that idol worship was emasculated during their lifetime, that is as it is written: “And they have no hurt”",
          "talmudLocation": "Sanhedrin 93b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93b#section-13",
          "talmudFullText": "The Talmud asks: <b>Granted, according to the one who says that idol worship was emasculated during their lifetime, that is as it is written: “And they have no hurt”</b> (Daniel 3:25), indicating that the bodies of Hananiah, Mishael, and Azariah were intact and they were not castrated. <b>But according to the one who says</b> that they were <b>literally eunuchs, what is</b> the meaning of the phrase <b>“And they have no hurt”? </b> The Talmud answers: It means they had no <b>hurt from the fire</b> of the furnace, not that their bodies were completely intact. The Talmud asks: <b>But isn’t it</b> already <b>written: “Nor had the odor of fire passed over them”</b> (Daniel 3:27)? There was no need to repeat that they were unaffected by the fire. The Talmud answers: This means that there was <b>neither hurt</b> from the fire <b>nor</b> harm from the <b>odor</b> of the fire."
        },
        {
          "verseLocation": "Daniel 3:25",
          "verseText": "“And the appearance of the fourth is like that of an angel”",
          "talmudLocation": "Sanhedrin 95b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/95b#section-14",
          "talmudFullText": "<b>R' Yehoshua ben Levi says: Fourteen</b> remained, <b>as it is stated: “Two or three…four or five, ”</b> which total fourteen. <b>R' Yoḥanan says: Five</b> remained: <b>Sennacherib, and his two sons, </b> and <b>Nebuchadnezzar, and Nebuzaradan, </b> the captain of the guard. The fact that <b>Nebuzaradan</b> was among them is learned through <b>tradition. Nebuchadnezzar</b> was among them, <b>as it is written</b> that Nebuchadnezzar said when he saw an angel with Hananiah, Mishael, and Azariah: <b>“And the appearance of the 4th is like that of an angel”</b> (Daniel 3:25). <b>And if he had not seen</b> the angel that smote Sennacherib’s army, <b>from where would he have known</b> that the 4th person looked like an angel? <b>Sennacherib and his two sons</b> were among them, <b>as it is written</b> later in their regard: <b>“And it came to pass as he was worshipping in the house of Nisroch his god that Adrammelech and Sarezer, his sons, smote him with the sword”</b> (II Kings 19:37). Evidently, the three of them survived."
        },
        {
          "verseLocation": "Daniel 3:27",
          "verseText": "“And the satraps, the prefects, the governors, and the king’s counselors gathered and saw these men”",
          "talmudLocation": "Sanhedrin 92b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92b#section-14",
          "talmudFullText": "<b>And</b> the knowledge that <b>all of</b> the miracles were performed is based on <b>tradition. And the four</b> ranks of officials from <b>monarchies</b> that were burned is related in <b>a verse, as it is written: “Then Nebuchadnezzar the king sent to gather together the satraps, the prefects and the governors, the counselors, the treasurers, the justices, the magistrates and all the rulers of the provinces”</b> (Daniel 3:2). <b>And it is written: “There are certain Jews…</b>they do not serve your gods, nor worship the golden image you have erected” (Daniel 3:12). <b>And it is written</b> in the verse after Hananiah, Mishael, and Azariah left the fiery furnace: <b>“And the satraps, the prefects, the governors, and the king’s counselors gathered and saw these men”</b> (Daniel 3:27) who emerged from the fire unscathed. Nebuchadnezzar sent to gather eight ranks of officials, and only four ranks witnessed Hananiah, Mishael, and Azariah emerge from the furnace. Apparently, the other four ranks were burned in the fire."
        },
        {
          "verseLocation": "Daniel 3:27",
          "verseText": "written: “Nor had the odor of fire passed over them”",
          "talmudLocation": "Sanhedrin 93b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93b#section-13",
          "talmudFullText": "The Talmud asks: <b>Granted, according to the one who says that idol worship was emasculated during their lifetime, that is as it is written: “And they have no hurt”</b> (Daniel 3:25), indicating that the bodies of Hananiah, Mishael, and Azariah were intact and they were not castrated. <b>But according to the one who says</b> that they were <b>literally eunuchs, what is</b> the meaning of the phrase <b>“And they have no hurt”? </b> The Talmud answers: It means they had no <b>hurt from the fire</b> of the furnace, not that their bodies were completely intact. The Talmud asks: <b>But isn’t it</b> already <b>written: “Nor had the odor of fire passed over them”</b> (Daniel 3:27)? There was no need to repeat that they were unaffected by the fire. The Talmud answers: This means that there was <b>neither hurt</b> from the fire <b>nor</b> harm from the <b>odor</b> of the fire."
        },
        {
          "verseLocation": "Daniel 3:33",
          "verseText": "began and said: “How great are His signs and how mighty are His wonders; His kingdom is an everlasting kingdom and His dominion is from generation to generation”",
          "talmudLocation": "Sanhedrin 92b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92b#section-11",
          "talmudFullText": "§ <b>A baraita states</b> in a <i>baraita</i>: <b>At the moment that Nebuchadnezzar the wicked cast Hananiah, Mishael, and Azariah into the fiery furnace, God said to Ezekiel: Go and revive the dead in the Dura Valley. Once</b> Ezekiel <b>revived them, the bones came and struck</b> Nebuchadnezzar, <b>that wicked</b> man, <b>in his face. </b> Nebuchadnezzar <b>said: What is the nature of these? </b> His servants <b>said to him: The friend of these</b> three, Hananiah, Mishael, and Azariah, <b>is reviving</b> the <b>dead in the Dura Valley. </b> Nebuchadnezzar <b>began and said: “How great are His signs and how mighty are His wonders; His kingdom is an everlasting kingdom and His dominion is from generation to generation”</b> (Daniel 3:33)."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Daniel 4:6",
          "verseText": "no secret causes you trouble”",
          "talmudLocation": "Chullin 59a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/59a#section-5",
          "talmudFullText": "Rav <b>said to him: What is the rectification</b> for such an uncertainty? Shmuel said to him: <b>We shall set it in a</b> hot <b>oven, as it will</b> then <b>inspect itself. </b> Shmuel <b>set it</b> in the oven on a spit, and the meat <b>fell</b> off the bone <b>bit by bit, </b> a sign that a snake had bitten the young deer. <b>Shmuel recited about Rav</b> the verse: <b>“There shall no mischief befall the righteous”</b> (Proverbs 12:21), since he was saved due to his righteousness. <b>Rav recited about Shmuel</b> the verse: “And <b>no secret causes you trouble”</b> (Daniel 4:6), since he was learned even with regard to such matters."
        },
        {
          "verseLocation": "Daniel 4:9",
          "verseText": "“And in its branches will dwell the birds [ tzipparei ] of the heaven”",
          "talmudLocation": "Chullin 140a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/140a#section-1",
          "talmudFullText": "stated in the verse describing a tree: <b>“And in its branches will dwell the birds [<i>tzipparei</i>] of the heaven”</b> (Daniel 4:9). The verse states only: “The birds [<i>tzipparei</i>],” and not: The birds of any type of wing. Accordingly, the term “the birds [<i>tzipparei</i>]” must be referring to all birds, whether kosher or non-kosher, since all birds dwell in tree branches. The Talmud rejects this: Non-kosher birds <b>are called: Birds [<i>tzipparei</i>] of the heaven, </b> but <b>they are not called: <i>Tzipparei</i>, </b> in <b>an unspecified</b> manner."
        },
        {
          "verseLocation": "Daniel 4:14",
          "verseText": "in order to fulfill what is stated: “And He sets up over it the lowest of men”",
          "talmudLocation": "Moed Katan 18a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/18a#section-12",
          "talmudFullText": "§ Having mentioned Avitul the scribe, the Talmud records other statements of his: <b>And Avitul the scribe said in the name of Rav Pappa: </b> The <b>Pharaoh who lived in the days of Moses was a cubit</b> tall, his <b>beard was a cubit</b> long, <b>and his penis</b> [<b><i>parmashtako</i></b>] was <b>a cubit and a span, </b> i.e., a cubit and the distance between the thumb and the little finger, in length, <b>in order to fulfill what is stated: “And He sets up over it the lowest of men”</b> (Daniel 4:14), which teaches that Pharaoh was extremely short and lowly."
        },
        {
          "verseLocation": "Daniel 4:14",
          "verseText": "“The matter is by the decree of the watchers, and the sentence by the word of the sacred ones”",
          "talmudLocation": "Pesachim 33a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/33a#section-11",
          "talmudFullText": "The Talmud asks: <b>What are the circumstances</b> in <b>which</b> this leavened bread <b>did not have a period of fitness</b> even on Passover? This could have happened only in a case <b>where it</b> became <b>leavened</b> while it was still <b>attached</b> to the ground and could not yet become <i>teruma</i>. <b>However, </b> if <b>it</b> became <b>leavened</b> after being <b>detached</b> from the ground, then can this leavened bread <b>indeed become consecrated</b> as <i>teruma</i>, even though the <i>baraita</i> indicates that no leavened bread can be designated as <i>teruma</i> during Passover? Rav Naḥman bar Yitzhak <b>said to</b> Rav Huna, son of Rav Yehoshua: <b>Yes, </b> this is indeed the case despite this puzzling limitation, and the biblical expression can be applied homiletically: <b>“The matter is by the decree of the watchers, and the sentence by the word of the sacred ones”</b> (Daniel 4:14). The rabbis, who are compared to celestial beings, agree with my statement. <b>And so too, in the study hall, they teach in accordance with my</b> opinion, despite the puzzling nature of this ruling."
        },
        {
          "verseLocation": "Daniel 4:14",
          "verseText": "as it is stated: “The matter is by the decree of the watchers, and the sentence by the word of the holy ones”",
          "talmudLocation": "Sanhedrin 38b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/38b#section-16",
          "talmudFullText": "The Talmud asks: <b>Why do I</b> need <b>these</b> instances of plural words? Why does the verse employ the plural at all when referring to God? The Talmud explains: This is <b>in accordance with</b> the statement <b>of R' Yoḥanan, as R' Yoḥanan says: God does not act unless He consults with the entourage of Above, </b> i.e., the angels, <b>as it is stated: “The matter is by the decree of the watchers, and the sentence by the word of the holy ones”</b> (Daniel 4:14)."
        },
        {
          "verseLocation": "Daniel 4:16",
          "verseText": "“was dismayed for a while”",
          "talmudLocation": "Kiddushin 39a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/39a#section-6",
          "talmudFullText": "<b>R' Asi says</b> that <b>R' Yoḥanan says: <i>Orla</i></b> is forbidden <b>outside of Eretz</b> Yisrael by <b>a <i>halakha</i></b> transmitted <b>to Moses from Sinai. R' Zeira said to R' Asi: But isn’t it taught</b> in a <i>baraita</i>: With regard to produce whose status concerning <b><i>orla</i></b> is <b>uncertain, in Eretz</b> Yisrael it is <b>forbidden, in Syria</b> it is <b>permitted, </b> and <b>outside of Eretz</b> Yisrael <b>one goes down and gathers</b> it? And if <i>orla</i> is forbidden outside of Eretz Yisrael by a <i>halakha</i> transmitted to Moses from Sinai, why is produce whose status concerning <i>orla</i> is uncertain permitted in Syria? R' Zeira <b>“was dismayed for a while”</b> (Daniel 4:16), and then R' Asi <b>said to him: Say</b> that <b>it is stated like this, </b> i.e., explain that the <i>halakha</i> transmitted to Moses from Sinai was that outside of Eretz Yisrael produce whose status concerning <i>orla</i> is <b>uncertain</b> is <b>permitted, and</b> produce whose status concerning <i>orla</i> is <b>certain</b> is <b>forbidden. </b>"
        },
        {
          "verseLocation": "Daniel 4:16",
          "verseText": "“was astonished for a while”",
          "talmudLocation": "Moed Katan 3b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/3b#section-10",
          "talmudFullText": "R' Abbahu <b>“was astonished for a while”</b> (Daniel 4:16), and then <b>said to him: Say</b> that when Beit Shammai and Beit Hillel established their decree, <b>they stipulated among themselves: Anyone who</b> later <b>wishes to nullify</b> this decree <b>may come and nullify</b> it."
        },
        {
          "verseLocation": "Daniel 4:16",
          "verseText": "“He was astonished for a while”",
          "talmudLocation": "Shabbat 47a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/47a#section-3",
          "talmudFullText": "<b>“He was astonished for a while”</b> (Daniel 4:16) and could not find an answer. <b>And, </b> ultimately, R' Asi <b>said: Here, too, </b> it is referring to a case where the coal pan <b>has bits</b> of frankincense that were not yet burned. Due to those bits, moving the pan is permitted. <b>Abaye said: Are</b> small <b>bits in the house of R'</b> Yehuda HaNasi <b>significant? </b> Since they are not significant, they are nullified by the ashes and the mixture is entirely unsuitable for use."
        },
        {
          "verseLocation": "Daniel 4:16",
          "verseText": "sacred, as it is stated: “My Lord, the dream shall be for your enemy and its interpretation for your foe”",
          "talmudLocation": "Shevuot 35b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/35b#section-20",
          "talmudFullText": "<b>And some say: This too</b> is <b>sacred, as it is stated: “My Lord, the dream shall be for your enemy and its interpretation for your foe”</b> (Daniel 4:16). <b>To whom is</b> Daniel <b>saying</b> this? <b>If it enters your mind</b> that when Daniel says: “My lord,” it is <b>to Nebuchadnezzar</b> that <b>he is saying it, his enemy, who are they? </b> They are the <b>Jewish people. Would</b> Daniel <b>curse the Jewish people? </b>"
        },
        {
          "verseLocation": "Daniel 4:16",
          "verseText": "“He was astonished for a while”",
          "talmudLocation": "Sukkah 44a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/44a#section-10",
          "talmudFullText": "<b>R' Zeira said to R' Abbahu: Did R' Yoḥanan</b> actually <b>say that? Didn’t R' Yoḥanan say in the name of R' Neḥunya of the valley of Beit Ḥortan: </b> The <i>halakha</i> of the <b>ten saplings, </b> the mitzva of the <b>willow branch</b> in the Temple, <b>and</b> the mitzva of <b>the water libation</b> on the altar during the festival of <i>Sukkot</i> are each <b>a <i>halakha</i></b> transmitted <b>to Moses from Sinai? </b> How then could he attribute the origin of the mitzva of the willow branch to the prophets? <b>“He was astonished for a while”</b> (Daniel 4:16), <b>and</b> after considering the apparent contradiction <b>he said</b> that indeed R' Yoḥanan maintains that the mitzva of the willow branch is a <i>halakha</i> transmitted to Moses from Sinai. However, over the course of time during the Babylonian exile <b>they forgot</b> some <i>halakhot</i>, including the mitzva of the willow branch, <b>and then</b> the prophets <b>reinstituted them. </b>"
        },
        {
          "verseLocation": "Daniel 4:20",
          "verseText": "“Hew down the tree and destroy it; yet leave the stump of its roots in the earth”",
          "talmudLocation": "Sanhedrin 110b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/110b#section-10",
          "talmudFullText": "<b>R' Akiva says: They come into the World-to-Come, as it is stated: “YHWH preserves the simple [<i>peta’im</i>]”</b> (Psalms 116:6), <b>as in the cities overseas</b> the residents <b>call a child <i>patya</i>. And</b> the verse <b>states</b> with regard to Nebuchadnezzar: <b>“Hew down the tree and destroy it; yet leave the stump of its roots in the earth”</b> (Daniel 4:20). If that is the case with regard to Nebuchadnezzar, all the more so it is the case with regard to the wicked people of Israel. <b>But how do I realize</b> the meaning of the phrase: <b>“So that it will leave them neither root nor branch”? </b> It means that God <b>will not leave for</b> the wicked <b>a mitzva nor the remnants of a mitzva</b> for which they will be rewarded. R' Akiva dug deep to find a way into the World-to-Come for these children. <b>Alternatively, “root”; this</b> is referring to the <b>soul. “Nor branch”; this</b> is referring to <b>the body. </b>"
        },
        {
          "verseLocation": "Daniel 4:24",
          "verseText": "“Therefore, O king, let my counsel be acceptable to you, and break off your sins by charity, and your iniquities by showing mercy to the poor; that there may be an extension of your serenity”",
          "talmudLocation": "Bava Batra 10b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/10b#section-9",
          "talmudFullText": "<b>R' Yehoshua answered</b> Rabban Yoḥanan ben Zakkai’s challenge to interpret the verse <b>and said: “Righteousness exalts a nation”; these are</b> the people of <b>Israel, as it is written: “And who is like your people Israel, one nation</b> on the earth. ” <b>“But the kindness of the peoples is sin”</b> means that <b>all the</b> acts of <b>charity and kindness that the nations of the world perform is</b> counted as <b>a sin for them, since they perform them only to perpetuate their dominion, as it is stated</b> by Daniel to Nebuchadnezzar: <b>“Therefore, O king, let my counsel be acceptable to you, and break off your sins by charity, and your iniquities by showing mercy to the poor; that there may be an extension of your serenity”</b> (Daniel 4:24). Since this is the argument that persuaded Nebuchadnezzar, it would appear that his actual motive was his own benefit."
        },
        {
          "verseLocation": "Daniel 4:24",
          "verseText": "it is stated: “Therefore, O king, let my counsel be acceptable to you, redeem your sins with charity and your iniquities with graciousness to the poor, that there may be a lengthening of your prosperity”",
          "talmudLocation": "Bava Batra 4a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/4a#section-7",
          "talmudFullText": "The Talmud asks: <b>And how did Bava ben Buta do this, </b> i.e., give advice to Herod the wicked? <b>But doesn’t Rav Yehuda say</b> that <b>Rav says, and some say</b> it was <b>R' Yehoshua ben Levi</b> who says: <b>For what</b> reason <b>was Daniel punished? Because he offered advice to Nebuchadnezzar, as</b> after sharing a harsh prophecy with him, <b>it is stated: “Therefore, O king, let my counsel be acceptable to you, redeem your sins with charity and your iniquities with graciousness to the poor, that there may be a lengthening of your prosperity”</b> (Daniel 4:24). <b>And it is written: “All this came upon King Nebuchadnezzar”</b> (Daniel 4:25). <b>And it is written: “And at the end of twelve months”</b> (Daniel 4:26). Only after a year was the prophecy fulfilled but not before that, apparently because Nebuchadnezzar heeded Daniel’s advice."
        },
        {
          "verseLocation": "Daniel 4:24",
          "verseText": "and then there shall be an extension to your tranquility”",
          "talmudLocation": "Sotah 21a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/21a#section-1",
          "talmudFullText": "<b>and then there shall be an extension to your tranquility”</b> (Daniel 4:24). <b>And it is written: “All this came upon King Nebuchadnezzar”</b> (Daniel 4:25), <b>and it is written</b> in the following verse that this occurred: <b>“At the end of twelve months”</b> (Daniel 4:26). None of the opinions in the <i>baraita</i> are in accordance with the Mishnah’s statement that merit can delay punishment for up to three years."
        },
        {
          "verseLocation": "Daniel 4:25",
          "verseText": "And it is written: “All this came upon King Nebuchadnezzar”",
          "talmudLocation": "Bava Batra 4a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/4a#section-7",
          "talmudFullText": "The Talmud asks: <b>And how did Bava ben Buta do this, </b> i.e., give advice to Herod the wicked? <b>But doesn’t Rav Yehuda say</b> that <b>Rav says, and some say</b> it was <b>R' Yehoshua ben Levi</b> who says: <b>For what</b> reason <b>was Daniel punished? Because he offered advice to Nebuchadnezzar, as</b> after sharing a harsh prophecy with him, <b>it is stated: “Therefore, O king, let my counsel be acceptable to you, redeem your sins with charity and your iniquities with graciousness to the poor, that there may be a lengthening of your prosperity”</b> (Daniel 4:24). <b>And it is written: “All this came upon King Nebuchadnezzar”</b> (Daniel 4:25). <b>And it is written: “And at the end of twelve months”</b> (Daniel 4:26). Only after a year was the prophecy fulfilled but not before that, apparently because Nebuchadnezzar heeded Daniel’s advice."
        },
        {
          "verseLocation": "Daniel 4:25",
          "verseText": "And it is written: “All this came upon King Nebuchadnezzar”",
          "talmudLocation": "Sotah 21a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/21a#section-1",
          "talmudFullText": "<b>and then there shall be an extension to your tranquility”</b> (Daniel 4:24). <b>And it is written: “All this came upon King Nebuchadnezzar”</b> (Daniel 4:25), <b>and it is written</b> in the following verse that this occurred: <b>“At the end of twelve months”</b> (Daniel 4:26). None of the opinions in the <i>baraita</i> are in accordance with the Mishnah’s statement that merit can delay punishment for up to three years."
        },
        {
          "verseLocation": "Daniel 4:26",
          "verseText": "And it is written: “And at the end of twelve months”",
          "talmudLocation": "Bava Batra 4a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/4a#section-7",
          "talmudFullText": "The Talmud asks: <b>And how did Bava ben Buta do this, </b> i.e., give advice to Herod the wicked? <b>But doesn’t Rav Yehuda say</b> that <b>Rav says, and some say</b> it was <b>R' Yehoshua ben Levi</b> who says: <b>For what</b> reason <b>was Daniel punished? Because he offered advice to Nebuchadnezzar, as</b> after sharing a harsh prophecy with him, <b>it is stated: “Therefore, O king, let my counsel be acceptable to you, redeem your sins with charity and your iniquities with graciousness to the poor, that there may be a lengthening of your prosperity”</b> (Daniel 4:24). <b>And it is written: “All this came upon King Nebuchadnezzar”</b> (Daniel 4:25). <b>And it is written: “And at the end of twelve months”</b> (Daniel 4:26). Only after a year was the prophecy fulfilled but not before that, apparently because Nebuchadnezzar heeded Daniel’s advice."
        },
        {
          "verseLocation": "Daniel 4:26",
          "verseText": "“At the end of twelve months”",
          "talmudLocation": "Sotah 21a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/21a#section-1",
          "talmudFullText": "<b>and then there shall be an extension to your tranquility”</b> (Daniel 4:24). <b>And it is written: “All this came upon King Nebuchadnezzar”</b> (Daniel 4:25), <b>and it is written</b> in the following verse that this occurred: <b>“At the end of twelve months”</b> (Daniel 4:26). None of the opinions in the <i>baraita</i> are in accordance with the Mishnah’s statement that merit can delay punishment for up to three years."
        },
        {
          "verseLocation": "Daniel 4:30",
          "verseText": "to hair, as it is written: “Until his hair was grown like eagles’ feathers, and his nails like birds’ claws”",
          "talmudLocation": "Nazir 3a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/3a#section-11",
          "talmudFullText": "§ The Mishnah taught that if one says: An obligation <b>is hereby</b> incumbent <b>upon me</b> with regard to <b>birds, R' Meir says: He is a nazirite, </b> and the rabbis say: He is not a nazirite. The Talmud asks: <b>What is the reason</b> for the opinion <b>of R' Meir? Reish Lakish said: He accepted upon himself</b> an obligation with regard to the <b>birds</b> that are <b>juxtaposed</b> in a verse <b>to hair, as it is written: “Until his hair was grown like eagles’ feathers, and his nails like birds’ claws”</b> (Daniel 4:30). Since the verse juxtaposes birds with growing hair, it is understood that when this individual accepted an obligation with regard to birds, he was referring to growing his hair as a nazirite."
        },
        {
          "verseLocation": "Daniel 4:32",
          "verseText": "Nebuchadnezzar said: “And all the inhabitants of the world are considered like la ”",
          "talmudLocation": "Yoma 20b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/20b#section-10",
          "talmudFullText": "<b>As R' Levi said: Why is a person’s voice not heard during the day in the manner that it is during the night? </b> It is <b>due to</b> the fact that the sound of the <b>sphere of the sun traversing the sky</b> generates noise <b>like</b> the noise generated by <b>a carpenter sawing cedars, </b> and that noise drowns out other sounds. <b>And that sawdust</b> that is visible during <b>the day</b> in the rays of the sun, <b><i>la</i> is its name. This is</b> what <b>Nebuchadnezzar said: “And all the inhabitants of the world are considered like <i>la</i>”</b> (Daniel 4:32), i.e., all inhabitants of the earth are equivalent to specks of dust."
        },
        {
          "verseLocation": "Daniel 4:33",
          "verseText": "“And surpassing greatness was added unto me”",
          "talmudLocation": "Shabbat 150a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/150a#section-2",
          "talmudFullText": "The Talmud cites another verse pertaining to Nebuchadnezzar: <b>“And surpassing greatness was added unto me”</b> (Daniel 4:33), about which <b>Rav Yehuda said</b> that <b>Rav Yirmeya bar Abba said: This teaches that</b> Nebuchadnezzar <b>rode atop a male lion and tied a serpent to its head, fulfilling what was said</b> of him: <b>“And the beasts of the field I have also given him to serve him”</b> (Jeremiah 27:6)."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Daniel 5:8",
          "verseText": "“Then came in all the king’s wise men. But they could not read the writing, nor make known to the king the interpretation”",
          "talmudLocation": "Sanhedrin 22a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-1",
          "talmudFullText": "<b>“And the writing of the letter [<i>hannishtevan</i>] was written in the Aramaic script, and set forth in the Aramaic tongue”</b> (Ezra 4:7). The term “<i>hannishtevan</i>” is similar to the word <i>nishtana</i>, meaning changed, alluding to the fact that the script had been changed. <b>And it is written</b> with regard to the writing on the wall of Belshazzar’s palace: <b>“Then came in all the king’s wise men. But they could not read the writing, nor make known to the king the interpretation”</b> (Daniel 5:8), and the reason they could not read it is that it was written in the new script that Ezra would transmit. <b>And it is written: “That he shall write for himself a second [<i>mishne</i>] Torah”</b> (Deuteronomy 17:18), where “second [<i>mishne</i>]” teaches that it is written in <b>a script that is apt to be changed [<i>lehishtannot</i>]. </b>"
        },
        {
          "verseLocation": "Daniel 5:8",
          "verseText": "“they could not read the writing”",
          "talmudLocation": "Sanhedrin 22a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-8",
          "talmudFullText": "The Talmud asks: <b>According to R' Shimon, who says</b> that <b>this script was not changed</b> at all, <b>what</b> is the reason <b>“they could not read the writing”</b> (Daniel 5:8)? <b>Rav says: </b> Because <b>it was written for them in</b> the obscure code of <b><i>gimatriyya</i>. </b> It was written: <b><i>Yod</i>, <i>tet</i>, <i>tav</i>; <i>yod</i>, <i>tet</i>, <i>tav</i>; <i>alef</i>, <i>yod</i>, <i>dalet</i>, <i>khaf</i>; <i>peh</i>, <i>vav</i>, <i>gimmel</i>, <i>ḥet</i>, <i>mem</i>, <i>tet</i>. </b> These letters correspond with: <i>Mem</i>, <i>nun</i>, <i>alef</i>; <i>mem</i>, <i>nun</i>, <i>alef</i>; <i>tav</i>, <i>kuf</i>, <i>lamed</i>; <i>vav</i>, <i>peh</i>, <i>reish</i>, <i>samekh</i>, <i>yod</i>, <i>nun</i>; this is based on the exchange of letters known as <i>at bash</i>, or the exchanging of a letter with its counterpart in the opposite place in the alphabet, e.g., <i>alef</i>, the first letter, for <i>tav</i>, the last letter."
        },
        {
          "verseLocation": "Daniel 5:23",
          "verseText": "“But you have lifted yourself up against the Lord of heaven; and they have brought the vessels of His House before you”",
          "talmudLocation": "Megillah 11b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-11",
          "talmudFullText": "<b>This is that</b> which <b>Daniel said to him</b> with regard to his impending punishment for using the Temple’s vessels: <b>“But you have lifted yourself up against YHWH of heaven; and they have brought the vessels of His House before you”</b> (Daniel 5:23). <b>And it is written</b> further in the chapter: <b>“In that night Belshazzar, the king of the Chaldeans, was slain”</b> (Daniel 5:30). This was the description of Belshazzar’s mistaken calculation. <b>And it states</b> after the fall of Belshazzar: <b>“And Darius the Mede received the kingdom, being about sixty-two years old”</b> (Daniel 6:1)."
        },
        {
          "verseLocation": "Daniel 5:23",
          "verseText": "“But you have lifted up yourself against the Lord of heaven; and they have brought the vessels of His house before you, and you, and your lords, your consorts [ shegal ] and your concubines, have drunk wine in them”",
          "talmudLocation": "Rosh Hashanah 4a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/4a#section-7",
          "talmudFullText": "The Talmud raises a difficulty: <b>However, if</b> that is <b>so, </b> there is a contradiction from <b>that which is written</b> about Belshazzar: <b>“But you have lifted up yourself against YHWH of heaven; and they have brought the vessels of His house before you, and you, and your lords, your consorts [<i>shegal</i>] and your concubines, have drunk wine in them”</b> (Daniel 5:23). <b>If <i>shegal</i></b> means <b>a she-dog, does a she-dog drink wine? </b> The Talmud explains: <b>This</b> is <b>not difficult, as</b> perhaps <b>they trained it to drink</b> wine."
        },
        {
          "verseLocation": "Daniel 5:25",
          "verseText": "“ Mene mene tekel ufarsin ”",
          "talmudLocation": "Sanhedrin 22a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-9",
          "talmudFullText": "<b>What did</b> Daniel <b>explain to them? </b> The letters stand for the terms: <b>“<i>Mene mene tekel ufarsin</i>”</b> (Daniel 5:25). He then explained the meaning: <b>“<i>Mene</i>”: God has numbered [<i>mena</i>]</b> the days of <b>your kingdom and brought it to an end. “<i>Tekel</i>”: You are weighed [<i>tekilta</i>] on the scale and are found lacking. “<i>Parsin</i>”: Your kingdom is divided [<i>perisat</i>] and given to the Medes and Persians”</b> (Daniel 5:26–28)."
        },
        {
          "verseLocation": "Daniel 5:30",
          "verseText": "“In that night Belshazzar, the king of the Chaldeans, was slain”",
          "talmudLocation": "Megillah 11b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-11",
          "talmudFullText": "<b>This is that</b> which <b>Daniel said to him</b> with regard to his impending punishment for using the Temple’s vessels: <b>“But you have lifted yourself up against YHWH of heaven; and they have brought the vessels of His House before you”</b> (Daniel 5:23). <b>And it is written</b> further in the chapter: <b>“In that night Belshazzar, the king of the Chaldeans, was slain”</b> (Daniel 5:30). This was the description of Belshazzar’s mistaken calculation. <b>And it states</b> after the fall of Belshazzar: <b>“And Darius the Mede received the kingdom, being about sixty-two years old”</b> (Daniel 6:1)."
        },
        {
          "verseLocation": "Daniel 5:30",
          "verseText": "was killed”",
          "talmudLocation": "Nedarim 62a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/62a#section-5",
          "talmudFullText": "<b>And</b> with regard to this statement, <b>Rabba bar bar Ḥana said</b> that <b>R' Yoḥanan said: Whoever makes use of the crown of Torah is uprooted from the world. </b> This can be derived by means of <b>an <i>a fortiori</i></b> inference: <b>If Belshazzar, who made use of the sacred</b> Temple <b>vessels, which had</b> already <b>become non-sacred vessels</b> by that time, as after their forcible removal from the Temple the vessels lost their sanctity, <b>as it is stated</b> in the verse: <b>“And robbers shall enter into it, and profane it”</b> (Ezekiel 7:22), showing that <b>once</b> the Temple vessels <b>have been robbed they become non-sacred, was uprooted from the world</b> for his actions, <b>as it is written: “On that night Belshazzar</b> the Chaldean king <b>was killed”</b> (Daniel 5:30); <b>one who makes use of the crown of Torah, which lives and endures forever</b> and whose sanctity cannot be removed, <b>all the more so</b> shall he be uprooted."
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "Daniel 6:1",
          "verseText": "“And Darius the Mede received the kingdom, being about sixty-two years old”",
          "talmudLocation": "Megillah 11b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-11",
          "talmudFullText": "<b>This is that</b> which <b>Daniel said to him</b> with regard to his impending punishment for using the Temple’s vessels: <b>“But you have lifted yourself up against YHWH of heaven; and they have brought the vessels of His House before you”</b> (Daniel 5:23). <b>And it is written</b> further in the chapter: <b>“In that night Belshazzar, the king of the Chaldeans, was slain”</b> (Daniel 5:30). This was the description of Belshazzar’s mistaken calculation. <b>And it states</b> after the fall of Belshazzar: <b>“And Darius the Mede received the kingdom, being about sixty-two years old”</b> (Daniel 6:1)."
        },
        {
          "verseLocation": "Daniel 6:2",
          "verseText": "over which he did not rule, as it is written: “It pleased Darius to set over the kingdom a hundred and twenty satraps”",
          "talmudLocation": "Megillah 11b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-4",
          "talmudFullText": "The Talmud continues to ask: <b>But there is Darius, as it is stated: “Then King Darius wrote to all the peoples, nations, and languages that dwell in all the earth: Peace be multiplied to you”</b> (Daniel 6:26). The Talmud answers: <b>There are the seven</b> provinces <b>over which he did not rule, as it is written: “It pleased Darius to set over the kingdom a hundred and twenty satraps”</b> (Daniel 6:2). It is apparent from here that Darius did not rule over the entire world, for his son Ahasuerus ruled over a hundred and twenty-seven provinces, an additional seven."
        },
        {
          "verseLocation": "Daniel 6:4",
          "verseText": "one who knows about another that he is greater than him, even in one matter, that he must treat him with respect? As it is stated: “Because a surpassing spirit was in him, the king thought to set him over the whole realm”",
          "talmudLocation": "Pesachim 113b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/113b#section-16",
          "talmudFullText": "<b>And from where</b> is it derived concerning <b>one who knows about another that he is greater than him, even in one matter, that he must treat him with respect? As it is stated: “Because a surpassing spirit was in him, the king thought to set him over the whole realm”</b> (Daniel 6:4). This verse teaches that one who is in any way greater than another person is worthy of his respect."
        },
        {
          "verseLocation": "Daniel 6:11",
          "verseText": "there were open windows",
          "talmudLocation": "Berakhot 31a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/31a#section-19",
          "talmudFullText": "Many <i>halakhot</i> are derived from evoking the prayers of biblical characters. <b>R' Ḥiyya bar Abba said: One should always pray in a house with windows, as it is stated</b> regarding Daniel: “And when Daniel knew that the writing was signed, he went to his house. In his attic <b>there were open windows</b> facing Jerusalem, and three times a day he knelt upon his knees and prayed and gave thanks before his God, just as he had done before” (Daniel 6:11)."
        },
        {
          "verseLocation": "Daniel 6:11",
          "verseText": "there were open windows",
          "talmudLocation": "Berakhot 34b:29",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/34b#section-29",
          "talmudFullText": "<b>And</b> on the topic of prayer, <b>R' Ḥiyya bar Abba said</b> that <b>R' Yoḥanan said: One may only pray in a house with windows, </b> as then he can see the heavens and focus his heart, <b>as it is stated</b> with regard to Daniel’s prayer: “In his attic <b>there were open windows</b> facing Jerusalem” (Daniel 6:11)."
        },
        {
          "verseLocation": "Daniel 6:18",
          "verseText": "as it is written: “And a stone was brought and placed [ vesumat ] upon the mouth of the den;",
          "talmudLocation": "Niddah 69b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/69b#section-13",
          "talmudFullText": "The Talmud notes that the word <i>mesama</i> is based on a verse, <b>as it is written: “And a stone was brought and placed [<i>vesumat</i>] upon the mouth of the den; </b> and the king sealed it with his own signet and with the signet of his lords, that nothing might be changed concerning Daniel” (Daniel 6:18). Accordingly, the Mishnah is teaching that although a corpse does not normally impart ritual impurity to vessels under a heavy stone, these specific types of corpses do transmit impurity in this manner."
        },
        {
          "verseLocation": "Daniel 6:26",
          "verseText": "But there is Darius, as it is stated: “Then King Darius wrote to all the peoples, nations, and languages that dwell in all the earth: Peace be multiplied to you”",
          "talmudLocation": "Megillah 11b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-4",
          "talmudFullText": "The Talmud continues to ask: <b>But there is Darius, as it is stated: “Then King Darius wrote to all the peoples, nations, and languages that dwell in all the earth: Peace be multiplied to you”</b> (Daniel 6:26). The Talmud answers: <b>There are the seven</b> provinces <b>over which he did not rule, as it is written: “It pleased Darius to set over the kingdom a hundred and twenty satraps”</b> (Daniel 6:2). It is apparent from here that Darius did not rule over the entire world, for his son Ahasuerus ruled over a hundred and twenty-seven provinces, an additional seven."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Daniel 7:5",
          "verseText": "“And behold another beast, a second, like a bear”",
          "talmudLocation": "Avodah Zarah 2b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/2b#section-7",
          "talmudFullText": "<b>The Roman Empire leaves, and the Persian Empire enters after it. What is the reason</b> that the Persian Empire enters second? The reason is <b>that after</b> the Roman Empire it is the next most <b>important. And from where do we</b> derive this? <b>As it is written</b> in Daniel’s vision: <b>“And behold another beast, a second, like a bear”</b> (Daniel 7:5). <b>And Rav Yosef teaches: These are the Persians, </b> who are compared to a bear, <b>as they eat and drink</b> copious amounts <b>as</b> does <b>a bear, and they are fleshy like a bear, and they grow</b> their <b>hair</b> long <b>as</b> does <b>a bear, and they never rest, like a bear, </b> which is constantly on the move from one place to another."
        },
        {
          "verseLocation": "Daniel 7:5",
          "verseText": "“And it had three ribs in its mouth between its teeth”",
          "talmudLocation": "Kiddushin 72a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/72a#section-8",
          "talmudFullText": "In connection to the aforementioned places, the Talmud analyzes the following verse, describing a vision of a bear-like animal: <b>“And it had three ribs in its mouth between its teeth”</b> (Daniel 7:5). <b>R' Yoḥanan says: This is Ḥillazon, Hadyav, and Netzivin, which</b> the Persian government <b>sometimes swallows and sometimes discharges. </b> In other words, control over these places passed from the Persians to the Romans and back again several times."
        },
        {
          "verseLocation": "Daniel 7:5",
          "verseText": "“And behold a second beast, similar to a bear”",
          "talmudLocation": "Kiddushin 72a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/72a#section-9",
          "talmudFullText": "The first part of that verse stated: <b>“And behold a second beast, similar to a bear”</b> (Daniel 7:5). <b>Rav Yosef taught: These are Persians, who eat and drink</b> copious amounts <b>like a bear, and are corpulent like a bear, and grow hair like a bear, and have no rest like a bear, </b> which is constantly on the move from one place to another. <b>When R' Ami saw a Persian riding, he would say: This is a bear on the move. </b>"
        },
        {
          "verseLocation": "Daniel 7:5",
          "verseText": "“A hungry bear”; this is Ahasuerus, as it is written about him: “And behold, another beast, a second one, like a bear”",
          "talmudLocation": "Megillah 11a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-4",
          "talmudFullText": "<b>Reish Lakish introduced this passage with an introduction from here: “As a roaring lion, and a ravenous bear, so is a wicked ruler over a poor people”</b> (Proverbs 28:15). <b>“A roaring lion”; this is the wicked Nebuchadnezzar, as it is written about him: “The lion has come up from his thicket”</b> (Jeremiah 4:7). <b>“A hungry bear”; this is Ahasuerus, as it is written about him: “And behold, another beast, a second one, like a bear”</b> (Daniel 7:5). <b>And Rav Yosef taught</b> that <b>these</b> who are referred to as a bear in the verse <b>are the Persians. </b> They are compared to a bear, <b>as they eat and drink</b> in large quantities <b>like a bear; and they are coated with flesh like a bear; and they grow their hair</b> long <b>like a bear; and they never rest like a bear, </b> whose manner it is to move about from place to place."
        },
        {
          "verseLocation": "Daniel 7:9",
          "verseText": "wool”",
          "talmudLocation": "Chagigah 14a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/14a#section-4",
          "talmudFullText": "§ The Talmud continues to reconcile verses that seem to contradict each other: <b>One verse states: “His raiment was as white snow, and the hair of his head like pure</b> white <b>wool”</b> (Daniel 7:9), <b>and it is written: “His locks are curled, black as a raven”</b> (Song of Songs 5:11). The Talmud answers: This is <b>not difficult. Here</b> the verse in Daniel is referring to when He is <b>in the</b> heavenly <b>academy, </b> while <b>there</b> the verse in Song of Songs speaks of when He is <b>at war, for the Master said: There is no finer</b> individual to study Torah <b>in an academy than an old man, and there is no finer</b> individual to wage war <b>than a youth. </b> A different metaphor is therefore used to describe God on each occasion."
        },
        {
          "verseLocation": "Daniel 7:9",
          "verseText": "One verse states: “His throne was fiery flames”",
          "talmudLocation": "Chagigah 14a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/14a#section-5",
          "talmudFullText": "The Talmud poses another question: <b>One verse states: “His throne was fiery flames”</b> (Daniel 7:9), <b>and</b> another phrase in the same <b>verse states: “Till thrones were placed, and one who was ancient of days sat, ”</b> implying the existence of two thrones. The Talmud answers: This is <b>not difficult. One</b> throne is <b>for Him and one</b> is <b>for David, as it is taught</b> in a <i>baraita</i> with regard to this issue: <b>One</b> throne <b>for Him and one for David; </b> this is <b>the statement of R' Akiva. R' Yosei HaGelili said to him: Akiva, how long shall you make the Shekhina profane, </b> by presenting it as though one could sit next to Him? <b>Rather, </b> the two thrones are designated for different purposes: <b>One for judgment and one for righteousness. </b>"
        },
        {
          "verseLocation": "Daniel 7:9",
          "verseText": "till thrones were placed, and one that was ancient of days did sit”",
          "talmudLocation": "Sanhedrin 38b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/38b#section-15",
          "talmudFullText": "R' Yoḥanan cites several examples where the counterclaim is in the same verse as the claim of the heretics. The verse states: <b>“For what nation is there so great that has God so near to them as YHWH our God is whenever we call upon Him? ”</b> (Deuteronomy 4:7), where the term “near” is written in plural, <i>kerovim</i>, but the term “upon Him” is written in singular. Another verse states: <b>“And who is like Your people, like Israel, a nation one in the earth, whom God went to redeem unto Himself for a people? ”</b> (II Samuel 7:23), where the term “went” is written in plural, <i>halekhu</i>, but the term “Himself” is written in singular. Another verse states: “I beheld <b>till thrones were placed, and one that was ancient of days did sit”</b> (Daniel 7:9); where the term “thrones” is written in plural, <i>kharsavan</i>, but the term “sit” is written in singular."
        },
        {
          "verseLocation": "Daniel 7:10",
          "verseText": "One verse states: “A thousand thousands ministered to Him, and ten thousand times ten thousand stood before him”",
          "talmudLocation": "Chagigah 13b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/13b#section-12",
          "talmudFullText": "§ The Talmud continues to address apparent contradictions between verses concerning similar matters: <b>One verse states: “A thousand thousands ministered to Him, and ten thousand times ten thousand stood before him”</b> (Daniel 7:10), <b>and another verse states: “Is there a number to His troops? ”</b> (Job 25:3), implying that they are even more numerous than “ten thousand times ten thousand. ” The Talmud answers: This is <b>not difficult, </b> for <b>here, </b> when they are without number, the verse is referring <b>to the time when the Temple is standing; there, </b> the other verse is referring <b>to the time when the Temple is not standing, </b> for <b>it is as though the heavenly entourage [<i>pamalya</i>] were diminished. </b>"
        },
        {
          "verseLocation": "Daniel 7:10",
          "verseText": "to the River Dinur, as it is stated: “A fiery [ dinur ] river issued and came forth from before him; a thousand thousands ministered to it, and a myriad myriads stand before it”",
          "talmudLocation": "Chagigah 13b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/13b#section-13",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i>: <b>R'</b> Yehuda HaNasi <b>says in the name of Abba Yosei ben Dosai: “A thousand thousands ministered to Him”</b> is referring to the <b>number</b> of angels in <b>a single troop, </b> but with regard to the number of his troops, it can be said: <b>“And to his troops, there is no number”. And R' Yirmeya bar Abba said: </b> There is no contradiction, since with regard to the phrase <b>“a thousand thousands ministered to Him, ”</b> the pronoun “Him” can be literally translated as: It, referring not to those who serve God Himself, but to those who administer <b>to the River Dinur, as it is stated: “A fiery [<i>dinur</i>] river issued and came forth from before him; a thousand thousands ministered to it, and a myriad myriads stand before it”</b> (Daniel 7:10). The ministers of God, however, are indeed too numerous to count."
        },
        {
          "verseLocation": "Daniel 7:23",
          "verseText": "“And it shall devour the whole earth, and shall tread it down, and break it in pieces”",
          "talmudLocation": "Avodah Zarah 2b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/2b#section-2",
          "talmudFullText": "<b>Immediately, the Roman Empire enters first before Him. </b> The Talmud asks: <b>What is the reason</b> that the Roman Empire enters first? It is <b>because</b> the Roman Empire is the most <b>important</b> of all of the nations. <b>And from where do we</b> derive <b>that it is</b> the most <b>important? As it is written</b> in the book of Daniel with regard to the 4th empire that will rule over the world: <b>“And it shall devour the whole earth, and shall tread it down, and break it in pieces”</b> (Daniel 7:23), and <b>R' Yoḥanan says: This</b> empire that will devour the earth is <b>the wicked Roman</b> Empire, <b>whose name spread throughout the world. </b>"
        },
        {
          "verseLocation": "Daniel 7:23",
          "verseText": "“It shall devour the whole earth and tread upon it and break it into pieces”",
          "talmudLocation": "Shevuot 6b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/6b#section-13",
          "talmudFullText": "<b>Rav Pappa said to Rava: Which of them is greater, </b> King Shapur or the Roman emperor? Rava <b>said to him: Does he eat in the forest, </b> i.e., do you live disconnected and unaware of events in the world at large? <b>Go out</b> and <b>see whose coin circulates throughout the world, </b> which is an indicator of a government’s influence, <b>as it is written</b> with regard to the 4th empire described in Daniel’s dream of the future powers of the world: <b>“It shall devour the whole earth and tread upon it and break it into pieces”</b> (Daniel 7:23), and <b>R' Yoḥanan says: This is the guilty</b> empire of <b>Rome whose coin circulates throughout the entire world. </b>"
        },
        {
          "verseLocation": "Daniel 7:25",
          "verseText": "“For a period and periods and a half period”",
          "talmudLocation": "Sanhedrin 97b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/97b#section-5",
          "talmudFullText": "The Messiah will come <b>not in accordance with</b> the opinion of <b>our Rabbis, who would interpret</b> the verse: <b>“For a period and periods and a half period”</b> (Daniel 7:25), to mean that the duration of the ultimate exile will be three and a half times the duration of the period of the exile in Egypt."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "Daniel 8:20",
          "verseText": "as it is written: “The ram that you saw sporting two horns are the kings of Media and Persia”",
          "talmudLocation": "Yoma 10a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/10a#section-8",
          "talmudFullText": "<b>Rabba bar Ulla strongly objected to this. </b> From <b>where</b> may it be <b>inferred that this</b> phrase: <b>Youngest of the flock, is Persia? </b> It is <b>as it is written: “The ram that you saw sporting two horns are the kings of Media and Persia”</b> (Daniel 8:20), and the ram is a member of the flock mentioned in the verse. Still, how is that proof? <b>And say</b> that youngest of the flock refers to <b>Greece, </b> who will overthrow Rome, <b>as it is written: “The goat is the king of Greece”</b> (Daniel 8:21). The goat, too, could be characterized as a member of the flock."
        },
        {
          "verseLocation": "Daniel 8:21",
          "verseText": "as it is written: “The goat is the king of Greece”",
          "talmudLocation": "Yoma 10a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/10a#section-8",
          "talmudFullText": "<b>Rabba bar Ulla strongly objected to this. </b> From <b>where</b> may it be <b>inferred that this</b> phrase: <b>Youngest of the flock, is Persia? </b> It is <b>as it is written: “The ram that you saw sporting two horns are the kings of Media and Persia”</b> (Daniel 8:20), and the ram is a member of the flock mentioned in the verse. Still, how is that proof? <b>And say</b> that youngest of the flock refers to <b>Greece, </b> who will overthrow Rome, <b>as it is written: “The goat is the king of Greece”</b> (Daniel 8:21). The goat, too, could be characterized as a member of the flock."
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "Daniel 9:2",
          "verseText": "that He would accomplish for the desolations of Jerusalem seventy years”",
          "talmudLocation": "Megillah 11b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-7",
          "talmudFullText": "The Talmud explains: <b>What is</b> this calculation? <b>As it is written</b> with regard to Jeremiah’s prophecy of a return to Eretz Yisrael: <b>“After seventy years are accomplished for Babylonia I will remember you</b> and perform My good word toward you, enabling you to return to this place” (Jeremiah 29:10), <b>and</b> elsewhere <b>it is written</b> in a slightly different formulation: “In the first year of his reign, I, Daniel, meditated in the books, over the number of the years, which the word of YHWH came to Jeremiah the prophet, <b>that He would accomplish for the desolations of Jerusalem seventy years”</b> (Daniel 9:2). <b>He, </b> Belshazzar, <b>calculated</b> as follows: <b>Forty-five</b> years <b>of Nebuchadnezzar, and twenty-three of Evil-merodach, and two of his</b> own, for a total of <b>seventy</b> years that had passed without redemption. He was therefore certain that Jeremiah’s prophecy would no longer be fulfilled, and he therefore said: <b>I will take out the vessels of the Holy Temple and use them. </b>"
        },
        {
          "verseLocation": "Daniel 9:2",
          "verseText": "Rava said: Daniel also erred in this calculation, as it is written: “In the first year of his reign, I, Daniel, meditated in the books",
          "talmudLocation": "Megillah 12a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-2",
          "talmudFullText": "<b>Rava said: Daniel also erred in this calculation, as it is written: “In the first year of his reign, I, Daniel, meditated in the books</b> over the number of the years, whereof the word of YHWH came to Jeremiah the prophet, that He would accomplish for the desolations of Jerusalem seventy years” (Daniel 9:2). <b>From</b> the fact <b>that he said “I meditated, ”</b> a term indicating recounting and calculating, <b>it can be inferred that he had</b> previously <b>erred. </b>"
        },
        {
          "verseLocation": "Daniel 9:2",
          "verseText": "for the desolations of Jerusalem",
          "talmudLocation": "Megillah 12a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-3",
          "talmudFullText": "The Talmud comments: <b>In any case, the verses contradict each other</b> with regard to how the seventy years should be calculated. In one verse <b>it is written: </b> “After seventy years <b>are accomplished for Babylonia</b> I will remember [<i>efkod</i>] you, and perform My good word toward you, in causing you to return to this place” (Jeremiah 29:10), which indicates that the seventy years should be counted from the Babylonian exile. <b>And</b> in another verse <b>it is written: </b> “That he would accomplish <b>for the desolations of Jerusalem</b> seventy years” (Daniel 9:2), indicating that the seventy years are calculated from the destruction of Jerusalem."
        },
        {
          "verseLocation": "Daniel 9:4",
          "verseText": "he did not say mighty",
          "talmudLocation": "Yoma 69b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/69b#section-14",
          "talmudFullText": "The Talmud comments: <b>This</b> interpretation that <b>Rav Mattana</b> said <b>leans to, </b> i.e., is consonant with, the exposition <b>of R' Yehoshua ben Levi. As R' Yehoshua ben Levi said: Why are</b> the rabbis of those generations <b>called the members of the Great Assembly? </b> It is <b>because they returned the crown</b> of God, <b>to its former</b> glory. How so? <b>Moses came</b> and <b>said</b> in his prayer: <b>“The great, the mighty, and the awesomeGod”</b> (Deuteronomy 10:17). <b>Jeremiah</b> the prophet <b>came and said: non-Jews, </b> i.e., the minions of Nebuchadnezzar, <b>are carousing in His sanctuary; where is His awesomeness? </b> Therefore, <b>he did not say awesome</b> in his prayer: “The great God, the mighty Lord of Hosts, is His name” (Jeremiah 32:18). <b>Daniel came</b> and <b>said: non-Jews are enslaving His children; where is His might? </b> Therefore <b>he did not say mighty</b> in his prayer: “The great and awesome God” (Daniel 9:4)."
        },
        {
          "verseLocation": "Daniel 9:5",
          "verseText": "And likewise, with regard to Daniel it says: “We have sinned, and we have done wrong, and we have done evil, and we have rebelled”",
          "talmudLocation": "Yoma 36b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/36b#section-7",
          "talmudFullText": "<b>Rather, this is</b> the manner in which <b>he confesses: I have sinned, I have done wrong, and I have rebelled before You, I and my household. And likewise, with regard to David it says</b> in this sequence: <b>“We have sinned along with our forefathers, we have done wrong, we have performed evil”</b> (Psalms 106:6). <b>And likewise, with regard to Solomon it says: “We have sinned, and we have done wrong, we have done evil”</b> (I Kings 8:47). <b>And likewise, with regard to Daniel it says: “We have sinned, and we have done wrong, and we have done evil, and we have rebelled”</b> (Daniel 9:5). <b>However, </b> according to this interpretation, <b>what is</b> the rationale for the sequence of that <b>which Moses said: Forgiving wrongdoing and rebellion and sin, </b> where sin appears last? <b>Moses said before God: God!, when the Jewish people sin before you and repent, render their intentional sins like unwitting ones, </b> forgive wrongdoing and rebellion as if they were sin."
        },
        {
          "verseLocation": "Daniel 9:7",
          "verseText": "began and said: “Lord, righteousness is Yours, but we are shamefaced, as of this day”",
          "talmudLocation": "Sanhedrin 93a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93a#section-2",
          "talmudFullText": "§ <b>R' Tanḥum bar Ḥanilai says: At the moment that Hananiah, Mishael, and Azariah emerged from the fiery furnace, all the nations of the world came and struck the enemies of Israel, </b> a euphemism for the Jewish people, <b>in the face</b> and <b>said to them: You have a God</b> with capabilities <b>like that and you bow to the graven image? Immediately</b> Hananiah, Mishael, and Azariah <b>began and said: “Lord, righteousness is Yours, but we are shamefaced, as of this day”</b> (Daniel 9:7)."
        },
        {
          "verseLocation": "Daniel 9:14",
          "verseText": "which is written: “And so the Lord has watched over the evil, and brought it upon us; for the Lord our God is righteous [ tzaddik ]”",
          "talmudLocation": "Gittin 88a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/88a#section-20",
          "talmudFullText": "<b>Rav Ḥisda said</b> that <b>Mar Ukva said, and some say</b> that it was <b>Rav Ḥisda</b> who <b>said</b> that <b>R' Yirmeya said, </b> that <b>Mareimar interpreted</b> a verse <b>homiletically</b> as follows: <b>What</b> is the meaning of that <b>which is written: “And so YHWH has watched over the evil, and brought it upon us; for YHWH our God is righteous [<i>tzaddik</i>]”</b> (Daniel 9:14)? How can it be that <b>because YHWH, our God, is righteous, YHWH watched over the evil and brought it upon us? </b>"
        },
        {
          "verseLocation": "Daniel 9:14",
          "verseText": "which is written: “And so the Lord has hastened the evil, and brought it upon us; for the Lord our God is righteous",
          "talmudLocation": "Sanhedrin 38a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/38a#section-4",
          "talmudFullText": "Apropos the discussion of exile, <b>Rav Ḥisda says</b> that <b>Mar Ukva says, and some say</b> that <b>Rav Ḥisda says</b> that <b>Mari bar Mar taught: What</b> is the meaning of that <b>which is written: “And so YHWH has hastened the evil, and brought it upon us; for YHWH our God is righteous</b> in all His works He has done” (Daniel 9:14)? Is it <b>because “YHWH</b> our God <b>is righteous”</b> that <b>“YHWH has hastened the evil, and brought it upon us”? </b> He explains: <b>Yes, </b> because it was <b>a righteous</b> act that <b>God performed for the Jewish people by hastening the exile of Zedekiah while</b> the Jews who had been exiled in <b>the exile of Jeconiah, </b> which preceded it, <b>were still alive, </b> as the wise people among those exiled with Jeconiah were able to instruct those exiled with Zedekiah."
        },
        {
          "verseLocation": "Daniel 9:17",
          "verseText": "Rav said: Even Daniel’s prayers were only answered on account of Abraham, as it is stated: “And now listen, God, to the prayer of Your servant and to his supplication; and cause Your face to shine upon Your desolate Temple, for the sake of the Lord”",
          "talmudLocation": "Berakhot 7b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/7b#section-2",
          "talmudFullText": "The Talmud cites another statement extolling that virtue of Abraham is mentioned, as <b>Rav said: Even Daniel’s prayers were only answered on account of Abraham, as it is stated: “And now listen, God, to the prayer of Your servant and to his supplication; and cause Your face to shine upon Your desolate Temple, for the sake of YHWH”</b> (Daniel 9:17). The verse <b>should have said: </b> And cause Your face to shine upon Your desolate Temple, <b>for Your sake, </b> as Daniel was addressing YHWH."
        },
        {
          "verseLocation": "Daniel 9:21",
          "verseText": "regarding Gabriel, it is written: “The man, Gabriel, whom I had seen at the beginning, in a vision, being caused to fly swiftly,",
          "talmudLocation": "Berakhot 4b:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/4b#section-23",
          "talmudFullText": "After this discussion of the statement that R' Elazar said that R' Avina said, another statement of R' Elazar is cited. <b>R' Elazar bar Avina said: What was said about</b> the angel <b>Michael is greater than what was said about</b> the angel <b>Gabriel. As about Michael, it is written: “And one of the seraphim flew to me”</b> (Isaiah 6:6), indicating that with a single flight, the seraph arrived and performed his mission, while <b>regarding Gabriel, it is written: “The man, Gabriel, whom I had seen at the beginning, in a vision, being caused to fly swiftly, </b> approached close to me about the time of the evening offering” (Daniel 9:21). The double language used in the phrase “to fly swiftly [<i>muaf biaf]</i>,” indicates that he did not arrive at his destination in a single flight, but rather, that it took him two flights."
        },
        {
          "verseLocation": "Daniel 9:23",
          "verseText": "“For you are greatly loved”",
          "talmudLocation": "Yoma 76b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/76b#section-9",
          "talmudFullText": "The Talmud continues to show that abstaining from smearing oil on oneself is considered an affliction: <b>And from where do we</b> derive that abstaining from the activities that Daniel describes is <b>considered affliction? As it is written: “Then he said to me: Fear not, Daniel, for from the first day that you set your heart to understand and to afflict yourself before your God, your words were heard, and I have come due to your words”</b> (Daniel 10:12). <b>“For you are greatly loved”</b> (Daniel 9:23)."
        },
        {
          "verseLocation": "Daniel 9:24",
          "verseText": "they not know when? But isn’t it written: “Seventy sevens are decreed upon your people and upon your sacred city”",
          "talmudLocation": "Nazir 32b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/32b#section-6",
          "talmudFullText": "The Talmud responds: <b>Although they</b> might have <b>known</b> that the Second Temple <b>would be destroyed, </b> as the verse speaks of three Temples, <b>did they know when</b> it would be destroyed? Would they have considered that it might occur in their lifetimes, preventing them from sacrificing their offerings? <b>Abaye said: And</b> did <b>they not know when? But isn’t it written: “Seventy sevens are decreed upon your people and upon your sacred city”</b> (Daniel 9:24), which indicates that the Second Temple would be destroyed seventy Sabbatical cycles of seven years after the destruction of the First Temple, which is 490 years. The Talmud answers: <b>And still, did we know on which day</b> it would be destroyed? It was therefore impossible to use this factor as a means to broach the dissolution of their vows."
        },
        {
          "verseLocation": "Daniel 9:27",
          "verseText": "But isn’t it written: “And upon the wing of detestable things shall be that which causes appallment”",
          "talmudLocation": "Taanit 28b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/28b#section-16",
          "talmudFullText": "The Talmud asks: <b>And was there</b> only <b>one</b> idol placed there? <b>But isn’t it written: “And upon the wing of detestable things shall be that which causes appallment”</b> (Daniel 9:27)? The plural, “detestable things,” indicates the presence of at least two idols. <b>Rava said: There were</b> initially <b>two</b> idols, <b>but one fell upon the other and broke its hand. </b> Since only one idol was whole, the Mishnah mentions only that one. Rava continues: <b>And</b> an inscription was found on the broken idol <b>that read: </b>"
        },
        {
          "verseLocation": "Daniel 9:27",
          "verseText": "“covenant.” It is written here: “And he shall make a firm covenant with many for one week”",
          "talmudLocation": "Yoma 54a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/54a#section-4",
          "talmudFullText": "<b>And it was taught</b> in another <i>baraita</i> that <b>R' Yosei says: </b> For <b>seven years</b> a curse of <b>brimstone and salt endured in Eretz Yisrael, </b> rendering it unfit for human habitation. <b>And R' Yoḥanan said: What is the rationale of R' Yosei; </b> from where does he learn this? It is <b>derived from</b> a verbal analogy between <b>“covenant”</b> and <b>“covenant. ” It is written here: “And he shall make a firm covenant with many for one week”</b> (Daniel 9:27), i.e., seven years. <b>And it is written there: </b> “And that its entire land is brimstone and salt…<b>They shall say: Because they forsook the covenant of YHWH, the God of their fathers”</b> (Deuteronomy 29:22; 24). Evidently, the Jebusites must have been exiled from Jerusalem, which proves that the phrase “to this day” does not always mean forever."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "Daniel 10:3",
          "verseText": "as it is written: “Neither did I anoint myself at all”",
          "talmudLocation": "Yoma 76b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/76b#section-11",
          "talmudFullText": "The Talmud asks: <b>But the <i>tanna</i> took</b> the <b>opposite</b> meaning, <b>as we learned</b> in a Mishnah: <b>From where do we derive that smearing</b> oil <b>is like drinking on Yom Kippur? Although there is no</b> explicit <b>proof of the matter</b> from the Bible, <b>there is an allusion to the matter</b> from the verse, <b>as it is stated: “And it came into his innards like water, and like oil into his bones”</b> (Psalms 109:18), meaning that oil on the body is like water within it. Therefore, the phrase “and it came into his innards like water” is referring to the act of drinking water. <b>Rather, Rav Ashi said: Bathing is derived from the same verse</b> cited above, <b>as it is written: “Neither did I anoint myself at all”</b> (Daniel 10:3). This teaches that Daniel did not do any anointing, including bathing. Consequently, the same source prohibits both of these activities."
        },
        {
          "verseLocation": "Daniel 10:3",
          "verseText": "As it is written “I ate no pleasant bread, neither did meat nor wine enter my mouth, neither did I anoint myself at all”",
          "talmudLocation": "Yoma 76b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/76b#section-8",
          "talmudFullText": "§ The Talmud asks: <b>From where do we</b> derive that abstaining from <b>bathing and smearing</b> oil on oneself <b>is called affliction? </b> The Talmud answers: <b>As it is written “I ate no pleasant bread, neither did meat nor wine enter my mouth, neither did I anoint myself at all”</b> (Daniel 10:3). The Talmud explains the verse: <b>What</b> is the meaning of <b>“I ate no pleasant bread”? Rav Yehuda, son of Rav Shmuel bar Sheilat, said: He did not eat even bread</b> made from <b>refined wheat; </b> he ate only wheat mixed with bran."
        },
        {
          "verseLocation": "Daniel 10:6",
          "verseText": "with regard to an angel: “His body was like Tarshish”",
          "talmudLocation": "Chullin 91b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/91b#section-10",
          "talmudFullText": "<b>And it is written</b> in a verse <b>with regard to an angel: “His body was like Tarshish”</b> (Daniel 10:6). <b>And</b> it <b>is learned</b> as a tradition <b>that</b> the city of <b>Tarshish was two thousand parasangs. </b> Consequently, in order to accommodate four angels, the ladder must have been eight thousands parasangs wide."
        },
        {
          "verseLocation": "Daniel 10:7",
          "verseText": "“And I, Daniel, alone saw the vision, for the men who were with me did not see the vision; but a great trembling fell upon them, so that they fled to hide themselves”",
          "talmudLocation": "Megillah 3a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/3a#section-11",
          "talmudFullText": "§ The Talmud introduces another statement from the same line of tradition. The verse states: <b>“And I, Daniel, alone saw the vision, for the men who were with me did not see the vision; but a great trembling fell upon them, so that they fled to hide themselves”</b> (Daniel 10:7). <b>Who were these men? </b> The term “men” in the Bible indicates important people; who were they? <b>R' Yirmeya said, and some say</b> that it was <b>R' Ḥiyya bar Abba</b> who said: <b>These are</b> the prophets <b>Haggai, Zechariah, and Malachi. </b>"
        },
        {
          "verseLocation": "Daniel 10:7",
          "verseText": "as it is written: “And I, Daniel, alone saw the vision, and the men who were with me did not see the vision; but a great trembling fell upon them, and they fled to hide”",
          "talmudLocation": "Sanhedrin 93b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93b#section-18",
          "talmudFullText": "The Talmud asks: <b>From where do we</b> derive <b>that</b> Daniel was <b>greater than he</b> was? The Talmud answers: It is derived from a verse, <b>as it is written: “And I, Daniel, alone saw the vision, and the men who were with me did not see the vision; but a great trembling fell upon them, and they fled to hide”</b> (Daniel 10:7). The Talmud asks: <b>“And the men who were with me did not see the vision”; and who were</b> these <b>men? R' Yirmeya, and some say R' Ḥiyya bar Abba, says: That</b> is referring to <b>Haggai, Zechariah, and Malachi, </b> who were with him and did not see. Evidently, Daniel was greater than these prophets, and all the more so was he greater than Nehemiah, who was never privileged to prophesy."
        },
        {
          "verseLocation": "Daniel 10:12",
          "verseText": "as it is written: “Then he said to me: Fear not, Daniel, for from the first day that you set your heart to understand, and to fast before your God, your words were heard”",
          "talmudLocation": "Taanit 8b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/8b#section-10",
          "talmudFullText": "<b>They said to him: From where do you</b> know <b>this, </b> the fact that one may take a fast upon himself that he cannot observe? R' Zeira <b>said to them</b> that the reason is <b>as it is written: “Then he said to me: Fear not, Daniel, for from the first day that you set your heart to understand, and to fast before your God, your words were heard”</b> (Daniel 10:12). This verse indicates that from the moment one turns his heart to fast, his prayers are heard."
        },
        {
          "verseLocation": "Daniel 10:12",
          "verseText": "“And I have come due to your words”",
          "talmudLocation": "Yoma 76b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/76b#section-12",
          "talmudFullText": "Apropos the verses from Daniel, the Talmud asks: <b>What</b> did the angel mean when he said to Daniel: <b>“And I have come due to your words”</b> (Daniel 10:12)? From this, it seems that the angel was able to come only because of Daniel. The Talmud answers: <b>This is as it is written: “And there stood before them seventy men of the Elders of the house of Israel, and Jaazaniah, son of Shaphan, standing in the midst of them, each man with his censer in his hand, and a thick cloud of incense went up”</b> (Ezekiel 8:11). Ezekiel saw the Elders of the house of Israel worshipping foreign gods. <b>“And the form of a hand was put forth, and I was taken by a lock of my head; and a spirit lifted me up between the earth and the heaven, and brought me in the visions of God to Jerusalem, to the door of the gate of the inner court that faces northward where</b>"
        },
        {
          "verseLocation": "Daniel 10:12",
          "verseText": "considered affliction? As it is written: “Then he said to me: Fear not, Daniel, for from the first day that you set your heart to understand and to afflict yourself before your God, your words were heard, and I have come due to your words”",
          "talmudLocation": "Yoma 76b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/76b#section-9",
          "talmudFullText": "The Talmud continues to show that abstaining from smearing oil on oneself is considered an affliction: <b>And from where do we</b> derive that abstaining from the activities that Daniel describes is <b>considered affliction? As it is written: “Then he said to me: Fear not, Daniel, for from the first day that you set your heart to understand and to afflict yourself before your God, your words were heard, and I have come due to your words”</b> (Daniel 10:12). <b>“For you are greatly loved”</b> (Daniel 9:23)."
        },
        {
          "verseLocation": "Daniel 10:12",
          "verseText": "is stated: “And I have come due to your words”",
          "talmudLocation": "Yoma 77a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/77a#section-7",
          "talmudFullText": "<b>He said before Him: God!, if all the wise men of other nations were placed on one side of the scale, and Daniel the beloved man were on the other side, would he not outweigh them? God said: Who is the one who teaches the virtue of My children? They said to Him: God!, </b> it is <b>Gabriel. He said to them: Let him come</b> from behind the partition, as it <b>is stated: “And I have come due to your words”</b> (Daniel 10:12), meaning that Gabriel was permitted to enter from behind the partition because he mentioned Daniel’s name. <b>God</b> then <b>said</b> to the other angels: <b>Let him ascend. They brought him up. </b>"
        },
        {
          "verseLocation": "Daniel 10:13",
          "verseText": "and there, it is written: “And behold, Michael, one of the chief ministers of the king, came to my aid”",
          "talmudLocation": "Berakhot 4b:25",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/4b#section-25",
          "talmudFullText": "<b>R' Yoḥanan said: This is derived</b> through a verbal analogy between the words <b>one and one. Here, it is written: “And one of the seraphim flew to me”</b> (Isaiah 6:6), <b>and there, it is written: “And behold, Michael, one of the chief ministers of the king, came to my aid”</b> (Daniel 10:13). Since the verse from Daniel refers to Michael as “one,” which aggadic midrash interprets as “the unique one,” so, too, “one of the seraphs” described in Isaiah must also refer to the unique one, Michael."
        },
        {
          "verseLocation": "Daniel 10:13",
          "verseText": "and he served for twenty-one days. As it is written: “But the prince of the kingdom of Persia stood opposed to me for twenty-one days, but, lo, Michael, one of the chief princes, came to help me and I remained there beside the kings of Persia”",
          "talmudLocation": "Yoma 77a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/77a#section-5",
          "talmudFullText": "<b>They</b> then <b>brought Dubiel, the ministering angel of the Persians and put him in the place of [<i>baḥarikei</i>]</b> Gabriel <b>and he served for twenty-one days. As it is written: “But the prince of the kingdom of Persia stood opposed to me for twenty-one days, but, lo, Michael, one of the chief princes, came to help me and I remained there beside the kings of Persia”</b> (Daniel 10:13). Corresponding to those twenty-one days, <b>they gave him, </b> the ministering angel of Persia, <b>twenty-one kings</b> who ruled and <b>the seaport</b> of <b>Mashhig. </b>"
        },
        {
          "verseLocation": "Daniel 10:16",
          "verseText": "But isn’t it written: “My lord, by reason of the vision my pains [ tzirai ] come”",
          "talmudLocation": "Bekhorot 45a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/45a#section-21",
          "talmudFullText": "<b>Abaye said to him: And are there no</b> hinges <b>in a man? But isn’t it written: “Pangs [<i>tzirim</i>] have taken hold upon me, as the pangs of a woman in travail”</b> (Isaiah 21:3)? The Talmud responds: The verse is referring specifically to <b>hinges of flesh, </b> which are not considered limbs, as they contain no bones. The Talmud persists: <b>But isn’t it written: “My lord, by reason of the vision my pains [<i>tzirai</i>] come”</b> (Daniel 10:16)? The Talmud responds: <b>Here too, </b> the verse is referring to <b>hinges of flesh. </b> The Talmud notes: <b>So too, it is reasonable</b> that the hinges of a male are only of flesh, <b>as if you do not say so, </b> then as far as the <b>248</b> limbs that the rabbis stated constitute a human body, <b>how can you find</b> them? <b>Neither in a man nor in a woman. </b>"
        },
        {
          "verseLocation": "Daniel 10:20",
          "verseText": "“And when I depart from him, the prince of Greece comes”",
          "talmudLocation": "Yoma 77a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/77a#section-8",
          "talmudFullText": "<b>He came</b> and <b>found Dubiel</b> the ministering angel of the Persians <b>holding the letter in his hand. </b> Gabriel <b>wanted to take</b> the letter <b>from him, </b> but Dubiel <b>swallowed it. Some say the letter was written, but it was not signed. Some say it was also signed, </b> but <b>when he swallowed it, </b> the signature <b>was erased. </b> The Talmud comments: <b>This is</b> why, <b>in the kingdom of Persia, there are</b> those <b>who pay taxes and there are</b> those <b>who do not pay taxes, </b> as the decree was not finalized. It also states there: <b>“And when I depart from him, the prince of Greece comes”</b> (Daniel 10:20). Gabriel <b>screamed and screamed</b> that the kings of Greece should not rule over the Jews, <b>but no one listened to him. </b>"
        },
        {
          "verseLocation": "Daniel 10:21",
          "verseText": "“But I will declare to you that which is inscribed in the writing of truth”",
          "talmudLocation": "Yevamot 105a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/105a#section-9",
          "talmudFullText": "Apropos adherence to instructions given in the Torah, the Talmud relates a story. <b>Levi went out to the villages</b> to teach people Torah. <b>They asked him</b> several questions: Firstly, <b>what is</b> the <i>halakha</i> for <b>an armless woman, may she perform <i>ḥalitza</i></b> with her teeth? Secondly, <b>what is</b> the <i>halakha</i> if <b>a <i>yevama</i> spat blood</b> instead of saliva, is the <i>ḥalitza</i> valid? Furthermore, they asked with regard to the verse: <b>“But I will declare to you that which is inscribed in the writing of truth”</b> (Daniel 10:21), if <b>by inference, there is writing</b> in Heaven <b>that is not truth. </b>"
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "Daniel 11:14",
          "verseText": "“Also the children of the wicked [ peritzei ] among your people shall raise themselves up to establish the vision but they shall stumble”",
          "talmudLocation": "Bava Metzia 105a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/105a#section-13",
          "talmudFullText": "The Talmud asks: <b>What</b> is the meaning of <b>unruly [<i>peritzei</i>] olives? Rav Huna said: Wicked olives, </b> i.e., olives that barely produce any oil. <b>Rav Yosef said: And what is the verse</b> from which it is derived? <b>“Also the children of the wicked [<i>peritzei</i>] among your people shall raise themselves up to establish the vision but they shall stumble”</b> (Daniel 11:14). This verse indicates that the word <i>peritzei</i> means wicked. <b>Rav Naḥman bar Yitzḥak said</b> that the meaning of this word can be derived <b>from here: “If he beget a son that is a robber [<i>paritz</i>], a shedder of blood”</b> (Ezekiel 18:10)."
        },
        {
          "verseLocation": "Daniel 11:41",
          "verseText": "it is written: “The land of the deer”",
          "talmudLocation": "Rosh Hashanah 13a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/13a#section-13",
          "talmudFullText": "The Talmud rejects this argument: <b>Rather, what</b> can one say? <b>That</b> the grain <b>had reached one quarter or one-6th [<i>danka</i>]</b> of its growth before the Jewish people conquered the land? This too is difficult, as one can <b>still</b> ask: <b>Could</b> the grain <b>have reached full growth in</b> just <b>five days? Rather, what have you to say? </b> One could say that with regard to Eretz Yisrael <b>it is written: “The land of the deer”</b> (Daniel 11:41), implying that the grain of Eretz Yisrael ripens with the swiftness of a deer. <b>Here, too, </b> one can say that <b>“the land of the deer” is written</b> with regard to Eretz Yisrael and applies to the ripening of the grain, so that it can ripen in just a few days."
        },
        {
          "verseLocation": "Daniel 11:45",
          "verseText": "As it is written: “And he shall plant [ vayitta ] the tents of his palace",
          "talmudLocation": "Sotah 10a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/10a#section-22",
          "talmudFullText": "The tanna’im <b>R' Yehuda and R' Neḥemya</b> disagree as to the meaning of the word “<i>eshel</i>. ” <b>One said</b> that it means <b>an orchard [<i>pardes</i>], and one said</b> that it means <b>an inn [<i>pundak</i>]. </b> The Talmud continues: <b>Granted, according to the one who said</b> that it means <b>an orchard, this is what is written: “And he planted, ”</b> and this is suitable language for an orchard. <b>But according to the one who said</b> that he opened <b>an inn, what is</b> the meaning of the phrase <b>“and he planted”? </b> The Talmud answers: <b>As it is written: “And he shall plant [<i>vayitta</i>] the tents of his palace</b> between the seas and the beauteous holy mountain; and he shall come to his end, and none shall help him” (Daniel 11:45), indicating that the word vayitta, and he planted, is also used to indicate pitching tents."
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "Daniel 12:2",
          "verseText": "will immediately be written and sealed for Gehenna, as it is stated: “And many of those who sleep in the dust of the earth shall wake, some to eternal life and some to shame and everlasting contempt”",
          "talmudLocation": "Rosh Hashanah 16b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/16b#section-15",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i>: <b>Beit Shammai say: There will be three groups</b> of people <b>on the</b> great <b>Day of Judgment</b> at the end of days: <b>One of wholly righteous</b> people, <b>one of wholly wicked</b> people, <b>and one of middling</b> people. Wholly <b>righteous</b> people <b>will immediately be written and sealed for eternal life. Wholly wicked</b> people <b>will immediately be written and sealed for Gehenna, as it is stated: “And many of those who sleep in the dust of the earth shall wake, some to eternal life and some to shame and everlasting contempt”</b> (Daniel 12:2). <b>Middling</b> people <b>will descend to Gehenna</b> to be cleansed and to achieve atonement for their sins,"
        },
        {
          "verseLocation": "Daniel 12:2",
          "verseText": "from here: “And many of those who sleep in the dust of the earth shall awaken, some to everlasting life, and some to reproaches and everlasting disgrace”",
          "talmudLocation": "Sanhedrin 92a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92a#section-5",
          "talmudFullText": "The Talmud returns to the topic of the source for resurrection in the Torah. <b>Rava says: From where</b> is <b>resurrection of the dead</b> derived <b>from the Torah? </b> It is derived from a verse, <b>as it is stated: “Let Reuben live and not die, </b> in that his men become few” (Deuteronomy 33:6). This is interpreted: <b>“Let Reuben live” in this world “and not die” in the World-to-Come. Ravina says</b> that resurrection is derived <b>from here: “And many of those who sleep in the dust of the earth shall awaken, some to everlasting life, and some to reproaches and everlasting disgrace”</b> (Daniel 12:2). <b>Rav Ashi says</b> proof is derived <b>from here: “But go you your way until the end be; and you shall rest, and arise to your lot at the end of days”</b> (Daniel 12:13)."
        },
        {
          "verseLocation": "Daniel 12:3",
          "verseText": "“And they who are wise shall shine like the brightness of the firmament;",
          "talmudLocation": "Bava Batra 8b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/8b#section-13",
          "talmudFullText": "Having raised the issue of charity collection, the Talmud cites various rabbinic expositions with regard to the matter. The verse states: <b>“And they who are wise shall shine like the brightness of the firmament; </b> and they who turn many to righteousness like the stars for ever and ever” (Daniel 12:3). <b>“And they who are wise shall shine like the brightness of the firmament”; this is a judge who judges an absolutely true judgment, </b> as his wisdom and understanding lead him to a correct judgment. <b>“And they who turn many to righteousness like the stars for ever and ever”; these are the charity collectors, </b> who facilitate the giving of charity."
        },
        {
          "verseLocation": "Daniel 12:7",
          "verseText": "not because it is written: “When he lifted up his right hand and his left hand unto heaven, and swore by Him that lives forever”",
          "talmudLocation": "Nazir 3b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/3b#section-7",
          "talmudFullText": "The Talmud asks: <b>Is there, </b> in fact, <b>anyone who says</b> that <b>a person does not associate</b> the object of his vow with <b>something juxtaposed to it</b> in a verse? <b>Isn’t it taught</b> in a <i>baraita</i> that in the case of <b>one who says: Right [<i>yamin</i>], that is</b> an expression of <b>an oath? What is the reason</b> for this? Is it <b>not because it is written: “When he lifted up his right hand and his left hand unto heaven, and swore by Him that lives forever”</b> (Daniel 12:7)? It seems evident that the term “right” indicates an oath merely because in the verse it is juxtaposed to an oath."
        },
        {
          "verseLocation": "Daniel 12:7",
          "verseText": "Rabbi Yehoshua said to him: But isn’t it already stated: “And I heard the man clothed in linen, who was above the waters of the river, when he lifted up his right hand and his left hand to heaven and swore by the One Who lives forever that it shall be for a period, periods, and a half; when the crushing of the power of the holy people shall have been completed, all these",
          "talmudLocation": "Sanhedrin 98a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/98a#section-2",
          "talmudFullText": "<b>R' Eliezer said to him: But isn’t it already stated: “If you will return, Israel, says YHWH, return to Me”</b> (Jeremiah 4:1), indicating that redemption is contingent upon repentance? <b>R' Yehoshua said to him: But isn’t it already stated: “And I heard the man clothed in linen, who was above the waters of the river, when he lifted up his right hand and his left hand to heaven and swore by the One Who lives forever that it shall be for a period, periods, and a half; when the crushing of the power of the holy people shall have been completed, all these</b> things shall be finished” (Daniel 12:7), indicating that the time for redemption is set and unrelated to repentance? <b>And R' Eliezer was silent, </b> unable to refute the proof from that verse."
        },
        {
          "verseLocation": "Daniel 12:11",
          "verseText": "As it is written: “And from the time that the daily offering shall be taken away and the abomination that causes appallment is set up”",
          "talmudLocation": "Taanit 28b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/28b#section-15",
          "talmudFullText": "The Mishnah also stated that on the seventeenth of Tammuz Manasseh <b>placed an idol in the Sanctuary. </b> The Talmud asks: <b>From where do we</b> derive that this occurred on the seventeenth of Tammuz? <b>As it is written: “And from the time that the daily offering shall be taken away and the abomination that causes appallment is set up”</b> (Daniel 12:11), which indicates that an idol was placed in the Temple on the very day that the daily offering was suspended."
        },
        {
          "verseLocation": "Daniel 12:13",
          "verseText": "from here: “But go you your way until the end be; and you shall rest, and arise to your lot at the end of days”",
          "talmudLocation": "Sanhedrin 92a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92a#section-5",
          "talmudFullText": "The Talmud returns to the topic of the source for resurrection in the Torah. <b>Rava says: From where</b> is <b>resurrection of the dead</b> derived <b>from the Torah? </b> It is derived from a verse, <b>as it is stated: “Let Reuben live and not die, </b> in that his men become few” (Deuteronomy 33:6). This is interpreted: <b>“Let Reuben live” in this world “and not die” in the World-to-Come. Ravina says</b> that resurrection is derived <b>from here: “And many of those who sleep in the dust of the earth shall awaken, some to everlasting life, and some to reproaches and everlasting disgrace”</b> (Daniel 12:2). <b>Rav Ashi says</b> proof is derived <b>from here: “But go you your way until the end be; and you shall rest, and arise to your lot at the end of days”</b> (Daniel 12:13)."
        }
      ]
    }
  ]
}