{
  "bookName": "Esther",
  "totalEntries": 186,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Esther 1:1",
          "verseText": "“And it came to pass [ vayhi ] in the days of Ahasuerus”",
          "talmudLocation": "Megillah 10b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-4",
          "talmudFullText": "§ The Talmud returns to the primary topic of this chapter, the book of Esther. The Talmud cites various aggadic interpretations of the verses of the Megilla. The opening verse of the Megilla states: <b>“And it came to pass [<i>vayhi</i>] in the days of Ahasuerus”</b> (Esther 1:1). <b>R' Levi said, and some say</b> that it was <b>R' Yonatan</b> who said: <b>This matter is a tradition</b> that <b>we</b> received <b>from the members of the Great Assembly. Anywhere that</b> the word <b><i>vayhi</i> is stated, it is</b> an ominous <b>term</b> indicating <b>nothing other</b> than impending <b>grief, </b> as if the word were a contraction of the words <i>vai</i> and <i>hi</i>, meaning woe and mourning."
        },
        {
          "verseLocation": "Esther 1:1",
          "verseText": "“And it came to pass [ vayhi ] in the days of Ahasuerus”",
          "talmudLocation": "Megillah 11a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-10",
          "talmudFullText": "§ The Talmud returns to its interpretation of the book of Esther. The verse states: <b>“And it came to pass [<i>vayhi</i>] in the days of Ahasuerus”</b> (Esther 1:1). <b>Rav said: </b> The word <i>vayhi</i> may be understood as if it said <b><i>vai</i> and <i>hi</i>, </b> meaning <b>woe and mourning. This is as it is written: “And there you shall sell yourselves to your enemies for bondsmen and bondswomen, </b> and no man shall buy you” (Deuteronomy 28:68). The repetitive nature of the verse, indicating that no one will be willing to buy you for servitude, but they will purchase you in order to murder you, indicates a doubly horrific situation, which is symbolized by the dual term <i>vayhi</i>, meaning woe and mourning."
        },
        {
          "verseLocation": "Esther 1:1",
          "verseText": "“This is [ hu ] Ahasuerus”",
          "talmudLocation": "Megillah 11a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-17",
          "talmudFullText": "The Talmud continues: <b>“This is [<i>hu</i>] Ahasuerus”</b> (Esther 1:1); the term <i>hu</i>, this is, comes to teach that <b>he</b> remained as he was <b>in his wickedness from beginning to end. </b> Similarly, wherever the words “this is” appear in this manner, the verse indicates that the individual under discussion remained the same from beginning to end, for example: <b>“This is [<i>hu</i>] Esau”</b> (Genesis 36:43); <b>he</b> remained <b>in his wickedness from beginning to end. “This is [<i>hu</i>] Dathan and Abiram”</b> (Numbers 26:9); <b>they</b> remained <b>in their wickedness from beginning to end. “This is [<i>hu</i>] the king Ahaz”</b> (II Chronicles 28:22); <b>he</b> remained <b>in his wickedness from beginning to end. </b>"
        },
        {
          "verseLocation": "Esther 1:1",
          "verseText": "“Who reigned”",
          "talmudLocation": "Megillah 11a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-19",
          "talmudFullText": "The next term in the opening verse: <b>“Who reigned”</b> (Esther 1:1), is now interpreted. <b>Rav said: </b> This comes to teach <b>that he reigned on his own, </b> without having inherited the throne. <b>Some say</b> this <b>to</b> his <b>credit, and some say it to</b> his <b>disgrace. </b> The Talmud explains: <b>Some say</b> this <b>to</b> his <b>credit, that there was no</b> other <b>man as fit as him to be king. And some say it to</b> his <b>disgrace, that he was not fit to be king, but he distributed large amounts of money, and</b> in that way <b>rose</b> to the throne."
        },
        {
          "verseLocation": "Esther 1:1",
          "verseText": "seven and twenty and a hundred provinces”",
          "talmudLocation": "Megillah 11a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-22",
          "talmudFullText": "The opening verse continues, stating that Ahasuerus reigned “over <b>seven and twenty and a hundred provinces”</b> (Esther 1:1). <b>Rav Ḥisda said: </b> This verse should be understood as follows: <b>At first he reigned over seven</b> provinces; <b>and then he reigned over twenty</b> more; <b>and finally he reigned over</b> another <b>hundred. </b> The Talmud asks: <b>However, if</b> that is <b>so, </b> with regard to the similarly worded verse: <b>“And the years of the life of Amram were seven and thirty and a hundred years”</b> (Exodus 6:20), <b>what would you expound</b> from <b>it? </b> The Talmud answers: <b>It is different here, </b> in the book of Esther, <b>as</b> this part of <b>the verse is</b> entirely <b>superfluous. Since it is</b> already <b>written: “From Hodu to Cush, ” why</b> then <b>do I need “Seven and twenty and a hundred provinces”? </b> Rather, <b>learn from here</b> that these words come <b>for</b> this <b>exposition, </b> to teach that Ahasuerus did not begin to reign over all of them at the same time."
        },
        {
          "verseLocation": "Esther 1:1",
          "verseText": "“from Hodu until Cush”",
          "talmudLocation": "Megillah 2b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2b#section-7",
          "talmudFullText": "The Talmud challenges this answer: <b>Say</b> that the <b>unwalled towns</b> celebrate Purim <b>on the fourteenth, </b> as indicated in the verse, and <b>the walled cities</b> do <b>not</b> celebrate it <b>at all. </b> The Talmud expresses astonishment: <b>And are they not Jews? And furthermore: It is written</b> that the kingdom of Ahasuerus was <b>“from Hodu until Cush”</b> (Esther 1:1), and the celebration of Purim was accepted in all of the countries of his kingdom (Esther 9:20–23)."
        },
        {
          "verseLocation": "Esther 1:2",
          "verseText": "sat",
          "talmudLocation": "Megillah 11b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-6",
          "talmudFullText": "§ The second verse in Esther states: <b>“In those days when the king</b> Ahasuerus <b>sat</b> on the throne of his kingdom” (Esther 1:2), implying that the events to follow took place during the first year of his reign; <b>and</b> one verse <b>afterward it is written: “In the 3rd year of his reign”</b> (Esther 1:3), indicating that it was the 3rd year, not the first. <b>Rava said: </b> There is no contradiction. <b>What is</b> the meaning of <b>“when he sat” [<i>keshevet</i>]? </b> It is intended to indicate that he acted not immediately upon his rise to the throne, but rather <b>after his mind was settled [<i>shenityasheva</i>], </b> and he overcame his anxiety and worry with regard to the redemption of the Jewish people. <b>He said</b> to himself as follows: <b>Belshazzar, </b> the king of Babylonia, <b>calculated and erred</b> with regard to the Jewish people’s redemption. <b>I</b> too <b>will calculate, but I will not err. </b>"
        },
        {
          "verseLocation": "Esther 1:3",
          "verseText": "afterward it is written: “In the third year of his reign”",
          "talmudLocation": "Megillah 11b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-6",
          "talmudFullText": "§ The second verse in Esther states: <b>“In those days when the king</b> Ahasuerus <b>sat</b> on the throne of his kingdom” (Esther 1:2), implying that the events to follow took place during the first year of his reign; <b>and</b> one verse <b>afterward it is written: “In the 3rd year of his reign”</b> (Esther 1:3), indicating that it was the 3rd year, not the first. <b>Rava said: </b> There is no contradiction. <b>What is</b> the meaning of <b>“when he sat” [<i>keshevet</i>]? </b> It is intended to indicate that he acted not immediately upon his rise to the throne, but rather <b>after his mind was settled [<i>shenityasheva</i>], </b> and he overcame his anxiety and worry with regard to the redemption of the Jewish people. <b>He said</b> to himself as follows: <b>Belshazzar, </b> the king of Babylonia, <b>calculated and erred</b> with regard to the Jewish people’s redemption. <b>I</b> too <b>will calculate, but I will not err. </b>"
        },
        {
          "verseLocation": "Esther 1:3",
          "verseText": "“The army of Persia and Media, the nobles",
          "talmudLocation": "Megillah 12a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-6",
          "talmudFullText": "§ The Talmud returns to its interpretations of verses in the Megilla. The Megilla mentions that among those invited to the king’s feast were: <b>“The army of Persia and Media, the nobles</b> and princes of the provinces” (Esther 1:3), <b>and it is written</b> near the conclusion of the Megilla: “In the book of chronicles <b>of the kings of Media and Persia”</b> (Esther 10:2). Why is Persia mentioned first at the beginning of the Megilla, while later in the Megilla, Media is mentioned first? <b>Rava said</b> in response: These two peoples, the Persians and the Medes, <b>stipulated with each other, </b> saying: <b>If the kings</b> will come <b>from us, the ministers</b> will come <b>from you; and if the kings</b> will come <b>from you, the ministers</b> will come <b>from us. </b> Therefore, in reference to kings, Media is mentioned first, whereas in connection with nobles and princes, Persia is given priority."
        },
        {
          "verseLocation": "Esther 1:4",
          "verseText": "“When he showed the riches of his glorious [ kevod ] kingdom",
          "talmudLocation": "Megillah 12a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-7",
          "talmudFullText": "The verse states: <b>“When he showed the riches of his glorious [<i>kevod</i>] kingdom</b> and the honor of his majestic [<i>tiferet</i>] greatness” (Esther 1:4). <b>R' Yosei bar Ḥanina said: This teaches that</b> Ahasuerus <b>wore the priestly vestments. </b> Proof for this assertion may be adduced from the fact that the same terms are written with regard to the priestly vestments, as <b>it is written here: </b> “The riches of his glorious [<i>kevod</i>] kingdom and <b>the honor of his majestic [<i>tiferet</i>] greatness. ” And it is written there, </b> with regard to the priestly garments: <b>“For glory [<i>kavod</i>] and for majesty [<i>tiferet</i>]”</b> (Exodus 28:2)."
        },
        {
          "verseLocation": "Esther 1:5",
          "verseText": "“In the court of the garden of the king’s palace”",
          "talmudLocation": "Megillah 12a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-11",
          "talmudFullText": "The verse states: <b>“In the court of the garden of the king’s palace”</b> (Esther 1:5). <b>Rav and Shmuel</b> disagreed with regard to how to understand the relationship between these three places: Court, garden, and palace: <b>One said: </b> The guests were received in different places. <b>One</b> who, according to his stature, was <b>fit for the courtyard</b> was brought <b>to the courtyard; one</b> who was <b>fit for the garden</b> was brought <b>to the garden; </b> and <b>one</b> who was <b>fit for the palace</b> was brought <b>to the palace. And</b> the other <b>one said: He</b> first <b>sat them in the courtyard, but it did not hold them, </b> as they were too numerous. He then sat them <b>in the garden, but it did not hold them</b> either, <b>until he brought them into the palace and it held them. </b> A 3rd understanding <b>was taught in a <i>baraita</i>: He sat them in the courtyard and opened two entranceways for them, one to the garden and one to the palace. </b>"
        },
        {
          "verseLocation": "Esther 1:5",
          "verseText": "“And when these days were fulfilled,",
          "talmudLocation": "Megillah 12a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-8",
          "talmudFullText": "The verse states: <b>“And when these days were fulfilled, </b> the king made a feast for all the people that were present in Shushan the capital” (Esther 1:5). <b>Rav and Shmuel</b> disagreed as to whether this was a wise decision. <b>One said: </b> Ahasuerus arranged a feast for the residents of Shushan, the capital, after the feast for foreign dignitaries that preceded it, as mentioned in the earlier verses, indicating that <b>he was a clever king. And</b> the other <b>one said: </b> It is precisely this that indicates that <b>he was a foolish king. The one who said</b> that this proves that <b>he was a clever king</b> maintains <b>that he acted well when he first brought close those</b> more <b>distant</b> subjects by inviting them to the earlier celebration, <b>as he could appease the residents of his</b> own <b>city whenever he wished. And the one who said</b> that <b>he was foolish</b> maintains <b>that he should have invited the residents of his city first, so that if those</b> faraway subjects <b>rebelled against him, these</b> who lived close by <b>would have stood with him. </b>"
        },
        {
          "verseLocation": "Esther 1:6",
          "verseText": "ḥur , karpas , and sky blue”",
          "talmudLocation": "Megillah 12a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-12",
          "talmudFullText": "The verse states: “There were hangings of <b><i>ḥur</i>, <i>karpas</i>, and sky blue”</b> (Esther 1:6). The Talmud asks: <b>What is <i>ḥur</i>? Rav said: </b> A fabric fashioned with <b>many holes [<i>ḥarei ḥarei</i>], </b> similar to lace. <b>And Shmuel said: He spread out for them</b> carpets of <b>white wool, </b> as the word <i>ḥavar</i> means white. And what is <b><i>karpas</i>? R' Yosei bar Ḥanina said: Cushions [<i>karim</i>] of velvet [<i>pasim</i>]. </b>"
        },
        {
          "verseLocation": "Esther 1:6",
          "verseText": "“On silver rods and pillars of marble; the couches were of gold and silver”",
          "talmudLocation": "Megillah 12a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-13",
          "talmudFullText": "The verse states: <b>“On silver rods and pillars of marble; the couches were of gold and silver”</b> (Esther 1:6). <b>It is taught</b> in a <i>baraita</i>: <b>R' Yehuda says: </b> Some couches were of gold and others of silver. <b>One</b> who, according to his stature, was <b>fit for silver</b> sat on a couch of <b>silver, </b> and <b>one</b> who was <b>fit for gold</b> sat on one of <b>gold. R' Neḥemya said to him: </b> This was not done. <b>If so, you</b> would <b>cast jealousy into the feast, </b> for the guests would be envious of each other. <b>Rather, </b> the couches <b>themselves</b> were made <b>of silver, and their feet</b> were made <b>of gold. </b>"
        },
        {
          "verseLocation": "Esther 1:6",
          "verseText": "bahat and marble”",
          "talmudLocation": "Megillah 12a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-14",
          "talmudFullText": "The verse continues: “Upon a pavement of <b><i>bahat</i> and marble”</b> (Esther 1:6). <b>R' Asi said</b> with regard to the definition of <i>bahat</i>: These are <b>stones that ingratiate themselves with their owners, </b> as they are precious stones that people are willing to spend large amounts of money to acquire. <b>And similarly, it states</b> elsewhere that the Jewish people will be likened to precious stones: “And YHWH their God shall save them in that day as the flock of His people; for they shall be as <b>“the stones of a crown, glittering over His land”</b> (Zechariah 9:16)."
        },
        {
          "verseLocation": "Esther 1:6",
          "verseText": "“And dar and soḥaret ”",
          "talmudLocation": "Megillah 12a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-15",
          "talmudFullText": "The verse concludes: <b>“And <i>dar</i> and <i>soḥaret</i>”</b> (Esther 1:6). <b>Rav said: </b> <i>Dar</i> means <b>many rows [<i>darei darei</i>]</b> around. Similarly, <i>soḥaret</i> is derived from <i>seḥor seḥor</i>, around and around, meaning that the floor was surrounded with numerous rows of <i>bahat</i> and marble stones. <b>And Shmuel said: </b> There is <b>a precious stone in the seaports, and its name is <i>dara</i>, </b> and Ahasuerus <b>placed it in the center of</b> the <b>feast, and it illuminated</b> the festivities <b>for them as</b> the sun illuminates the world <b>at midday. </b> He explains that the word <i>soḥaret</i> is derived from <i>tzohar</i>, a light. A scholar from <b>the school of R' Yishmael taught</b> a <i>baraita</i>: This means <b>that he proclaimed a remission for all the merchants, </b> absolving them from paying their taxes, understanding that the word <i>dar</i> derives from <i>deror</i>, freedom, and <i>soḥaret</i> from <i>soḥer</i>, merchant."
        },
        {
          "verseLocation": "Esther 1:7",
          "verseText": "“And they gave them drink in vessels of gold, the vessels being diverse [ shonim ] from one another”",
          "talmudLocation": "Megillah 12a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-16",
          "talmudFullText": "The verse states: <b>“And they gave them drink in vessels of gold, the vessels being diverse [<i>shonim</i>] from one another”</b> (Esther 1:7). The Talmud asks: Why does the verse use the term <i>shonim</i> to express that they are different? <b>It should have said</b> the more proper term <b><i>meshunim</i>. Rava said: A bat kol issued forth and said to them: The early ones, </b> referring to Belshazzar and his people, <b>were destroyed because</b> they used <b>these vessels, </b> the vessels of the Temple, <b>and</b> yet <b>you use them again [<i>shonim</i>]? </b> The verse continues: <b>“And royal wine in abundance [<i>rav</i>]”</b> (Esther 1:7). <b>Rav said: This teaches that each and every</b> guest at the feast <b>was poured</b> well-aged <b>wine that was older [<i>rav</i>] than himself in years. </b>"
        },
        {
          "verseLocation": "Esther 1:8",
          "verseText": "“And the drinking was according to the law; none did compel”",
          "talmudLocation": "Megillah 12a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-17",
          "talmudFullText": "The verse states: <b>“And the drinking was according to the law; none did compel”</b> (Esther 1:8). The Talmud asks: <b>What is</b> the meaning of <b>“according to the law”? R' Ḥanan said in the name of R' Meir: </b> The drinking was <b>according to the law of the Torah. Just as, </b> according to <b>the law of the Torah, </b> with regard to offerings, <b>the food</b> sacrificed on the altar <b>is greater</b> in quantity <b>than the drink, </b> for the wine libation is quantitatively much smaller than the sacrificial offerings it accompanies, <b>so too, </b> at the <b>feast of that wicked man, the food was greater</b> in quantity <b>than the drink. </b>"
        },
        {
          "verseLocation": "Esther 1:8",
          "verseText": "“None did compel”",
          "talmudLocation": "Megillah 12a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-18",
          "talmudFullText": "The verse states: <b>“None did compel”</b> (Esther 1:8). <b>R' Elazar said: This teaches that each and every</b> guest at the feast <b>was poured</b> a drink <b>from wine of his</b> own <b>country, </b> so that he would feel entirely free, as if he were in his home country. The verse continues: <b>“That they should do according to every man’s pleasure”</b> (Esther 1:8). <b>Rava</b> commented on the literal meaning of the verse, which is referring to two men, a man and a man [<i>ish va’ish</i>], and <b>said: </b> The man and man whom they should follow indicates <b>that they should do according to the wishes of Mordecai and Haman. </b> The two of them served as butlers at the feast, and they were in charge of distributing the wine. Why is the verse interpreted in this way? <b>Mordecai</b> is called “man,” <b>as it is written: </b> “There was a certain <b>Jewish man [<i>ish</i>]</b> in Shushan the castle, whose name was Mordecai, the son of Jair” (Esther 2:5). <b>And Haman</b> is also called man, as it states: <b>“A man [<i>ish</i>] who is an adversary and an enemy, </b> this evil Haman” (Esther 7:6)."
        },
        {
          "verseLocation": "Esther 1:9",
          "verseText": "“Also Vashti the queen made a feast for the women, in the royal house,",
          "talmudLocation": "Megillah 12a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-19",
          "talmudFullText": "The verse states: <b>“Also Vashti the queen made a feast for the women, in the royal house, </b> which belonged to King Ahasuerus” (Esther 1:9). The Talmud questions why she held the feast in the royal house, a place of men, rather than in <b>the women’s house, </b> where it <b>should have been. Rava said</b> in response: <b>The two of them had sinful intentions. </b> Ahasuerus wished to fornicate with the women, and Vashti wished to fornicate with the men. <b>This</b> explains the folk saying <b>that people say: He with pumpkins and his wife</b>"
        },
        {
          "verseLocation": "Esther 1:10",
          "verseText": "“On the seventh day, when the heart of the king was merry with wine”",
          "talmudLocation": "Megillah 12b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-2",
          "talmudFullText": "The verse states: <b>“On the 7th day, when the heart of the king was merry with wine”</b> (Esther 1:10). The Talmud asks: <b>Is that to say</b> that <b>until now his heart was not merry with wine? </b> Did it take seven days for him to achieve merriment? <b>Rava said: The 7th day was Shabbat, </b> when the difference between the Jewish people and the non-Jews is most apparent. On Shabbat, <b>when the Jewish people eat and drink, they begin</b> by occupying themselves <b>with words of Torah and words of praise</b> for God. <b>But the nations of the world, when they eat and drink, they begin only with words of licentiousness. </b>"
        },
        {
          "verseLocation": "Esther 1:12",
          "verseText": "“But the queen Vashti refused",
          "talmudLocation": "Megillah 12b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-5",
          "talmudFullText": "The verse states: <b>“But the queen Vashti refused</b> to come” (Esther 1:12). The Talmud asks: <b>Since she was immodest, as the Master said</b> above: <b>The two of them had sinful intentions, what is the reason</b> that <b>she did not come? R' Yosei bar Ḥanina said: This teaches that she broke out in tzara'at, </b> and therefore she was embarrassed to expose herself publicly. An alternative reason for her embarrassment <b>was taught in a <i>baraita</i>: </b> The angel <b>Gabriel came and fashioned her a tail. </b>"
        },
        {
          "verseLocation": "Esther 1:12",
          "verseText": "“Therefore the king was very wrathful,",
          "talmudLocation": "Megillah 12b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-6",
          "talmudFullText": "The verse continues: <b>“Therefore the king was very wrathful, </b> and his anger burned in him” (Esther 1:12). The Talmud asks: <b>Why did</b> his anger <b>burn in him so greatly</b> merely because she did not wish to come? <b>Rava said: </b> Vashti not only refused to come, but she also <b>sent him</b> a message by way of a messenger: You, <b>son of my father’s stableman [<i>ahuriyyarei</i>]. </b> Belshazzar, <b>my father, drank wine against a thousand</b> men <b>and did not become inebriated, </b> as the verse in Daniel (5:1) testifies about him: “Belshazzar the king made a great feast to a thousand of his lords, and drank wine before the thousand”; <b>and that man, </b> referring euphemistically to Ahasuerus himself, <b>has become senseless from his wine. </b> Due to her audacity, <b>immediately “his anger burned in him”</b> (Esther 1:12)."
        },
        {
          "verseLocation": "Esther 1:13",
          "verseText": "“Then the king said to the wise men,",
          "talmudLocation": "Megillah 12b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-7",
          "talmudFullText": "The following verse states: <b>“Then the king said to the wise men, </b> who knew the times” (Esther 1:13). The Talmud asks: <b>Who are these wise men? </b> These wise men are <b>the rabbis</b> of the Jewish people, who are referred to as those <b>“who knew the times, ” for they know how to intercalate years and fix the months</b> of the Jewish calendar. Ahasuerus <b>said to them: Judge her for me. </b> The rabbis <b>said</b> in their hearts: <b>What should we do? </b> If <b>we say to him: Kill her, tomorrow he will become sober and</b> then come and <b>demand her from us. </b> If <b>we say to him: Let her be, she has scorned royalty, </b> and that cannot be tolerated. Consequently, they decided not to judge the matter, and <b>they said to him</b> as follows: <b>From the day that the Temple was destroyed and we have been exiled from our land, counsel</b> and insight <b>have been removed from us, and we do not know how to judge capital cases, </b> as they are exceptionally difficult. <b>Go to</b> the people of <b>Ammon and Moab, who have remained</b> permanently <b>settled in their places like wine that is settled on its lees, </b> and so their minds are settled as well."
        },
        {
          "verseLocation": "Esther 1:14",
          "verseText": "“And next to him was Carshena, Shethar, Admatha, Tarshish,",
          "talmudLocation": "Megillah 12b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-8",
          "talmudFullText": "<b>And</b> they provided a good <b>reason</b> when <b>they spoke to him, </b> as they proved that one who is settled retains his reasoning: <b>For it is written: “Moab has been at ease from his youth, and he has settled on his lees, and has not been emptied from vessel to vessel, neither has he gone into exile; therefore his taste has remained in him, and his scent is not changed”</b> (Jeremiah 48:11). Ahasuerus <b>immediately</b> acted on their advice and asked his advisors, as it is written: <b>“And next to him was Carshena, Shethar, Admatha, Tarshish, </b> Meres, Marsena, and Memucan” (Esther 1:14)."
        },
        {
          "verseLocation": "Esther 1:14",
          "verseText": "who saw the king’s face",
          "talmudLocation": "Megillah 23a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/23a#section-7",
          "talmudFullText": "A question is raised with regard to the number of readers on different days. <b>Corresponding to what</b> were <b>these three, five, and seven, </b> readers instituted? <b>R' Yitzḥak bar Naḥmani and one</b> other Sage <b>who was with him disagree about this. And who was</b> that other scholar? <b>R' Shimon ben Pazi. And some say</b> that this was a matter of dispute between <b>R' Shimon ben Pazi and one</b> other scholar <b>who was with him. And who was</b> that other scholar? <b>R' Yitzḥak bar Naḥmani, and some say</b> it was <b>R' Shmuel bar Naḥmani. One said: </b> These numbers <b>correspond</b> to the number of Hebrew words in the three verses of <b>the Priestly Benediction. And one said: </b> These numbers <b>correspond to the three guards of the door</b> (II Kings 25:18), <b>five of</b> the officers <b>who saw the king’s face</b> (II Kings 25:19), <b>and the seven</b> officers <b>who saw the king’s face</b> (Esther 1:14)."
        },
        {
          "verseLocation": "Esther 1:16",
          "verseText": "“And Memucan said”",
          "talmudLocation": "Megillah 12b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-11",
          "talmudFullText": "The verse states: <b>“And Memucan said”</b> (Esther 1:16). A Sage <b>taught</b> in a <i>baraita</i>: <b>Memucan is Haman. And why is</b> Haman <b>referred to as Memucan? Because he was prepared [<i>mukhan</i>] to</b> bring <b>calamity</b> upon the Jewish people. <b>Rav Kahana said: From here</b> we see <b>that the common man jumps to the front</b> and speaks first, for Memucan was mentioned last of the king’s seven advisors, and nevertheless he expressed his opinion first."
        },
        {
          "verseLocation": "Esther 1:20",
          "verseText": "“And when the king’s decree [ pitgam ] shall be publicized”",
          "talmudLocation": "Megillah 9a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/9a#section-7",
          "talmudFullText": "<b>Rav Pappa said</b> that it is written: <b>“And when the king’s decree [<i>pitgam</i>] shall be publicized”</b> (Esther 1:20), and that <i>pitgam</i> is essentially an Aramaic word. <b>Rav Naḥman bar Yitzḥak said</b> that it is written: <b>“And all the wives will give honor [<i>yekar</i>] to their husbands”</b> (Esther 1:20), and <i>yekar</i> is Aramaic for honor."
        },
        {
          "verseLocation": "Esther 1:22",
          "verseText": "“That every man shall wield authority in his own house",
          "talmudLocation": "Megillah 12b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-12",
          "talmudFullText": "The king sent out letters to the people of all his provinces, in which it was written: <b>“That every man shall wield authority in his own house</b> and speak according to the language of his people” (Esther 1:22). <b>Rava said: Were it not for the first letters</b> sent by Ahasuerus, which everybody discounted, <b>there would not have been left among the enemies of the Jewish people, </b> a euphemism for the Jewish people themselves, <b>a remnant or a refugee. </b> Since these first letters were the subject of ridicule, people didn’t take the king seriously and did not immediately act upon the directive of the later letters, calling for the Jewish people’s destruction."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Esther 2:1",
          "verseText": "as it is written: “After these things, when the wrath of King Ahasuerus was appeased, he remembered Vashti, and what she had done, and what was decreed against her”",
          "talmudLocation": "Megillah 12b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-4",
          "talmudFullText": "The Talmud comments: Vashti was punished in this humiliating way <b>for it is with the measure that a man measures</b> to others <b>that he</b> himself <b>is measured. </b> In other words, God punishes individuals in line with their transgressions, measure for measure. <b>This teaches that the wicked Vashti would take the daughters of Israel, and strip them naked, and make them work on Shabbat. </b> Therefore, it was decreed that she be brought before the king naked, on Shabbat. This is <b>as it is written: “After these things, when the wrath of King Ahasuerus was appeased, he remembered Vashti, and what she had done, and what was decreed against her”</b> (Esther 2:1). That is to say, <b>just as she had done</b> with the young Jewish women, <b>so it was decreed upon her. </b>"
        },
        {
          "verseLocation": "Esther 2:3",
          "verseText": "“And let the king appoint officers",
          "talmudLocation": "Megillah 12b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-14",
          "talmudFullText": "The verse describes Ahasuerus’s search for a new wife by stating: <b>“And let the king appoint officers</b> in all the provinces of his kingdom, that they may gather together all the fair young virgins unto Shushan the castle” (Esther 2:3). <b>R'</b> Yehuda HaNasi <b>said: What is</b> the meaning of <b>that which is written: “In everything a prudent man acts with knowledge, but a fool unfolds his folly”</b> (Proverbs 13:16)? The verse highlights the difference between two kings’ approaches to finding a wife."
        },
        {
          "verseLocation": "Esther 2:5",
          "verseText": "Jewish man [ ish ]",
          "talmudLocation": "Megillah 12a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-18",
          "talmudFullText": "The verse states: <b>“None did compel”</b> (Esther 1:8). <b>R' Elazar said: This teaches that each and every</b> guest at the feast <b>was poured</b> a drink <b>from wine of his</b> own <b>country, </b> so that he would feel entirely free, as if he were in his home country. The verse continues: <b>“That they should do according to every man’s pleasure”</b> (Esther 1:8). <b>Rava</b> commented on the literal meaning of the verse, which is referring to two men, a man and a man [<i>ish va’ish</i>], and <b>said: </b> The man and man whom they should follow indicates <b>that they should do according to the wishes of Mordecai and Haman. </b> The two of them served as butlers at the feast, and they were in charge of distributing the wine. Why is the verse interpreted in this way? <b>Mordecai</b> is called “man,” <b>as it is written: </b> “There was a certain <b>Jewish man [<i>ish</i>]</b> in Shushan the castle, whose name was Mordecai, the son of Jair” (Esther 2:5). <b>And Haman</b> is also called man, as it states: <b>“A man [<i>ish</i>] who is an adversary and an enemy, </b> this evil Haman” (Esther 7:6)."
        },
        {
          "verseLocation": "Esther 2:5",
          "verseText": "Benjamite”",
          "talmudLocation": "Megillah 12b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12b#section-16",
          "talmudFullText": "The verse that initially describes Mordecai states: <b>“There was a certain Jew in Shushan the castle, </b> whose name was Mordecai the son of Jair the son of Shimei the son of Kish, a <b>Benjamite”</b> (Esther 2:5). The Talmud asks: <b>What is it</b> conveying in the verse by <b>saying</b> the names of Mordecai’s ancestors? <b>If</b> the verse in fact <b>comes to</b> trace his <b>ancestry, it should continue tracing</b> his lineage <b>back</b> all the way <b>to Benjamin, </b> the founder of his tribe. <b>Rather, what is different</b> about these names that they deserve special mention?"
        },
        {
          "verseLocation": "Esther 2:5",
          "verseText": "“There was a certain Jew”",
          "talmudLocation": "Megillah 18b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/18b#section-11",
          "talmudFullText": "The Talmud asks: <b>But does one</b> really <b>fulfill</b> his obligation in this way? <b>Didn’t R' Ḥelbo say</b> that <b>Rav Ḥama bar Gurya said</b> that <b>Rav said: The <i>halakha</i> is in accordance with the statement of the one who says</b> that the Megilla must be read <b>in its entirety</b> in order to fulfill one’s obligation. <b>And</b> moreover, he said that <b>even according to the one who said</b> that one need not read the entire Megilla, but only from <b>“There was a certain Jew”</b> (Esther 2:5) and onward, the Megilla itself <b>must</b> nevertheless <b>be written in its entirety. </b> How, then, can it be suggested that one who is reading each verse as he writes it can fulfill his obligation by reading from a Megilla that is not yet written to the end?"
        },
        {
          "verseLocation": "Esther 2:5",
          "verseText": "a certain Jew”",
          "talmudLocation": "Megillah 19a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-5",
          "talmudFullText": "Beginning <b>from where must a person read the Megilla in order to fulfill his obligation? R' Meir says: </b> He must read <b>all of it. R' Yehuda says: </b> He need read only <b>from</b> “There was <b>a certain Jew”</b> (Esther 2:5). <b>R' Yosei says: From “After these things”</b> (Esther 3:1)."
        },
        {
          "verseLocation": "Esther 2:6",
          "verseText": "“Who had been exiled from Jerusalem”",
          "talmudLocation": "Megillah 13a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-9",
          "talmudFullText": "§ The Talmud resumes its explanation of the book of Esther. The verse states with regard to Mordecai: <b>“Who had been exiled from Jerusalem”</b> (Esther 2:6). <b>Rava said: </b> This language indicates <b>that he went into exile on his own, </b> not because he was forced to leave Jerusalem. He knew that he would be needed by those in exile, and therefore he consciously left Jerusalem to attend to the needs of his people."
        },
        {
          "verseLocation": "Esther 2:7",
          "verseText": "as it is stated: “And he had brought up Hadassah;",
          "talmudLocation": "Megillah 10b:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-23",
          "talmudFullText": "The next section of the verse states: <b>“Shall the myrtle [<i>hadas</i>] come up”; this is the righteous Esther, who was called Hadassah</b> in the Megilla, <b>as it is stated: “And he had brought up Hadassah; </b> that is, Esther” (Esther 2:7). The concluding section of the verse states: <b>“And it shall be to YHWH for a name”; this is the reading of the Megilla. “For an everlasting sign that shall not be cut off”; these are the days of Purim. </b>"
        },
        {
          "verseLocation": "Esther 2:7",
          "verseText": "“And he had brought up Hadassah,",
          "talmudLocation": "Megillah 13a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-10",
          "talmudFullText": "The verse states: <b>“And he had brought up Hadassah, </b> that is, Esther” (Esther 2:7). <b>She is referred to as “Hadassah” and she is referred to as “Esther. ”</b> What was her real name? <b>It is taught</b> in a <i>baraita</i> that the rabbis differed in their opinion as to which was in fact her name and which one was a description: <b>R' Meir says: Esther was her</b> real <b>name. Why</b> then <b>was she called Hadassah? On account of the righteous, who are called myrtles [<i>hadassim</i>], and so it states: “And he stood among the myrtles [<i>hahadassim</i>]”</b> (Zechariah 1:8)."
        },
        {
          "verseLocation": "Esther 2:7",
          "verseText": "“For she had neither father nor mother”",
          "talmudLocation": "Megillah 13a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-13",
          "talmudFullText": "The verse initially states with regard to Esther: <b>“For she had neither father nor mother”</b> (Esther 2:7). <b>Why do I need</b> to be told in the continuation of the verse: <b>“And when her father and mother were dead, </b> Mordecai took her for his own daughter”? <b>Rav Aḥa said: </b> This repetition indicates that <b>when</b> her mother <b>became pregnant</b> with her, <b>her father died, </b> and <b>when she gave birth</b> to her, <b>her mother died, </b> so that she did not have a mother or a father for even a single day."
        },
        {
          "verseLocation": "Esther 2:7",
          "verseText": "“And when her father and mother were dead, Mordecai took her for his own daughter”",
          "talmudLocation": "Megillah 13a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-14",
          "talmudFullText": "The verse states: <b>“And when her father and mother were dead, Mordecai took her for his own daughter”</b> (Esther 2:7). A <i>tanna</i> <b>taught</b> a <i>baraita</i> <b>in the name of R' Meir: Do not read</b> the verse literally as <b>for a daughter [<i>bat</i>], </b> but <b>rather</b> read it as <b>for a home [<i>bayit</i>]. </b> This indicates that Mordecai took Esther to be his wife. <b>And so it states: “But the poor man had nothing, except one little ewe lamb, which he had bought and reared: And it grew up together with him, and with his children; it did eat of his bread, and drank of his own cup, and lay in his bosom, and was like a daughter [<i>kevat</i>] to him”</b> (II Samuel 12:3). The Talmud questions: <b>Because it lay in his bosom, it “was like a daughter to him”? Rather, </b> the parable in II Samuel referenced the illicit taking of another’s wife, and the phrase should be read: <b>Like a home [<i>bayit</i>]</b> to him, i.e., a wife. <b>So too, here, </b> Mordecai took her <b>for a home, </b> i.e., a wife."
        },
        {
          "verseLocation": "Esther 2:7",
          "verseText": "but the righteous, as it is stated: “And he raised Hadassah,",
          "talmudLocation": "Sanhedrin 93a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93a#section-5",
          "talmudFullText": "<b>Once He looked at Hananiah, Mishael, and Azariah He was placated, as it is stated: “And he stood among the myrtle bushes [<i>hadassim</i>] that were in the depths [<i>bametzula</i>]. ” And <i>hadassim</i></b> is referring to <b>no</b> one <b>but the righteous, as it is stated: “And he raised Hadassah, </b> that is Esther, his uncle’s daughter” (Esther 2:7). Hadassah is an appellation for the righteous Esther. <b>And <i>metzula</i></b> is referring to <b>no</b> place <b>but Babylonia, as it is stated</b> with regard to the downfall of Babylonia: <b>“That says to the deep [<i>latzula</i>]: Be dry, and I will dry up your rivers”</b> (Isaiah 44:27). <b>Immediately</b> those messengers, in the form of horses, <b>filled with anger</b> and <b>became gray, and</b> those who were <b>red became white. Rav Pappa says: Conclude from it</b> that seeing <b>a white horse</b> in a dream <b>is a good</b> portent <b>for</b> that <b>dream, </b> as it presages peace and quiet."
        },
        {
          "verseLocation": "Esther 2:9",
          "verseText": "“And the seven maids",
          "talmudLocation": "Megillah 13a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-15",
          "talmudFullText": "The verse states: <b>“And the seven maids</b> chosen to be given her out of the king’s house” (Esther 2:9). <b>Rava said: She would</b> have a separate maid attend her each day, and she would <b>count the days of the week by them, </b> so she was always aware when Shabbat was. The verse continues: <b>“And he advanced her and her maids</b> to the best place in the house of the women. ” <b>Rav said: </b> The advancement in the verse signals <b>that he fed her food of Jews, </b> i.e., kosher food."
        },
        {
          "verseLocation": "Esther 2:12",
          "verseText": "“Six months with oil of myrrh”",
          "talmudLocation": "Megillah 13a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-18",
          "talmudFullText": "The verse states: <b>“Six months with oil of myrrh”</b> (Esther 2:12). The Talmud asks: <b>What is “oil of myrrh”? R' Ḥiyya bar Abba said: </b> It is the aromatic oil called <b><i>setakt</i>. Rav Huna said: </b> It is a cosmetic <b>oil</b> derived <b>from olives that have not</b> yet <b>reached one-3rd</b> of their growth. <b>It is</b> similarly <b>taught</b> in a <i>baraita</i>: <b>R' Yehuda says: <i>Anpakinon</i></b> is <b>the oil of olives that have not reached one-3rd</b> of their growth. <b>And why is it smeared</b> on the body? Because <b>it removes the hair and softens the skin. </b>"
        },
        {
          "verseLocation": "Esther 2:12",
          "verseText": "Six months with oil of myrrh,",
          "talmudLocation": "Menachot 86a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/86a#section-3",
          "talmudFullText": "§ The Talmud digresses to discuss oil of myrrh: In describing the treatments provided to the women in preparation for their meeting with King Ahasuerus, the verse states: “For so were the days of their anointing accomplished: <b>Six months with oil of myrrh, </b> and six months with sweet odors and with other ointments of the women” (Esther 2:12). The Talmud asks: <b>What is “oil of myrrh”? Rav Huna bar Ḥiyya says: </b> It is the aromatic oil called <b><i>setakhta</i>. Rav Yirmeya bar Abba says: </b> It is <b>an oil</b> derived <b>from olives that have not</b> yet <b>reached one-3rd</b> of their growth; the acidic oil is effective as a depilatory."
        },
        {
          "verseLocation": "Esther 2:12",
          "verseText": "“Six months with shemen hamor ”",
          "talmudLocation": "Moed Katan 9b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/9b#section-18",
          "talmudFullText": "With regard to applying lime to one’s body, <b>Rav Yehuda said: The daughters of Israel who reached</b> physical <b>maturity, but had not</b> yet <b>reached the age</b> of majority, i.e., girls that were less than twelve years of age, and therefore embarrassed by their precocious physical development, would seek to remove the excess hair from their bodies. <b>The poor</b> among them would <b>smear their</b> skin <b>with lime</b> in order to remove the hair. <b>The wealthy ones</b> would <b>smear themselves with fine flour</b> for this purpose, <b>and the daughters of kings would smear themselves with <i>shemen hamor</i>. As it is stated</b> with regard to the women who were brought to King Ahasuerus: <b>“Six months with <i>shemen hamor</i>”</b> (Esther 2:12)."
        },
        {
          "verseLocation": "Esther 2:12",
          "verseText": "six months with shemen hamor ”",
          "talmudLocation": "Pesachim 43a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/43a#section-1",
          "talmudFullText": "<b>who reached</b> physical <b>maturity, but had not</b> yet <b>reached the age</b> of majority, and women who sought to remove hair for cosmetic purposes: <b>They would smear daughters of the poor with lime; they would smear daughters of the wealthy with fine flour; they would smear daughters of kings with <i>shemen hamor</i>, as it was stated: </b> “For so were the days of their anointing filled, <b>six months with <i>shemen hamor</i>”</b> (Esther 2:12)."
        },
        {
          "verseLocation": "Esther 2:12",
          "verseText": "six months with shemen hamor ”",
          "talmudLocation": "Shabbat 80b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/80b#section-2",
          "talmudFullText": "We learned in the Mishnah: The measure that determines liability for carrying out <b>lime</b> is <b>equivalent</b> to that which is used <b>to spread</b> as a depilatory on the smallest of girls. A <i>tanna</i> <b>taught</b> in a <i>Tosefta</i>: In a measure <b>equivalent</b> to that which is used <b>to spread on the finger</b> of <b>the smallest of girls, </b> who would use lime to soften and pamper the skin. <b>Rav Yehuda said</b> that <b>Rav said</b> that initially, lime was used for a different purpose. It was used for <b>daughters of Israel who reached</b> physical <b>maturity, but had not</b> yet <b>reached the age</b> of maturity, and women who sought to remove hair for cosmetic purposes. <b>They would smear daughters of the poor with lime; they would smear daughters of the wealthy with fine flour; they would smear daughters of kings with <i>shemen hamor</i>, as it was stated: </b> “For so were the days of their anointing filled, <b>six months with <i>shemen hamor</i>”</b> (Esther 2:12). The Talmud asks: <b>What is <i>shemen hamor</i>? Rav Huna bar Ḥiyya said: <i>Setaket</i>. Rav Yirmeya bar Abba said: </b> It is <b>olive oil</b> extracted from an olive <b>that</b> has <b>not</b> yet <b>reached a 3rd</b> of its growth; the acidic oil is effective as a depilatory. <b>It was taught</b> in a <i>baraita</i>: <b>R' Yehuda says</b> that <b><i>anfiknon</i></b> is <b>olive oil</b> from an olive <b>that has not reached a 3rd</b> of its growth. <b>And why is it spread</b> on the body? Because <b>it removes the hair and pampers the skin. </b>"
        },
        {
          "verseLocation": "Esther 2:14",
          "verseText": "“In the evening she went, and in the morning she returned”",
          "talmudLocation": "Megillah 13a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-19",
          "talmudFullText": "The verse states: <b>“In the evening she went, and in the morning she returned”</b> (Esther 2:14). <b>R' Yoḥanan said: From the</b> implicit <b>criticism of that wicked man, </b> Ahasuerus, who cohabited with many women, <b>we have</b> incidentally <b>learned his praise</b> as well, <b>that he would not have sex during the day, </b> but in a more modest fashion at night."
        },
        {
          "verseLocation": "Esther 2:15",
          "verseText": "“And Esther obtained favor",
          "talmudLocation": "Megillah 13a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-20",
          "talmudFullText": "The verse states: <b>“And Esther obtained favor</b> in the sight of all those who looked upon her” (Esther 2:15). <b>R' Elazar said: This teaches that she appeared to each and every one as if</b> she were a member of <b>his</b> own <b>nation, </b> and therefore she obtained favor in the eyes of all. The next verse states: <b>“So Esther was taken to King Ahasuerus into his royal house in the 10th month, which is the month Tevet”</b> (Esther 2:16). It was by act of divine providence that Esther was taken to Ahasuerus in a cold winter <b>month, in which the body takes pleasure in</b> the warmth of <b>another body, </b> and therefore she found favor in his eyes."
        },
        {
          "verseLocation": "Esther 2:15",
          "verseText": "the Divine Spirit, as it is stated: “And Esther obtained favor in the sight of all those who looked upon her”",
          "talmudLocation": "Megillah 7a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/7a#section-12",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> that <b>R' Eliezer says: </b> The book of <b>Esther was said with</b> the inspiration of <b>the Holy Spirit, as it is stated: “And Haman thought in his heart”</b> (Esther 6:6). If the book of Esther was not divinely inspired, how was it known what Haman thought in his heart? <b>R' Akiva says: </b> The book of <b>Esther was said with</b> the inspiration of <b>the Holy Spirit, as it is stated: “And Esther obtained favor in the sight of all those who looked upon her”</b> (Esther 2:15); this could have been known only through Holy Spirit."
        },
        {
          "verseLocation": "Esther 2:16",
          "verseText": "“So Esther was taken to King Ahasuerus into his royal house in the tenth month, which is the month Tevet”",
          "talmudLocation": "Megillah 13a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-20",
          "talmudFullText": "The verse states: <b>“And Esther obtained favor</b> in the sight of all those who looked upon her” (Esther 2:15). <b>R' Elazar said: This teaches that she appeared to each and every one as if</b> she were a member of <b>his</b> own <b>nation, </b> and therefore she obtained favor in the eyes of all. The next verse states: <b>“So Esther was taken to King Ahasuerus into his royal house in the 10th month, which is the month Tevet”</b> (Esther 2:16). It was by act of divine providence that Esther was taken to Ahasuerus in a cold winter <b>month, in which the body takes pleasure in</b> the warmth of <b>another body, </b> and therefore she found favor in his eyes."
        },
        {
          "verseLocation": "Esther 2:16",
          "verseText": "“So Esther was taken to the king Ahasuerus into his royal house in the tenth month, which is the month of Tevet”",
          "talmudLocation": "Rosh Hashanah 7a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/7a#section-8",
          "talmudFullText": "<b>Rather, Ravina said: This matter we did not learn from the Torah of Moses, our teacher; </b> rather, <b>we learned it from the texts of the tradition, </b> i.e., the Prophets and Writings: <b>“On the twenty-4th day of the eleventh month, which is the month of Shevat”</b> (Zechariah 1:7). If Shevat is the eleventh month, Nisan must be the first month. <b>Rabba bar Ulla said: </b> It is derived <b>from here, </b> as it is stated: <b>“So Esther was taken to the king Ahasuerus into his royal house in the 10th month, which is the month of Tevet”</b> (Esther 2:16)."
        },
        {
          "verseLocation": "Esther 2:17",
          "verseText": "“And the king loved Esther more than all the women, and she obtained grace and favor in his sight more than all the virgins”",
          "talmudLocation": "Megillah 13a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-21",
          "talmudFullText": "The verse states: <b>“And the king loved Esther more than all the women, and she obtained grace and favor in his sight more than all the virgins”</b> (Esther 2:17). <b>Rav said: </b> This double language indicates that if <b>he wanted to taste</b> in her <b>the taste of a virgin</b> during sex, <b>he tasted</b> it, and if he wanted to experience <b>the taste of a non-virgin, he tasted</b> it, and therefore he loved her more than all the other women."
        },
        {
          "verseLocation": "Esther 2:18",
          "verseText": "“Then the king made a great feast",
          "talmudLocation": "Megillah 13a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-22",
          "talmudFullText": "The verse states: <b>“Then the king made a great feast</b> for all his princes and his servants, even Esther’s feast” (Esther 2:18). The Talmud explains that this was part of an attempt to have Esther reveal her true identity. <b>He made</b> a great <b>feast</b> in her honor, <b>but she did not reveal</b> her identity <b>to him. He lowered the taxes [<i>karga</i>]</b> in her name, <b>but</b> still <b>she did not reveal</b> it <b>to him. He sent gifts [<i>pardishenei</i>]</b> to the ministers in her name, <b>but</b> even so <b>she did not reveal</b> it <b>to him. </b>"
        },
        {
          "verseLocation": "Esther 2:19",
          "verseText": "“And when the virgins were gathered together the second time",
          "talmudLocation": "Megillah 13a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-23",
          "talmudFullText": "The verse states: <b>“And when the virgins were gathered together the second time</b> and Mordecai sat in the king’s gate” (Esther 2:19). The Talmud explains: The reason Ahasuerus gathered the women together was that <b>he went</b> and <b>took advice from Mordecai</b> as to what he should do to get Esther to reveal her identity. Mordecai <b>said</b> to him: As a rule, <b>a woman is jealous only of the thigh of another</b> woman. Therefore, you should take for yourself additional women. <b>But even so she did not reveal</b> her origins <b>to him, as it is written: “Esther had not yet made known her kindred</b> nor her people” (Esther 2:20)."
        },
        {
          "verseLocation": "Esther 2:20",
          "verseText": "her people”",
          "talmudLocation": "Megillah 13a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-11",
          "talmudFullText": "<b>R' Yehuda</b> differs and <b>says: Hadassah was her</b> real <b>name. Why</b> then <b>was she called Esther? Because she concealed [<i>masteret</i>] the truth</b> about herself, <b>as it is stated: “Esther had not yet made known</b> her kindred nor <b>her people”</b> (Esther 2:20)."
        },
        {
          "verseLocation": "Esther 2:20",
          "verseText": "to him, as it is written: “Esther had not yet made known her kindred",
          "talmudLocation": "Megillah 13a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13a#section-23",
          "talmudFullText": "The verse states: <b>“And when the virgins were gathered together the second time</b> and Mordecai sat in the king’s gate” (Esther 2:19). The Talmud explains: The reason Ahasuerus gathered the women together was that <b>he went</b> and <b>took advice from Mordecai</b> as to what he should do to get Esther to reveal her identity. Mordecai <b>said</b> to him: As a rule, <b>a woman is jealous only of the thigh of another</b> woman. Therefore, you should take for yourself additional women. <b>But even so she did not reveal</b> her origins <b>to him, as it is written: “Esther had not yet made known her kindred</b> nor her people” (Esther 2:20)."
        },
        {
          "verseLocation": "Esther 2:20",
          "verseText": "“For Esther adhered to the words of Mordecai,",
          "talmudLocation": "Megillah 13b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-7",
          "talmudFullText": "§ The Talmud returns to its exposition of the Megilla. The verse states: <b>“For Esther adhered to the words of Mordecai, </b> as she did when she was brought up with him” (Esther 2:20). <b>R' Yirmeya said: </b> This teaches <b>that she would show</b> discharges of her <b>menstrual blood to the rabbis</b> to inquire whether she was pure or impure. The verse continues: <b>“As she did when she was brought up with him”</b> (Esther 2:20). <b>Rabba bar Lima said in the name of Rav: </b> This means <b>that she</b> maintained a relationship with Mordecai, as she <b>would arise from the lap of Ahasuerus, immerse herself</b> in a ritual bath, <b>and sit in the lap of Mordecai. </b>"
        },
        {
          "verseLocation": "Esther 2:21",
          "verseText": "became angry,",
          "talmudLocation": "Megillah 13b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-8",
          "talmudFullText": "The Megilla continues: <b>“In those days, while Mordecai sat in the king’s gate, </b> two of the king’s chamberlains, <b>Bigthan and Teresh, </b> of those that guarded the doors, <b>became angry, </b> and sought to lay hands on the king Ahasuerus” (Esther 2:21). <b>R' Ḥiyya bar Abba said</b> that <b>R' Yoḥanan said: God caused a master to become angry with his servants</b> in order <b>to fulfill the will of a righteous man. And who is this? </b> It is <b>Joseph, as it is stated</b> in the chief butler’s account of how Pharaoh had become angry with him and with the chief baker and sent them to jail: <b>“And there was with us there a young man, a Hebrew”</b> (Genesis 41:12)."
        },
        {
          "verseLocation": "Esther 2:22",
          "verseText": "“And Esther reported it to the king in the name of Mordecai”",
          "talmudLocation": "Chullin 104b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/104b#section-10",
          "talmudFullText": "<b>Rather, this</b> is what the Mishnah <b>teaches us: Who is the first <i>tanna</i>? </b> It is <b>R' Yosei. </b> The identification is important, since <b>whoever reports a statement in the name of the one who said it brings redemption to the world. As it is stated</b> with respect to the incident of Bigthan and Teresh: <b>“And Esther reported it to the king in the name of Mordecai”</b> (Esther 2:22), and Mordecai was later rewarded for saving the king’s life, paving the way for the miraculous salvation."
        },
        {
          "verseLocation": "Esther 2:22",
          "verseText": "it is written: “And the matter became known to Mordecai”",
          "talmudLocation": "Megillah 13b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-9",
          "talmudFullText": "Similarly, God also caused <b>servants</b> to become angry <b>with their master in order to perform a miracle for</b> another <b>righteous man. And who is he? </b> It is <b>Mordecai, as</b> with regard to the plot to kill the king <b>it is written: “And the matter became known to Mordecai”</b> (Esther 2:22)."
        },
        {
          "verseLocation": "Esther 2:22",
          "verseText": "“And Esther reported it to the king in the name of Mordecai”",
          "talmudLocation": "Megillah 15a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-20",
          "talmudFullText": "<b>And R' Elazar</b> further <b>said</b> that <b>R' Ḥanina said: Whoever reports a saying in the name of he who said it brings redemption to the world. As it is stated</b> with respect to the incident of Bigthan and Teresh: <b>“And Esther reported it to the king in the name of Mordecai”</b> (Esther 2:22), and this eventually brought redemption, as Mordecai was later rewarded for saving the king’s life, paving the way for the miraculous salvation."
        },
        {
          "verseLocation": "Esther 2:22",
          "verseText": "“And the thing became known to Mordecai”",
          "talmudLocation": "Megillah 7a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/7a#section-13",
          "talmudFullText": "<b>R' Meir says: </b> The book of <b>Esther was said with</b> the inspiration of <b>the Holy Spirit, as it is stated</b> with regard to the conspiracy of Bigtan and Teresh against Ahasuerus: <b>“And the thing became known to Mordecai”</b> (Esther 2:22). This too could have been known only through Holy Spirit. <b>R' Yosei ben Durmaskit says: </b> The book of <b>Esther was said with</b> the inspiration of <b>the Holy Spirit, as it is stated: “But they did not lay their hands on the plunder”</b> (Esther 9:15). The only way that could have been stated with certainty is through Holy Spirit."
        },
        {
          "verseLocation": "Esther 2:23",
          "verseText": "“And when inquiry was made of the matter, it was found to be so”",
          "talmudLocation": "Megillah 13b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-11",
          "talmudFullText": "While planning their plot, one of them <b>said to</b> the other: <b>But my post and your post are not identical. </b> How then can one of us leave our position to succeed in our plot to poison the king? The other one <b>said to him: I will guard</b> both <b>my post and your post. And this is as it is written</b> with regard to the king’s verifying Mordecai’s revelation of the plan to kill the king: <b>“And when inquiry was made of the matter, it was found to be so”</b> (Esther 2:23); it was discovered <b>that they were not</b> both <b>found at their posts. </b>"
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Esther 3:1",
          "verseText": "“After these events",
          "talmudLocation": "Megillah 13b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-12",
          "talmudFullText": "The verse describes when the rest of the events of the Megilla occurred: <b>“After these events</b> did King Ahasuerus promote Haman” (Esther 3:1). The Talmud asks: <b>After what</b> particular events? <b>Rava said: </b> Only <b>after God created a remedy for the blow</b> and set in place the chain of events that would lead to the miraculous salvation was Haman appointed, setting the stage for the decree against the Jews to be issued."
        },
        {
          "verseLocation": "Esther 3:1",
          "verseText": "Rabbi Yosei says: From “After these things”",
          "talmudLocation": "Megillah 19a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-5",
          "talmudFullText": "Beginning <b>from where must a person read the Megilla in order to fulfill his obligation? R' Meir says: </b> He must read <b>all of it. R' Yehuda says: </b> He need read only <b>from</b> “There was <b>a certain Jew”</b> (Esther 2:5). <b>R' Yosei says: From “After these things”</b> (Esther 3:1)."
        },
        {
          "verseLocation": "Esther 3:2",
          "verseText": "because “Mordecai did not bow down, nor prostrate himself before him”",
          "talmudLocation": "Megillah 19a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-17",
          "talmudFullText": "<b>And the one who said</b> that it needs to be read <b>from “After these things”</b> interprets the verse in this way: <b>That which Haman “saw” in that he became incensed with all the Jews. “Concerning this matter”</b> was <b>because “Mordecai did not bow down, nor prostrate himself before him”</b> (Esther 3:2). <b>“And that which had befallen them”</b> is referring to the fact that <b>“he and his sons were hanged on the gallows”</b> (Esther 9:25). Accordingly, the Megilla must be read from the first mention of Haman."
        },
        {
          "verseLocation": "Esther 3:6",
          "verseText": "“But it seemed contemptible in his eyes to lay his hand on Mordecai alone;",
          "talmudLocation": "Megillah 13b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-14",
          "talmudFullText": "The verse states: <b>“But it seemed contemptible in his eyes to lay his hand on Mordecai alone; </b> for they had made known to him the people of Mordecai; wherefore Haman sought to destroy all the Jews that were throughout the whole kingdom of Ahasuerus, even the people of Mordecai” (Esther 3:6). <b>Rava said: At first</b> he wanted to lay his hands on <b>Mordecai alone, and in the end on the people of Mordecai. And who were</b> the people of Mordecai? They were <b>the rabbis, </b> i.e., Mordecai’s special people. <b>And ultimately</b> he sought to bring harm <b>on all the Jews. </b>"
        },
        {
          "verseLocation": "Esther 3:7",
          "verseText": "“They cast pur , that is, the lot”",
          "talmudLocation": "Megillah 13b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-15",
          "talmudFullText": "The verse states: <b>“They cast <i>pur</i>, that is, the lot”</b> (Esther 3:7). A Sage <b>taught</b> the following <i>baraita</i>: <b>Once the lot fell on the month of Adar, he, </b> Haman, <b>greatly rejoiced, </b> for he saw this as a favorable omen for the execution of his plans. <b>He said: The lot has fallen for me in the month that Moses died, </b> which is consequently a time of calamity for the Jewish people. <b>But he did not know that</b> not only <b>did</b> Moses <b>die on the 7th of Adar, </b> but <b>he was</b> also <b>born on the 7th of Adar, </b> and therefore it is also a time of rejoicing for the Jewish people."
        },
        {
          "verseLocation": "Esther 3:7",
          "verseText": "from here: “He cast pur , that is, the lot, before Haman from day to day, and from month to month, to the twelfth month, that is, the month of Adar”",
          "talmudLocation": "Rosh Hashanah 7a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/7a#section-9",
          "talmudFullText": "<b>Rav Kahana said: </b> It is derived <b>from here: “On the 4th day of the 9th month, in Kislev”</b> (Zechariah 7:1). <b>Rav Aḥa bar Ya’akov said: </b> It is derived <b>from here, </b> as it is stated: <b>“And the scribes of the king were called at that time in the 3rd month, that is the month of Sivan”</b> (Esther 8:9). <b>Rav Ashi said: </b> It is derived <b>from here: “He cast <i>pur</i>, that is, the lot, before Haman from day to day, and from month to month, to the twelfth month, that is, the month of Adar”</b> (Esther 3:7). <b>And if you wish, say</b> that it is derived <b>from here: “In the first month, that is, the month of Nisan”</b> (Esther 3:7)."
        },
        {
          "verseLocation": "Esther 3:8",
          "verseText": "“There is [ yeshno ] one",
          "talmudLocation": "Megillah 13b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-16",
          "talmudFullText": "Haman said to Ahasuerus: <b>“There is [<i>yeshno</i>] one</b> people scattered abroad [<i>mefuzar</i>] and dispersed [<i>meforad</i>] among the peoples in all the provinces of your kingdom; and their laws are diverse from those of every people; nor do they keep the king’s laws; therefore it does not profit the king to tolerate them” (Esther 3:8). <b>Rava said: There was none who knew how to slander like Haman, </b> as in his request to the king he included responses to all the reasons Ahasuerus might be reluctant to destroy the Jewish people. <b>He said to</b> Ahasuerus: <b>Let us destroy them. </b> Ahasuerus <b>said to him: I am afraid of their God, lest He do to me as He did to those</b> who stood against them <b>before me. </b> Haman <b>said to him: They have been asleep [<i>yashnu</i>] with respect to the mitzvot, </b> having ceased to observe the mitzvot, and, therefore there is no reason to fear."
        },
        {
          "verseLocation": "Esther 3:8",
          "verseText": "“in all the provinces of your kingdom”",
          "talmudLocation": "Megillah 13b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-18",
          "talmudFullText": "Haman continued with his next response as expressed in the verse: <b>Perhaps you will say</b> that <b>I am making a bald spot in your kingdom, </b> i.e., you fear that if an entire nation is wiped out there will be a desolate area within the kingdom. There is no need to worry, though, as <b>they are scattered [<i>mefuzarin</i>] among the peoples, </b> and eradicating them will not result in the creation of an unpopulated zone in the area where they had once lived. Furthermore, <b>perhaps you will say</b> that <b>there is benefit from them; </b> but this nation is <b><i>meforad</i>, like this</b> barren <b>mule [<i>pereida</i>] that cannot bear offspring, </b> and there is no benefit to be gained from them. And <b>perhaps you will say</b> that <b>there is</b> at least <b>a province</b> that is filled <b>with them. Therefore the verse states</b> that they are scattered <b>“in all the provinces of your kingdom”</b> (Esther 3:8), and they do not inhabit one place."
        },
        {
          "verseLocation": "Esther 3:8",
          "verseText": "“And their laws are diverse from those of every people”",
          "talmudLocation": "Megillah 13b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-19",
          "talmudFullText": "Haman continued: <b>“And their laws are diverse from those of every people”</b> (Esther 3:8), <b>as they do not eat from our</b> food, <b>nor do they marry from our</b> women, <b>nor do they marry off</b> their women <b>to us. “Nor do they keep the king’s laws”</b> (Esther 3:8). <b>They spend the entire year</b> in idleness, as they are constantly saying: <b><i>Shehi pehi</i>, </b> an acronym for: It is Shabbat today [<i>Shabbat hayom</i>]; it is Passover today [<i>Pesaḥ hayom</i>]. The verse continues: <b>“Therefore it does not profit the king to tolerate them, ” as they eat and drink and scorn the throne. </b> And a proof of this is that <b>even if a fly falls into the cup of one of them, he will throw</b> the fly <b>out and drink</b> the wine <b>it</b> fell into, <b>but if my master the king were to touch the glass of one of them, he would throw it to the ground, and would not drink it, </b> since it is prohibited to drink wine that was touched by a non-Jew."
        },
        {
          "verseLocation": "Esther 3:9",
          "verseText": "ten thousand talents of silver",
          "talmudLocation": "Megillah 13b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-20",
          "talmudFullText": "Therefore, Haman concluded: <b>“If it please the king, let it be written that they be destroyed, and</b> I will weigh out <b>ten thousand talents of silver</b> into the hands of those who have the charge of the business, to bring it into the king’s treasuries” (Esther 3:9). <b>Reish Lakish said: It is revealed and known</b> in advance <b>to the One Who spoke and the world came into being, that in the future Haman was going to weigh out shekels against the Jewish people; therefore, He</b> arranged that the Jewish people’s <b>shekels</b> that were given to the Temple <b>preceded</b> Haman’s <b>shekels. </b>"
        },
        {
          "verseLocation": "Esther 3:10",
          "verseText": "“And the king removed his ring",
          "talmudLocation": "Megillah 14a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14a#section-3",
          "talmudFullText": "§ The verse states: <b>“And the king removed his ring</b> from his hand” (Esther 3:10). <b>R' Abba bar Kahana said: The removal of</b> Ahasuerus’s <b>ring</b> for the sealing of Haman’s decree <b>was more effective than the forty-eight prophets and the seven prophetesses who prophesied on behalf of the Jewish people. As, they were all unable to return</b> the Jewish people <b>to the right way, but the removal of</b> Ahasuerus’s <b>ring returned them to the right way, </b> since it brought them to repentance."
        },
        {
          "verseLocation": "Esther 3:11",
          "verseText": "“And the king said to Haman: The silver is given to you; the people also, to do with them as it seems good to you”",
          "talmudLocation": "Megillah 13b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-22",
          "talmudFullText": "Ahasuerus responded to Haman’s request: <b>“And the king said to Haman: The silver is given to you; the people also, to do with them as it seems good to you”</b> (Esther 3:11). <b>R' Abba said: </b>"
        },
        {
          "verseLocation": "Esther 3:15",
          "verseText": "“But when the wicked man rules, the people mourn”; this is Haman, as it is written: “But the city of Shushan was perplexed”",
          "talmudLocation": "Megillah 11a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-8",
          "talmudFullText": "<b>Rava introduced this passage with an introduction from here: “When the righteous are on the increase, the people rejoice; but when the wicked man rules, the people mourn”</b> (Proverbs 29:2). <b>“When the righteous are on the increase, the people rejoice”; this is Mordecai and Esther, as it is written: “And the city of Shushan rejoiced and was glad”</b> (Esther 8:15). <b>“But when the wicked man rules, the people mourn”; this is Haman, as it is written: “But the city of Shushan was perplexed”</b> (Esther 3:15)."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Esther 4:1",
          "verseText": "“When Mordecai perceived all that was done,",
          "talmudLocation": "Megillah 15a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-9",
          "talmudFullText": "§ The Talmud returns to its explanation of the verses of the book of Esther. The verse states: <b>“When Mordecai perceived all that was done, </b> Mordecai rent his clothes, and put on sackcloth with ashes, and went out into the midst of the city, and cried with a loud and bitter cry” (Esther 4:1). The Talmud asks: <b>What did</b> Mordecai <b>say</b> when he cried out? <b>Rav said: </b> He said that <b>Haman has risen above Ahasuerus, </b> for he saw that Haman had become even stronger than Ahasuerus himself, and that he controlled all affairs of the empire. <b>And Shmuel said: The upper King has prevailed over the lower king, </b> saying this euphemistically and insinuating just the opposite. In other words, it would appear that Ahasuerus, the lower king, has prevailed over the higher King, God in Heaven, Who desires good for the Jewish people."
        },
        {
          "verseLocation": "Esther 4:2",
          "verseText": "It says: “For none may enter within the king’s gate clothed with sackcloth”",
          "talmudLocation": "Berakhot 62b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/62b#section-24",
          "talmudFullText": "<b>R' Yosei bar Yehuda, says: This</b> <i>a fortiori</i> inference <b>is unnecessary. </b> It could be otherwise derived. <b>It says: “For none may enter within the king’s gate clothed with sackcloth”</b> (Esther 4:2). <b>This matter</b> can be inferred <b><i>a fortiori</i>: Just as sackcloth, which is</b> generally <b>not</b> considered <b>repulsive before</b> one who is <b>flesh and blood, is</b> forbidden within the king’s gate, <b>all the more so spitting, which is repulsive, </b> should be forbidden <b>before the King of Kings. </b>"
        },
        {
          "verseLocation": "Esther 4:4",
          "verseText": "“Then the queen was exceedingly distressed” [ vatitḥalḥal ]",
          "talmudLocation": "Megillah 15a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-10",
          "talmudFullText": "The verse states: <b>“Then the queen was exceedingly distressed” [<i>vatitḥalḥal</i>]</b> (Esther 4:4). The Talmud asks: <b>What is</b> the meaning of <b><i>vatitḥalḥal</i>? Rav said: </b> This means <b>that she began to menstruate</b> out of fear, as the cavities, <i>ḥalalim</i>, of her body opened. <b>And R' Yirmeya said: Her bowels were loosened, </b> also understanding the verse as referring to her bodily cavities."
        },
        {
          "verseLocation": "Esther 4:4",
          "verseText": "which is written: “Then the queen was exceedingly distressed [ vatitḥalḥal ]”",
          "talmudLocation": "Niddah 71a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/71a#section-5",
          "talmudFullText": "§ The Mishnah teaches that <b>Beit Shammai say: </b> The status of all women when they die is as though they were menstruating women. The Talmud asks: <b>What is the reason</b> for the opinion <b>of Beit Shammai? If we say</b> that their opinion is <b>due to</b> that <b>which is written: “Then the queen was exceedingly distressed [<i>vatitḥalḥal</i>]”</b> (Esther 4:4), this is difficult. The Talmud first explains the derivation. <b>And Rav said: </b> This <b>teaches that she began to menstruate</b> out of fear, as the cavities [<i>ḥalalim</i>] of her body opened. <b>Here too, </b> when a woman is about to die, <b>due to the fear of the Angel of Death she sees</b> blood. This is difficult, as <b>didn’t we learn</b> in a Mishnah (39a) <b>that trepidation eliminates</b> the flow of menstrual <b>blood? </b> The Talmud answers: <b>This</b> is <b>not difficult. Anxiety</b> generated by extended worry <b>contracts</b> the muscles and prevents the blood from flowing, but sudden <b>fear relaxes</b> the muscles and causes the blood to flow."
        },
        {
          "verseLocation": "Esther 4:4",
          "verseText": "Yes, as it is written: “And the Queen was exceedingly pained”",
          "talmudLocation": "Sotah 20b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/20b#section-12",
          "talmudFullText": "<b>Abaye said: </b> The woman is removed not due to a concern that she will die there but <b>lest</b> the fear of the water cause her to <b>begin to menstruate, </b> and it is prohibited for a menstruating woman to enter the Levite camp. The Talmud asks: <b>Is this to say that fear causes</b> muscular <b>relaxation</b> and menstrual bleeding? The Talmud responds: <b>Yes, as it is written: “And the Queen was exceedingly pained”</b> (Esther 4:4), <b>and Rav says: </b> This means that <b>she began to menstruate. </b> The Talmud asks: <b>But didn’t we learn</b> in a Mishnah (<i>Nidda</i> 39a) that <b>trepidation eliminates</b> the flow of menstrual <b>blood? </b> Presumably, the <i>sota</i> experiences trepidation. The Talmud answers: <b>Trepidation</b> generated by extended worry <b>contracts</b> the muscles and prevents the blood from flowing, but sudden <b>fear relaxes</b> the muscles and causes the blood to flow."
        },
        {
          "verseLocation": "Esther 4:5",
          "verseText": "because it is written: “And Esther called for Hatach,",
          "talmudLocation": "Bava Batra 4a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/4a#section-9",
          "talmudFullText": "The Talmud asks: <b>And from where do we</b> derive <b>that Daniel was punished? If we say</b> we know this <b>because it is written: “And Esther called for Hatach, </b> one of the king’s chamberlains, whom he had appointed to attend upon her” (Esther 4:5), <b>and Rav said: Hatach is Daniel. This works out well according to the one who says</b> Daniel was called Hatach because <b>they cut him down [<i>ḥatakh</i>] from his greatness</b> and turned him into a minor attendant. <b>But according to the one who says</b> he was called Hatach <b>because all governmental matters were determined [<i>ḥatakh</i>] according to his word, what is there to say? </b> What punishment did he receive? The Talmud answers: His punishment was <b>that they threw him into the den of lions. </b>"
        },
        {
          "verseLocation": "Esther 4:5",
          "verseText": "“Then Esther called for Hathach,",
          "talmudLocation": "Megillah 15a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-11",
          "talmudFullText": "The verse states: <b>“Then Esther called for Hathach, </b> one of the king’s chamberlains, whom he had appointed to attend upon her” (Esther 4:5). <b>Rav said: Hathach is</b> in fact the prophet <b>Daniel. And why was he called Hathach? Because he was cut down [<i>ḥatakh</i>] from his greatness</b> during Ahasuerus’s reign, as he was demoted from his high position. Previously he had served as a senior minister, and now he had become Esther’s steward. <b>And Shmuel</b> expounded the name Hathach as derived from <i>ḥatakh</i> in the opposite sense, as he <b>said: </b> Daniel was called Hathach <b>because all the affairs of the kingdom were decided [<i>neḥtakhin</i>] by his word. </b>"
        },
        {
          "verseLocation": "Esther 4:5",
          "verseText": "“To know what this [ zeh ] was, and why it [ zeh ] was”",
          "talmudLocation": "Megillah 15a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-12",
          "talmudFullText": "The verse continues to relate that Esther sent Hathach to Mordecai after hearing about the decree: <b>“To know what this [<i>zeh</i>] was, and why it [<i>zeh</i>] was”</b> (Esther 4:5). <b>R' Yitzḥak said</b> that Esther <b>sent</b> a message <b>to</b> Mordecai, saying: <b>Perhaps the Jews have transgressed the five books of the Torah, as it is written</b> with regard to the two tablets: <b>“On this [<i>zeh</i>] side and on the other [<i>zeh</i>] side were they written”</b> (Exodus 32:15)."
        },
        {
          "verseLocation": "Esther 4:12",
          "verseText": "“And they told Esther’s words to Mordecai”",
          "talmudLocation": "Megillah 15a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-13",
          "talmudFullText": "The verse states: <b>“And they told Esther’s words to Mordecai”</b> (Esther 4:12), <b>but he, </b> Hathach himself, <b>did not go to</b> tell <b>him</b> directly. The Talmud explains: <b>From here</b> we see that <b>one does not bring back a sad report. </b> If one has nothing positive to say, it is best for him to remain silent. This explains why Hathach himself did not report the information to Mordecai, and Esther’s words had to be delivered by other messengers."
        },
        {
          "verseLocation": "Esther 4:16",
          "verseText": "not according to the custom”",
          "talmudLocation": "Megillah 15a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-14",
          "talmudFullText": "Esther sent a message to Mordecai: <b>“Go, gather together all the Jews</b> who are present in Shushan, and fast for me, and neither eat nor drink for three days, night and day; I also and my maidens will fast likewise, and so will I go in to the king, <b>not according to the custom”</b> (Esther 4:16). <b>R' Abba said: It will not be according to</b> my usual <b>custom, for every day until now</b> when I submitted myself to Ahasuerus it was <b>under compulsion, but now</b> I will be submitting myself to him <b>of my</b> own free <b>will. </b> And Esther further said: <b>“And if I perish, I perish”</b> (Esther 4:16). What she meant was: <b>Just as I was lost to my father’s house</b> ever since I was brought here, <b>so too, shall I be lost to you, </b> for after voluntarily having sex with Ahasuerus, I shall be forever forbidden to you."
        },
        {
          "verseLocation": "Esther 4:16",
          "verseText": "but isn’t it written: “Fast for me, and neither eat nor drink",
          "talmudLocation": "Yevamot 121b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/121b#section-3",
          "talmudFullText": "§ The Mishnah stated that <b>R' Meir said: An incident</b> occurred <b>involving a certain</b> individual <b>who fell into the Great Cistern</b> and emerged after three days. It <b>is taught</b> in a <i>baraita</i>: <b>They said to R' Meir: One does not mention miraculous acts</b> to teach general <i>halakha</i>. The Talmud asks: <b>What</b> about that story defines it as an example of <b>miraculous acts? If we say</b> the fact <b>that he did not eat or drink</b> for three days and still survived is miraculous, <b>but isn’t it written: “Fast for me, and neither eat nor drink</b> three days, night or day” (Esther 4:16), demonstrating that one may survive this experience naturally?"
        },
        {
          "verseLocation": "Esther 4:17",
          "verseText": "“So Mordecai passed [ vaya’avor ]”",
          "talmudLocation": "Megillah 15a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-15",
          "talmudFullText": "There is a dispute with regard to the meaning of the verse: <b>“So Mordecai passed [<i>vaya’avor</i>]”</b> (Esther 4:17). <b>Rav said: </b> This means <b>that he passed the first day of Passover as a fast day, </b> understanding the word <i>vaya’avor</i> in the sense of sin [<i>aveira</i>], as by doing so he transgressed the obligation to rejoice on the Festival. <b>And Shmuel said: </b> It means <b>that he crossed over [<i>avar</i>] a stream</b> in order to bring the message to all."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Esther 5:1",
          "verseText": "as it is written: “And it came to pass on the third day that Esther clothed herself in royalty”",
          "talmudLocation": "Megillah 14b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-9",
          "talmudFullText": "<b>Esther</b> was also a prophetess, <b>as it is written: “And it came to pass on the 3rd day that Esther clothed herself in royalty”</b> (Esther 5:1). <b>It should have said: </b> Esther clothed herself in <b>royal garments. Rather, </b> this alludes to the fact <b>that she clothed herself with a divine</b> spirit of <b>inspiration. It is written here: “And she clothed herself, ” and it is written elsewhere: “And the spirit clothed Amasai”</b> (I Chronicles 12:19). Just as there the reference is to being enclothed by a spirit, so too Esther was enclothed by a spirit of Holy Spirit."
        },
        {
          "verseLocation": "Esther 5:1",
          "verseText": "“And it came to pass on the third day, that Esther clothed herself in royalty”",
          "talmudLocation": "Megillah 15a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-16",
          "talmudFullText": "The verse states: <b>“And it came to pass on the 3rd day, that Esther clothed herself in royalty”</b> (Esther 5:1). The Talmud asks: <b>It should have said: </b> Esther clothed herself in <b>royal garments. R' Elazar said</b> that <b>R' Ḥanina said: This teaches that she clothed herself with</b> a <b>divine</b> spirit of <b>inspiration, </b> as <b>it is written here: “And she clothed herself, ” and it is written elsewhere: “And the spirit clothed Amasai”</b> (I Chronicles 12:19). Just as there the reference is to the spirit of Holy Spirit, so too here, the term royalty is referring to the spirit of Holy Spirit."
        },
        {
          "verseLocation": "Esther 5:1",
          "verseText": "“And she stood in the inner court of the king’s house”",
          "talmudLocation": "Megillah 15b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-7",
          "talmudFullText": "§ The Talmud returns to its explanation of the verses of the Megilla. The verse states with regard to Esther: <b>“And she stood in the inner court of the king’s house”</b> (Esther 5:1). <b>R' Levi said: Once she reached the chamber of the idols, </b> which was in the inner court, <b>the Shekhina left her. She</b> immediately <b>said: “My God, my God, why have You forsaken me? ”</b> (Psalms 22:2). <b>Perhaps</b> it is because <b>You judge an unintentional sin as one</b> performed <b>intentionally, and</b> an action <b>done due to</b> circumstances <b>beyond one’s control as</b> one done <b>willingly. </b>"
        },
        {
          "verseLocation": "Esther 5:2",
          "verseText": "“And so it was, that when the king saw Esther the queen",
          "talmudLocation": "Megillah 15b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-9",
          "talmudFullText": "The verse states: <b>“And so it was, that when the king saw Esther the queen</b> standing in the court, that she obtained favor in his sight; and the king held out to Esther the golden scepter that was in his hand” (Esther 5:2). <b>R' Yoḥanan said: Three ministering angels happened to join her at that time: One that raised up her neck, </b> so that she could stand erect, free of shame; <b>one that strung a cord</b> of divine <b>grace around her, </b> endowing her with charm and beauty; <b>and one that stretched the</b> king’s <b>scepter. </b>"
        },
        {
          "verseLocation": "Esther 5:4",
          "verseText": "let the king and Haman come this day to the banquet",
          "talmudLocation": "Megillah 15b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-12",
          "talmudFullText": "The verse states that Esther requested: “If it seem good unto the king, <b>let the king and Haman come this day to the banquet</b> that I have prepared for him” (Esther 5:4). <b>A baraita states</b> in a <i>baraita</i>: <b>What did Esther see to invite Haman</b> to the banquet? <b>R' Elazar says: She hid a snare for him, as it is stated: “Let their table become a snare before them”</b> (Psalms 69:23), as she assumed that she would be able to trip up Haman during the banquet."
        },
        {
          "verseLocation": "Esther 5:6",
          "verseText": "“Then the king said to her” (Esther 5:3), to Esther the queen, “What is your wish, even to half the kingdom, it shall be performed”",
          "talmudLocation": "Megillah 15b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-11",
          "talmudFullText": "The verse states: <b>“Then the king said to her” (Esther 5: 3), to Esther the queen, “What is your wish, even to half the kingdom, it shall be performed”</b> (Esther 5:6). The Talmud comments that Ahasuerus intended only a limited offer: Only <b>half the kingdom, but not the whole kingdom, and not something that would serve as a barrier to the kingdom, </b> as there is one thing to which the kingdom will never agree. <b>And what is that? The building of the Temple; </b> if that shall be your wish, realize that it will not be fulfilled."
        },
        {
          "verseLocation": "Esther 5:11",
          "verseText": "“And Haman recounted to them the glory of his riches, and the multitude of his sons”",
          "talmudLocation": "Megillah 15b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-17",
          "talmudFullText": "The verse states: <b>“And Haman recounted to them the glory of his riches, and the multitude of his sons”</b> (Esther 5:11). The Talmud asks: <b>And how many</b> sons did he in fact have that are referred to as <b>“the multitude of his sons”? Rav said: </b> There were <b>thirty</b> sons; <b>ten</b> of them <b>died</b> in childhood, <b>ten of them were hanged</b> as recorded in the book of Esther, <b>and ten</b> survived and were forced to <b>beg at</b> other people’s <b>doors. </b>"
        },
        {
          "verseLocation": "Esther 5:13",
          "verseText": "“Yet all this avails me nothing”",
          "talmudLocation": "Megillah 15a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-22",
          "talmudFullText": "Haman said: <b>“Yet all this avails me nothing”</b> (Esther 5:13). <b>R' Elazar said</b> that <b>R' Ḥanina said: When Haman saw Mordecai sitting at the king’s gate he said: Yet all this avails me nothing. </b> This may be understood <b>as</b> was suggested <b>by Rav Ḥisda, for Rav Ḥisda said: This one, </b> Mordecai, <b>came as</b> one with the heritage of <b>a rich man [<i>perozebuli</i>], </b> whereas <b>that one, </b> Haman, <b>came</b>"
        },
        {
          "verseLocation": "Esther 5:13",
          "verseText": "“Yet all this avails me nothing”",
          "talmudLocation": "Megillah 15b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-2",
          "talmudFullText": "Haman’s previously quoted statement: <b>“Yet all this avails me nothing”</b> (Esther 5:13), <b>teaches that all the treasures of that wicked one were engraved on his heart, and when he saw Mordecai sitting at the king’s gate, he said: </b> As long as Mordecai is around, <b>all this</b> that I wear on my heart <b>avails me nothing. </b>"
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "Esther 6:1",
          "verseText": "“On that night the sleep of the king was disturbed”",
          "talmudLocation": "Megillah 15b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-20",
          "talmudFullText": "The verse states: <b>“On that night the sleep of the king was disturbed”</b> (Esther 6:1). <b>R' Tanḥum said: </b> The verse alludes to another king who could not sleep; <b>the sleep of the King of the universe, </b> God, <b>was disturbed. And the rabbis say: </b> The sleep of <b>the higher ones, </b> the angels, <b>was disturbed, and</b> the sleep of <b>the lower ones, </b> the Jewish people, <b>was disturbed. Rava said: </b> This should be understood <b>literally: The sleep of King Ahasuerus</b> was disturbed."
        },
        {
          "verseLocation": "Esther 6:1",
          "verseText": "“And he commanded the book of remembrances of the chronicles to be brought”",
          "talmudLocation": "Megillah 15b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-21",
          "talmudFullText": "And this was the reason Ahasuerus could not sleep: <b>A thought occurred to him</b> and <b>he said</b> to himself: <b>What is this before us that Esther has invited Haman? Perhaps they are conspiring against that man, </b> i.e., against me, <b>to kill him. He</b> then <b>said again</b> to himself: <b>If this is so, is there no man who loves me and would inform me</b> of this conspiracy? <b>He</b> then <b>said again</b> to himself: <b>Perhaps there is some man who has done a favor for me and I have not</b> properly <b>rewarded him, and due to that</b> reason <b>people refrain from revealing to me</b> information regarding such plots, as they see no benefit for themselves. <b>Immediately</b> afterward, the verse states: <b>“And he commanded the book of remembrances of the chronicles to be brought”</b> (Esther 6:1)."
        },
        {
          "verseLocation": "Esther 6:1",
          "verseText": "“And they were read",
          "talmudLocation": "Megillah 15b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-22",
          "talmudFullText": "The verse states: <b>“And they were read</b> before the king” (Esther 6:1). The Talmud explains that <b>this</b> passive form: “And they were read,” <b>teaches that they were read</b> miraculously <b>by themselves. </b> It further says: <b>“And it was found written [<i>katuv</i>]”</b> (Esther 6:2). The Talmud asks: Why does the Megilla use the word <i>katuv</i>, which indicates that it was newly written? <b>It should have said: A writing [<i>ketav</i>]</b> was found, which would indicate that it had been written in the past. The Talmud explains: This <b>teaches</b>"
        },
        {
          "verseLocation": "Esther 6:1",
          "verseText": "“On that night”",
          "talmudLocation": "Megillah 19a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-11",
          "talmudFullText": "§ The Mishnah teaches that three rabbis disagree about the question: Beginning <b>from where must a person read the Megilla</b> in order to fulfill his obligation? <b>It is taught</b> in a <i>baraita</i> that there is a 4th opinion as well: <b>R' Shimon bar Yoḥai says: </b> One must start to read from <b>“On that night”</b> (Esther 6:1)."
        },
        {
          "verseLocation": "Esther 6:2",
          "verseText": "“And it was found written [ katuv ]”",
          "talmudLocation": "Megillah 15b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15b#section-22",
          "talmudFullText": "The verse states: <b>“And they were read</b> before the king” (Esther 6:1). The Talmud explains that <b>this</b> passive form: “And they were read,” <b>teaches that they were read</b> miraculously <b>by themselves. </b> It further says: <b>“And it was found written [<i>katuv</i>]”</b> (Esther 6:2). The Talmud asks: Why does the Megilla use the word <i>katuv</i>, which indicates that it was newly written? <b>It should have said: A writing [<i>ketav</i>]</b> was found, which would indicate that it had been written in the past. The Talmud explains: This <b>teaches</b>"
        },
        {
          "verseLocation": "Esther 6:3",
          "verseText": "“Nothing has been done for him”",
          "talmudLocation": "Megillah 16a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-2",
          "talmudFullText": "The verse states that Ahasuerus was told with regard to Mordecai: <b>“Nothing has been done for him”</b> (Esther 6:3). <b>Rava said: It is not because they love Mordecai</b> that the king’s servants said this, <b>but rather because they hate Haman. </b>"
        },
        {
          "verseLocation": "Esther 6:4",
          "verseText": "prepared for him”",
          "talmudLocation": "Megillah 16a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-3",
          "talmudFullText": "The verse states: “Now Haman had come into the outer court of the king’s house, to speak to the king about hanging Mordecai on the gallows that he had <b>prepared for him”</b> (Esther 6:4). A Sage <b>taught</b> in a <i>baraita</i>: This should be understood to mean: On the gallows that <b>he had prepared for himself. </b>"
        },
        {
          "verseLocation": "Esther 6:6",
          "verseText": "the Divine Spirit, as it is stated: “And Haman thought in his heart”",
          "talmudLocation": "Megillah 7a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/7a#section-12",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> that <b>R' Eliezer says: </b> The book of <b>Esther was said with</b> the inspiration of <b>the Holy Spirit, as it is stated: “And Haman thought in his heart”</b> (Esther 6:6). If the book of Esther was not divinely inspired, how was it known what Haman thought in his heart? <b>R' Akiva says: </b> The book of <b>Esther was said with</b> the inspiration of <b>the Holy Spirit, as it is stated: “And Esther obtained favor in the sight of all those who looked upon her”</b> (Esther 2:15); this could have been known only through Holy Spirit."
        },
        {
          "verseLocation": "Esther 6:8",
          "verseText": "that when he elaborated extensively and said:",
          "talmudLocation": "Megillah 7a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/7a#section-15",
          "talmudFullText": "<b>Rava said: There is a refutation for all</b> of these proofs, <b>except for</b> the proof cited by <b>Shmuel, for which there is no refutation. </b> The Talmud elaborates. That <b>which R' Eliezer</b> said with regard to knowledge of what Haman was thinking in his heart can be refuted, as <b>it is</b> based on <b>logical reasoning</b> to conclude that this was his thinking. <b>There was no</b> other <b>person as important to the king as he</b> was; <b>and</b> the fact is <b>that when he elaborated extensively and said: </b> “Let the royal apparel be brought” (Esther 6:8), <b>he said</b> it <b>with himself in mind. </b>"
        },
        {
          "verseLocation": "Esther 6:11",
          "verseText": "“And he proclaimed before him: Thus shall it be done to the man whom the king delights to honor”",
          "talmudLocation": "Megillah 16a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-11",
          "talmudFullText": "The verse states: <b>“And he proclaimed before him: Thus shall it be done to the man whom the king delights to honor”</b> (Esther 6:11). <b>As</b> Haman <b>was taking</b> Mordecai <b>along the street of Haman’s house, </b> Haman’s <b>daughter was standing on the roof and saw</b> the spectacle. <b>She thought</b> to herself that <b>the one who is riding</b> on the horse must be <b>her father, and the one walking before him</b> must be <b>Mordecai. She</b> then <b>took a chamber pot</b> full of feces <b>and cast its</b> contents <b>onto the head of her father, </b> whom she mistakenly took as Mordecai. When Haman <b>raised his eyes</b> in disgust afterward, and looked up at his daughter, <b>she saw that he was her father. </b> In her distress, <b>she fell from the roof to the ground and died. </b>"
        },
        {
          "verseLocation": "Esther 6:11",
          "verseText": "“Then Haman took the apparel and the horse”",
          "talmudLocation": "Megillah 16a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-6",
          "talmudFullText": "The Talmud describes what occurred as Haman went to follow the king’s orders, as the verse states: <b>“Then Haman took the apparel and the horse”</b> (Esther 6:11). When <b>he went, he found</b> Mordecai <b>as the rabbis were sitting before him, and he was demonstrating to them the <i>halakhot</i> of the handful, </b> i.e., the scooping out of a handful of flour from the meal-offering in order to burn it on the altar. <b>Once Mordecai saw him coming toward him with his horse’s</b> reins <b>held in his hands, he became frightened, </b> and <b>he said to the rabbis: This evil man has come to kill me. Go away from him so that you should not get burnt from his coals, </b> i.e., that you should not suffer harm as well. <b>At that moment Mordecai wrapped himself</b> in his prayer shawl <b>and stood up to pray. Haman came</b> over to where they were <b>and sat down before them and waited until Mordecai finished his prayer. </b>"
        },
        {
          "verseLocation": "Esther 6:12",
          "verseText": "And this is as it is written: “And Mordecai returned to the king’s gate”",
          "talmudLocation": "Megillah 16a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-12",
          "talmudFullText": "<b>And this is as it is written: “And Mordecai returned to the king’s gate”</b> (Esther 6:12). <b>Rav Sheshet said: </b> This means <b>that he returned to his sackcloth and his fasting</b> over the troubles of the Jewish people. Simultaneously, <b>“but Haman hastened to his house, mourning, and having his head covered”</b> (Esther 6:12). <b>“Mourning”; over</b> the death of <b>his daughter. “And having his head covered”; due to what had happened to him, </b> as his head was full of filth."
        },
        {
          "verseLocation": "Esther 6:13",
          "verseText": "“And Haman recounted to Zeresh his wife and to all his friends",
          "talmudLocation": "Megillah 16a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-13",
          "talmudFullText": "The following verse states: <b>“And Haman recounted to Zeresh his wife and to all his friends</b> everything that had befallen him. Then his wise men and Zeresh his wife said to him: If Mordecai, before whom you have begun to fall, be of the seed of the Jews, then you will not prevail over him, but you shall fall before him” (Esther 6:13). The Talmud comments: At the beginning of the verse <b>it calls them “his friends, ” and</b> in the continuation of the verse <b>it calls them “his wise men. ” R' Yoḥanan said: Whoever says something wise, even if</b> he is <b>from the nations of the world, is called</b> a <b>wise</b> man."
        },
        {
          "verseLocation": "Esther 6:13",
          "verseText": "“If Mordecai be of the seed of the Jews [ Yehudim ],",
          "talmudLocation": "Megillah 16a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-14",
          "talmudFullText": "The Talmud explains that their wise remark, which earned them their distinction, is contained in their advice: <b>“If Mordecai be of the seed of the Jews [<i>Yehudim</i>], </b> then you will not prevail over him” (Esther 6:13). The word <i>Yehudim</i> can also refer to people from the tribe of Judah. Haman’s wise men thereby <b>said to him: If he descends from the other tribes, you can</b> still <b>prevail over him, but if he</b> descends <b>from the tribe of</b> either <b>Judah, Benjamin, Ephraim, or Manasseh, you cannot prevail over him. </b> With regard to <b>Judah, </b> the proof of this is <b>as it is written: “Your hand shall be on the neck of your enemies”</b> (Genesis 49:8), indicating that Judah will emerge victorious over his enemies. And the proof that Haman cannot prevail over <b>the others</b> that were mentioned is <b>as it is written with regard to them: “Before Ephraim and Benjamin and Manasseh, stir up Your might”</b> (Psalms 80:3)."
        },
        {
          "verseLocation": "Esther 6:13",
          "verseText": "“But you shall fall [ nafol tippol ] before him”",
          "talmudLocation": "Megillah 16a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-15",
          "talmudFullText": "The wise men continued: <b>“But you shall fall [<i>nafol tippol</i>] before him”</b> (Esther 6:13). <b>R' Yehuda bar Ilai interpreted</b> a verse <b>homiletically: Why are these two fallings, </b> <i>nafol</i> and <i>tippol</i>, mentioned here? The wise men <b>said to</b> Haman: <b>This</b> Jewish <b>nation is compared</b> in the Bible <b>to the dust</b> of the earth <b>and it is</b> also <b>compared to the stars</b> in heaven. This teaches you that <b>when they descend, they descend to the dust, and when they rise, they rise to the stars. </b> Accordingly, when Mordecai is on the rise, you will be utterly incapable of prevailing over him."
        },
        {
          "verseLocation": "Esther 6:14",
          "verseText": "“The king’s chamberlains came, and they hastened [ vayavhilu ]",
          "talmudLocation": "Megillah 16a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-16",
          "talmudFullText": "The next verse states: <b>“The king’s chamberlains came, and they hastened [<i>vayavhilu</i>]</b> to bring Haman” (Esther 6:14). <b>This teaches that they brought him in disarray [<i>behala</i>], </b> not even giving him a chance to wash himself from the filth."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Esther 7:4",
          "verseText": "since the affliction [ tzar ] would not have been worth [ eino shoveh ] the damage to the king”",
          "talmudLocation": "Megillah 16a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-17",
          "talmudFullText": "During the banquet Esther said to Ahasuerus: <b>“For we are sold, I and my people, </b> to be destroyed, to be slain, and to be annihilated. But if we had been sold merely for bondmen and bondwomen, I would have held my tongue, <b>since the affliction [<i>tzar</i>] would not have been worth [<i>eino shoveh</i>] the damage to the king”</b> (Esther 7:4). The Talmud explains that <b>she said to him: This adversary [<i>tzar</i>] is not concerned [<i>eino shoveh</i>] about the damage</b> that he is constantly causing <b>to the king. First he was jealous of Vashti and killed her, </b> as it has been explained that Memucan, who suggesting killing Vashti, was Haman; <b>now he is jealous of me and desires to kill me. </b>"
        },
        {
          "verseLocation": "Esther 7:5",
          "verseText": "“Then said the king Ahasuerus and said to Esther the queen”",
          "talmudLocation": "Megillah 16a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-18",
          "talmudFullText": "The verse states: <b>“Then said the king Ahasuerus and said to Esther the queen”</b> (Esther 7:5). The Talmud asks: <b>Why do I</b> need it to say <b>“said”</b> and again <b>“said”? R' Abbahu said: At first</b> he spoke to her <b>through the translator, </b> who would interpret on his behalf, because he thought that she was a common woman of lowly ancestry. <b>Once she told him that she came from the house of Saul, immediately</b> it says: <b>“And said to Esther the queen. ”</b> Ahasuerus himself spoke to her, as if she had royal lineage, she was a woman befitting his status."
        },
        {
          "verseLocation": "Esther 7:6",
          "verseText": "“A man [ ish ] who is an adversary and an enemy,",
          "talmudLocation": "Megillah 12a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-18",
          "talmudFullText": "The verse states: <b>“None did compel”</b> (Esther 1:8). <b>R' Elazar said: This teaches that each and every</b> guest at the feast <b>was poured</b> a drink <b>from wine of his</b> own <b>country, </b> so that he would feel entirely free, as if he were in his home country. The verse continues: <b>“That they should do according to every man’s pleasure”</b> (Esther 1:8). <b>Rava</b> commented on the literal meaning of the verse, which is referring to two men, a man and a man [<i>ish va’ish</i>], and <b>said: </b> The man and man whom they should follow indicates <b>that they should do according to the wishes of Mordecai and Haman. </b> The two of them served as butlers at the feast, and they were in charge of distributing the wine. Why is the verse interpreted in this way? <b>Mordecai</b> is called “man,” <b>as it is written: </b> “There was a certain <b>Jewish man [<i>ish</i>]</b> in Shushan the castle, whose name was Mordecai, the son of Jair” (Esther 2:5). <b>And Haman</b> is also called man, as it states: <b>“A man [<i>ish</i>] who is an adversary and an enemy, </b> this evil Haman” (Esther 7:6)."
        },
        {
          "verseLocation": "Esther 7:6",
          "verseText": "“And Esther said: An adversary and enemy is this wicked Haman”",
          "talmudLocation": "Megillah 16a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-19",
          "talmudFullText": "The next verse states: <b>“And Esther said: An adversary and enemy is this wicked Haman”</b> (Esther 7:6). <b>R' Elazar said: </b> This <b>teaches that she was</b> in fact <b>pointing toward Ahasuerus, </b> indicating that in fact he was an adversary and enemy, <b>and an angel came and pushed her hand toward Haman. </b>"
        },
        {
          "verseLocation": "Esther 7:7",
          "verseText": "in his wrath",
          "talmudLocation": "Megillah 16a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-20",
          "talmudFullText": "The verse states: <b>“And the king arose</b> from the banquet of wine <b>in his wrath</b> and went into the palace garden” (Esther 7:7), and the next verse states: <b>“Then the king returned out of the palace garden</b> to the place of the wine drinking” (Esther 7:8). The Talmud comments: The verses here <b>compare his returning to his arising: Just as his arising</b> was <b>in wrath, so too, his returning</b> was <b>in wrath. </b> And why did he return in wrath? <b>For</b> when <b>he went</b> out <b>he found ministering angels who appeared to him as people and they were uprooting trees from the garden, and he said to them: What are you doing? They said to him: Haman commanded us</b> to do this."
        },
        {
          "verseLocation": "Esther 7:8",
          "verseText": "“Then the king returned out of the palace garden",
          "talmudLocation": "Megillah 16a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-20",
          "talmudFullText": "The verse states: <b>“And the king arose</b> from the banquet of wine <b>in his wrath</b> and went into the palace garden” (Esther 7:7), and the next verse states: <b>“Then the king returned out of the palace garden</b> to the place of the wine drinking” (Esther 7:8). The Talmud comments: The verses here <b>compare his returning to his arising: Just as his arising</b> was <b>in wrath, so too, his returning</b> was <b>in wrath. </b> And why did he return in wrath? <b>For</b> when <b>he went</b> out <b>he found ministering angels who appeared to him as people and they were uprooting trees from the garden, and he said to them: What are you doing? They said to him: Haman commanded us</b> to do this."
        },
        {
          "verseLocation": "Esther 7:8",
          "verseText": "“Haman was falling upon the bed”",
          "talmudLocation": "Megillah 16a:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-21",
          "talmudFullText": "And when <b>he entered his house</b> he saw that <b>“Haman was falling upon the bed”</b> (Esther 7:8). The Talmud asks: Why does it say <b>“was falling” [<i>nofel</i>]</b> in the present tense, implying that he was currently falling? <b>It should have said “fell” [<i>nafal</i>]</b> in the past tense. <b>R' Elazar said: This teaches that an angel came and pushed him down on it, </b> and every time he would try to stand up, the angel would push him down again. Ahasuerus <b>said: Woe unto</b> me <b>in the house and woe</b> unto me <b>outside, </b> as the verse continues: <b>“Then the king said: Will he even force the queen before me in the house? ”</b> (Esther 7:8)."
        },
        {
          "verseLocation": "Esther 7:8",
          "verseText": "“Will he even force the queen before me in the house?”",
          "talmudLocation": "Pesachim 100a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/100a#section-8",
          "talmudFullText": "<b>He said to him: Each and every day you cherish my statements before</b> those of <b>R' Yehuda, </b> and rule in accordance with my opinion, <b>and now you cherish the statement of R' Yehuda before me? </b> R' Yosei continued by applying a verse to this situation: <b>“Will he even force the queen before me in the house? ”</b> (Esther 7:8)."
        },
        {
          "verseLocation": "Esther 7:8",
          "verseText": "and it is written there: “And Haman was fallen upon the divan",
          "talmudLocation": "Sanhedrin 105a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/105a#section-17",
          "talmudFullText": "The Talmud relates: Balaam <b>was a diviner by</b> using <b>his penis. It is written here: “Fallen, yet with opened eyes”</b> (Numbers 24:4), <b>and it is written there: “And Haman was fallen upon the divan</b> whereupon Esther was” (Esther 7:8), indicating that the verb fallen has sexual connotations. <b>It was stated</b> that there is an amoraic dispute with regard to this matter. <b>Mar Zutra says: </b> Balaam <b>was a diviner by</b> using <b>his penis. Mar, son of Ravina, says: He engaged in bestiality with his donkey. The one who says</b> that he <b>was a diviner by</b> using <b>his penis</b> derives it <b>as we stated. And the one who says</b> that <b>he engaged in bestiality with his donkey</b> derives it as follows: <b>It is written here: “He crouched, he lay down”</b> (Numbers 24:9), <b>and it is written there: “Between her legs</b>"
        },
        {
          "verseLocation": "Esther 7:9",
          "verseText": "said",
          "talmudLocation": "Megillah 16a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-22",
          "talmudFullText": "<b>“And Harbonah, </b> one of the chamberlains, <b>said</b> before the king, Behold also, the gallows fifty cubits high, which Haman has made for Mordecai, who spoke good for the king, stands in the house of Haman” (Esther 7:9). <b>R' Elazar said: Harbonah was also wicked and involved in that plot, </b> as he too wanted Mordecai executed. <b>Once he saw that his plot had not succeeded, he immediately fled</b> and joined Mordecai’s side. <b>And this is</b> the meaning of <b>that which is written: “It hurls itself at him, and does not spare; he would fain flee out of its hand”</b> (Job 27:22), indicating that when God sends calamity upon a wicked person, his friends immediately flee from him."
        },
        {
          "verseLocation": "Esther 7:10",
          "verseText": "“Then the king’s wrath was assuaged [ shakhakha ]”",
          "talmudLocation": "Megillah 16a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16a#section-23",
          "talmudFullText": "The verse states: <b>“Then the king’s wrath was assuaged [<i>shakhakha</i>]”</b> (Esther 7:10). The Talmud asks: <b>Why are there two assuagings here? </b> The term <i>shakhakha</i> is used rather than <i>shaka</i> and indicates doubled wrath. There was <b>one</b> assuaging of the wrath <b>of the King of the universe, and one</b> of the wrath <b>of Ahasuerus. And some say: </b> Ahasuerus’s wrath burned within him for two reasons; <b>one due to</b> Haman’s involvement with <b>Esther, and one due to</b> his involvement with <b>Vashti, </b> and now they were both assuaged."
        },
        {
          "verseLocation": "Esther 7:10",
          "verseText": "of the king abated”",
          "talmudLocation": "Rosh Hashanah 12a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/12a#section-4",
          "talmudFullText": "The Talmud answers: Even according to R' Eliezer a change was made, <b>in accordance with</b> the statement <b>of Rav Ḥisda, as Rav Ḥisda said: They sinned with boiling</b> heat, <b>and they were punished with boiling</b> heat; <b>they sinned with the boiling</b> heat <b>of the sin</b> of forbidden sexual sex, <b>and they were punished with the boiling</b> heat of scalding waters. This is derived from a verbal analogy. <b>It is written here, </b> with regard to the flood: <b>“And the waters abated”</b> (Genesis 8:1), <b>and it is written elsewhere, </b> with regard to King Ahasuerus: <b>“And the heated</b> anger <b>of the king abated”</b> (Esther 7:10), which implies that the word “abated” means cooled. This indicates that at first the waters of the flood had been scalding hot."
        },
        {
          "verseLocation": "Esther 7:10",
          "verseText": "and it is written there: “Then the king’s wrath was assuaged”",
          "talmudLocation": "Sanhedrin 108b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/108b#section-3",
          "talmudFullText": "Noah <b>said to them: </b> If He wishes <b>He will bring</b> the water <b>from between your feet</b> and you can do nothing to prevent it, <b>as it is stated: “For them whose foot slips. ” It is taught</b> in a <i>baraita</i>: <b>The waters of the flood were</b> as <b>hard</b> and thick <b>as semen, as it is stated: “For them whose foot slips”; </b> foot is a euphemism. <b>Rav Ḥisda says: With hot</b> semen <b>they sinned, and with hot</b> water <b>they were punished. </b> As <b>it is written here, </b> at the conclusion of the flood: <b>“And the waters assuaged”</b> (Genesis 8:1), <b>and it is written there: “Then the king’s wrath was assuaged”</b> (Esther 7:10). Just as the term “assuaged” there is referring to the heat of Ahasuerus’s wrath, so too, “assuaged” with regard to the flood is referring to the heat of the waters."
        },
        {
          "verseLocation": "Esther 7:10",
          "verseText": "Then the king’s boiling anger was assuaged [ shakhakha ]”",
          "talmudLocation": "Zevachim 113b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/113b#section-4",
          "talmudFullText": "The Talmud notes that this is <b>in accordance with</b> the statement <b>of Rav Ḥisda, as Rav Ḥisda says: </b> The generation of the flood <b>sinned with boiling</b> heat, i.e., forbidden sex, <b>and they were punished with</b> the <b>boiling</b> heat of the flood waters. <b>As it is written here, </b> with regard to the flood: “And God remembered Noah and every living creature and all the cattle that were with him in the ark; and God made a wind to pass over the earth <b>and the waters calmed [<i>vayashoku hamayim</i>]”</b> (Genesis 8:1); <b>and it is written there, </b> with regard to the execution of Haman: “So they hanged Haman on the gallows that he had prepared for Mordecai. <b>Then the king’s boiling anger was assuaged [<i>shakhakha</i>]”</b> (Esther 7:10). This latter verse indicates that a matter is assuaged from heat; similarly, the flood waters were hot."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "Esther 8:2",
          "verseText": "This is Mordecai and Esther, as it is written: “And Esther set Mordecai over the house of Haman”",
          "talmudLocation": "Megillah 10b:28",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-28",
          "talmudFullText": "<b>R' Abba bar Kahana introduced this passage with an introduction from here. </b> The verse states with regard to God’s reward to the righteous: <b>“He gives to a man that is good in His sight wisdom, and knowledge, and joy”</b> (Ecclesiastes 2:26). The Talmud explains that <b>this</b> verse <b>is</b> referring to <b>the righteous Mordecai. </b> With regard to the next part of the verse: <b>“But to the sinner He gives the task of gathering and heaping up, ” this is</b> referring to <b>Haman. </b> The conclusion of the verse states: <b>“That he may give it to one who is good before God”</b> (Ecclesiastes 2:26). <b>This is Mordecai and Esther, as it is written: “And Esther set Mordecai over the house of Haman”</b> (Esther 8:2)."
        },
        {
          "verseLocation": "Esther 8:9",
          "verseText": "“According to their writing, and according to their language”",
          "talmudLocation": "Megillah 9a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/9a#section-6",
          "talmudFullText": "<b>Rather, </b> say this is <b>not difficult. Here, </b> the <i>baraita</i> <b>is referring to</b> the <b>Megilla, </b> the Scroll of Esther, which must be written in Hebrew; <b>there, </b> the Mishnah <b>is referring to</b> Torah <b>scrolls, </b> which may be written in any language. The Talmud asks: <b>What is the reason</b> that the <b>Megilla</b> must be written in Hebrew? It is due to the fact <b>that it is written with regard to</b> the Megilla: <b>“According to their writing, and according to their language”</b> (Esther 8:9), without change. The Talmud asks: But if the <i>baraita</i> is referring to the Megilla, <b>what</b> Aramaic <b>translation that one wrote</b> in the Hebrew of the <b>Bible is there? </b> The entire Megilla is written in Hebrew."
        },
        {
          "verseLocation": "Esther 8:9",
          "verseText": "“And the scribes of the king were called at that time in the third month, that is the month of Sivan”",
          "talmudLocation": "Rosh Hashanah 7a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/7a#section-9",
          "talmudFullText": "<b>Rav Kahana said: </b> It is derived <b>from here: “On the 4th day of the 9th month, in Kislev”</b> (Zechariah 7:1). <b>Rav Aḥa bar Ya’akov said: </b> It is derived <b>from here, </b> as it is stated: <b>“And the scribes of the king were called at that time in the 3rd month, that is the month of Sivan”</b> (Esther 8:9). <b>Rav Ashi said: </b> It is derived <b>from here: “He cast <i>pur</i>, that is, the lot, before Haman from day to day, and from month to month, to the twelfth month, that is, the month of Adar”</b> (Esther 3:7). <b>And if you wish, say</b> that it is derived <b>from here: “In the first month, that is, the month of Nisan”</b> (Esther 3:7)."
        },
        {
          "verseLocation": "Esther 8:9",
          "verseText": "states: “And to the Jews according to their script and according to their language”",
          "talmudLocation": "Sanhedrin 22a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-5",
          "talmudFullText": "The <i>baraita</i> continues: <b>R' Shimon ben Elazar says in the name of R' Eliezer ben Perata, who said in the name of R' Elazar HaModa’i: This script did not change at all, as it is stated</b> with regard to the construction of the Tabernacle: <b>“The hooks of [<i>vavei</i>] the poles”</b> (Exodus 27:10). This teaches that <b>just as the poles were not changed, so too, the hooks [<i>vavim</i>] were not changed. </b> The letter <i>vav</i> in <i>Ashurit</i> script has the shape of a hook. Evidently, this is why the term for hook in the Torah is <i>vav</i>. <b>And</b> the verse <b>states: “And to the Jews according to their script and according to their language”</b> (Esther 8:9). This teaches that <b>just as their language was not changed</b> over the generations but remained Hebrew, <b>so too, their script was not changed. </b>"
        },
        {
          "verseLocation": "Esther 8:10",
          "verseText": "ha’aḥashteranim benei haramakhim",
          "talmudLocation": "Megillah 18a:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/18a#section-24",
          "talmudFullText": "<b>Ravina strongly objects to</b> the premise of the question raised above, i.e., that someone who does not understand the original, untranslated language of the Megilla cannot fulfill his obligation. <b>Is that to say</b> that even <b>we, </b> the rabbis, who are very well acquainted with Hebrew, <b>know</b> for certain the meaning of the obscure words <b><i>ha’aḥashteranim benei haramakhim</i></b> (Esther 8:10), often translated as: “Used in the royal service, bred from the stud”? <b>But</b> nevertheless, we fulfill the <b>mitzva of reading</b> the Megilla <b>and publicizing the miracle</b> of Purim by reading these words as they appear in the original text. <b>Here too, </b> one who speaks a foreign language who hears the Megilla being read in Hebrew fulfills the <b>mitzva of reading</b> the Megilla <b>and publicizing the</b> Purim <b>miracle, </b> even if he does not understand the words themselves."
        },
        {
          "verseLocation": "Esther 8:15",
          "verseText": "“When the righteous are on the increase, the people rejoice”; this is Mordecai and Esther, as it is written: “And the city of Shushan rejoiced and was glad”",
          "talmudLocation": "Megillah 11a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-8",
          "talmudFullText": "<b>Rava introduced this passage with an introduction from here: “When the righteous are on the increase, the people rejoice; but when the wicked man rules, the people mourn”</b> (Proverbs 29:2). <b>“When the righteous are on the increase, the people rejoice”; this is Mordecai and Esther, as it is written: “And the city of Shushan rejoiced and was glad”</b> (Esther 8:15). <b>“But when the wicked man rules, the people mourn”; this is Haman, as it is written: “But the city of Shushan was perplexed”</b> (Esther 3:15)."
        },
        {
          "verseLocation": "Esther 8:15",
          "verseText": "in royal apparel of sky blue",
          "talmudLocation": "Megillah 16b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16b#section-1",
          "talmudFullText": "<b>he</b> himself <b>should stumble</b> by showing favoritism to Benjamin? <b>As Rava bar Meḥaseyya said</b> that <b>Rav Ḥama bar Gurya said</b> that <b>Rav said: Due to</b> the weight of <b>two sela of fine wool that Jacob</b> gave to Joseph, which he <b>added to</b> what he gave <b>Joseph beyond</b> what he gave <b>the rest of his brothers, </b> as he made him his special coat, <b>the story progressed and our forefathers went down to Egypt. </b> How then could Joseph have displayed similar favoritism toward Benjamin? <b>R' Binyamin bar Yefet said: He</b> was not showing favoritism. Rather, he <b>intimated to him that a descendant was destined to issue from him who would go out from the presence of the king</b> wearing <b>five royal garments, as it is stated: “And Mordecai went forth</b> from the presence of the king <b>in royal apparel of sky blue</b> and white, and with a great crown of gold, and with a wrap of fine linen and purple” (Esther 8:15)."
        },
        {
          "verseLocation": "Esther 8:16",
          "verseText": "“The Jews had light and gladness, and joy and honor”",
          "talmudLocation": "Megillah 16b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16b#section-8",
          "talmudFullText": "§ The Talmud returns to its explanation of the Megilla. The verse states: <b>“The Jews had light and gladness, and joy and honor”</b> (Esther 8:16). <b>Rav Yehuda said: “Light”; this</b> is referring to the <b>Torah</b> that they once again studied. <b>And similarly it says: “For the mitzva is a lamp and the Torah is light”</b> (Proverbs 6:23). <b>“Gladness” [<i>simḥa</i>]; this</b> is referring to <b>the Festivals</b> that they once again observed. <b>And similarly it says: “And you shall be glad [<i>vesamakhta</i>] on your Festival”</b> (Deuteronomy 16:14). <b>“Joy” [<i>sasson</i>]; this</b> is referring to <b>circumcision, </b> as they once again circumcised their sons. <b>And similarly it says: “I rejoice [<i>sas</i>] at Your word”</b> (Psalms 119:162), which the rabbis understood as referring to David’s rejoicing over the mitzva of circumcision."
        },
        {
          "verseLocation": "Esther 8:17",
          "verseText": "I am superior to you, as it is written: “There was happiness [ simḥa ] and joy [ sason ] for the Jews”",
          "talmudLocation": "Sukkah 48b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/48b#section-5",
          "talmudFullText": "Apropos this verse, the Talmud relates: There were <b>these two heretics, one named Sason and one named Simḥa. Sason said to Simḥa: I am superior to you, as it is written: “They shall obtain joy [<i>sason</i>] and happiness [<i>simḥa</i>], </b> and sorrow and sighing shall flee” (Isaiah 35:10). The verse mentions joy first. <b>Simḥa said to Sason, </b> On the contrary, <b>I am superior to you, as it is written: “There was happiness [<i>simḥa</i>] and joy [<i>sason</i>] for the Jews”</b> (Esther 8:17). <b>Sason said to Simḥa: One day they will dismiss you and render you a messenger [<i>parvanka</i>], as it is written: “For you shall go out with happiness [<i>simḥa</i>]”</b> (Isaiah 55:12). <b>Simḥa said to Sason: One day they will dismiss you and draw water with you, as it is written: “With joy [<i>sason</i>] you shall draw water. ”</b>"
        },
        {
          "verseLocation": "Esther 8:17",
          "verseText": "Mordecai and Esther",
          "talmudLocation": "Yevamot 24b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/24b#section-4",
          "talmudFullText": "<b>As R' Neḥemya would say: </b> With regard to <b>converts</b> by <b>lions, </b> i.e., forced converts such as the Samaritans [<i>Kutim</i>] described in II Kings (17:24–25); <b>and converts</b> who convert based on their <b>dreams; and converts of</b> the time of <b>Mordecai and Esther</b> described in the verse, “And many from among the peoples of the land became Jews; for the fear of the Jews was fallen upon them” (Esther 8:17); all of these <b>are not converts until they are converted at this</b> present <b>time. </b>"
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "Esther 9:12",
          "verseText": "in Shushan the capital,",
          "talmudLocation": "Megillah 16b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16b#section-13",
          "talmudFullText": "The verse states: <b>“And the king said to Esther the queen: The Jews have slain</b> and destroyed five hundred men <b>in Shushan the capital, </b> and also the ten sons of Haman; what have they done in the rest of the king’s provinces? Now what is your petition and it shall be granted to you; and what more do you request, and it shall be done” (Esther 9:12). <b>R' Abbahu said: This teaches that an angel came and slapped him on his mouth, </b> so that he was unable to finish what he was saying; he started with a complaint about what the Jews were doing, but ended on an entirely different note."
        },
        {
          "verseLocation": "Esther 9:15",
          "verseText": "the Divine Spirit, as it is stated: “But they did not lay their hands on the plunder”",
          "talmudLocation": "Megillah 7a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/7a#section-13",
          "talmudFullText": "<b>R' Meir says: </b> The book of <b>Esther was said with</b> the inspiration of <b>the Holy Spirit, as it is stated</b> with regard to the conspiracy of Bigtan and Teresh against Ahasuerus: <b>“And the thing became known to Mordecai”</b> (Esther 2:22). This too could have been known only through Holy Spirit. <b>R' Yosei ben Durmaskit says: </b> The book of <b>Esther was said with</b> the inspiration of <b>the Holy Spirit, as it is stated: “But they did not lay their hands on the plunder”</b> (Esther 9:15). The only way that could have been stated with certainty is through Holy Spirit."
        },
        {
          "verseLocation": "Esther 9:19",
          "verseText": "Rava said: From where do I say this? As it is written: “Therefore the Jews of unwalled towns, who dwell in the unwalled towns,",
          "talmudLocation": "Megillah 19a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-6",
          "talmudFullText": "<strong>Talmud: </strong> <b>Rava said: They taught</b> the Mishnah that one who is destined to return to his own place reads according to the <i>halakha</i> governing his own place <b>only</b> with regard to <b>one who is destined to return</b> to his own place <b>on the night of the fourteenth</b> of Adar. <b>But if he is not destined to return on the night of the fourteenth, although</b> he does intend to return to his own place eventually, <b>he reads with</b> the residents of his current location. <b>Rava said: From where do I say this? As it is written: “Therefore the Jews of unwalled towns, who dwell in the unwalled towns, </b> make the fourteenth day of the month Adar a day of gladness and feasting” (Esther 9:19). <b>Since it is</b> already <b>written: “The Jews of unwalled towns, ” why do I</b> need it <b>to write</b> further, <b>“who dwell in the unwalled towns”? </b> It comes to <b>teach us this: That one who is in an unwalled town</b> even <b>for the day is</b> also <b>called one who</b> lives <b>in an unwalled town. </b>"
        },
        {
          "verseLocation": "Esther 9:19",
          "verseText": "unwalled. It is written here: “Therefore the Jews of the villages,",
          "talmudLocation": "Megillah 2b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2b#section-15",
          "talmudFullText": "The Talmud asks: <b>What is the reason for</b> the opinion of <b>the <i>tanna</i> of our</b> Mishnah? The Talmud explains: It is <b>derived</b> through a verbal analogy between one instance of the word <b>unwalled and</b> another instance of the word <b>unwalled. It is written here: “Therefore the Jews of the villages, </b> who dwell in the unwalled towns” (Esther 9:19), <b>and it is written there, </b> in Moses’ statement to Joshua before the Jewish people entered Eretz Yisrael: “All these cities were fortified with high walls, gates and bars; <b>besides unwalled towns, a great many”</b> (Deuteronomy 3:5). <b>Just as there, </b> in Deuteronomy, the reference is to a city <b>that was surrounded by a wall from the days of Joshua, son of Nun, so too here</b> it is referring to a city <b>that was surrounded by a wall from the days of Joshua, son of Nun. </b>"
        },
        {
          "verseLocation": "Esther 9:19",
          "verseText": "as the verse states: “Therefore the Jews of the villages, who dwell in the unwalled towns,",
          "talmudLocation": "Megillah 2b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2b#section-6",
          "talmudFullText": "§ We learned in the Mishnah: <b>Cities that have been surrounded by a wall since the days of Joshua, son of Nun, read</b> the Megilla <b>on the fifteenth</b> of Adar. The Talmud asks: <b>From where are these matters</b> derived, as they are not stated explicitly in the Megilla? <b>Rava said: </b> It is <b>as the verse states: “Therefore the Jews of the villages, who dwell in the unwalled towns, </b> make the fourteenth day of the month of Adar a day of gladness and feasting” (Esther 9:19). <b>From</b> the fact that <b>the unwalled towns</b> celebrate Purim <b>on the fourteenth, </b> it may be derived that <b>the walled cities</b> celebrate Purim <b>on the fifteenth. </b>"
        },
        {
          "verseLocation": "Esther 9:19",
          "verseText": "gladness and feasting and a good day [ yom tov ]”",
          "talmudLocation": "Megillah 5b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/5b#section-10",
          "talmudFullText": "This can be proven from the fact <b>that initially, </b> when Mordecai and Esther proposed the celebration of Purim, <b>it is written: </b> “A day of <b>gladness and feasting and a good day [<i>yom tov</i>]”</b> (Esther 9:19), <b>and at the end, </b> when the celebration of Purim was accepted by the Jewish people, <b>it is written: </b> “That they should <b>make them days of feasting and gladness”</b> (Esther 9:22), <b>whereas</b> the term <b>good day [<i>yom tov</i>], </b> which alludes to a day when it is prohibited to perform labor, <b>is not written. </b> The people never accepted upon themselves the prohibition against performing labor on Purim as if it were a Festival, and therefore the prohibition never took effect."
        },
        {
          "verseLocation": "Esther 9:19",
          "verseText": "gladness and feasting, and a good day [ yom tov ]”",
          "talmudLocation": "Megillah 5b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/5b#section-3",
          "talmudFullText": "The Talmud asks: <b>And how</b> could <b>R'</b> Yehuda HaNasi <b>plant a sapling on Purim? Didn’t Rav Yosef teach</b> with regard to the verse: “Therefore the Jews of the villages, who dwell in the unwalled towns, make the fourteenth day of the month of Adar a day of <b>gladness and feasting, and a good day [<i>yom tov</i>]”</b> (Esther 9:19), that the term <b>“gladness” teaches that</b> it is <b>prohibited</b> to <b>eulogize</b> on Purim; <b>“feasting” teaches that</b> it is <b>prohibited</b> to <b>fast; and</b> the term <b>“good day” [<i>yom tov</i>] teaches that</b> it is <b>prohibited</b> to <b>perform labor, </b> just as on a Festival, which is also referred to as a <i>yom tov</i>? <b>Rather, </b> what happened was as follows: <b>R'</b> Yehuda HaNasi was in a place that observed Purim <b>on the fourteenth, and when he planted</b> the sapling, <b>he planted</b> it <b>on the fifteenth. </b>"
        },
        {
          "verseLocation": "Esther 9:21",
          "verseText": "“their times”? Learn from this",
          "talmudLocation": "Megillah 2a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2a#section-10",
          "talmudFullText": "The Talmud objects: <b>But still, </b> the plural term is <b>necessary</b> to indicate that <b>the time of this</b> walled city <b>is not</b> the same as <b>the time of that</b> unwalled town, i.e., Purim is celebrated on different days in different places. The Talmud answers: <b>If so, let the verse say: Their time, </b> indicating that each place celebrates Purim on its respective day. <b>What</b> is the significance of the compound plural <b>“their times”? Learn from this</b> term that although the verse (Esther 9:21) specifies only two days, the Megilla may, at times, be read on <b>all of</b> the days enumerated in the Mishnah."
        },
        {
          "verseLocation": "Esther 9:21",
          "verseText": "on the fourteenth and on the fifteenth, as it is written: “That they should keep the fourteenth day of the month of Adar and the fifteenth day of the same, in every year”",
          "talmudLocation": "Megillah 2b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2b#section-8",
          "talmudFullText": "Rather, the following challenge may be raised: <b>Say</b> that <b>the unwalled towns</b> celebrate Purim <b>on the fourteenth</b> and <b>the walled cities</b> celebrate it <b>on the fourteenth and on the fifteenth, as it is written: “That they should keep the fourteenth day of the month of Adar and the fifteenth day of the same, in every year”</b> (Esther 9:21). This verse can be understood to mean that there are places where Purim is celebrated on both days."
        },
        {
          "verseLocation": "Esther 9:21",
          "verseText": "in each and every year”",
          "talmudLocation": "Megillah 6b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/6b#section-24",
          "talmudFullText": "<b>R' Yoḥanan said: And both of them, </b> Rabban Shimon ben Gamliel and R' Eliezer ben Yosei, <b>interpreted the same verse</b> differently, leading them to their conclusions. It is written: “To enjoin upon them that they should keep the fourteenth day of the month of Adar and the fifteenth day of the same, <b>in each and every year”</b> (Esther 9:21). <b>R' Eliezer ben Yosei, maintains: “In each and every year”</b> teaches that Purim must be celebrated the same way each year, even if it is intercalated: <b>Just as each and every year</b> Purim is celebrated during <b>Adar that is adjacent to Shevat, so too here</b> in an intercalated year Purim is celebrated during <b>Adar that is adjacent to Shevat. </b>"
        },
        {
          "verseLocation": "Esther 9:22",
          "verseText": "the verse states: “As the days on which the Jews rested from their enemies”",
          "talmudLocation": "Megillah 2a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2a#section-14",
          "talmudFullText": "Having cited and discussed the opinion of Rav Shemen bar Abba, the Talmud cites another answer to the question of where the verses allude to the permissibility of reading the Megilla on the days enumerated in the Mishnah. <b>And R' Shmuel bar Naḥmani said: </b> These dates are alluded to when <b>the verse states: “As the days on which the Jews rested from their enemies”</b> (Esther 9:22). The term <b>“days”</b> is referring to the two days that are explicitly mentioned in the previous verse, i.e., the fourteenth and the fifteenth. The term <b>“as the days”</b> comes <b>to include</b> two additional days, i.e., <b>the eleventh and twelfth</b> of Adar."
        },
        {
          "verseLocation": "Esther 9:22",
          "verseText": "make them days of feasting and gladness”",
          "talmudLocation": "Megillah 5b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/5b#section-10",
          "talmudFullText": "This can be proven from the fact <b>that initially, </b> when Mordecai and Esther proposed the celebration of Purim, <b>it is written: </b> “A day of <b>gladness and feasting and a good day [<i>yom tov</i>]”</b> (Esther 9:19), <b>and at the end, </b> when the celebration of Purim was accepted by the Jewish people, <b>it is written: </b> “That they should <b>make them days of feasting and gladness”</b> (Esther 9:22), <b>whereas</b> the term <b>good day [<i>yom tov</i>], </b> which alludes to a day when it is prohibited to perform labor, <b>is not written. </b> The people never accepted upon themselves the prohibition against performing labor on Purim as if it were a Festival, and therefore the prohibition never took effect."
        },
        {
          "verseLocation": "Esther 9:22",
          "verseText": "“And of sending portions one to another”",
          "talmudLocation": "Megillah 7a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/7a#section-20",
          "talmudFullText": "The Mishnah mentions: <b>And gifts</b> distributed <b>to the poor. Rav Yosef taught</b> a <i>baraita</i> that the verse states: <b>“And of sending portions one to another”</b> (Esther 9:22), indicating <b>two portions to one person. </b> The verse continues: <b>“And gifts to the poor”</b> (Esther 9:22), indicating <b>two gifts to two people. </b>"
        },
        {
          "verseLocation": "Esther 9:22",
          "verseText": "Rava said: A Purim feast that one ate at night did not fulfill his obligation. What is the reason? “Days of feasting and gladness”",
          "talmudLocation": "Megillah 7b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/7b#section-9",
          "talmudFullText": "<b>Rava said: A Purim feast that one ate at night did not fulfill his obligation. What is the reason? “Days of feasting and gladness”</b> (Esther 9:22) <b>is written, </b> i.e., days and not nights. The Talmud relates: <b>Rav Ashi was sitting before Rav Kahana</b> his teacher on Purim, and <b>it grew dark and the rabbis</b> who usually came to study with him <b>did not come. </b> Rav Ashi <b>said to him: What is the reason that the rabbis did not come</b> today? Rav Kahana answered: <b>Perhaps they are preoccupied with the Purim feast. </b> Rav Ashi <b>said to him: Wasn’t it possible</b> for them <b>to eat</b> the feast <b>at night</b> on Purim, instead of being derelict in their Torah study on Purim day? Rav Kahana <b>said to him: Didn’t the master learn that which Rava said: A Purim feast that one ate at night did not fulfill his obligation? </b> Rav Ashi <b>said to him: Did Rava say that? </b> Rav Kahana <b>said to him: Yes. </b> Rav Ashi then <b>learned it from him forty times until</b> he remembered it so well that <b>it seemed to him as if it were placed in his purse. </b>"
        },
        {
          "verseLocation": "Esther 9:22",
          "verseText": "days of feasting and gladness”",
          "talmudLocation": "Pesachim 68b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/68b#section-10",
          "talmudFullText": "<b><i>Ayin</i>, <i>beit</i>, <i>mem</i></b> is <b>a mnemonic</b> consisting of the first letter of <i>Atzeret</i>, the middle letter of Shabbat and the final letter of Purim. <b>R' Elazar said: All agree with regard to <i>Atzeret</i>, </b> the holiday of <i>Shavuot</i>, <b>that we require</b> that it be <b>also “for you, ”</b> meaning that it is a mitzva to eat, drink, and rejoice on that day. <b>What is the reason? It is the day on which the Torah was given, </b> and one must celebrate the fact that the Torah was given to the Jewish people. <b>Rabba said: All agree with regard to Shabbat that we require</b> that it be <b>also “for you. ” What is the reason? </b> Because the verse states: <b>“If you proclaim Shabbat a delight, </b> the sacred day of God honored” (Isaiah 58:13). <b>Rav Yosef said: All agree with regard to Purim that we require</b> that it be <b>also “for you. ” What is the reason? </b> Because <b>it is written: </b> “To observe them as <b>days of feasting and gladness”</b> (Esther 9:22)."
        },
        {
          "verseLocation": "Esther 9:25",
          "verseText": "“But when she came before the king, he said with a letter”",
          "talmudLocation": "Megillah 16b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16b#section-14",
          "talmudFullText": "The verse states: <b>“But when she came before the king, he said with a letter”</b> (Esther 9:25). Why does it say: <b>“He said”? It should have said: “She said, ”</b> as it was Esther who changed the decree. <b>R' Yoḥanan said: She said to</b> Ahasuerus: <b>Let it be said by</b> word of <b>mouth, </b> indicating that <b>that which is written in the letter</b> should also be ordered verbally."
        },
        {
          "verseLocation": "Esther 9:25",
          "verseText": "“he and his sons were hanged on the gallows”",
          "talmudLocation": "Megillah 19a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-17",
          "talmudFullText": "<b>And the one who said</b> that it needs to be read <b>from “After these things”</b> interprets the verse in this way: <b>That which Haman “saw” in that he became incensed with all the Jews. “Concerning this matter”</b> was <b>because “Mordecai did not bow down, nor prostrate himself before him”</b> (Esther 3:2). <b>“And that which had befallen them”</b> is referring to the fact that <b>“he and his sons were hanged on the gallows”</b> (Esther 9:25). Accordingly, the Megilla must be read from the first mention of Haman."
        },
        {
          "verseLocation": "Esther 9:27",
          "verseText": "as it is written: “The Jews confirmed, and they took upon themselves”",
          "talmudLocation": "Makkot 23b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/23b#section-9",
          "talmudFullText": "<b>Reading the Scroll</b> of Esther is derived from a verse, <b>as it is written: “The Jews confirmed, and they took upon themselves”</b> (Esther 9:27). The verse could have simply said: They took upon themselves. From the formulation of the verse it is interpreted: <b>They confirmed above</b> in Heaven that <b>which they took upon themselves below</b> on earth."
        },
        {
          "verseLocation": "Esther 9:27",
          "verseText": "according to their writing, and according to their appointed times",
          "talmudLocation": "Megillah 17a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/17a#section-12",
          "talmudFullText": "<strong>Talmud: </strong> It was taught in the Mishnah that one who reads the Megilla out of order has not fulfilled his obligation. The Talmud asks: <b>From where are these matters</b> derived? <b>Rava said: The verse states</b> concerning Purim: “That they should unfailingly observe these two days <b>according to their writing, and according to their appointed times</b> every year” (Esther 9:27), and the word “times” is referring to the two days of Purim, the fourteenth and the fifteenth of Adar. And we learn by way of analogy: <b>Just as their appointed times cannot be out of order, </b> as the fifteenth of Adar cannot possibly come before the fourteenth, <b>so too, their writing must not be out of order. </b>"
        },
        {
          "verseLocation": "Esther 9:27",
          "verseText": "“According to their writing and according to their time”",
          "talmudLocation": "Megillah 19a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-2",
          "talmudFullText": "§ It was taught in the Mishnah: He does not fulfill his obligation <b>unless</b> the Megilla <b>is written in <i>Ashurit</i>. </b> The Talmud explains the reason for this: <b>As it is written</b> concerning the Megilla: <b>“According to their writing and according to their time”</b> (Esther 9:27), i.e., the way it was originally written."
        },
        {
          "verseLocation": "Esther 9:27",
          "verseText": "It is written: “And it shall not pass”",
          "talmudLocation": "Megillah 2a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2a#section-13",
          "talmudFullText": "The Talmud objects: <b>And say</b> that the two additional days are <b>the sixteenth and the seventeenth</b> of Adar. The Talmud responds: <b>It is written: “And it shall not pass”</b> (Esther 9:27), indicating that the celebration of Purim is not delayed until a later date."
        },
        {
          "verseLocation": "Esther 9:27",
          "verseText": "in every year”",
          "talmudLocation": "Megillah 4b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/4b#section-9",
          "talmudFullText": "The Talmud asks: <b>What is the reason of the first <i>tanna</i>? </b> The Talmud explains that it is <b>as it is written: </b> “To keep these two days, according to their writing and according to their time, <b>in every year”</b> (Esther 9:27), which indicates that Purim must be celebrated every year in similar fashion. <b>Just as</b> in <b>every</b> other <b>year</b> the large <b>towns precede the walled cities</b> by one day, <b>so too here the</b> large <b>towns precede the walled cities</b> by one day. Consequently, since the walled cities cannot read the Megilla on Shabbat and they are required to advance the reading to Friday, the large towns must also advance their reading a day to Thursday."
        },
        {
          "verseLocation": "Esther 9:27",
          "verseText": "and it shall not pass,",
          "talmudLocation": "Megillah 5a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/5a#section-9",
          "talmudFullText": "We learned in the Mishnah: <b>It was with regard to these</b> times for reading the Megilla that the rabbis <b>said</b> that <b>one advances</b> the reading of the Megilla <b>and one does not postpone</b> it. The Talmud asks: <b>What is the reason</b> for this? <b>R' Abba said</b> that <b>Shmuel said: </b> The <b>verse states: </b> “The Jews ordained, and took upon them, and upon their seed, and upon all who joined themselves to them, <b>and it shall not pass, </b> that they should keep these two days” (Esther 9:27), which indicates that the designated time must not pass without the reading of the Megilla."
        },
        {
          "verseLocation": "Esther 9:27",
          "verseText": "I would have stated a matter that is superior to them all, as it is stated: “They confirmed, and took upon themselves”",
          "talmudLocation": "Megillah 7a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/7a#section-14",
          "talmudFullText": "<b>Shmuel said: Had I been there</b> among the <i>tanna’im</i>, <b>I would have stated a matter that is superior to them all, as it is stated: “They confirmed, and took upon themselves”</b> (Esther 9:27), which was interpreted to mean: <b>They confirmed above</b> in heaven <b>what they took upon themselves below</b> on earth. Clearly, it is only through Holy Spirit that this could have been ascertained."
        },
        {
          "verseLocation": "Esther 9:27",
          "verseText": "ordained, and took upon them,",
          "talmudLocation": "Shabbat 88a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/88a#section-5",
          "talmudFullText": "The Talmud cites additional homiletic interpretations on the topic of the revelation at Sinai. The Torah says, “And Moses brought forth the people out of the camp to meet God; <b>and they stood at the lowermost part of the mount”</b> (Exodus 19:17). <b>R' Avdimi bar Ḥama bar Ḥasa said: </b> the Jewish people actually stood beneath the mountain, and the verse <b>teaches that God overturned the mountain above</b> the Jews <b>like a tub, and said to them: If you accept the Torah, excellent, and if not, there will be your burial. Rav Aḥa bar Ya’akov said: From here</b> there is <b>a substantial caveat to</b> the obligation to fulfill the <b>Torah. </b> The Jewish people can claim that they were coerced into accepting the Torah, and it is therefore not binding. <b>Rava said: Even so, they again accepted it</b> willingly <b>in the time of Ahasuerus, as it is written: </b> “The Jews <b>ordained, and took upon them, </b> and upon their seed, and upon all such as joined themselves unto them” (Esther 9:27), and he taught: The Jews <b>ordained what they had already taken upon themselves</b> through coercion at Sinai."
        },
        {
          "verseLocation": "Esther 9:27",
          "verseText": "ordained and took",
          "talmudLocation": "Shevuot 39a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shevuot/39a#section-10",
          "talmudFullText": "<b>And I have</b> derived <b>only</b> that the <b>mitzvot that</b> the Jewish people <b>accepted upon themselves at Mount Sinai</b> were included in the oath. <b>From where</b> is it derived that <b>mitzvot that were to be initiated in the future, for example, the reading of the Megilla, </b> the Scroll of Esther, on Purim, were also included? <b>The verse states: </b> “The Jews <b>ordained and took</b> upon themselves…that they would keep these two days” (Esther 9:27), which is homiletically interpreted to mean: <b>They ordained, </b> in the generation of Esther, mitzvot <b>that they had already accepted</b> upon themselves by oath in the plains of Moab."
        },
        {
          "verseLocation": "Esther 9:28",
          "verseText": "from here, as it is written: “And that these days should be remembered and observed",
          "talmudLocation": "Megillah 17a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/17a#section-13",
          "talmudFullText": "The Talmud rejects this derivation: <b>Is reading written here at all? </b> It is “<b>observing”</b> that <b>is written</b> here in this verse, not reading, <b>as it is written: “That they should unfailingly observe these two days</b> according to their writing, and according to their appointed times. ” <b>Rather, </b> the proof is <b>from here, as it is written: “And that these days should be remembered and observed</b> throughout every generation” (Esther 9:28). <b>Remembering is juxtaposed to observing, </b> indicating: <b>Just as observing cannot be out of order, </b> as was derived from the words “That they should unfailingly observe these two days according to their writing, and according to their appointed times,” <b>so too, remembering, </b> by reading the Megilla, <b>may not be out of order. </b>"
        },
        {
          "verseLocation": "Esther 9:28",
          "verseText": "“That these days should be remembered”",
          "talmudLocation": "Megillah 18a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/18a#section-12",
          "talmudFullText": "§ It is taught in the Mishnah: <b>If one read</b> the Megilla <b>by heart he has not fulfilled</b> his obligation. The Talmud asks: <b>From where do we</b> derive this? <b>Rava said: </b> This is <b>derived</b> by means of a verbal analogy between one instance of the term <b>remembrance</b> and another instance of the term <b>remembrance. It is written here, </b> with regard to the Megilla: <b>“That these days should be remembered”</b> (Esther 9:28), <b>and it is written elsewhere: “And YHWH said to Moses: Write this for a memorial in the book, </b> and rehearse it in the ears of Joshua: That I will utterly blot out the remembrance of Amalek from under the heavens” (Exodus 17:14). <b>Just as there, </b> with regard to Amalek, remembrance is referring specifically to something written <b>in a book, </b> as it is stated, “in the book,” <b>so too here, </b> the Megilla remembrance is through being written <b>in a book. </b>"
        },
        {
          "verseLocation": "Esther 9:28",
          "verseText": "As the verse states: “And that these days should be remembered and kept”",
          "talmudLocation": "Megillah 20a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/20a#section-8",
          "talmudFullText": "<strong>Talmud: </strong> The Talmud asks: <b>From where do we</b> derive the <i>halakha</i> taught in the Mishnah that the Megilla may be read only during the day? The Talmud answers: <b>As the verse states: “And that these days should be remembered and kept”</b> (Esther 9:28). The word “days” indicates <b>during the day, yes, </b> but <b>at night, no. </b> The Talmud asks: <b>Let us say that this is a conclusive refutation of</b> the opinion of <b>R' Yehoshua ben Levi, as R' Yehoshua ben Levi said: A person is obligated to read the Megilla at night and</b> then <b>repeat it during the day. </b> The Talmud rejects this: There is no proof from here, <b>as when</b> the Mishnah <b>teaches</b> that the Megilla may be read only during the day, it was referring to <b>the daytime</b> reading, but the nighttime reading is not considered here at all."
        },
        {
          "verseLocation": "Esther 9:28",
          "verseText": "the verse states: “That these days should be remembered and kept”",
          "talmudLocation": "Megillah 20b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/20b#section-11",
          "talmudFullText": "<strong>Talmud: </strong> The Talmud asks: <b>From where do we</b> derive that these mitzvot were commanded to be performed specifically during the day? With regard to reading the Megilla, <b>the verse states: “That these days should be remembered and kept”</b> (Esther 9:28). <b>For reciting the <i>hallel</i>, </b> the proof is from <b>that which is written</b> in <i>hallel</i>: <b>“From the rising of the sun to its setting, </b> YHWH’s name is to be praised” (Psalms 113:3). <b>R' Yosei said: </b> The proof is from another verse in <i>hallel</i>: <b>“This is the day that YHWH has made”</b> (Psalms 118:24), implying that it is to be recited during the day and not at night."
        },
        {
          "verseLocation": "Esther 9:28",
          "verseText": "the verse states: “That these days should be remembered and observed”",
          "talmudLocation": "Megillah 2b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2b#section-12",
          "talmudFullText": "The Talmud comments: <b>We found</b> a source for <b>observing</b> the holiday of Purim on the fourteenth of Adar in unwalled towns and on the fifteenth of Adar in walled cities; <b>from where do we</b> derive that <b>remembering</b> the story of Purim through the reading of the Megilla takes place on these days? The Talmud explains that <b>the verse states: “That these days should be remembered and observed”</b> (Esther 9:28), from which it is derived that <b>remembering is compared to observing. </b>"
        },
        {
          "verseLocation": "Esther 9:28",
          "verseText": "every province, and every city”",
          "talmudLocation": "Megillah 2b:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2b#section-19",
          "talmudFullText": "The Talmud asks: <b>Granted, according</b> to <b>the <i>tanna</i> of our</b> Mishnah, <b>this is</b> the meaning of <b>what is written: </b> “And these days should be remembered and observed throughout every generation, every family, <b>every province, and every city”</b> (Esther 9:28). The phrase <b>“every province [<i>medina</i>]”</b> is expressed in the verse using repetition, so that it reads literally: Every province and province, and therefore contains a superfluous usage of the word province, is meant <b>to distinguish between</b> cities <b>that were surrounded by a wall since the days of Joshua, son of Nun, </b> where the Megilla is read on the fifteenth, <b>and</b> a city that <b>was surrounded by a wall since the days of Ahasuerus, </b> where the Megilla is read on the fourteenth."
        },
        {
          "verseLocation": "Esther 9:28",
          "verseText": "“every family”",
          "talmudLocation": "Megillah 3a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/3a#section-15",
          "talmudFullText": "§ After this digression, the Talmud returns to the exposition of a verse cited above. <b>Now</b> that <b>you have said</b> that the phrases <b>“every province” and “every city”</b> appear <b>for</b> the purposes of midrashic <b>exposition, for what</b> exposition do the words <b>“every family”</b> appear in that same verse (Esther 9:28)? <b>R' Yosei bar Ḥanina said: </b> These words come <b>to include the priestly and Levitical families, </b> and indicate <b>that they cancel their service</b> in the Temple <b>and come to hear the reading of the Megilla. </b>"
        },
        {
          "verseLocation": "Esther 9:28",
          "verseText": "Rabbi Yosei bar Ḥanina",
          "talmudLocation": "Megillah 3b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/3b#section-6",
          "talmudFullText": "§ <b>Rava said: </b> It <b>is obvious to me</b> that if one must choose between Temple <b>service and reading the Megilla, reading the Megilla</b> takes <b>precedence, based upon</b> the exposition of <b>R' Yosei bar Ḥanina</b> with regard to the phrase “every family” (Esther 9:28). Similarly, if one must choose between <b>Torah study and reading the Megilla, reading the Megilla</b> takes <b>precedence, based upon</b> the fact that the rabbis of <b>the house of R'</b> Yehuda HaNasi <b>relied</b> on R' Yosei bar Ḥanina’s exposition to rule that one interrupts Torah study to hear the reading of the Megilla."
        },
        {
          "verseLocation": "Esther 9:28",
          "verseText": "from here: “And these days of Purim shall not cease from among the Jews”",
          "talmudLocation": "Megillah 7a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/7a#section-19",
          "talmudFullText": "<b>Rav Yosef said: </b> Proof that the book of Esther was divinely inspired may be cited <b>from here: “And these days of Purim shall not cease from among the Jews”</b> (Esther 9:28), an assertion that could have been made only with Holy Spirit. <b>Rav Naḥman bar Yitzḥak says: </b> Proof may be cited <b>from here, </b> at the end of that verse: <b>“Nor the memorial of them perish from their seed”</b> (Esther 9:28)."
        },
        {
          "verseLocation": "Esther 9:29",
          "verseText": "and Mordecai the Jew, wrote about all the acts of power",
          "talmudLocation": "Megillah 19a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-12",
          "talmudFullText": "<b>R' Yoḥanan said: And all of</b> these <i>tanna’im</i>, in arriving at their respective opinions, <b>were expounding the same verse. </b> As it is stated: <b>“Then Esther the queen, </b> the daughter of Abihail, <b>and Mordecai the Jew, wrote about all the acts of power</b> to confirm this second letter of Purim” (Esther 9:29). <b>The one who said</b> that the Megilla must be read <b>in its entirety</b> interprets “acts of power” as referring to <b>the power of Ahasuerus, </b> and so the Megilla must be read from the beginning, where the power of Ahasuerus is recounted."
        },
        {
          "verseLocation": "Esther 9:29",
          "verseText": "referred to as a “letter”",
          "talmudLocation": "Megillah 19a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-20",
          "talmudFullText": "<b>And R' Ḥelbo said</b> further that <b>Rav Ḥama bar Gurya said</b> that <b>Rav said: </b> The <b>Megilla is referred to as a “book”</b> (Esther 9:32), <b>and it is</b> also <b>referred to as a “letter”</b> (Esther 9:29). <b>It is called a book, </b> indicating a comparison to the book of the Torah, i.e., to a Torah scroll, to teach us <b>that if one sewed</b> its parchment sheets together <b>with flax threads</b> the Megilla <b>is unfit, </b> just as a Torah scroll sewn in this manner is unfit. <b>And it is called a letter</b> to teach us <b>that if one stitched</b> the Megilla sheets together <b>with</b> only <b>three threads of sinew, </b> in the manner of a letter, the Megilla <b>is fit</b> for use, as it does not have to be completely stitched like a Torah scroll. <b>Rav Naḥman said: This is</b> true <b>provided that</b> the stitches are <b>made in three parts. </b>"
        },
        {
          "verseLocation": "Esther 9:29",
          "verseText": "wrote",
          "talmudLocation": "Megillah 19a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-3",
          "talmudFullText": "The Mishnah concludes: He does not fulfill his obligation unless the Megilla is written <b>“upon parchment and with ink. ”</b> The Talmud asks: <b>From where do we</b> derive this? The Talmud answers: It is <b>derived</b> by way of a verbal analogy between one instance of <b>writing</b> and another instance of <b>writing. It is written here</b> in the book of Esther: <b>“Then Esther the queen, </b> the daughter of Abihail, and Mordecai the Jew, <b>wrote</b> all the acts of power, to confirm this second letter of Purim” (Esther 9:29), <b>and it is written there: “Then Baruch answered them: He pronounced all these words to me with his mouth, and I wrote them with ink on the parchment”</b> (Jeremiah 36:18). Just as there the writing was with ink on parchment, so too here, a Megilla must be written with ink on parchment."
        },
        {
          "verseLocation": "Esther 9:29",
          "verseText": "from here, as it is written: “To confirm this second letter of Purim”",
          "talmudLocation": "Megillah 6b:28",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/6b#section-28",
          "talmudFullText": "<b>R' Elazar said: The reason</b> for the opinion <b>of Rabban Shimon ben Gamliel</b> is derived <b>from here, as it is written: “To confirm this second letter of Purim”</b> (Esther 9:29), indicating that there are circumstances where the Megilla is read a second time (Jerusalem Talmud), i.e., when the year was intercalated after the Megilla was read in the first Adar."
        },
        {
          "verseLocation": "Esther 9:30",
          "verseText": "“Words of peace and truth”",
          "talmudLocation": "Megillah 16b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16b#section-15",
          "talmudFullText": "With regard to what is stated: <b>“Words of peace and truth”</b> (Esther 9:30), <b>R' Tanḥum said, and some say</b> that <b>R' Asi</b> said: This <b>teaches that</b> a Megilla scroll <b>requires scoring, </b> i.e., that the lines for the text must be scored onto the parchment, <b>as the Torah itself, </b> i.e., as is done in a Torah scroll."
        },
        {
          "verseLocation": "Esther 9:31",
          "verseText": "the verse states: “To confirm these days of Purim in their times”",
          "talmudLocation": "Megillah 2a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2a#section-8",
          "talmudFullText": "<b>Rav Shemen bar Abba said</b> that <b>R' Yoḥanan said: </b> It is alluded to when <b>the verse states: “To confirm these days of Purim in their times”</b> (Esther 9:31). The phrase “in their times” indicates that <b>they enacted many times for them</b> and not only two days."
        },
        {
          "verseLocation": "Esther 9:31",
          "verseText": "The verse states: “In their times”",
          "talmudLocation": "Megillah 2b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/2b#section-10",
          "talmudFullText": "The Talmud suggests: <b>Say</b> that residents of <b>unwalled towns</b> celebrate Purim <b>on the fourteenth, </b> as stated in the verse, and with regard to residents of <b>walled cities, if they wish</b> they may celebrate it <b>on the fourteenth, </b> and <b>if they wish</b> they may celebrate it <b>on the fifteenth. </b> The Talmud responds: <b>The verse states: “In their times”</b> (Esther 9:31), indicating that <b>the time</b> when the residents of <b>this</b> place celebrate Purim <b>is not the time</b> when the residents of <b>that</b> place celebrate Purim."
        },
        {
          "verseLocation": "Esther 9:31",
          "verseText": "days of Purim in their appointed times”",
          "talmudLocation": "Yevamot 13b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/13b#section-20",
          "talmudFullText": "Reish Lakish <b>said to</b> R' Yoḥanan: <b>I speak to you</b> of <b>a prohibition, </b> as residents of villages are prohibited from reading the Megilla with a blessing on the fifteenth of Adar, <b>as Rav Shemen bar Abba said</b> that <b>R' Yoḥanan said: </b> The verse <b>“to confirm</b> these <b>days of Purim in their appointed times”</b> (Esther 9:31) teaches that <b>the rabbis instituted many times for their</b> reading, and it is prohibited to deviate from these dates. <b>And you speak to me</b> about <b>a custom</b> that does not involve a prohibition. How can a prohibition be established in a manner that involves the formation of factions among the people?"
        },
        {
          "verseLocation": "Esther 9:32",
          "verseText": "Megilla is referred to as a “book”",
          "talmudLocation": "Megillah 19a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/19a#section-20",
          "talmudFullText": "<b>And R' Ḥelbo said</b> further that <b>Rav Ḥama bar Gurya said</b> that <b>Rav said: </b> The <b>Megilla is referred to as a “book”</b> (Esther 9:32), <b>and it is</b> also <b>referred to as a “letter”</b> (Esther 9:29). <b>It is called a book, </b> indicating a comparison to the book of the Torah, i.e., to a Torah scroll, to teach us <b>that if one sewed</b> its parchment sheets together <b>with flax threads</b> the Megilla <b>is unfit, </b> just as a Torah scroll sewn in this manner is unfit. <b>And it is called a letter</b> to teach us <b>that if one stitched</b> the Megilla sheets together <b>with</b> only <b>three threads of sinew, </b> in the manner of a letter, the Megilla <b>is fit</b> for use, as it does not have to be completely stitched like a Torah scroll. <b>Rav Naḥman said: This is</b> true <b>provided that</b> the stitches are <b>made in three parts. </b>"
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "Esther 10:1",
          "verseText": "As it is written: “And the king Ahasuerus laid a tribute [ mas ] upon the land”",
          "talmudLocation": "Chagigah 8a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/8a#section-8",
          "talmudFullText": "The Talmud asks: <b>From where may it be inferred that this: “After the measure [<i>missat</i>], ”</b> mentioned in the verse, <b>is a term for non-sacred</b> property? The Talmud answers: <b>As it is written: “And the king Ahasuerus laid a tribute [<i>mas</i>] upon the land”</b> (Esther 10:1), which is clearly referring to a tribute of non-sacred property."
        },
        {
          "verseLocation": "Esther 10:1",
          "verseText": "rash ] in his days, as it is stated: “And the king Ahasuerus laid a tribute",
          "talmudLocation": "Megillah 11a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-16",
          "talmudFullText": "<b>And Shmuel said: </b> The name Ahasuerus should be understood in the sense of black [<i>shaḥor</i>], as <b>the face of the Jewish people was blackened in his days like the bottom of a pot. And R' Yoḥanan said</b> a different explanation: <b>Everyone who recalled him said: “Woe upon his head” [<i>aḥ lerosho</i>]. And R' Ḥanina said: </b> The name alludes to the fact <b>that everyone became poor</b> [<b><i>rash</i>] in his days, as it is stated: “And the king Ahasuerus laid a tribute</b> upon the land” (Esther 10:1)."
        },
        {
          "verseLocation": "Esther 10:2",
          "verseText": "of the kings of Media and Persia”",
          "talmudLocation": "Megillah 12a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-6",
          "talmudFullText": "§ The Talmud returns to its interpretations of verses in the Megilla. The Megilla mentions that among those invited to the king’s feast were: <b>“The army of Persia and Media, the nobles</b> and princes of the provinces” (Esther 1:3), <b>and it is written</b> near the conclusion of the Megilla: “In the book of chronicles <b>of the kings of Media and Persia”</b> (Esther 10:2). Why is Persia mentioned first at the beginning of the Megilla, while later in the Megilla, Media is mentioned first? <b>Rava said</b> in response: These two peoples, the Persians and the Medes, <b>stipulated with each other, </b> saying: <b>If the kings</b> will come <b>from us, the ministers</b> will come <b>from you; and if the kings</b> will come <b>from you, the ministers</b> will come <b>from us. </b> Therefore, in reference to kings, Media is mentioned first, whereas in connection with nobles and princes, Persia is given priority."
        },
        {
          "verseLocation": "Esther 10:3",
          "verseText": "“For Mordecai the Jew was second to the king Ahasuerus, and great among the Jews, and accepted by the majority of his brethren”",
          "talmudLocation": "Megillah 16b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16b#section-17",
          "talmudFullText": "The verse states: <b>“For Mordecai the Jew was second to the king Ahasuerus, and great among the Jews, and accepted by the majority of his brethren”</b> (Esther 10:3). The Talmud comments: The verse indicates that Mordecai was accepted only <b>“By the majority of his brethren, ” but not by all his brethren. </b> This <b>teaches that some</b> members <b>of the Sanhedrin parted from him, </b> because he occupied himself with community needs, and was therefore compelled to neglect his Torah study. They felt that this was a mistake and that he should have remained active on the Sanhedrin."
        }
      ]
    }
  ]
}