{
  "bookName": "Ezra",
  "totalEntries": 64,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Ezra 1:2",
          "verseText": "has given me all the kingdoms of the earth”",
          "talmudLocation": "Megillah 11b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-5",
          "talmudFullText": "The Talmud raises another question: <b>But there is Cyrus, as it is written: “Thus says Cyrus, king of Persia: YHWH, </b> God of heaven, <b>has given me all the kingdoms of the earth”</b> (Ezra 1:2). The Talmud answers: This is not proof that he ruled the world, for <b>there he was</b> merely <b>boasting about himself, </b> although in fact there was no truth to his words."
        },
        {
          "verseLocation": "Ezra 1:2",
          "verseText": "“Thus says Cyrus king of Persia: The Lord, God of heaven, has given me all the kingdoms of the earth; and He has charged [ pakad ] me to build Him a house in Jerusalem”",
          "talmudLocation": "Megillah 12a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-4",
          "talmudFullText": "<b>Rava said</b> in response: The seventy years that “are accomplished for Babylonia” were <b>only for being remembered [<i>lifekida</i>], </b> as mentioned in the verse, allowing the Jews to return to Eretz Yisrael but not to build the Temple. <b>And this is as it is written</b> with regard to Cyrus’s proclamation permitting the Jewish people’s return to Eretz Yisrael, in the seventieth year of the Babylonian exile: <b>“Thus says Cyrus king of Persia: YHWH, God of heaven, has given me all the kingdoms of the earth; and He has charged [<i>pakad</i>] me to build Him a house in Jerusalem”</b> (Ezra 1:2). The verse makes use of the same root, <i>peh-kuf-dalet</i>, heralding the return to Jerusalem to build the Temple, but not its actual completion."
        },
        {
          "verseLocation": "Ezra 1:3",
          "verseText": "Rather, he said: “Whoever is among you of all His people…let him go up",
          "talmudLocation": "Megillah 12a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/12a#section-5",
          "talmudFullText": "Apropos its mention of Cyrus, the Talmud states that <b>Rav Naḥman bar Rav Ḥisda interpreted homiletically</b> a verse concerning Cyrus: <b>What is</b> the meaning of that <b>which is written: “Thus says YHWH to His anointed, to Cyrus, whose right hand I have held”</b> (Isaiah 45:1), which seemingly is referring to Cyrus as God’s anointed? <b>Now was Cyrus</b> God’s anointed one, i.e., the <b>Messiah, </b> that the verse should refer to him in this manner? <b>Rather, </b> the verse should be understood as God speaking to the Messiah with regard to Cyrus: <b>God said to the Messiah: I am complaining to you about Cyrus, </b> who is not acting in accordance with what he is intended to do. <b>I had said: “He shall build My House and gather My exiles”</b> (see Isaiah 45:13), but he did not carry this out. <b>Rather, he said: “Whoever is among you of all His people…let him go up</b> to Jerusalem” (Ezra 1:3). He gave permission to return to Israel, but he did no more than that."
        },
        {
          "verseLocation": "Ezra 1:10",
          "verseText": "as it is written: “Atoning bowls [ keforei ] of gold”",
          "talmudLocation": "Menachot 7b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/7b#section-21",
          "talmudFullText": "<b>Abaye said: </b> He wipes his finger <b>on the edge of</b> the <b>bowl</b> containing the blood, <b>as it is written: “Atoning bowls [<i>keforei</i>] of gold”</b> (Ezra 1:10), which is referring to the bowls containing the blood. The root <i>kafar</i> can also mean to wipe."
        },
        {
          "verseLocation": "Ezra 1:10",
          "verseText": "“Atoning-bowls [ keforei ] of gold”",
          "talmudLocation": "Zevachim 25a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/25a#section-12",
          "talmudFullText": "The Talmud asks: <b>And with what does he wipe</b> the <b>blood</b> from the <b>knife? Abaye says: </b> He wipes it <b>with the rim of</b> the <b>bowl</b> used to collect the blood, <b>as it is written</b> of the bowls used to collect the blood: <b>“Atoning-bowls [<i>keforei</i>] of gold”</b> (Ezra 1:10). The root <i>kaf</i>, <i>peh</i>, <i>reish</i> can also mean to wipe."
        },
        {
          "verseLocation": "Ezra 1:10",
          "verseText": "as it is written: “Atoning bowls [ keforei ] of gold”",
          "talmudLocation": "Zevachim 93b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/93b#section-14",
          "talmudFullText": "The Talmud asks: <b>Granted, </b> if he <b>concluded</b> sprinkling, <b>he wipes his hand on the body of</b> the red <b>heifer, as it is stated: “And the heifer shall be burned in his sight; </b> its skin, and its flesh, and its blood” (Numbers 19:5), indicating that the remaining blood must be incinerated together with the flesh. <b>But on what does he wipe his finger</b> after each sprinkling, since he must not wipe it on the body of the heifer, which might cause hair to stick to his finger, interfering with the sprinkling? <b>Abaye said: </b> He wipes his finger <b>on the lip of</b> the <b>bowl</b> holding the blood for sprinkling, <b>as it is written: “Atoning bowls [<i>keforei</i>] of gold”</b> (Ezra 1:10). The atoning bowls are so named because the priest wipes his finger on them, and the word <i>keforei</i> indicates cleansing by way of wiping (see <i>Ḥullin</i> 8b)."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Ezra 2:2",
          "verseText": "At first it is written: “Who came with Zerubbabel, Jeshua, Nehemiah, Seraiah, Reelaiah, Mordecai, Bilshan”",
          "talmudLocation": "Megillah 16b:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/16b#section-18",
          "talmudFullText": "<b>Rav Yosef said: Studying Torah is greater than saving lives, as initially, </b> when listing the Jewish leaders who came to Eretz Yisrael, <b>Mordecai was mentioned after four</b> other people, <b>but at the end</b> he was listed <b>after five. </b> This is taken to indicate that his involvement in governmental affairs instead of in Torah study lowered his stature one notch. The Talmud proves this: <b>At first it is written: “Who came with Zerubbabel, Jeshua, Nehemiah, Seraiah, Reelaiah, Mordecai, Bilshan”</b> (Ezra 2:2); <b>but in the end</b> in a later list <b>it is written: “Who came with Zerubbabel, Jeshua, Nehemiah, Azariah, Raamiah, Nahmani, Mordecai, Bilshan”</b> (Nehemiah 7:7)."
        },
        {
          "verseLocation": "Ezra 2:63",
          "verseText": "But isn’t it written: “That they should not partake of the most sacred items [ kodesh hakodashim ]”",
          "talmudLocation": "Ketubot 25a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/25a#section-3",
          "talmudFullText": "The Talmud asks: <b>And did they</b> in fact <b>not partake of <i>teruma</i> by Torah</b> law? <b>But isn’t it written: “That they should not partake of the most sacred items [<i>kodesh hakodashim</i>]”</b> (Ezra 2:63), from which it may be inferred: It is <b>of the most sacred items, </b> i.e., offerings, <b>that they did not partake; of <i>teruma</i> by Torah</b> law, <b>they did partake. </b>"
        },
        {
          "verseLocation": "Ezra 2:63",
          "verseText": "But isn’t it written: “And the Tirshatha said to them that they should not eat of the offerings of the most sacred order [ kodesh hakodashim ]”",
          "talmudLocation": "Kiddushin 69b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/69b#section-15",
          "talmudFullText": "The Talmud asks: <b>But isn’t it written: “And the Tirshatha said to them that they should not eat of the offerings of the most sacred order [<i>kodesh hakodashim</i>]”</b> (Ezra 2:63)? This indicates that <b>it is from the offerings of the most sacred order that they may not eat, but anything</b> else, i.e., offerings not of the most sacred order, <b>they may eat, </b> including produce that is <i>teruma</i> by Torah law."
        },
        {
          "verseLocation": "Ezra 2:63",
          "verseText": "“And the Tirshatha said to them that they should not eat of the most sacred things, until there stood a priest with the Urim VeTummim ”",
          "talmudLocation": "Sotah 48b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/48b#section-5",
          "talmudFullText": "<b>And if a person would whisper to you saying</b> that the <i>Urim VeTummim</i> was still extant, as it states with regard to when the Second Temple first stood: <b>“And the Tirshatha said to them that they should not eat of the most sacred things, until there stood a priest with the <i>Urim VeTummim</i>”</b> (Ezra 2:63), which seems to indicate that they merely had to wait until the Second Temple was built for the reappearance of the <i>Urim VeTummim</i>; you should <b>say to him</b> that this is not referring to an expectation of a short-term development, but it is <b>like a person who says to his friend, </b> with regard to something that will occur in the distant future: <b>Until the dead live and the Messiah, </b> the <b>son of David, comes. </b> In any case, the <i>baraita</i> indicates that the <i>Urim VeTummim</i> ceased only from the time when the First Temple was destroyed, and not in the time of Solomon."
        },
        {
          "verseLocation": "Ezra 2:64",
          "verseText": "which it is written: “The whole congregation together was 42,360”",
          "talmudLocation": "Arakhin 32b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/32b#section-15",
          "talmudFullText": "The <i>baraita</i> cited earlier teaches that the Jews began counting the Jubilee Year upon their return from exile. The Talmud asks: <b>But did they count Sabbatical</b> Years <b>and Jubilee</b> Years in the days of Ezra? <b>Now, </b> if <b>from</b> the time <b>that the tribe of Reuben and the tribe of Gad and half the tribe of Manasseh were exiled</b> (see I Chronicles 5:26) the counting of <b>Jubilee</b> Years was <b>nullified, </b> despite the fact that a majority of Jews lived in Eretz Yisrael, then in the time of <b>Ezra, </b> about <b>which it is written: “The whole congregation together was 42, 360”</b> (Ezra 2:64), <b>would</b> they have <b>counted</b> Jubilee Years?"
        },
        {
          "verseLocation": "Ezra 2:64",
          "verseText": "when the Jewish people were not very numerous, as it is written: “The whole congregation together was forty and two thousand three hundred and sixty”",
          "talmudLocation": "Bava Metzia 28a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/28a#section-17",
          "talmudFullText": "The Talmud explains the answer: <b>During the First Temple</b> period, <b>when the Jewish people were very numerous, as it is written with regard to them: “Judea and Israel were many, as the sand that is by the sea in multitude, </b> eating and drinking and rejoicing” (I Kings 4:20), <b>we need that much</b> time for them to travel from Jerusalem to the farthest reaches of Eretz Yisrael, due to the wide distribution of the large population. <b>During the Second Temple</b> period, <b>when the Jewish people were not very numerous, as it is written: “The whole congregation together was forty and two thousand three hundred and sixty”</b> (Ezra 2:64), <b>we do not need that much</b> time for them to travel from Jerusalem to the farthest reaches of Eretz Yisrael, due to the limited distribution of the small population."
        },
        {
          "verseLocation": "Ezra 2:64",
          "verseText": "thousand",
          "talmudLocation": "Zevachim 61b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/61b#section-9",
          "talmudFullText": "<b>Abaye said to him: Now, </b> if in <b>the First Temple</b> era, <b>about which it is written: “Judah and Israel were many as the sand that is by the sea”</b> (I Kings 4:20), the altar <b>was sufficient, </b> how could it be that in <b>the Second Temple</b> era, <b>about which it is written: “The whole congregation together was forty</b> and two <b>thousand</b> three hundred and sixty” (Ezra 2:64), the altar <b>was not sufficient? </b> Rav Yosef <b>said to</b> Abaye: <b>There, </b> in the First Temple, a <b>heavenly fire</b> would <b>assist them</b> and consume the offerings. <b>Here, </b> in the Second Temple, there was <b>no heavenly fire</b> that would <b>assist them. </b> Therefore, they needed a larger area in which to burn the offerings."
        },
        {
          "verseLocation": "Ezra 2:70",
          "verseText": "and all Israel in their cities”",
          "talmudLocation": "Bava Metzia 28a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/28a#section-18",
          "talmudFullText": "<b>Abaye said to</b> Rav Yosef: <b>But isn’t it written: “So the priests, and the Levites, </b> and some of the people, <b>and the singers, and the porters, </b> and the Gibeonites, dwelt in their cities, <b>and all Israel in their cities”</b> (Ezra 2:70). The verse indicates that despite their limited numbers, the Jewish people dwelt in all the cities that they inhabited previously, and the distance to the far reaches of Eretz Yisrael was no shorter during the Second Temple period."
        },
        {
          "verseLocation": "Ezra 2:70",
          "verseText": "As it is written: “So the priests, and the Levites, and some of the people, and the singers, and the gatekeepers, and the Gibeonites dwelt in their cities, and all of Israel in their cities”",
          "talmudLocation": "Kiddushin 69b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/69b#section-8",
          "talmudFullText": "§ The Mishnah included in its list of types of lineage <b>priests, Levites, and Israelites. </b> The Talmud asks: <b>From where do we</b> derive <b>that they ascended? </b> The Talmud answers: <b>As it is written: “So the priests, and the Levites, and some of the people, and the singers, and the gatekeepers, and the Gibeonites dwelt in their cities, and all of Israel in their cities”</b> (Ezra 2:70). The verse specifies priests, Levites, and all of Israel."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Ezra 3:3",
          "verseText": "“And they set the altar upon its bases”",
          "talmudLocation": "Zevachim 62a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/62a#section-2",
          "talmudFullText": "The Talmud relates that after reconsidering the reason for the expansion of the altar, <b>Rav Yosef said: Is this not as it is taught</b> in a <i>baraita</i> with regard to the verse: <b>“And they set the altar upon its bases”</b> (Ezra 3:3), which teaches <b>that</b> in the Second Temple the size of the altar <b>reached its full measure, </b> i.e., that it was the ideal size, whereas in the First Temple it was not the ideal size? The Talmud asks: <b>But isn’t it written</b> with regard to the instructions David gave Solomon about how to build the Temple: <b>“All this in writing, as YHWH has made me wise by His hand upon me, </b> even all the works of this pattern” (I Chronicles 28:19), indicating that the design of the First Temple was dictated by God?"
        },
        {
          "verseLocation": "Ezra 3:8",
          "verseText": "as it is written: “And appointed the Levites, from twenty years old and upward, to oversee of the work of the House of the Lord”",
          "talmudLocation": "Chullin 24b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/24b#section-6",
          "talmudFullText": "<b>Rav Ḥisda said: What is the reason</b> for the opinion <b>of R'</b> Yehuda HaNasi? The reason is <b>as it is written: “And appointed the Levites, from twenty years old and upward, to oversee of the work of the House of YHWH”</b> (Ezra 3:8). <b>And</b> what does <b>the other</b> <i>tanna</i> hold? He holds that <b>to oversee is different</b> and requires an older priest."
        },
        {
          "verseLocation": "Ezra 3:9",
          "verseText": "Rabbi Yoḥanan says: As the verse states: “Then stood Jeshua with his sons and his brethren, and Kadmiel and his sons, the sons of Judah, together, to make music for the workmen in the House of God”",
          "talmudLocation": "Arakhin 13b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/13b#section-9",
          "talmudFullText": "§ The Mishnah teaches: <b>A minor</b> Levite may <b>enter the Temple courtyard for service only at a time when the Levites</b> are engaging in song. The Talmud asks: <b>From where is this matter</b> derived? <b>R' Yoḥanan says: As the verse states: “Then stood Jeshua with his sons and his brethren, and Kadmiel and his sons, the sons of Judah, together, to make music for the workmen in the House of God”</b> (Ezra 3:9). This verse shows that in making music it is preferable to have one’s sons, i.e., minors, as accompaniment."
        },
        {
          "verseLocation": "Ezra 3:12",
          "verseText": "as it is written: “Many of the priests and Levites and heads of patrilineal houses,",
          "talmudLocation": "Horayot 6a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/6a#section-8",
          "talmudFullText": "The Talmud asks: <b>Are</b> these matters <b>comparable? There, </b> in the case of the heifer whose neck is broken, <b>all</b> the residents of the city on whose behalf the rite was performed <b>are present</b> when they perform the rite, and <b>since it atones for the living, it also atones for the dead. But here, </b> in the case of those returning from Zion, <b>are</b> any of the people who worshipped idols during the time of Zedekiah <b>alive</b> when the offering is sacrificed? The Talmud answers: <b>Yes, it is indeed so</b> that there were people from that period still alive, <b>as it is written: “Many of the priests and Levites and heads of patrilineal houses, </b> the elders that had seen the first house standing on its foundation, wept with a loud voice when this house was before their eyes. And many shouted aloud for joy” (Ezra 3:12)."
        },
        {
          "verseLocation": "Ezra 3:12",
          "verseText": "and many shouted aloud",
          "talmudLocation": "Temurah 15b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/15b#section-7",
          "talmudFullText": "<b>And if you wish, say</b> instead a different answer in response to the earlier difficulty: The sin offerings for idolatry brought by the returning exiles were not in fact sacrificed for people who had died. Rather, <b>when they sacrificed these sin offerings</b> for the idolatry committed in the time of Zedekiah, <b>they sacrificed them for the living, </b> i.e., for those survivors who had worshipped idols in the time of Zedekiah and were still alive many decades later and had returned to rebuild the Second Temple. <b>As it is written: “But many of the priests, Levites, and heads of fathers’ houses, the old men that had seen the first house standing on its foundation, wept with a loud voice when this house</b> was before their eyes; <b>and many shouted aloud</b> for joy” (Ezra 3:12)."
        },
        {
          "verseLocation": "Ezra 3:13",
          "verseText": "and the noise was heard far off”",
          "talmudLocation": "Horayot 6a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/6a#section-9",
          "talmudFullText": "The Talmud challenges: <b>But perhaps those</b> elders <b>were few</b> in number, <b>and were not many, </b> and the majority of those present consisted of people who were not alive during the days of Zedekiah. The Talmud answers: <b>Isn’t it written: “And the people could not discern the noise of the shout of joy from the noise of the weeping of the people; </b> as the people shouted with a loud shout, <b>and the noise was heard far off”</b> (Ezra 3:13)? This indicates that the weeping elders who survived from the era of Zedekiah outnumbered the younger people."
        },
        {
          "verseLocation": "Ezra 3:13",
          "verseText": "“So that the people could not discern the noise of the shout of joy from the noise of the weeping of the people;",
          "talmudLocation": "Temurah 15b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/15b#section-8",
          "talmudFullText": "The Talmud objects: <b>But perhaps those</b> who remained and remembered the First Temple were <b>the minority, </b> in which case they should have each brought individual sin offerings, rather than a communal sin offering. The fact that they brought communal sacrifices indicates that the sin offering was not brought only on behalf of those few who remained. The Talmud explains: <b>You cannot say</b> that they were the minority, <b>as it is written</b> in the following verse: <b>“So that the people could not discern the noise of the shout of joy from the noise of the weeping of the people; </b> for the people shouted with a loud shout, and the noise was heard afar off” (Ezra 3:13). This verse shows that the people who cried because they remembered the First Temple were not a small minority."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Ezra 4:3",
          "verseText": "“You have nothing to do with us to build a house to our God”",
          "talmudLocation": "Arakhin 5b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/5b#section-15",
          "talmudFullText": "Rava elaborates: <b>R' Meir’s <i>halakha</i></b> that non-Jews cannot take a valuation vow <b>is reasonable, as it is written</b> that the Jews who returned to Eretz Yisrael from Babylonia rejected the Samaritans’ request to assist them in the construction of the Second Temple, saying: <b>“You have nothing to do with us to build a house to our God”</b> (Ezra 4:3). This supports R' Meir’s contention that non-Jews may not take vows of valuation, which are used for Temple maintenance. But <b>his explanation is not reasonable, as he adduces</b> proof <b>for</b> his <i>halakha</i> <b>from</b> the fact that <b>a deaf-mute, an imbecile, and a minor</b> cannot take a vow of valuation. This proof is unconvincing, since <b>a deaf-mute, an imbecile, and a minor are different, as</b> unlike non-Jews, they <b>lack the</b> presumed <b>mental competence</b> to make a commitment."
        },
        {
          "verseLocation": "Ezra 4:4",
          "verseText": "As it is written: “Then the people of the land weakened the hands of the people of Judah, and harried them while they were building”",
          "talmudLocation": "Arakhin 5b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/5b#section-20",
          "talmudFullText": "<b>Rather, Rava said</b> that actually R' Yehuda maintains that the valuation of a non-Jew is given to Temple maintenance and is not interred. And as for that which the Jews said to the non-Jews in the time of the Second Temple: “You have nothing to do with us,” that refusal was not for halakhic reasons. Rather, <b>it</b> was <b>due to</b> the non-Jews’ attempt to foster <b>weakening of the hands</b> of those rebuilding the Temple. <b>As it is written: “Then the people of the land weakened the hands of the people of Judah, and harried them while they were building”</b> (Ezra 4:4)."
        },
        {
          "verseLocation": "Ezra 4:6",
          "verseText": "as it is stated: “And in the reign of Ahasuerus, in the beginning of his reign, they wrote to him an accusation against the inhabitants of Judah and Jerusalem”",
          "talmudLocation": "Megillah 11a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-15",
          "talmudFullText": "The Talmud continues with its explanation of the book of Esther, beginning with a discussion of the name <b>Ahasuerus. Rav said: </b> The name should be viewed as a contraction: <b>The brother of the head [<i>aḥiv shel rosh</i>] and of the same character as the head [<i>ben gilo shel rosh</i>]. </b> Rav explains: <b>The brother of the head, </b> i.e., <b>the brother of the wicked Nebuchadnezzar, who is called “head, ” as it is stated: “You are the head of gold”</b> (Daniel 2:38). <b>Of the same character as the head, for he, </b> Nebuchadnezzar, <b>killed</b> the Jews, and <b>he, </b> Ahasuerus, <b>sought to kill</b> them. <b>He destroyed</b> the Temple, and <b>he sought to destroy</b> the foundations for the Temple laid by Zerubbabel, <b>as it is stated: “And in the reign of Ahasuerus, in the beginning of his reign, they wrote to him an accusation against the inhabitants of Judah and Jerusalem”</b> (Ezra 4:6), and he ordered that the construction of the Temple cease."
        },
        {
          "verseLocation": "Ezra 4:7",
          "verseText": "“And the writing of the letter [ hannishtevan ] was written in the Aramaic script, and set forth in the Aramaic tongue”",
          "talmudLocation": "Sanhedrin 22a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22a#section-1",
          "talmudFullText": "<b>“And the writing of the letter [<i>hannishtevan</i>] was written in the Aramaic script, and set forth in the Aramaic tongue”</b> (Ezra 4:7). The term “<i>hannishtevan</i>” is similar to the word <i>nishtana</i>, meaning changed, alluding to the fact that the script had been changed. <b>And it is written</b> with regard to the writing on the wall of Belshazzar’s palace: <b>“Then came in all the king’s wise men. But they could not read the writing, nor make known to the king the interpretation”</b> (Daniel 5:8), and the reason they could not read it is that it was written in the new script that Ezra would transmit. <b>And it is written: “That he shall write for himself a second [<i>mishne</i>] Torah”</b> (Deuteronomy 17:18), where “second [<i>mishne</i>]” teaches that it is written in <b>a script that is apt to be changed [<i>lehishtannot</i>]. </b>"
        },
        {
          "verseLocation": "Ezra 4:10",
          "verseText": "“the great and noble Asenappar”",
          "talmudLocation": "Sanhedrin 94a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94a#section-12",
          "talmudFullText": "The eight names of <b>Sennacherib</b> are <b>as it is written in his</b> regard among the kings of Assyria: <b>“Tiglath-Pileser”</b> (II Kings 15:29), <b>“</b>Tiglath-<b>Pilneser”</b> (II Chronicles 28:20), <b>“Shalmaneser”</b> (II Kings 17:3), <b>“Pul”</b> (II Kings 15:19), <b>“Sargon”</b> (Isaiah 20:1), and <b>“the great and noble Asenappar”</b> (Ezra 4:10). And the Talmud asks: <b>But isn’t there</b> an additional name, <b>Sennacherib [<i>Sanḥeriv</i>]? </b> The Talmud explains: That was not a given name; rather, it is an appellation based on the fact <b>that his speech is contentious [<i>siḥato riv</i>], </b> leading to quarrel and shame. <b>Alternatively, </b> he was called Sanḥeriv due to the fact <b>that he spoke [<i>saḥ</i>] and snorted out [<i>niḥer</i>]</b> contemptuous <b>statements vis-à-vis the Transcendent. </b>"
        },
        {
          "verseLocation": "Ezra 4:24",
          "verseText": "as it is written: “Then ceased the work of the House of God, which is at Jerusalem;",
          "talmudLocation": "Arakhin 13a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/13a#section-3",
          "talmudFullText": "It is known that Ezra ascended to Eretz Yisrael six years after the beginning of the construction of the Second Temple, <b>as it is written: “Then ceased the work of the House of God, which is at Jerusalem; </b> and it ceased until the second year of the reign of Darius, king of Persia” (Ezra 4:24). This proves that construction on the Temple started in the second year of the reign of Darius. <b>And it is written: “And this house was finished on the 3rd day of the month Adar, which was in the 6th year of the reign of Darius the king”</b> (Ezra 6:15), which was the 5th year from when they started building."
        },
        {
          "verseLocation": "Ezra 4:24",
          "verseText": "why is it written: “Then the work of the House of God, which is in Jerusalem, ceased;",
          "talmudLocation": "Megillah 11b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11b#section-14",
          "talmudFullText": "The Talmud asks: <b>Ultimately, how many</b> years <b>were lacking? Eleven, </b> for the exile of Zedekiah took place eleven years after that of Jehoiachin. <b>How many</b> years <b>did</b> Ahasuerus <b>reign</b> as king? <b>Fourteen. </b> Indeed, <b>in his fourteenth year, </b> then, <b>the Temple should have been built. </b> If so, <b>why is it written: “Then the work of the House of God, which is in Jerusalem, ceased; </b> so it ceased until the second year of the reign of Darius, king of Persia” (Ezra 4:24), which indicates that the Temple was not built during the entire reign of Ahasuerus? <b>Rava said: The years</b> reckoned <b>were partial</b> years. To complete the seventy years, it was necessary to wait until the second year of the rule of Darius II, when indeed the Temple was built."
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "Ezra 6:4",
          "verseText": "with three rows of great stones, and a row of new timber, and let the expense be paid out of the king’s house”",
          "talmudLocation": "Rosh Hashanah 4a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/4a#section-4",
          "talmudFullText": "<b>And if you wish, say: From where do we</b> derive <b>that</b> Cyrus <b>became corrupt? As it is written</b> with regard to the building of the Temple that he issued the following command: “Let the house be built…<b>with three rows of great stones, and a row of new timber, and let the expense be paid out of the king’s house”</b> (Ezra 6:4). <b>Why did he do it</b> in <b>this</b> manner and command that the Temple be built with a row of timber? <b>He thought: If the Jews rebel against me, I will burn</b> their Temple <b>with fire, </b> and it will be more flammable because of the wood."
        },
        {
          "verseLocation": "Ezra 6:9",
          "verseText": "“And that which they need, both young bullocks, and rams, and lambs, for the burnt-offerings of the God of heaven, wheat, salt, wine, and oil, according to the word of the priests who are at Jerusalem, let it be given them day by day without fail”",
          "talmudLocation": "Rosh Hashanah 4a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/4a#section-1",
          "talmudFullText": "<b>“And that which they need, both young bullocks, and rams, and lambs, for the burnt-offerings of the God of heaven, wheat, salt, wine, and oil, according to the word of the priests who are at Jerusalem, let it be given them day by day without fail”</b> (Ezra 6:9)? Doesn’t Cyrus’ contribution to the Temple demonstrate his fear of Heaven? <b>R' Yitzḥak said to</b> Rav Kahana: <b>My teacher, </b> a refutation can be brought <b>from your</b> own <b>burden, </b> from the text you yourself cited, as the next verse continues: <b>“That they may sacrifice offerings of sweet savor to the God of heaven, and pray for the life of the king and of his sons”</b> (Ezra 6:10). This shows that Cyrus did this solely for his own benefit, so that the Jews would sacrifice offerings and pray for him and his sons."
        },
        {
          "verseLocation": "Ezra 6:10",
          "verseText": "as it is stated: “That they may sacrifice offerings of pleasing aroma to the God of heaven, and pray for the life of the king and of his sons”",
          "talmudLocation": "Bava Batra 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/10b#section-7",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i>: <b>Rabban Yoḥanan ben Zakkai said to his students: My sons, what is</b> the meaning of <b>that which the verse states: “Righteousness exalts a nation, but the kindness of the peoples is sin”</b> (Proverbs 14:34)? <b>R' Eliezer answered and said: “Righteousness exalts a nation”; these are</b> the people of <b>Israel, as it is written: “And who is like your people Israel, one nation on the earth? ”</b> (I Chronicles 17:21). <b>“But the kindness of the peoples is sin, ”</b> meaning that <b>all the</b> acts of <b>charity and kindness that the nations of the world perform are</b> counted as <b>a sin for them, since they perform them only to elevate themselves</b> in prestige, <b>as it is stated: “That they may sacrifice offerings of pleasing aroma to the God of heaven, and pray for the life of the king and of his sons”</b> (Ezra 6:10). Even though they donated offerings, they did so only for their own benefit."
        },
        {
          "verseLocation": "Ezra 6:10",
          "verseText": "“That they may sacrifice offerings of sweet savor to the God of heaven, and pray for the life of the king and of his sons”",
          "talmudLocation": "Rosh Hashanah 4a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/4a#section-1",
          "talmudFullText": "<b>“And that which they need, both young bullocks, and rams, and lambs, for the burnt-offerings of the God of heaven, wheat, salt, wine, and oil, according to the word of the priests who are at Jerusalem, let it be given them day by day without fail”</b> (Ezra 6:9)? Doesn’t Cyrus’ contribution to the Temple demonstrate his fear of Heaven? <b>R' Yitzḥak said to</b> Rav Kahana: <b>My teacher, </b> a refutation can be brought <b>from your</b> own <b>burden, </b> from the text you yourself cited, as the next verse continues: <b>“That they may sacrifice offerings of sweet savor to the God of heaven, and pray for the life of the king and of his sons”</b> (Ezra 6:10). This shows that Cyrus did this solely for his own benefit, so that the Jews would sacrifice offerings and pray for him and his sons."
        },
        {
          "verseLocation": "Ezra 6:15",
          "verseText": "And it is written: “And this house was finished on the third day of the month Adar, which was in the sixth year of the reign of Darius the king”",
          "talmudLocation": "Arakhin 13a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/13a#section-3",
          "talmudFullText": "It is known that Ezra ascended to Eretz Yisrael six years after the beginning of the construction of the Second Temple, <b>as it is written: “Then ceased the work of the House of God, which is at Jerusalem; </b> and it ceased until the second year of the reign of Darius, king of Persia” (Ezra 4:24). This proves that construction on the Temple started in the second year of the reign of Darius. <b>And it is written: “And this house was finished on the 3rd day of the month Adar, which was in the 6th year of the reign of Darius the king”</b> (Ezra 6:15), which was the 5th year from when they started building."
        },
        {
          "verseLocation": "Ezra 6:15",
          "verseText": "so, the verses contradict each other, as it is written: “And this house was finished on the third of the month Adar, which was in the sixth year of the reign of Darius the king”",
          "talmudLocation": "Rosh Hashanah 3b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/3b#section-9",
          "talmudFullText": "<b>Rav Yosef strongly objects to this</b> explanation for two reasons: <b>One</b> objection is <b>that if</b> this is <b>so, the verses contradict each other, as it is written: “And this house was finished on the 3rd of the month Adar, which was in the 6th year of the reign of Darius the king”</b> (Ezra 6:15), <b>and it is taught</b> in a <i>baraita</i>: <b>At that same time in the following year Ezra went up from Babylonia together with his</b> company of <b>exiles. And it is written</b> in the Bible: <b>“And he came to Jerusalem in the 5th month, which was in the 7th year of the king”</b> (Ezra 7:8). <b>And if it were so</b> that this king’s years were counted like those of the kings of Israel, <b>what</b> the verse <b>needed</b> to state is: Which was in <b>the 8th year</b> of the king."
        },
        {
          "verseLocation": "Ezra 6:21",
          "verseText": "and all such as had separated themselves to them from the impurity of the nations of the land",
          "talmudLocation": "Kiddushin 70a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/70a#section-2",
          "talmudFullText": "§ The Mishnah teaches that <b>converts and emancipated slaves</b> ascended from Babylonia. The Talmud asks: <b>From where do we</b> derive this? <b>Rav Ḥisda says: As the verse states</b> with regard to the eating of the Paschal offering upon the return to Eretz Yisrael: “And the children of Israel who had come back from the exile ate, <b>and all such as had separated themselves to them from the impurity of the nations of the land</b> to seek YHWH, the God of Israel, did eat” (Ezra 6:21), indicating that converts and emancipated slaves who had abandoned “the impurity of the nations of the land,” i.e., idolatry, joined Ezra."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Ezra 7:6",
          "verseText": "states: “This Ezra went up from Babylon",
          "talmudLocation": "Sanhedrin 21b:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21b#section-24",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> (<i>Tosefta</i> 4:5): <b>R' Yosei says: Ezra was suitable, </b> given his greatness, <b>for</b> the <b>Torah to be given by him to the Jewish people, had Moses not come first</b> and received the Torah already. <b>With regard to Moses</b> the verse <b>states: “And Moses went up to God”</b> (Exodus 19:3), and <b>with regard to Ezra</b> the verse <b>states: “This Ezra went up from Babylon</b> and he was a ready scribe in the Torah of Moses, which YHWH, the God of Israel, had given” (Ezra 7:6). <b>Just as</b> the <b>going up stated here, </b> with regard to Moses, is for the <b>Torah, </b> which he received from God and transmitted to the Jewish people, <b>so too, </b> the <b>going up stated there, </b> with regard to Ezra, is for the <b>Torah, </b> as he taught Torah to the Jewish people and was suitable to have originally merited to give it."
        },
        {
          "verseLocation": "Ezra 7:8",
          "verseText": "exiles, as it is written, “And he came to Jerusalem in the fifth month, which was in the seventh year of the king”",
          "talmudLocation": "Arakhin 13a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/13a#section-4",
          "talmudFullText": "<b>And</b> the rabbis <b>taught</b> in a <i>baraita</i>: <b>At that same time in the following year Ezra ascended</b> from Babylonia <b>together with his</b> company of <b>exiles, as it is written, “And he came to Jerusalem in the 5th month, which was in the 7th year of the king”</b> (Ezra 7:8). Accordingly, Ezra came to Eretz Yisrael six years after the beginning of the construction of the Temple. It was at that time that the counting of the Sabbatical and Jubilee cycles began. The counting continued for 414 years until the destruction of the Temple, which means that the Temple was destroyed in a Sabbatical Year."
        },
        {
          "verseLocation": "Ezra 7:8",
          "verseText": "“And he came to Jerusalem in the fifth month, which was in the seventh year of the king”",
          "talmudLocation": "Rosh Hashanah 3b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/3b#section-9",
          "talmudFullText": "<b>Rav Yosef strongly objects to this</b> explanation for two reasons: <b>One</b> objection is <b>that if</b> this is <b>so, the verses contradict each other, as it is written: “And this house was finished on the 3rd of the month Adar, which was in the 6th year of the reign of Darius the king”</b> (Ezra 6:15), <b>and it is taught</b> in a <i>baraita</i>: <b>At that same time in the following year Ezra went up from Babylonia together with his</b> company of <b>exiles. And it is written</b> in the Bible: <b>“And he came to Jerusalem in the 5th month, which was in the 7th year of the king”</b> (Ezra 7:8). <b>And if it were so</b> that this king’s years were counted like those of the kings of Israel, <b>what</b> the verse <b>needed</b> to state is: Which was in <b>the 8th year</b> of the king."
        },
        {
          "verseLocation": "Ezra 7:10",
          "verseText": "states: “For Ezra had set his heart to seek the Torah of the Lord his God and to do it and to teach in Israel statutes and ordinances”",
          "talmudLocation": "Sanhedrin 21b:25",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/21b#section-25",
          "talmudFullText": "The <i>baraita</i> continues: <b>With regard to Moses</b> the verse <b>states: “And YHWH commanded me at that time to teach you statutes and ordinances”</b> (Deuteronomy 4:14), and <b>with regard to Ezra</b> the verse <b>states: “For Ezra had set his heart to seek the Torah of YHWH his God and to do it and to teach in Israel statutes and ordinances”</b> (Ezra 7:10). <b>And even though</b> the <b>Torah was not given</b> literally <b>by him, the script</b> of the Torah <b>was changed by him, as it is stated: </b>"
        },
        {
          "verseLocation": "Ezra 7:22",
          "verseText": "“Up to a hundred talents of silver, and up to a hundred measures of wheat, and up to a hundred bat of wine, and up to a hundred bat of oil, and salt without prescribed limit”",
          "talmudLocation": "Rosh Hashanah 4a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/4a#section-10",
          "talmudFullText": "<b>And if you wish, say: From where do we</b> derive <b>that</b> Cyrus <b>became corrupt? </b> It is <b>from here, </b> as it is stated: <b>“Up to a hundred talents of silver, and up to a hundred measures of wheat, and up to a hundred <i>bat</i> of wine, and up to a hundred <i>bat</i> of oil, and salt without prescribed limit”</b> (Ezra 7:22). <b>Initially</b> he gave <b>without</b> setting <b>a limit, but now</b> he introduced <b>a limit. </b>"
        },
        {
          "verseLocation": "Ezra 7:24",
          "verseText": "the Writings, as it is written: “It shall not be lawful to impose tribute, impost or toll upon them”",
          "talmudLocation": "Bava Batra 8a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/8a#section-5",
          "talmudFullText": "And furthermore, you have transgressed the words of <b>the Writings, as it is written: “It shall not be lawful to impose tribute, impost or toll upon them”</b> (Ezra 7:24), i.e., upon the priests and Levites who serve in the Temple. This <i>halakha</i> would apply to Torah scholars as well. <b>And Rav Yehuda says: “Tribute”; this</b> is referring to <b>the king’s portion, </b> a tax given to the king. <b>“Impost”; this</b> is referring to <b>the head tax. “Toll”; this</b> is referring to <b>a tax [<i>arnona</i>]</b> paid with property that was imposed from time to time."
        },
        {
          "verseLocation": "Ezra 7:24",
          "verseText": "“It shall not be lawful to impose minda , belo , and halakh upon them”",
          "talmudLocation": "Nedarim 62b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/62b#section-2",
          "talmudFullText": "Furthermore, <b>Rava said: It is permitted for a Torah scholar to say: I will not pay the head tax [<i>karga</i>], as it is written</b> that the king of Persia wrote to Ezra, with regard to the priests, the Levites, and others who worked in the Temple: <b>“It shall not be lawful to impose <i>minda</i>, <i>belo</i>, and <i>halakh</i> upon them”</b> (Ezra 7:24). <b>And R' Yehuda said: <i>Minda</i>; this is the king’s portion. <i>Belo</i>; this is the money</b> of the <b>head</b> tax. <b>And <i>halakh</i>; this is <i>arnona</i>, </b> a levy on people and their animals to perform physical labor in the service of the ruling authority. Since a Torah scholar is considered equivalent to a priest, as he is also dedicated to a sacred task, this exemption applies to him as well."
        },
        {
          "verseLocation": "Ezra 7:26",
          "verseText": "and apply pressure? As it is written: “Whether it be for death, or for banishment [ lishroshi ], or for confiscation of goods, or for imprisonment”",
          "talmudLocation": "Moed Katan 16a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16a#section-11",
          "talmudFullText": "<b>And from where do we</b> derive <b>that we may shackle</b> his hands and feet, <b>chain</b> him, <b>and apply pressure? As it is written: “Whether it be for death, or for banishment [<i>lishroshi</i>], or for confiscation of goods, or for imprisonment”</b> (Ezra 7:26). The Talmud asks: <b>What</b> is the meaning of the word <b>“<i>lishroshi</i>, ”</b> translated here as banishment? <b>Adda Mari said</b> that <b>Neḥemya bar Baruch said</b> that <b>Rav Ḥiyya bar Avin said</b> that <b>Rav Yehuda said: </b> This is <b>pressure. </b> Since this expression is also unclear, the Talmud asks: <b>What</b> is <b>pressure? Rav Yehuda, son of Rav Shmuel bar Sheilat, said in the name of Rav</b> that this term refers to the following series of actions: <b>They ostracize</b> him <b>immediately, and</b> then once <b>again after thirty</b> days, and if he still does not repent, <b>they excommunicate him after sixty</b> days."
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "Ezra 8:9",
          "verseText": "but isn’t it written: “Of the sons of Joab: Obadiah, son of Jehiel”",
          "talmudLocation": "Bava Batra 116a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/116a#section-13",
          "talmudFullText": "The Talmud asks: <b>And</b> is it so that <b>Joab did not leave a son</b> behind; <b>but isn’t it written: “Of the sons of Joab: Obadiah, son of Jehiel”</b> (Ezra 8:9)? <b>Rather, </b> concerning King <b>David, who left a son as</b> great as <b>himself, sleeping was stated with regard to his</b> demise, but concerning <b>Joab, who did not leave a son as</b> great as <b>himself, death was stated with regard to his</b> demise."
        },
        {
          "verseLocation": "Ezra 8:15",
          "verseText": "as it is stated: “And I gathered them together at the river that runs to Aḥava, and we encamped there for three days, and I inspected the people”",
          "talmudLocation": "Eruvin 65a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/65a#section-16",
          "talmudFullText": "<b>R' Elazar said: One who returns</b> home <b>from a journey should not pray for three days</b> while recovering from the hardship of being on the road, <b>as it is stated: “And I gathered them together at the river that runs to Aḥava, and we encamped there for three days, and I inspected the people”</b> (Ezra 8:15), after which it is stated: “Then I proclaimed a fast there, at the river of Aḥava, that we might afflict ourselves before our God, to seek of Him a safe journey for us” (Ezra 8:21), which teaches that they rested three days before praying."
        },
        {
          "verseLocation": "Ezra 8:15",
          "verseText": "“And I gathered them together to the river that runs to Ahava, and we camped there for three days; and I viewed the people and the priests, and found there none of the sons of Levi”",
          "talmudLocation": "Kiddushin 69b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/69b#section-6",
          "talmudFullText": "The Talmud asks another question: <b>Granted, according to the one who says</b> that <b>they ascended</b> of their own accord, <b>this is</b> the meaning of the verse <b>that is written</b> in the book of Ezra: <b>“And I gathered them together to the river that runs to Ahava, and we camped there for three days; and I viewed the people and the priests, and found there none of the sons of Levi”</b> (Ezra 8:15), as it was necessary for Ezra to clarify the identity of the people traveling to Eretz Yisrael."
        },
        {
          "verseLocation": "Ezra 8:15",
          "verseText": "three days; and I viewed the people, and the priests, and found there none of the sons of Levi”",
          "talmudLocation": "Yevamot 86b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/86b#section-7",
          "talmudFullText": "The Talmud asks with regard to the penalty imposed on Levites: <b>And from where do we</b> derive <b>that</b> the Levites <b>did not ascend in the days of Ezra? As it is written: “And I gathered them together to the river that runs to Ahava; and we encamped there</b> for <b>three days; and I viewed the people, and the priests, and found there none of the sons of Levi”</b> (Ezra 8:15). With regard to this, <b>Rav Ḥisda said: Initially they would establish officers</b> over the people <b>only from</b> among <b>the Levites, as it states: “And the officers, the Levites, before you”</b> (II Chronicles 19:11), but <b>now they establish officers only from</b> among the <b>Israelites, as it is stated: And the officers of the many at your heads. </b> This indicates that officers were appointed from: The many, meaning the largest group, ordinary Israelites."
        },
        {
          "verseLocation": "Ezra 8:23",
          "verseText": "As it is written: “So we fasted and beseeched our God for this”",
          "talmudLocation": "Taanit 8b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/8b#section-8",
          "talmudFullText": "The Talmud explains: <b>And from where do we</b> derive <b>that</b> one should not pray <b>for two</b> troubles simultaneously? <b>As it is written: “So we fasted and beseeched our God for this”</b> (Ezra 8:23). <b>From the fact</b> that the verse states: “For this,” it may be inferred <b>that there is another</b> trouble about which the people did not pray. <b>In the West, </b> Eretz Yisrael, <b>they say in the name of R' Ḥaggai</b> that this idea comes <b>from here: “That they might ask mercy of the God of Heaven concerning this secret”</b> (Daniel 2:18). <b>From the fact</b> that the verse states: “This secret,” it may be inferred <b>that there is another</b> trouble about which they did not pray."
        },
        {
          "verseLocation": "Ezra 8:27",
          "verseText": "“And vessels of fine golden brass, two, precious as gold”",
          "talmudLocation": "Arakhin 10b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/10b#section-13",
          "talmudFullText": "The <i>baraita</i> concludes: <b>These two</b> copper <b>vessels, </b> the cymbal and the mortar, <b>were remnants from the First Temple and they were damaged and they</b> could <b>not be repaired</b> in an effective manner. <b>And</b> it was <b>with regard to</b> the copper vessels constructed for the First Temple that <b>David said: </b> “All these vessels, which Hiram made for King Solomon, in the House of YHWH, were of <b>burnished brass”</b> (I Kings 7:45), and, in a parallel verse, <b>“bright brass”</b> (II Chronicles 4:16). <b>And with regard to</b> these two items <b>it states</b> in the verse describing the vessels that Ezra brought to Jerusalem: <b>“And vessels of fine golden brass, two, precious as gold”</b> (Ezra 8:27)."
        },
        {
          "verseLocation": "Ezra 8:35",
          "verseText": "all this was a burnt-offering",
          "talmudLocation": "Horayot 6a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/6a#section-2",
          "talmudFullText": "<b>Similarly, R' Yosei said</b> that it is stated with regard to those who returned to Zion from Babylonia in the days of Ezra: “The children of the captivity <b>who came out of exile sacrificed burnt-offerings to the God of Israel, twelve bulls</b> for all Israel, ninety-six rams, seventy-seven lambs, twelve goats as a sin-offering; <b>all this was a burnt-offering</b> unto YHWH” (Ezra 8:35). The question arises: Does it <b>enter your mind</b> to say: <b>“All this was a burnt-offering”? </b> Is it <b>possible that a sin-offering</b> is <b>a burnt-offering? Rather, </b> say: <b>All this</b> was <b>like a burnt-offering. Just as a burnt-offering is not eaten, so too, </b> this <b>sin-offering is not eaten, as it is taught</b> in a <i>baraita</i> that <b>R' Yehuda says: </b> It was as atonement <b>for idol worship</b> that <b>they brought them; and Rav Yehuda says</b> that <b>Shmuel says: </b> It was atonement <b>for the idol worship that they practiced during the days of Zedekiah. </b>"
        },
        {
          "verseLocation": "Ezra 8:35",
          "verseText": "ninety-six rams, seventy-seven lambs, twelve goats for a sin offering; all this was a burnt offering unto the Lord”",
          "talmudLocation": "Temurah 15b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/15b#section-1",
          "talmudFullText": "<b>But isn’t it taught</b> in a <i>baraita</i>: <b>Similarly, R' Yosei said: </b> It is stated with regard to those who returned from Babylonia in the days of Ezra: <b>“The children of the captivity that came out of exile sacrificed burnt offerings</b> to the God of Israel, <b>twelve bulls</b> for all Israel, <b>ninety-six rams, seventy-seven lambs, twelve goats for a sin offering; all this was a burnt offering unto YHWH”</b> (Ezra 8:35)."
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "Ezra 9:2",
          "verseText": "“And the hand of the princes and the rulers has been first in this faithlessness”",
          "talmudLocation": "Bava Metzia 108a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/108a#section-2",
          "talmudFullText": "The Talmud cites a related incident: <b>Rabba bar Rav Naḥman was going on a boat</b> and <b>saw a certain forest that</b> was <b>located</b> right <b>on the riverbank, </b> as its trees had not been cut down to make room for the pullers. <b>He said to</b> those who were with him: <b>To whom</b> does this forest belong? <b>They said to him: </b> It belongs <b>to Rabba bar Rav Huna. </b> Rabba bar Rav Naḥman <b>said: </b> This is reminiscent of the verse: <b>“And the hand of the princes and the rulers has been first in this faithlessness”</b> (Ezra 9:2), because a renowned scholar is acting improperly. Rabba bar Rav Naḥman <b>said to them: Cut down, cut down</b> to clear a path."
        },
        {
          "verseLocation": "Ezra 9:4",
          "verseText": "as it is written: “Then everyone who trembled at the words of the God of Israel due to the transgression of the exiles gathered around me, and I sat appalled until the evening offering”",
          "talmudLocation": "Megillah 30b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/30b#section-8",
          "talmudFullText": "The Talmud objects: <b>But</b> perhaps <b>I should reverse</b> the order, and the first half of the day should be spent reading from the Torah and praying, and the second half of the day should be spent examining the affairs of the townspeople. The Talmud answers: <b>It should not enter your mind</b> to say this, <b>as it is written: “Then everyone who trembled at the words of the God of Israel due to the transgression of the exiles gathered around me, and I sat appalled until the evening offering”</b> (Ezra 9:4), <b>and it is written</b> in the next verse: <b>“And at the evening offering I arose from my fast, </b> and having rent my garment and my mantle; I fell on my knees, and I spread out my hands to YHWH my God” (Ezra 9:5). This indicates that the first half of a public fast should be dedicated to an inspection of the community’s behavior, and the rest of the day should be devoted to prayer."
        },
        {
          "verseLocation": "Ezra 9:4",
          "verseText": "“Then were assembled to me everyone who trembled at the words of the God of Israel due to the faithlessness of them of the captivity",
          "talmudLocation": "Taanit 13a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/13a#section-1",
          "talmudFullText": "The Talmud asks: <b>I</b> can <b>reverse</b> the order of events, so that the first half of the day is spent in prayer while the second half is focused on the concerns of the community. The Talmud answers: <b>It should not enter your mind</b> to say that, <b>as it is written</b> elsewhere: <b>“Then were assembled to me everyone who trembled at the words of the God of Israel due to the faithlessness of them of the captivity</b> and I sat appalled until the evening offering” (Ezra 9:4). <b>And it is written</b> in the next verse: <b>“And at the meal-offering I arose from my fast, </b> even with my garment and my mantle rent; and I fell on my knees <b>and I spread out my hands to YHWH”</b> (Ezra 9:5). These verses indicate that first one must deal with the issues of the community, and only afterward engage in prayer."
        },
        {
          "verseLocation": "Ezra 9:5",
          "verseText": "“And at the evening offering I arose from my fast,",
          "talmudLocation": "Megillah 30b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/30b#section-8",
          "talmudFullText": "The Talmud objects: <b>But</b> perhaps <b>I should reverse</b> the order, and the first half of the day should be spent reading from the Torah and praying, and the second half of the day should be spent examining the affairs of the townspeople. The Talmud answers: <b>It should not enter your mind</b> to say this, <b>as it is written: “Then everyone who trembled at the words of the God of Israel due to the transgression of the exiles gathered around me, and I sat appalled until the evening offering”</b> (Ezra 9:4), <b>and it is written</b> in the next verse: <b>“And at the evening offering I arose from my fast, </b> and having rent my garment and my mantle; I fell on my knees, and I spread out my hands to YHWH my God” (Ezra 9:5). This indicates that the first half of a public fast should be dedicated to an inspection of the community’s behavior, and the rest of the day should be devoted to prayer."
        },
        {
          "verseLocation": "Ezra 9:5",
          "verseText": "and I spread out my hands to the Lord”",
          "talmudLocation": "Taanit 13a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/13a#section-1",
          "talmudFullText": "The Talmud asks: <b>I</b> can <b>reverse</b> the order of events, so that the first half of the day is spent in prayer while the second half is focused on the concerns of the community. The Talmud answers: <b>It should not enter your mind</b> to say that, <b>as it is written</b> elsewhere: <b>“Then were assembled to me everyone who trembled at the words of the God of Israel due to the faithlessness of them of the captivity</b> and I sat appalled until the evening offering” (Ezra 9:4). <b>And it is written</b> in the next verse: <b>“And at the meal-offering I arose from my fast, </b> even with my garment and my mantle rent; and I fell on my knees <b>and I spread out my hands to YHWH”</b> (Ezra 9:5). These verses indicate that first one must deal with the issues of the community, and only afterward engage in prayer."
        },
        {
          "verseLocation": "Ezra 9:9",
          "verseText": "“For we are bondmen; yet our God has not forsaken us in our bondage, but has extended mercy unto us in the sight of the kings of Persia”",
          "talmudLocation": "Megillah 11a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/11a#section-1",
          "talmudFullText": "<b>“For we are bondmen; yet our God has not forsaken us in our bondage, but has extended mercy unto us in the sight of the kings of Persia”</b> (Ezra 9:9). <b>When</b> did this occur? <b>In the time of Haman. </b>"
        },
        {
          "verseLocation": "Ezra 9:9",
          "verseText": "which is stated: “To uplift the house of our God and restore its ruins”",
          "talmudLocation": "Shabbat 11a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/11a#section-2",
          "talmudFullText": "<b>And Rava bar Meḥasseya said</b> that <b>Rav Ḥama bar Gurya said</b> that <b>Rav said</b>: <b>Any city whose roofs are higher than the synagogue</b> will <b>ultimately be destroyed</b> because of the contempt shown the synagogue. Allusion to this is from that <b>which is stated: “To uplift the house of our God and restore its ruins”</b> (Ezra 9:9). The house that is devoted to God needs to be elevated above the other houses of the city. The Talmud adds: <b>And this applies only to the height of the houses</b> themselves. <b>However, </b> if <b>the poles [<i>kashkushei</i>] and the towers [<i>abrurei</i>]</b> that extend from the house are higher than the synagogue, <b>we have no</b> problem <b>with it. Rav Ashi said: I caused</b> the city of <b>Mata Meḥasseya to not be destroyed</b> by building the synagogue higher than the other houses. The Talmud asks: <b>Wasn’t</b> Mata Meḥasseya ultimately <b>destroyed? </b> The Talmud answers: <b>It was not destroyed because of that sin; </b> other sins caused its destruction."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "Ezra 10:2",
          "verseText": "Ezra, as it is written: “And Shecaniah the son of Jehiel, one of the sons of Elam, answered and said unto Ezra: We have broken faith with our God, and have married foreign women",
          "talmudLocation": "Megillah 15a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/15a#section-6",
          "talmudFullText": "<b>And who</b> was the one that <b>removed the foreign women</b> who were married to Jews? It was <b>Ezra, as it is written: “And Shecaniah the son of Jehiel, one of the sons of Elam, answered and said unto Ezra: We have broken faith with our God, and have married foreign women</b> of the peoples of the land” (Ezra 10:2). It therefore appears that Malachi was one of Ezra’s names, as the Bible describes them both as confronting an intermarriage epidemic."
        },
        {
          "verseLocation": "Ezra 10:2",
          "verseText": "And from where did Shmuel HaKatan learn it? From Shecaniah ben Jehiel, as it is written: “And Shecaniah, the son of Jehiel, one of the sons of Elam, answered and said to Ezra: We have broken faith with our God, and have married foreign women of the peoples of the land; yet now there is hope for Israel concerning this”",
          "talmudLocation": "Sanhedrin 11a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/11a#section-5",
          "talmudFullText": "<b>And from where did R' Meir learn that</b> characteristic? <b>From Shmuel HaKatan, </b> in the incident outlined above. <b>And from where did Shmuel HaKatan learn it? From Shecaniah ben Jehiel, as it is written: “And Shecaniah, the son of Jehiel, one of the sons of Elam, answered and said to Ezra: We have broken faith with our God, and have married foreign women of the peoples of the land; yet now there is hope for Israel concerning this”</b> (Ezra 10:2). And although he confessed, Shecaniah is not listed among those who took foreign wives (Ezra 10:18–44). Evidently, he confessed only to spare the others from public embarrassment."
        },
        {
          "verseLocation": "Ezra 10:8",
          "verseText": "ownerless? As it is stated: “And whoever did not come within three days according to the counsel of the princes and the Elders, all of his property shall be forfeited, and he shall be separated from the congregation of the captivity”",
          "talmudLocation": "Gittin 36b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/36b#section-3",
          "talmudFullText": "<b>Abaye says: </b> This is not actual theft; <b>it is</b> an instruction to <b>sit</b> passively <b>and not do</b> anything. The rabbis have the authority to instruct one to passively violate a Torah law, so long as no action is taken. <b>Rava says: </b> The rabbis are able to institute this ordinance because <b>property</b> declared <b>ownerless</b> by <b>the court</b> is <b>ownerless. As R' Yitzḥak says: From where</b> is it derived <b>that property</b> declared <b>ownerless</b> by <b>the court</b> is <b>ownerless? As it is stated: “And whoever did not come within three days according to the counsel of the princes and the Elders, all of his property shall be forfeited, and he shall be separated from the congregation of the captivity”</b> (Ezra 10:8)."
        },
        {
          "verseLocation": "Ezra 10:8",
          "verseText": "as ownerless? As it is written: “And that whoever would not come within three days, according to the counsel of the princes and the Elders, all his substance shall be forfeited [ yaḥoram ] and himself separated from the congregation of the exiles”",
          "talmudLocation": "Moed Katan 16a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/16a#section-9",
          "talmudFullText": "<b>And from where do we</b> derive <b>that</b> the court <b>may declare the property of</b> one who does not obey its orders <b>as ownerless? As it is written: “And that whoever would not come within three days, according to the counsel of the princes and the Elders, all his substance shall be forfeited [<i>yaḥoram</i>] and himself separated from the congregation of the exiles”</b> (Ezra 10:8). “Shall be forfeited” is referring to excommunication."
        },
        {
          "verseLocation": "Ezra 10:8",
          "verseText": "that property declared ownerless by the court is ownerless? As it is stated: “And whoever does not come within three days, according to the council of the princes and the Elders, all his property should be forfeited, and himself separated from the congregation of the captivity”",
          "talmudLocation": "Yevamot 89b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/89b#section-11",
          "talmudFullText": "<b>As R' Yitzḥak said: From where</b> is it derived <b>that property declared ownerless by the court is ownerless? As it is stated: “And whoever does not come within three days, according to the council of the princes and the Elders, all his property should be forfeited, and himself separated from the congregation of the captivity”</b> (Ezra 10:8). This verse indicates that the court can confiscate anyone’s possessions."
        }
      ]
    }
  ]
}