{
  "bookName": "Habakkuk",
  "totalEntries": 31,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Habakkuk 1:13",
          "verseText": "“Why do You observe the treacherous, and remain silent while the wicked swallows the one who is more righteous than he?”",
          "talmudLocation": "Bava Metzia 71a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/71a#section-7",
          "talmudFullText": "Referring to the subject of honest people who collapse temporarily, it is said: <b>“Why do You observe the treacherous, and remain silent while the wicked swallows the one who is more righteous than he? ”</b> (Habakkuk 1:13). <b>Rav Huna says</b> about this verse: <b>One who is more righteous than he, he swallows</b> for the moment, but <b>he does not swallow a completely righteous person</b> at all."
        },
        {
          "verseLocation": "Habakkuk 1:13",
          "verseText": "that which is written: “Why do You look on those who deal treacherously and hold Your peace? When the wicked swallows the man more righteous than he?”",
          "talmudLocation": "Berakhot 7b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/7b#section-21",
          "talmudFullText": "<b>And if you wish, say</b> instead <b>that this, </b> which says not to confront <b>and that, </b> which says to confront, are both referring <b>to a wicked person upon whom the hour is smiling, </b> but the question of whether one is permitted to confront him depends on who is confronting him. <b>And</b> nevertheless, this is <b>not difficult. This, </b> which says that it is a mitzva to confront them, is referring <b>to a completely righteous person, while this, </b> which says that one may not confront the wicked, is referring <b>to one who is not completely righteous, as Rav Huna said: What is</b> the meaning of <b>that which is written: “Why do You look on those who deal treacherously and hold Your peace? When the wicked swallows the man more righteous than he? ”</b> (Habakkuk 1:13). This verse is difficult to understand. <b>Do the wicked swallow the righteous? Isn’t it written: </b> “The wicked looks to the righteous and seeks to kill him; <b>YHWH will not leave him in his hand, </b> nor allow him to be condemned when he is judged” (Psalms 37:32–33), <b>and it is written: “No mischief shall befall the righteous”</b> (Proverbs 12:21)? <b>Rather, </b> in light of these verses, the verse: “The wicked swallows the man more righteous than he” means: <b>The</b> man who is <b>more righteous than he, </b> but not completely righteous, <b>he swallows. The completely righteous he does not swallow. </b>"
        },
        {
          "verseLocation": "Habakkuk 1:13",
          "verseText": "which is written: “Why do you look upon them that deal treacherously, and remain silent when the wicked devours the man that is more righteous than he”",
          "talmudLocation": "Megillah 6b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/6b#section-9",
          "talmudFullText": "<b>And if you wish, say: </b> Both <b>this</b> statement <b>and that</b> statement are stated <b>with regard to his own affairs, and</b> still it is <b>not difficult. This</b> statement, that it is permitted to provoke the wicked, <b>applies to a completely righteous</b> individual; <b>that</b> statement, that one may not provoke them, <b>applies to</b> an individual <b>who is not completely righteous. As Rav Huna said: What is</b> the meaning of that <b>which is written: “Why do you look upon them that deal treacherously, and remain silent when the wicked devours the man that is more righteous than he”</b> (Habakkuk 1:13)? This verse indicates that the wicked <b>devours one who is more righteous than he; </b> however, <b>he does not devour one who is completely righteous. </b>"
        },
        {
          "verseLocation": "Habakkuk 1:14",
          "verseText": "which is written: “And makes people as the fish of the sea, as the creeping things, that have no ruler over them”",
          "talmudLocation": "Avodah Zarah 3b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/3b#section-16",
          "talmudFullText": "The Talmud continues discussing the importance of Torah study. <b>Rav Yehuda says</b> that <b>Shmuel says: What</b> is the meaning of that <b>which is written: “And makes people as the fish of the sea, as the creeping things, that have no ruler over them”</b> (Habakkuk 1:14)? <b>Why are people compared to the fish of the sea? </b> This serves <b>to say to you: Just as</b> with regard to <b>the fish of the sea, once they arise onto dry land they die immediately; so too, </b> with regard to <b>people, once they separate</b> themselves <b>from</b> studying <b>words of Torah and</b> performing <b>the mitzvot, they die immediately. Alternatively, just as</b> with regard to the <b>fish of the sea, once the sun is heated over them they die immediately, so too</b> with regard to <b>people, once the sun is heated over them they die immediately. </b>"
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Habakkuk 2:1",
          "verseText": "and stood inside it, in the manner that the prophet Habakkuk did, as it is stated: “And I will stand upon my watch and set myself upon the tower,",
          "talmudLocation": "Taanit 23a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/23a#section-4",
          "talmudFullText": "§ The Mishnah taught: <b>An incident</b> occurred in <b>which</b> the people <b>sent</b> a message <b>to Ḥoni HaMe’aggel. </b> This event is related in greater detail in the following <i>baraita</i>. <b>A baraita states: Once, most of</b> the month of <b>Adar had passed but rain had</b> still <b>not fallen. They sent</b> this message <b>to Ḥoni HaMe’aggel: Pray, and rain will fall. He prayed, but no rain fell. He drew a circle</b> in the dust <b>and stood inside it, in the manner that the prophet Habakkuk did, as it is stated: “And I will stand upon my watch and set myself upon the tower, </b> and I will look out to see what He will say to me, and what I shall answer when I am reproved” (Habakkuk 2:1). This verse is taken to mean that Habakkuk fashioned a kind of prison for himself where he sat."
        },
        {
          "verseLocation": "Habakkuk 2:3",
          "verseText": "“For the vision is yet for the appointed time; and it declares of the end, and does not lie; though it tarry, wait for it, because it will surely come; it will not delay”",
          "talmudLocation": "Sanhedrin 97b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/97b#section-4",
          "talmudFullText": "§ <b>It is taught</b> in a <i>baraita</i> that <b>R' Natan says: This verse penetrates and descends until the depths; </b> just as the depths are unfathomable, so too, the period depicted in the following verse is unquantifiable. <b>“For the vision is yet for the appointed time; and it declares of the end, and does not lie; though it tarry, wait for it, because it will surely come; it will not delay”</b> (Habakkuk 2:3)."
        },
        {
          "verseLocation": "Habakkuk 2:4",
          "verseText": "upon one, as it is stated: “But the righteous person shall live by his faith”",
          "talmudLocation": "Makkot 24a:27",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/24a#section-27",
          "talmudFullText": "<b>Isaiah then established</b> the 613 mitzvot <b>upon two, as it is stated: “So says YHWH: Observe justice and perform righteousness”</b> (Isaiah 56:1). <b>Amos came and established</b> the 613 mitzvot <b>upon one, as it is stated: “So says YHWH to the house of Israel: Seek Me and live”</b> (Amos 5:4). <b>Rav Naḥman bar Yitzḥak objects to this: </b> There is no proof that the verse in Amos is establishing all the mitzvot upon one; <b>say</b> that Amos is saying: <b>Seek Me throughout the entire Torah, </b> as the verse does not specify the manner in which one should seek YHWH. <b>Rather, </b> say: <b>Habakkuk came and established</b> the 613 mitzvot <b>upon one, as it is stated: “But the righteous person shall live by his faith”</b> (Habakkuk 2:4)."
        },
        {
          "verseLocation": "Habakkuk 2:5",
          "verseText": "haughty man",
          "talmudLocation": "Bava Batra 98a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/98a#section-6",
          "talmudFullText": "<b>And</b> R' Yosei ben Ḥanina, <b>disagrees</b> with the opinion <b>of Rav Ḥiyya bar Yosef, as Rav Ḥiyya bar Yosef says: </b> With regard to <b>wine, </b> it is <b>the owner’s</b> poor <b>fortune</b> that <b>causes</b> the wine to go sour, <b>as it is stated: “And moreover, wine is a treacherous dealer; </b> the <b>haughty man</b> abides not” (Habakkuk 2:5), which is interpreted to mean that the wine of a haughty man will betray him, as it will sour as a punishment for his arrogance. Accordingly, since the wine soured after the buyer purchased it, he cannot place the blame upon the seller."
        },
        {
          "verseLocation": "Habakkuk 2:5",
          "verseText": "Rav Mari said: One who is haughty is not accepted even by the members of his household, as it is stated: “The haughty man abides not”",
          "talmudLocation": "Bava Batra 98a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/98a#section-7",
          "talmudFullText": "The Talmud offers additional homiletic interpretations of the verse just cited. <b>Rav Mari said: One who is haughty is not accepted even by the members of his household, as it is stated: “The haughty man abides not”</b> (Habakkuk 2:5). <b>What</b> does the phrase <b>“abides [<i>yinveh</i>] not”</b> mean? It means that <b>even in his abode [<i>naveh</i>], </b> he is not accepted."
        },
        {
          "verseLocation": "Habakkuk 2:5",
          "verseText": "But didn’t the Master say: One who is haughty is not even accepted by the members of his household, as it is stated: “The haughty man abides not”",
          "talmudLocation": "Sotah 47b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47b#section-20",
          "talmudFullText": "The Talmud raises a difficulty: <b>Is that so? </b> Do women wish to marry arrogant men? <b>But didn’t the Master say: One who is haughty is not even accepted by the members of his household, as it is stated: “The haughty man abides not”</b> (Habakkuk 2:5)? <b>“Abides [<i>yinaveh</i>] not”</b> means that <b>even in his abode [<i>naveh</i>], </b> he is not accepted. The Talmud explains: <b>Initially, she jumps at</b> the chance to marry <b>him, </b> because he appears to be a great person to her, but <b>in the end, </b> once she gets to know him, <b>he is demeaned in her eyes. </b>"
        },
        {
          "verseLocation": "Habakkuk 2:11",
          "verseText": "person testify against him, as it is stated: “For the stone shall cry out of the wall, and the beam out of the timber shall answer it”",
          "talmudLocation": "Chagigah 16a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/16a#section-16",
          "talmudFullText": "<b>And “intimate friend” is referring to none other</b> than <b>God as it is stated: “You are the intimate friend of my youth”</b> (Jeremiah 3:4). <b>Lest you say: </b> Since I am acting in private, <b>who will testify against me? The stones of the house and the beams of the house of</b> each <b>person testify against him, as it is stated: “For the stone shall cry out of the wall, and the beam out of the timber shall answer it”</b> (Habakkuk 2:11)."
        },
        {
          "verseLocation": "Habakkuk 2:11",
          "verseText": "testify against him, as it is stated: “For a stone shall cry out from the wall, and a beam out of the timber shall answer it”",
          "talmudLocation": "Taanit 11a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/11a#section-9",
          "talmudFullText": "The <i>baraita</i> further states: <b>And lest a person say, </b> I have acted in secret; <b>who will testify against me</b> on the Day of Judgment? The <i>tanna</i> explains that the <b>stones of a person’s house and</b> the <b>beams of a person’s house</b> will <b>testify against him, as it is stated: “For a stone shall cry out from the wall, and a beam out of the timber shall answer it”</b> (Habakkuk 2:11). In <b>the school of R' Sheila they say: </b> The <b>two ministering angels who accompany a person</b> will <b>testify against him, as it is stated: “For He will give His angels charge over you, </b> to keep you in all your ways” (Psalms 91:11)."
        },
        {
          "verseLocation": "Habakkuk 2:16",
          "verseText": "from here: “You are filled with shame instead of honor. Drink, you, and be like one who is uncircumcised,",
          "talmudLocation": "Shabbat 149b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/149b#section-8",
          "talmudFullText": "<b>Rather, </b> it is derived <b>from here: “You are filled with shame instead of honor. Drink, you, and be like one who is uncircumcised, </b> the cup of YHWH’s right hand will turn to you and filthiness shall be upon your glory” (Habakkuk 2:16). The verse is expounded: <b>“You are filled with shame instead of honor”; this</b> is referring to <b>Nebuchadnezzar. “Drink, you, and be like one who is uncircumcised”; this is</b> referring to <b>Zedekiah, </b> who was also punished for being the cause of Nebuchadnezzar’s punishment, as will be explained. The Talmud rejects this proof: <b>One</b> objection to this is <b>that the entire verse is written about Nebuchadnezzar. And furthermore, </b> with regard to <b>Zedekiah, the righteous one, what could he have done to him? </b> For <b>Rav Yehuda said</b> that <b>Rav said</b> about this matter: <b>When that wicked man wanted to do this to that righteous man, </b> his foreskin was stretched, as will be explained."
        },
        {
          "verseLocation": "Habakkuk 2:19",
          "verseText": "“Woe to him who says to the wood: Awake, to the dumb stone: Arise. Can this teach? Behold, it is overlaid with gold and silver, and there is no breath at all in the midst of it”",
          "talmudLocation": "Sanhedrin 7b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/7b#section-7",
          "talmudFullText": "The interpreter <b>began and said: </b> The verse states: <b>“Woe to him who says to the wood: Awake, to the dumb stone: Arise. Can this teach? Behold, it is overlaid with gold and silver, and there is no breath at all in the midst of it”</b> (Habakkuk 2:19). So is this judge, appointed to teach the public for gold, i.e., for payment, but no more qualified than wood and stone. <b>And</b> in the <b>future, God will punish those who appoint</b> such judges, <b>as it is stated</b> in the next verse: <b>“But YHWH is in His holy Sanctuary; let all the earth be silent before Him”</b> (Habakkuk 2:20). God, Who is above everything, will judge those responsible for such appointments."
        },
        {
          "verseLocation": "Habakkuk 2:20",
          "verseText": "“But the Lord is in His holy Sanctuary; let all the earth be silent before Him”",
          "talmudLocation": "Sanhedrin 7b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/7b#section-7",
          "talmudFullText": "The interpreter <b>began and said: </b> The verse states: <b>“Woe to him who says to the wood: Awake, to the dumb stone: Arise. Can this teach? Behold, it is overlaid with gold and silver, and there is no breath at all in the midst of it”</b> (Habakkuk 2:19). So is this judge, appointed to teach the public for gold, i.e., for payment, but no more qualified than wood and stone. <b>And</b> in the <b>future, God will punish those who appoint</b> such judges, <b>as it is stated</b> in the next verse: <b>“But YHWH is in His holy Sanctuary; let all the earth be silent before Him”</b> (Habakkuk 2:20). God, Who is above everything, will judge those responsible for such appointments."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Habakkuk 3:2",
          "verseText": "as it is written: “In wrath remember mercy [ raḥem ]”",
          "talmudLocation": "Moed Katan 17a:23",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/17a#section-23",
          "talmudFullText": "The following allusion is offered in support of the opinion of Reish Lakish: <b>When it enters, </b> it enters all the organs, <b>as it is written: “And the city shall be a curse [<i>ḥerem</i>]”</b> (Joshua 6:17), <b>and the numerical value [<i>gimatriyya</i>]</b> of the word <b><i>ḥerem</i>, </b> a concept similar to ostracism, <b>is two hundred and forty-eight. </b> Therefore, the verse alludes to the fact that a decree of ostracism penetrates one’s two hundred and forty-eight organs. <b>When it leaves, </b> it leaves all the organs, <b>as it is written: “In wrath remember mercy [<i>raḥem</i>]”</b> (Habakkuk 3:2), <b>and the numerical value</b> of the word <b><i>raḥem</i> is also</b> two hundred and forty-eight, thereby teaching that when the decree of ostracism is revoked, it disappears entirely."
        },
        {
          "verseLocation": "Habakkuk 3:2",
          "verseText": "as it is stated: “Lord, I heard Your report and was afraid; O Lord, revive Your work in the midst of the years”",
          "talmudLocation": "Sotah 49a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/49a#section-2",
          "talmudFullText": "§ <b>R' Ile’a bar Yeverekhya says: If it were not for the prayer of David</b> for Israel to have sustenance, <b>all Israel would be sellers of fat [<i>revav</i>], </b> i.e., involved in debased occupations, <b>as it is stated: “Place for them mastery, O Lord”</b> (Psalms 9:21), that is, may God grant them dignity. <b>And R' Ile’a bar Yeverekhya</b> also <b>says: If it were not for the prayer of Habakkuk, two Torah scholars would have to cover themselves with a single cloak</b> due to poverty <b>and engage in Torah study</b> dressed that way, <b>as it is stated: “Lord, I heard Your report and was afraid; O Lord, revive Your work in the midst of the years”</b> (Habakkuk 3:2). <b>Do not read: “In the midst [<i>bekerev</i>] of the years [<i>shanim</i>], ” but in the closeness [<i>bikrov</i>] of two [<i>shenayim</i>]. </b> In other words, Habakkuk prayed that God would nullify His decree of two Torah scholars having to share a single cloak."
        },
        {
          "verseLocation": "Habakkuk 3:3",
          "verseText": "and it is written: “God comes from Teman,",
          "talmudLocation": "Avodah Zarah 2b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/2b#section-12",
          "talmudFullText": "The nations will <b>say before</b> God: <b>God!, did You give us</b> the Torah <b>and we did not accept it? </b> Since we never received the Torah, why are we being judged for not fulfilling its mitzvot? The Talmud asks: <b>And can one say that</b> they were never offered the Torah? <b>But isn’t it written</b> in the description of the giving of the Torah: <b>“And he said: YHWH came from Sinai, and rose from Seir unto them”</b> (Deuteronomy 33:2), <b>and it is written: “God comes from Teman, </b> and the Holy One from mount Paran” (Habakkuk 3:3). And the rabbis asked: <b>What</b> did God <b>require in Seir and what</b> did He <b>require in Paran? </b> The Torah was not given in those locations."
        },
        {
          "verseLocation": "Habakkuk 3:4",
          "verseText": "which is written, “And a brightness appears as the light; He has rays at His side; and there is the hiding of His power”",
          "talmudLocation": "Pesachim 8a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/8a#section-4",
          "talmudFullText": "The Talmud asks: <b>And</b> is the light of <b>a torch not</b> bright enough for searching? <b>But didn’t Rava say: What is</b> the meaning of that <b>which is written, “And a brightness appears as the light; He has rays at His side; and there is the hiding of His power”</b> (Habakkuk 3:4), which indicates that God will provide rays of glory for the righteous in the future? The rabbis explained this verse by means of a parable: <b>To what are the righteous comparable before the Shekhina? </b> They are comparable <b>to a lamp in the face of a torch. </b> This statement indicates that the light of a torch is significantly greater than that of a lamp, and consequently a torch should be more effective in the search for leaven. <b>And</b> likewise <b>Rava said: </b> One who uses <b>a torch for</b> the blessing over fire in <b><i>havdala</i></b> has performed <b>the mitzva</b> in <b>the optimal manner. </b> Apparently, the light of a torch is greater than that of a lamp."
        },
        {
          "verseLocation": "Habakkuk 3:6",
          "verseText": "“He stands, and shakes the earth, He sees, and makes the nations tremble [ vayater ]”",
          "talmudLocation": "Avodah Zarah 2b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/2b#section-17",
          "talmudFullText": "The Talmud asks: <b>And from where do we</b> derive <b>that they did not fulfill them? As Rav Yosef teaches</b> in explanation of the verse: <b>“He stands, and shakes the earth, He sees, and makes the nations tremble [<i>vayater</i>]”</b> (Habakkuk 3:6): <b>What did</b> God <b>see? He saw</b> the <b>seven mitzvot that the descendants of Noah accepted upon themselves, and</b> He saw that they <b>did not fulfill them. Since they did not fulfill them, He arose and nullified for them [<i>vehitiran</i>]</b> the command to heed these mitzvot. The Talmud asks: Do they <b>gain</b> from not obeying, as they are now released from the obligation to fulfill these mitzvot? <b>If so, we find</b> that <b>a sinner profits</b> from his transgression."
        },
        {
          "verseLocation": "Habakkuk 3:6",
          "verseText": "the verse states: “He stood and shook the earth; He beheld, and made the nations tremble [ vayyatter ]”",
          "talmudLocation": "Bava Kamma 38a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/38a#section-3",
          "talmudFullText": "<b>R' Abbahu said</b> that the reason for this ruling is that <b>the verse states: “He stood and shook the earth; He beheld, and made the nations tremble [<i>vayyatter</i>]”</b> (Habakkuk 3:6). This is homiletically interpreted to mean that God <b>saw the seven mitzvot that the descendants of Noah accepted upon themselves</b> to fulfill, and <b>since they did not fulfill</b> them, <b>He arose and permitted [<i>vehittir</i>] their money to the Jewish people, </b> so that in certain cases Jews are not liable for damage caused to non-Jews."
        },
        {
          "verseLocation": "Habakkuk 3:6",
          "verseText": "vayyatter is a term of exile? It is written here: “And made the nations tremble [ vayyatter ]”",
          "talmudLocation": "Bava Kamma 38a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/38a#section-8",
          "talmudFullText": "<b>And from where may</b> it <b>be inferred that this</b> term <b><i>vayyatter</i> is a term of exile? It is written here: “And made the nations tremble [<i>vayyatter</i>]”</b> (Habakkuk 3:6), <b>and it is written there: “<i>Lenatter</i> upon the earth”</b> (Leviticus 11:21), <b>which is translated</b> into Aramaic as: <b>“To leap upon the earth. ”</b> Apparently, the root <i>nun</i>, <i>tav</i>, <i>reish</i>, common to both words, indicates uprooting from one place to another."
        },
        {
          "verseLocation": "Habakkuk 3:6",
          "verseText": "he is guaranteed that he is destined for the World-to-Come, as it is stated: “His ways [ halikhot ] are eternal”",
          "talmudLocation": "Megillah 28b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/28b#section-17",
          "talmudFullText": "<b>The school of Eliyahu taught: Anyone who studies <i>halakhot</i></b> every day, <b>he is guaranteed that he is destined for the World-to-Come, as it is stated: “His ways [<i>halikhot</i>] are eternal”</b> (Habakkuk 3:6): <b>Do not read</b> the verse as <b><i>halikhot</i> [ways]; rather, </b> read it as <b><i>halakhot</i>. </b> Consequently, the verse indicates that the study of the <i>halakhot</i> brings one to eternal life."
        },
        {
          "verseLocation": "Habakkuk 3:6",
          "verseText": "The school of Elijah taught: Anyone who studies halakhot every day is guaranteed that he is destined for the World-to-Come, as it is stated: “His ways [ halikhot ] are eternal”",
          "talmudLocation": "Niddah 73a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/73a#section-15",
          "talmudFullText": "The Talmud concludes the tractate with a general statement with regard to Torah study. <b>The school of Elijah taught: Anyone who studies <i>halakhot</i> every day is guaranteed that he is destined for the World-to-Come, as it is stated: “His ways [<i>halikhot</i>] are eternal”</b> (Habakkuk 3:6). <b>Do not read</b> the verse as <b><i>halikhot</i>; rather, </b> read it as <b><i>halakhot</i>. </b> The verse indicates that the study of <i>halakhot</i> brings one to eternal life in the future world."
        },
        {
          "verseLocation": "Habakkuk 3:6",
          "verseText": "who erode the world? Aren’t they settling the world, as it is stated: “His ways [ halikhot ] are eternal”",
          "talmudLocation": "Sotah 22a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/22a#section-7",
          "talmudFullText": "<b>It was taught</b> in a <i>baraita</i>: <b>The <i>tanna’im</i>, </b> who recite the tannaitic sources by rote, <b>are</b> individuals <b>who erode the world. </b> The Talmud is puzzled by this statement: <b>Could</b> it <b>enter your mind</b> that they are individuals <b>who erode the world? Ravina says: </b> This statement is referring to those <b>who issue halakhic rulings based</b> on <b>their</b> knowledge of <b><i>mishnayot</i>. This is also taught</b> in a <i>baraita</i>: <b>R' Yehoshua said: Are they</b> individuals <b>who erode the world? Aren’t they settling the world, as it is stated: “His ways [<i>halikhot</i>] are eternal”</b> (Habakkuk 3:6)? The rabbis read the term <i>halikhot</i> as <i>halakhot</i>, inferring that one who learns <i>halakhot</i> attains eternal life. <b>Rather, </b> this is referring to those <b>who issue halakhic rulings based</b> on <b>their</b> knowledge of <b><i>mishnayot</i>. </b>"
        },
        {
          "verseLocation": "Habakkuk 3:9",
          "verseText": "as it is stated: “Your bow is stripped bare [ erya ]”",
          "talmudLocation": "Sanhedrin 92a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92a#section-20",
          "talmudFullText": "<b>And R' Elazar says: </b> With regard to <b>anyone who looks at nakedness [<i>erva</i>], his bow is emptied, </b> i.e., he will be robbed of his potency, <b>as it is stated: “Your bow is stripped bare [<i>erya</i>]”</b> (Habakkuk 3:9)."
        },
        {
          "verseLocation": "Habakkuk 3:11",
          "verseText": "which is written: “The sun and moon stood still in their habitation [ zevula ],",
          "talmudLocation": "Nedarim 39b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/39b#section-13",
          "talmudFullText": "Apropos the conflict between Moses and Korah, the Talmud cites an additional verse that <b>Rava interpreted homiletically, and some say that</b> it was <b>R' Yitzḥak</b> who <b>said: What is</b> the meaning of that <b>which is written: “The sun and moon stood still in their habitation [<i>zevula</i>], </b> at the light of Your arrows as they go, at the shining of Your glittering spear” (Habakkuk 3:11)? <b>What do the sun and moon seek in <i>zevul</i>, </b> which is the 4th heaven; <b>aren’t they fixed in <i>rakia</i>, </b> the second heaven? Rather, this <b>teaches that the sun and moon ascended from <i>rakia</i> to <i>zevul</i> and said before Him: God!! If You do justice for the son of Amram, </b> i.e., Moses, in his dispute with Korah, <b>we</b> will continue to <b>illuminate</b> the world, <b>and if not, we</b> will <b>not illuminate</b> the world."
        },
        {
          "verseLocation": "Habakkuk 3:11",
          "verseText": "as it is stated: “At the light of Your arrows as they go, at the shining of Your glittering spear”",
          "talmudLocation": "Nedarim 39b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/39b#section-14",
          "talmudFullText": "<b>At that moment, </b> God, <b>shot arrows, and</b> threw <b>spears at them, </b> and <b>said to them: Each and every day</b> idolaters <b>bow to you and you</b> continue to <b>illuminate</b> the world and do not protest. <b>In My honor, you did not protest, but in honor of flesh and blood, you protested? And</b> ever since, <b>each and every day</b> the heavenly hosts <b>shoot arrows and</b> throw <b>spears at</b> the sun and the moon, and only then do they emerge and <b>illuminate</b> the world, <b>as it is stated: “At the light of Your arrows as they go, at the shining of Your glittering spear”</b> (Habakkuk 3:11)."
        },
        {
          "verseLocation": "Habakkuk 3:11",
          "verseText": "which is written: “The sun and moon stand still in their habitation [ zevula ], at the light of Your arrows as they go”",
          "talmudLocation": "Sanhedrin 110a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/110a#section-15",
          "talmudFullText": "<b>Rava says: What</b> is the meaning of that <b>which is written: “The sun and moon stand still in their habitation [<i>zevula</i>], at the light of Your arrows as they go”</b> (Habakkuk 3:11)? This <b>teaches that the sun and moon ascended to <i>zevul</i>, </b> one of the seven firmaments, in which the upper Temple stands. <b>They said before</b> God: <b>God!, if You perform justice for</b> Moses, <b>the son of Amram, </b> and prove his righteousness, <b>we will emerge</b> and illuminate the world. <b>And if not, we will not emerge. </b> They did not emerge <b>until</b> God <b>fired arrows at them</b> and <b>said to them: You did not protest with regard to My honor, </b> as people would see the sun and the moon each day and worship them, but <b>you protested for the honor of flesh and blood? And today, </b> the sun and the moon <b>do not emerge until they are struck, </b> as in deference to God they hesitate to emerge."
        },
        {
          "verseLocation": "Habakkuk 3:15",
          "verseText": "and it is written: “You have trodden through the sea with Your horses”",
          "talmudLocation": "Sanhedrin 94b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/94b#section-2",
          "talmudFullText": "<b>Pharaoh</b> blasphemed God, <b>as it is written</b> that he said to Moses and Aaron: <b>“Who is YHWH that I should obey His voice? ”</b> (Exodus 5:2) <b>God Himself exacted retribution from him, as it is written: “And YHWH overthrew Egypt in the midst of the sea”</b> (Exodus 14:27), <b>and it is written: “You have trodden through the sea with Your horses”</b> (Habakkuk 3:15). <b>Sennacherib</b> blasphemed God by means of an agent, <b>as it is written: “By your messengers you have taunted YHWH”</b> (II Kings 19:23). <b>God exacted retribution from him by means of an agent, as it is written: “Then the angel of YHWH went forth and smote in the camp of the Assyrians one hundred and eighty-five thousand”</b> (II Kings 19:35)."
        },
        {
          "verseLocation": "Habakkuk 3:16",
          "verseText": "“When I heard, my innards trembled,",
          "talmudLocation": "Yoma 75b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/75b#section-8",
          "talmudFullText": "It is told that <b>Rav Yehuda found</b> quail <b>among his jugs of wine, </b> and <b>Rav Ḥisda found</b> quail <b>among logs of wood</b> in his storeroom. <b>Every day Rava’s sharecropper brought him</b> a quail that he found in his fields. <b>One day, he did not bring</b> him one because he failed to find any. Rava <b>said</b> to himself: <b>What is this, </b> why is today different? <b>He went up to the roof</b> to think about it. <b>He heard a child say</b> the verse: <b>“When I heard, my innards trembled, </b> my lips quivered at the voice, rottenness enters into my bones, and I tremble where I stand; that I should wait for the day of trouble when he comes up against the people that he invades” (Habakkuk 3:16). Rava <b>said: Learn from this that Rav Ḥisda has died. </b> I am therefore not worthy to receive the quail anymore, since it is on <b>account of the teacher</b> that <b>the student eats. </b> When Rav Ḥisda was alive, Rava received the quail due to Rav Ḥisda’s merit; now that he had died, Rava was not worthy to receive the quail."
        }
      ]
    }
  ]
}