{
  "bookName": "Haggai",
  "totalEntries": 11,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Haggai 1:8",
          "verseText": "and I will look on it favorably and I will be glorified [ ve’ekkaved ],",
          "talmudLocation": "Yoma 21b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/21b#section-7",
          "talmudFullText": "The Talmud asks: <b>And was there</b> fire that descended from the heavens <b>in the Second Temple? Didn’t Rav Shmuel bar Inya say: What is</b> the meaning of that <b>which is written</b> with regard to the Second Temple: “Go up to the hills and get wood and build the house; <b>and I will look on it favorably and I will be glorified [<i>ve’ekkaved</i>], </b> said YHWH” (Haggai 1:8)? Even though it is written <i>ve’ekkaved</i>, <b>we read it <i>ve’ikkavda</i>, </b> with an added letter <i>heh</i>. The Talmud explains: <b>What is different</b> that the word is <b>missing</b> the letter <b><i>heh</i>? This</b> represents <b>five, </b> the numerological value of <i>heh</i>, <b>phenomena</b> that constituted the difference <b>between</b> the <b>First Temple</b> and the <b>Second Temple, </b> in that they were not in the Second Temple. <b>And these are: The Ark</b> of the Covenant, <b>and the Ark cover</b> upon it, <b>and the cherubs</b> that were on the Ark cover; <b>fire; and</b> the <b>Shekhina; and the Holy Spirit; and the <i>Urim VeTummim</i>. </b> Apparently, there was no fire from heaven in the Second Temple. The rabbis <b>say</b> in response: <b>Yes, there was</b> fire from heaven in the Second Temple; however, <b>it did not assist</b> in burning the offerings but was merely visible above the wood."
        },
        {
          "verseLocation": "Haggai 1:15",
          "verseText": "“On the twenty-fourth day of the sixth month, in the second year of Darius the king”",
          "talmudLocation": "Rosh Hashanah 3b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/3b#section-7",
          "talmudFullText": "<b>Rav Yosef raised an objection</b> against the rule established by Rav Ḥisda that the years of non-Jew kings are counted from Tishrei from the verse that states: <b>“On the twenty-4th day of the 6th month, in the second year of Darius the king”</b> (Haggai 1:15), <b>and it is written</b> immediately afterward: <b>“In the 7th month, in the second year, on the 21st day of the month, </b> the word of YHWH came by the prophet Haggai, saying” (Haggai 2:1). <b>And if it were so</b> that the years of non-Jew kings are counted from Tishrei, <b>what</b> the verse <b>needed</b> to state is: <b>In the 7th month in the 3rd year, </b> as a new year had already started for him."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Haggai 2:1",
          "verseText": "“In the seventh month, in the second year, on the twenty-first day of the month,",
          "talmudLocation": "Rosh Hashanah 3b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/3b#section-7",
          "talmudFullText": "<b>Rav Yosef raised an objection</b> against the rule established by Rav Ḥisda that the years of non-Jew kings are counted from Tishrei from the verse that states: <b>“On the twenty-4th day of the 6th month, in the second year of Darius the king”</b> (Haggai 1:15), <b>and it is written</b> immediately afterward: <b>“In the 7th month, in the second year, on the 21st day of the month, </b> the word of YHWH came by the prophet Haggai, saying” (Haggai 2:1). <b>And if it were so</b> that the years of non-Jew kings are counted from Tishrei, <b>what</b> the verse <b>needed</b> to state is: <b>In the 7th month in the 3rd year, </b> as a new year had already started for him."
        },
        {
          "verseLocation": "Haggai 2:6",
          "verseText": "“Yet once, it is a little while, and I will shake the heavens and the earth”",
          "talmudLocation": "Sanhedrin 97b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/97b#section-7",
          "talmudFullText": "<b>And</b> the Messiah will come <b>not in accordance with</b> the opinion of <b>R' Akiva, who would interpret</b> the verse: <b>“Yet once, it is a little while, and I will shake the heavens and the earth”</b> (Haggai 2:6), to mean that the redemption would transpire soon after the destruction of the Temple."
        },
        {
          "verseLocation": "Haggai 2:8",
          "verseText": "it is Mine, as it is stated: “Mine is the silver, and Mine the gold, said the Lord of hosts”",
          "talmudLocation": "Avodah Zarah 2b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/2b#section-5",
          "talmudFullText": "<b>God says to them: Fools of the world!</b> Are you attempting to deceive Me? <b>Everything that you did, you did for your own needs. You established marketplaces to place prostitutes in them; </b> you built <b>bathhouses for your own enjoyment; </b> and as for the <b>silver and gold</b> that you claim to have increased, <b>it is Mine, as it is stated: “Mine is the silver, and Mine the gold, said YHWH of hosts”</b> (Haggai 2:8)."
        },
        {
          "verseLocation": "Haggai 2:8",
          "verseText": "from the One to Whom wealth belongs, as it is stated: “Mine is the silver, and Mine the gold, says the Lord of hosts”",
          "talmudLocation": "Kiddushin 82b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/82b#section-3",
          "talmudFullText": "<b>R' Meir says: A person should always teach his son a clean and easy trade, and he should request compassion from the One to Whom wealth and property belong, as poverty</b> does <b>not</b> come <b>from a trade, nor</b> does <b>wealth</b> come <b>from a trade; rather, </b> they come <b>from the One to Whom wealth belongs, as it is stated: “Mine is the silver, and Mine the gold, says YHWH of hosts”</b> (Haggai 2:8)."
        },
        {
          "verseLocation": "Haggai 2:8",
          "verseText": "from the One to Whom wealth belongs, as it is stated: “Mine is the silver, and Mine the gold,",
          "talmudLocation": "Niddah 70b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/70b#section-13",
          "talmudFullText": "The rabbis of Alexandria asked: <b>What</b> should <b>a person do to become wealthy? </b> R' Yehoshua <b>said to them: </b> He should <b>increase</b> his time involved in <b>merchandise and conduct his business faithfully. </b> The rabbis of Alexandria <b>said</b> to R' Yehoshua: <b>Many</b> people <b>have done so, and</b> it <b>did not help them</b> become rich. R' Yehoshua replied: <b>Rather, they should pray for mercy</b> to receive wisdom <b>from the One to Whom wealth belongs, as it is stated: “Mine is the silver, and Mine the gold, </b> says YHWH of hosts” (Haggai 2:8)."
        },
        {
          "verseLocation": "Haggai 2:8",
          "verseText": "They said to him: Aren’t the silver and the gold His, as it is stated: “The silver is mine and the gold is mine says the Lord of hosts”",
          "talmudLocation": "Sanhedrin 103b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103b#section-12",
          "talmudFullText": "<b>When Jehoiakim came</b> along and reigned, <b>he said: </b> My <b>predecessors did not know</b> how <b>to express insolence to</b> God. <b>Do we need</b> God <b>even for his light? </b> Since <b>we have <i>parvayim</i> gold that we use</b> that shines, <b>let</b> God <b>take His light</b> from the world. <b>They said to him: Aren’t the silver and the gold His, as it is stated: “The silver is mine and the gold is mine says YHWH of hosts”</b> (Haggai 2:8)? Jehoiakim <b>said to them: He has already given it to us, as it is stated: “The heavens are the heavens of YHWH, but the earth He has given to the children of men”</b> (Psalms 115:16)."
        },
        {
          "verseLocation": "Haggai 2:9",
          "verseText": "As it is written: “The glory of this latter house shall be greater than that of the former”",
          "talmudLocation": "Bava Batra 3a:24",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/3a#section-24",
          "talmudFullText": "The Talmud comments: <b>And from where do we</b> derive <b>that</b> the Second Temple <b>was taller</b> than the First Temple? <b>As it is written: “The glory of this latter house shall be greater than that of the former”</b> (Haggai 2:9). <b>Rav and Shmuel</b> disagree about the meaning of this verse, <b>and some say</b> it was <b>R' Yoḥanan and R' Elazar</b> who disagreed as to its meaning. <b>One</b> of them <b>said</b> that it means that the Second Temple will be greater <b>in</b> the size of its <b>structure, </b> i.e., taller. <b>And one</b> of them <b>said</b>"
        },
        {
          "verseLocation": "Haggai 2:13",
          "verseText": "a corpse touches any of these, shall he be impure? And the priests answered and said: He shall be impure”",
          "talmudLocation": "Pesachim 17a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/17a#section-7",
          "talmudFullText": "The Talmud cites proof from the subsequent verse. <b>Come</b> and <b>hear: “And Haggai said: If one who is impure with</b> impurity imparted by <b>a corpse touches any of these, shall he be impure? And the priests answered and said: He shall be impure”</b> (Haggai 2:13). <b>Granted, </b> according <b>to Shmuel, from</b> the fact that <b>here, </b> with regard to a dead creeping animal, the priests <b>did not err, </b> as Shmuel maintains that the dilemma was with regard to 5th-degree ritual impurity, <b>there too they did not err. However, </b> according <b>to Rav, what is different here, </b> concerning the impurity of a creeping animal, such <b>that</b> the priests <b>erred, and what is different there, </b> with regard to impurity imparted by a corpse, such <b>that they did not err? </b>"
        },
        {
          "verseLocation": "Haggai 2:14",
          "verseText": "“And Haggai answered and said: So is this people, and so is this nation before me, said God;",
          "talmudLocation": "Pesachim 17a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/17a#section-10",
          "talmudFullText": "<b>Come</b> and <b>hear</b> a resolution to this matter from the next verse: <b>“And Haggai answered and said: So is this people, and so is this nation before me, said God; </b> and so is all the work of their hands; and that which they offer there is impure” (Haggai 2:14). <b>Granted, </b> according <b>to</b> the opinion of <b>Rav</b> that the priests erred, <b>that is</b> the reason <b>that it is written: </b> “That which they offer there is <b>impure, ”</b> as the priests’ lack of familiarity with the <i>halakhot</i> of impurity increase the likelihood that all of their Temple service is ritually impure. <b>However, </b> according <b>to Shmuel, why</b> does the verse say that their offerings are <b>ritually impure? </b>"
        }
      ]
    }
  ]
}