{
  "bookName": "Hosea",
  "totalEntries": 114,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Hosea 1:1",
          "verseText": "in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judea,",
          "talmudLocation": "Pesachim 87a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87a#section-12",
          "talmudFullText": "Apropos the verse from Hosea, the Talmud interprets additional verses there: <b>“The word of YHWH that came unto Hosea, </b> the son of Beeri, <b>in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judea, </b> and in the days of Jeroboam the son of Joash, king of Israel” (Hosea 1:1). The rabbis explained: <b>Four prophets prophesied in one era and the oldest of them was Hosea, as it is stated: “When YHWH spoke at first with Hosea”</b> (Hosea 1:2), indicating that Hosea was the first of these prophets. If not, the question arises: <b>And</b> was it <b>with Hosea that</b> YHWH <b>spoke first</b> of all the prophets? <b>Weren’t there several prophets</b> who lived and prophesied during the period <b>from Moses until Hosea? </b> Rather, <b>R' Yoḥanan said: </b> He was <b>the first of the four prophets who prophesied during that period, and these are they: Hosea, Isaiah, Amos, and Micah. </b>"
        },
        {
          "verseLocation": "Hosea 1:1",
          "verseText": "As it is written: “The word of the Lord that came to Hosea, son of Beeri, in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judea, and in the days of Jeroboam, the son of Joash, king of Israel”",
          "talmudLocation": "Pesachim 87b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-11",
          "talmudFullText": "The Talmud asks: <b>From where do we</b> derive <b>that he was counted</b> together with the righteous kings of Judea? <b>As it is written: “The word of YHWH that came to Hosea, son of Beeri, in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judea, and in the days of Jeroboam, the son of Joash, king of Israel”</b> (Hosea 1:1)."
        },
        {
          "verseLocation": "Hosea 1:2",
          "verseText": "as it is written: “The Lord spoke first to Hosea”",
          "talmudLocation": "Bava Batra 14b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/14b#section-8",
          "talmudFullText": "§ <b>A baraita states: The order of the</b> books of the <b>Prophets</b> when they are attached together is as follows: <b>Joshua and Judges, Samuel and Kings, Jeremiah and Ezekiel, </b> and <b>Isaiah and the Twelve</b> Prophets. The Talmud asks: <b>Consider: Hosea preceded</b> some of the other prophets whose books are included in the Bible, <b>as it is written: “YHWH spoke first to Hosea”</b> (Hosea 1:2). At first glance this verse is difficult: <b>But did God speak first with Hosea, </b> and not with any other prophet before him? <b>Weren’t there many prophets between Moses and Hosea? And R' Yoḥanan says: He was the first of four prophets who prophesied in that period, and they were: Hosea and Isaiah, Amos and Micah. </b> Accordingly, Hosea preceded those three prophets; <b>and</b> the book of <b>Hosea</b> as well <b>should precede</b> the books of those prophets."
        },
        {
          "verseLocation": "Hosea 1:2",
          "verseText": "Four prophets prophesied in one era and the oldest of them was Hosea, as it is stated: “When the Lord spoke at first with Hosea”",
          "talmudLocation": "Pesachim 87a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87a#section-12",
          "talmudFullText": "Apropos the verse from Hosea, the Talmud interprets additional verses there: <b>“The word of YHWH that came unto Hosea, </b> the son of Beeri, <b>in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judea, </b> and in the days of Jeroboam the son of Joash, king of Israel” (Hosea 1:1). The rabbis explained: <b>Four prophets prophesied in one era and the oldest of them was Hosea, as it is stated: “When YHWH spoke at first with Hosea”</b> (Hosea 1:2), indicating that Hosea was the first of these prophets. If not, the question arises: <b>And</b> was it <b>with Hosea that</b> YHWH <b>spoke first</b> of all the prophets? <b>Weren’t there several prophets</b> who lived and prophesied during the period <b>from Moses until Hosea? </b> Rather, <b>R' Yoḥanan said: </b> He was <b>the first of the four prophets who prophesied during that period, and these are they: Hosea, Isaiah, Amos, and Micah. </b>"
        },
        {
          "verseLocation": "Hosea 1:2",
          "verseText": "as it is stated: “The Lord said to Hosea: Go, take for yourself a wife of prostitution and children of prostitution”",
          "talmudLocation": "Pesachim 87a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87a#section-14",
          "talmudFullText": "<b>God said: What shall I do to this Elder</b> who does not know how to defend Israel? <b>I will say to him: Go and take a prostitute and bear for yourself children of prostitution. And after that I will say to him: Send her away from before you. If he is able to send</b> her away, <b>I will also send</b> away <b>the Jewish people. </b> This deliberation provides the background of the opening prophecy in Hosea, <b>as it is stated: “YHWH said to Hosea: Go, take for yourself a wife of prostitution and children of prostitution”</b> (Hosea 1:2). <b>And</b> then <b>it is written: “So he went and took Gomer the daughter of Diblaim”</b> (Hosea 1:3), and the rabbis interpreted her name homiletically. <b>“Gomer”; Rav said</b> she was so called <b>because everyone would finish [<i>gomerim</i>]</b> having sex with her and satisfy their desires <b>with her. “The daughter of</b>"
        },
        {
          "verseLocation": "Hosea 1:3",
          "verseText": "it is written: “So he went and took Gomer the daughter of Diblaim”",
          "talmudLocation": "Pesachim 87a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87a#section-14",
          "talmudFullText": "<b>God said: What shall I do to this Elder</b> who does not know how to defend Israel? <b>I will say to him: Go and take a prostitute and bear for yourself children of prostitution. And after that I will say to him: Send her away from before you. If he is able to send</b> her away, <b>I will also send</b> away <b>the Jewish people. </b> This deliberation provides the background of the opening prophecy in Hosea, <b>as it is stated: “YHWH said to Hosea: Go, take for yourself a wife of prostitution and children of prostitution”</b> (Hosea 1:2). <b>And</b> then <b>it is written: “So he went and took Gomer the daughter of Diblaim”</b> (Hosea 1:3), and the rabbis interpreted her name homiletically. <b>“Gomer”; Rav said</b> she was so called <b>because everyone would finish [<i>gomerim</i>]</b> having sex with her and satisfy their desires <b>with her. “The daughter of</b>"
        },
        {
          "verseLocation": "Hosea 1:6",
          "verseText": "compassion, as it is stated: “For I will no more have compassion upon the house of Israel”",
          "talmudLocation": "Pesachim 87b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-13",
          "talmudFullText": "<b>R' Elazar said: Even at</b> the <b>time of</b> the <b>anger of God He remembers the</b> attribute of <b>compassion, as it is stated: “For I will no more have compassion upon the house of Israel”</b> (Hosea 1:6). Even when implementing His attribute of justice, God still mentions His attribute of compassion. <b>R' Yosei bar R' Ḥanina said</b> that this is also indicated <b>from here, </b> from the continuation of the verse, which states: <b>“That I should bear them, ”</b> indicating that God promised to eventually bear Israel’s sins and pardon them."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Hosea 2:1",
          "verseText": "And it states: “And it shall come to pass that, instead of what was said to them: You are not My people, it shall be said to them: Sons of the living God”",
          "talmudLocation": "Kiddushin 36a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/36a#section-12",
          "talmudFullText": "<b>And R' Meir says: Either way you are</b> still <b>called sons, as it is stated: “They are foolish sons”</b> (Jeremiah 4:22). <b>And it</b> also <b>states: “Sons in whom there is no faithfulness”</b> (Deuteronomy 32:20). <b>And it states: “A seed of evildoers, sons who deal corruptly”</b> (Isaiah 1:4). <b>And it states: “And it shall come to pass that, instead of what was said to them: You are not My people, it shall be said to them: Sons of the living God”</b> (Hosea 2:1)."
        },
        {
          "verseLocation": "Hosea 2:1",
          "verseText": "And it will be that instead of that which was said to them: You are not My people, it shall be said to them: You are the children of the living God. And the children of Judea and the children of Israel shall be gathered together”",
          "talmudLocation": "Pesachim 87b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-8",
          "talmudFullText": "Hosea <b>stood and requested compassion</b> upon the Jewish people <b>and nullified</b> the <b>decree. </b> God responded <b>and began to bless them, as it is stated: “Yet the number of the children of Israel shall be as the sand of the sea, </b> which cannot be measured nor numbered. <b>And it will be that instead of that which was said to them: You are not My people, it shall be said to them: You are the children of the living God. And the children of Judea and the children of Israel shall be gathered together”</b> (Hosea 2:1). <b>And I will sow her to Me in the land; and I will have compassion upon her that had not received compassion; and I will say to them that were not My people: You are My people”</b> (Hosea 2:25)."
        },
        {
          "verseLocation": "Hosea 2:1",
          "verseText": "as it is stated: “And the number of the children of Israel will be like the sand of the sea, which cannot be measured”",
          "talmudLocation": "Yoma 22b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/22b#section-4",
          "talmudFullText": "<b>R' Elazar said: Whoever counts</b> a group of <b>Jews violates a negative</b> mitzva, <b>as it is stated: “And the number of the children of Israel will be like the sand of the sea, which cannot be measured”</b> (Hosea 2:1). R' Elazar interprets the verse to be saying: Which may not be measured. <b>Rav Naḥman bar Yitzḥak said: </b> One who counts a group of Jews in fact <b>violates two negative</b> mitzvot, <b>as it is stated</b> in that verse: “Which <b>cannot be measured and cannot be counted”</b> (Hosea 2:1)."
        },
        {
          "verseLocation": "Hosea 2:2",
          "verseText": "“And the children of Judea and the children of Israel shall be gathered together, and they shall appoint themselves one head, and shall go up out of the land; for great shall be the day of Jezreel”",
          "talmudLocation": "Pesachim 88a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/88a#section-5",
          "talmudFullText": "<b>R' Yoḥanan said: </b> The day of the <b>ingathering of exiles is as great as the day on which heaven and earth were created. </b> This is derived by means of a verbal analogy between the word day in these two contexts, <b>as it is stated</b> concerning the ingathering of exiles: <b>“And the children of Judea and the children of Israel shall be gathered together, and they shall appoint themselves one head, and shall go up out of the land; for great shall be the day of Jezreel”</b> (Hosea 2:2), <b>and it is written</b> in the narrative of Creation: <b>“And there was evening and there was morning, one day”</b> (Genesis 1:5)."
        },
        {
          "verseLocation": "Hosea 2:7",
          "verseText": "“I will follow my lovers, givers of my bread and my water, my wool and my flax, my oil and my drink [ veshikkuyai ]”",
          "talmudLocation": "Horayot 10b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/10b#section-11",
          "talmudFullText": "He explains: <b>“And Lot cast</b> his eyes” is an allusion to the verse: <b>“His master’s wife cast her eyes</b> upon Joseph and said: Lie with me” (Genesis 39:7). <b>“His eyes”</b> is an allusion to the verse: <b>“And Samson said: Get her for me, as she is pleasing to my eyes”</b> (Judges 14:3). <b>“And beheld”</b> is an allusion to the verse: <b>“And Shechem, son of Hamor, </b> the prince of the land, <b>beheld her; </b> and he took her and lay with her” (Genesis 34:2). <b>“The entire plain [<i>kikar</i>] of the Jordan”</b> is an allusion to the verse: <b>“For on account of a prostitute a man is brought to a loaf [<i>kikar</i>] of bread”</b> (Proverbs 6:26). <b>“That it was well watered [<i>mashke</i>] everywhere”</b> is an allusion to the verse <b>“I will follow my lovers, givers of my bread and my water, my wool and my flax, my oil and my drink [<i>veshikkuyai</i>]”</b> (Hosea 2:7)."
        },
        {
          "verseLocation": "Hosea 2:7",
          "verseText": "“I will go after my lovers who give me my bread and my water, my wool and my flax, my oil and my drink”",
          "talmudLocation": "Ketubot 65a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/65a#section-1",
          "talmudFullText": "<b>Wines are not allotted to a wife. And if you say</b> that in the verse: <b>“I will go after my lovers who give me my bread and my water, my wool and my flax, my oil and my drink”</b> (Hosea 2:7), “drink [<i>shikkuyai</i>]” is apparently a reference to wine, which indicates that it is usual for a woman to receive wine, this is invalid, since actually <i>shikkuyai</i> is not referring to wine but rather to <b>items that a woman desires [<i>mishtokeket</i>]. And what are these? Jewelry</b> or other ornaments, not wine."
        },
        {
          "verseLocation": "Hosea 2:7",
          "verseText": "“I will go after my lovers, who give me my bread and my water, my wool and my flax, my oil and my drink”",
          "talmudLocation": "Nazir 23a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/23a#section-17",
          "talmudFullText": "R' Yoḥanan continues to interpret the verse as a series of references to licentiousness. The phrase <b>“and saw”</b> is reminiscent of the verse dealing with Jacob’s daughter Dinah: <b>“And Shechem, the son of Hamor the Hivite, saw her</b> and he took her, and lay with her” (Genesis 34:2). The verse continues: <b>“All the plain [<i>kikar</i>] of the Jordan, ”</b> which alludes to the verse: <b>“For on account of a harlot a man is brought to a loaf [<i>kikar</i>] of bread”</b> (Proverbs 6:26). The last part of the verse: <b>“That it was well watered everywhere, ”</b> recalls: <b>“I will go after my lovers, who give me my bread and my water, my wool and my flax, my oil and my drink”</b> (Hosea 2:7)."
        },
        {
          "verseLocation": "Hosea 2:8",
          "verseText": "As it is written: “Therefore, behold, I will hedge up your way with thorns,",
          "talmudLocation": "Rosh Hashanah 23b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/23b#section-5",
          "talmudFullText": "The Talmud provides a source for this claim. <b>As it is written: “Therefore, behold, I will hedge up your way with thorns, </b> and make a wall against her, that she shall not find her paths” (Hosea 2:8). <b>Rav Naḥman bar Yitzḥak said: </b> It is derived <b>from here, as it is written: “He has made my paths crooked”</b> (Lamentations 3:9), which indicates that over the course of the exile the routes have become longer."
        },
        {
          "verseLocation": "Hosea 2:9",
          "verseText": "and she will say ‘I will go and return to my first husband; for it was better for me then than now’”",
          "talmudLocation": "Berakhot 7a:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/7a#section-22",
          "talmudFullText": "<b>And R' Yoḥanan said in the name of R' Yosei: A single regret</b> or pang of guilt <b>in one’s heart is preferable to many lashes</b> administered by others that cause only physical pain, <b>as it is stated: “And she chases her lovers, </b> but she does not overtake them; she seeks them, but she will not find them; <b>and she will say ‘I will go and return to my first husband; for it was better for me then than now’”</b> (Hosea 2:9). Remorse is more effective than any externally imposed punishment listed in the verses that follow (Hosea 2:11–19). <b>And Reish Lakish said</b> that in the Bible, it seems that such remorse is <b>preferable to one hundred lashes, as it is stated: “A rebuke enters deeper into a man of understanding than a hundred lashes to a fool”</b> (Proverbs 17:10)."
        },
        {
          "verseLocation": "Hosea 2:10",
          "verseText": "As it is stated: “And I gave them an abundance of silver and gold, which they used for the Ba’al”",
          "talmudLocation": "Berakhot 32a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/32a#section-13",
          "talmudFullText": "<b>And if you wish, say</b> instead that it is derived <b>from here: “And Jeshurun grew fat and kicked”</b> (Deuteronomy 32:15). <b>R' Shmuel bar Naḥmani said</b> that <b>R' Yonatan said: From where</b> in the Torah is it derived that <b>God ultimately conceded to Moses</b> that the reason for the sin of the Golden Calf was indeed the riches lavished upon Israel? <b>As it is stated: “And I gave them an abundance of silver and gold, which they used for the Ba’al”</b> (Hosea 2:10)."
        },
        {
          "verseLocation": "Hosea 2:11",
          "verseText": "Rabbi Ḥanina bar Pappa raised a contradiction: It is written, “I will take back My grain at its time",
          "talmudLocation": "Berakhot 35b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/35b#section-4",
          "talmudFullText": "On a similar note, the Talmud cites that <b>R' Ḥanina bar Pappa raised a contradiction: It is written, “I will take back My grain at its time</b> and wine in its season” (Hosea 2:11), <b>and it is written: “And you shall gather your grain, </b> your wine and your oil” (Deuteronomy 11:14). To whom does the grain belong: To God, or to the people?"
        },
        {
          "verseLocation": "Hosea 2:12",
          "verseText": "I will uncover her lewdness in the sight of her lovers, and none shall deliver her out of My hand”",
          "talmudLocation": "Shabbat 55a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/55a#section-13",
          "talmudFullText": "With regard to the statement that the merit of the Patriarchs has ceased, the Talmud asks: <b>From when did the merit of the Patriarchs cease? Rav said: From the days of</b> the prophet <b>Hosea, son of Beeri, as it is stated: </b> “And now <b>I will uncover her lewdness in the sight of her lovers, and none shall deliver her out of My hand”</b> (Hosea 2:12). Israel will no longer be saved by the merit of the Patriarchs."
        },
        {
          "verseLocation": "Hosea 2:13",
          "verseText": "as it is written: “And I will cause all of her happiness to cease, her Festival, her New Moon, and her Shabbat and all her Festivals”",
          "talmudLocation": "Shabbat 145b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/145b#section-14",
          "talmudFullText": "R' Yoḥanan continued to answer the questions of R' Ḥiyya bar Abba and R' Asi: <b>For what</b> reason are the <b>Festivals in Babylonia more joyous</b> than those in Eretz Yisrael? <b>Because they were not</b> included <b>in that curse</b> with which Eretz Yisrael was cursed, <b>as it is written: “And I will cause all of her happiness to cease, her Festival, her New Moon, and her Shabbat and all her Festivals”</b> (Hosea 2:13). <b>And it is</b> also <b>written: “My soul hates your New Moons and your Festivals; they are a burden to Me; </b> I am weary to bear them” (Isaiah 1:14). <b>What is</b> the meaning of the phrase: <b>“They are a burden to me”? R' Elazar said</b> that <b>God said: Is it not enough for the Jewish people that they sin before Me, that they</b> also <b>burden Me to know which harsh decree I will bring upon them? R' Yitzḥak said: </b> Because of this curse, <b>there is not a single Festival on which troops did not come to Tzippori</b> to conduct searches or to collect taxes. <b>And R' Ḥanina said: There is not a single Festival on which an <i>egmon</i> and a <i>kamton</i> and a branch bearer, </b> Roman officials, <b>did not come to Tiberias</b> to collect taxes, thereby disrupting the festive celebrations."
        },
        {
          "verseLocation": "Hosea 2:13",
          "verseText": "as it is written: “And I will cause all her mirth to cease, her Festival, her New Moon, and her Shabbat”",
          "talmudLocation": "Taanit 29b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/29b#section-13",
          "talmudFullText": "<b>R' Yoḥanan said: And all three of</b> these <i>tanna’im</i> <b>derived</b> their opinions from <b>one verse, </b> from which they drew different conclusions, <b>as it is written: “And I will cause all her mirth to cease, her Festival, her New Moon, and her Shabbat”</b> (Hosea 2:13). <b>The one who said</b> that these activities are prohibited <b>from the New Moon until</b> after <b>the fast, </b> R' Meir,"
        },
        {
          "verseLocation": "Hosea 2:17",
          "verseText": "in the messianic era, as it is stated: “And she shall respond there, as in the days of her youth, and as in the day when she came up out of the land of Egypt”",
          "talmudLocation": "Sanhedrin 111a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/111a#section-6",
          "talmudFullText": "<b>It is taught</b> in a <i>baraita</i> with regard to the few that are destined to be redeemed: <b>Rav Simai says</b> that <b>it is stated: “And I will take you to Me as a people”</b> (Exodus 6:7), <b>and</b> juxtaposed to that verse <b>it is stated: “And I will bring you</b> into the land” (Exodus 6:8). The Torah <b>compares their exodus from Egypt to their entry into the land; just as</b> during <b>their entry into the land</b> only <b>two of six hundred thousand</b> entered the land, as they all died in the wilderness except for Caleb and Joshua, <b>so too, </b> during <b>their exodus from Egypt, </b> in terms of the ratio, <b>only two of six hundred thousand</b> left Egypt and the rest died there. <b>Rava says: And likewise, </b> that will be the situation <b>in the messianic era, as it is stated: “And she shall respond there, as in the days of her youth, and as in the day when she came up out of the land of Egypt”</b> (Hosea 2:17). The ultimate redemption and the exodus from Egypt are juxtaposed, indicating that in the messianic era too, only few will survive."
        },
        {
          "verseLocation": "Hosea 2:18",
          "verseText": "“And it shall be on that day, says the Lord, that you will call Me: My Husband [ Ishi ], and you will no longer call Me: My Master [ Ba’ali ]”",
          "talmudLocation": "Ketubot 71b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/71b#section-15",
          "talmudFullText": "Similarly, concerning the verse <b>“And it shall be on that day, says YHWH, that you will call Me: My Husband [<i>Ishi</i>], and you will no longer call Me: My Master [<i>Ba’ali</i>]”</b> (Hosea 2:18), <b>R' Yoḥanan said: </b> The meaning is: <b>Like a bride in her father-in-law’s house</b> after she has already lived with her husband, whom she is consequently not ashamed to call her marriage partner, <b>and not like a</b> betrothed <b>bride</b> still <b>in her father’s house, </b> who simply refers to her groom as: My master."
        },
        {
          "verseLocation": "Hosea 2:18",
          "verseText": "in her father’s house. As it is written: “And it shall be at that day, says the Lord, that you shall call Me: My Husband, and shall call Me no more: My Master”",
          "talmudLocation": "Pesachim 87a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87a#section-6",
          "talmudFullText": "There is a homiletic interpretation of verses that conveys a similar idea, <b>as it is written: </b> “I am a wall, and my breasts are like towers; <b>then I was in his eyes as one who finds peace”</b> (Song of Songs 8:10). <b>And R' Yoḥanan said: </b> She is <b>like a bride who was found perfect. </b> She was warmly received <b>in her father-in-law’s house. And</b> she eagerly hurries, as one <b>pursued, to go to tell</b> of <b>her praise, </b> i.e., her warm welcome, <b>in her father’s house. As it is written: “And it shall be at that day, says YHWH, that you shall call Me: My Husband, and shall call Me no more: My Master”</b> (Hosea 2:18), of which <b>R' Yoḥanan said: </b> She shall be <b>like a bride in her father-in-law’s house, </b> where she experiences a close relationship with her husband. <b>And</b> she shall <b>not</b> be <b>like a bride</b> still in the betrothal period and living <b>in her father’s house, </b> during which time her relationship with her husband has still not developed."
        },
        {
          "verseLocation": "Hosea 2:25",
          "verseText": "And Rabbi Elazar said: The Holy One, Blessed be He, exiled Israel among the nations only so that converts would join them, as it is stated: “And I will sow her to Me in the land”",
          "talmudLocation": "Pesachim 87b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-14",
          "talmudFullText": "<b>And R' Elazar said: God exiled Israel among the nations only so that converts would join them, as it is stated: “And I will sow her to Me in the land”</b> (Hosea 2:25). <b>Does a person sow a <i>se’a</i></b> of grain for any reason other <b>than to bring in several <i>kor</i></b> of grain during the harvest? So too, the exile is to enable converts from the nations to join the Jewish people."
        },
        {
          "verseLocation": "Hosea 2:25",
          "verseText": "from here: “And I will have compassion upon her that had not received compassion;",
          "talmudLocation": "Pesachim 87b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-15",
          "talmudFullText": "<b>And R' Yoḥanan said</b> that this idea may be derived <b>from here: “And I will have compassion upon her that had not received compassion; </b> and I will say to them that were not My people: You are My people” (Hosea 2:25). Even those who were initially “not My people,” i.e., non-Jews, will convert and become part of the Jewish nation."
        },
        {
          "verseLocation": "Hosea 2:25",
          "verseText": "And I will sow her to Me in the land; and I will have compassion upon her that had not received compassion; and I will say to them that were not My people: You are My people”",
          "talmudLocation": "Pesachim 87b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-8",
          "talmudFullText": "Hosea <b>stood and requested compassion</b> upon the Jewish people <b>and nullified</b> the <b>decree. </b> God responded <b>and began to bless them, as it is stated: “Yet the number of the children of Israel shall be as the sand of the sea, </b> which cannot be measured nor numbered. <b>And it will be that instead of that which was said to them: You are not My people, it shall be said to them: You are the children of the living God. And the children of Judea and the children of Israel shall be gathered together”</b> (Hosea 2:1). <b>And I will sow her to Me in the land; and I will have compassion upon her that had not received compassion; and I will say to them that were not My people: You are My people”</b> (Hosea 2:25)."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Hosea 3:1",
          "verseText": "a jug of wine, as it is written: “And those who love the jug [ ashishei ] of grapes”",
          "talmudLocation": "Pesachim 36b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/36b#section-15",
          "talmudFullText": "<b>And Rav Ḥanan bar Abba said: </b> The word <b><i>eshpar</i></b> refers to a portion of meat equivalent to <b>one-6th of an ox, </b> and the word <b><i>ashisha</i></b> refers to a cake prepared from <b>one-6th of an <i>eipha</i></b> of flour. <b>And</b> this interpretation <b>disputes</b> the opinion <b>of Shmuel, as Shmuel said: <i>Ashisha</i></b> means <b>a jug of wine, as it is written: “And those who love the jug [<i>ashishei</i>] of grapes”</b> (Hosea 3:1)."
        },
        {
          "verseLocation": "Hosea 3:2",
          "verseText": "“So I bought her [ va’ekkereha ] to me for fifteen pieces of silver,",
          "talmudLocation": "Chullin 92a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/92a#section-17",
          "talmudFullText": "§ The Talmud cites homiletical interpretations of other verses that pertain to the leaders of the Jewish people in Eretz Yisrael and Babylonia. The verse states: <b>“So I bought her [<i>va’ekkereha</i>] to me for fifteen pieces of silver, </b> and a <i>ḥomer</i> of barley, and a half-<i>ḥomer</i> of barley” (Hosea 3:2). <b>R' Yoḥanan says in the name of R' Shimon ben Yehotzadak: </b> The term <b><i>kira</i>, </b> which forms the basis of the verb <i>va’ekkereha</i>, <b>is nothing other than language</b> referring to <b>a sale [<i>mekhira</i>], as it is stated</b> that Joseph said: “My father made me swear, saying: Lo, I die; <b>in my grave that I have acquired [<i>kariti</i>] for me</b> in the land of Canaan, there shall you bury me” (Genesis 50:5)."
        },
        {
          "verseLocation": "Hosea 3:2",
          "verseText": "nothing other than the righteous, as it is stated: “So I bought her to me for fifteen pieces of kesef and for a kor of barley and a half- kor of barley”",
          "talmudLocation": "Sanhedrin 96b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/96b#section-12",
          "talmudFullText": "Ammon and Moab <b>sent to</b> Nebuchadnezzar: <b>“He has taken a bundle of <i>kesef</i> with him”</b> (Proverbs 7:20), <b>and <i>kesef</i></b> is referring to <b>nothing other than the righteous, as it is stated: “So I bought her to me for fifteen pieces of <i>kesef</i> and for a <i>kor</i> of barley and a half-<i>kor</i> of barley”</b> (Hosea 3:2). The inference is that God acquired the congregation of Israel due to the presence of righteous people among them, and Ammon and Moab sent a message to Nebuchadnezzar that God had already taken the righteous and they no longer offered protection."
        },
        {
          "verseLocation": "Hosea 3:4",
          "verseText": "atones for idol worship, as it is written: “And without ephod or teraphim”",
          "talmudLocation": "Arakhin 16a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/16a#section-15",
          "talmudFullText": "The <b>breastplate</b> of the High Priest <b>atones for</b> improper <b>judgments, as it is written: “And you shall make a breastplate of judgment”</b> (Exodus 28:15). The <b>ephod</b> of the High Priest <b>atones for idol worship, as it is written: “And without ephod or teraphim”</b> (Hosea 3:4), that is to say, when there is no ephod, the sin of teraphim, i.e., idol worship, is found. This indicates that if there is an ephod, there is no sin of idol worship. The <b>robe</b> of the High Priest <b>atones for malicious speech, </b> as <b>God says: </b> Let an <b>item that</b> produces <b>sound, </b> i.e., the bells of the robe, <b>come and atone for</b> an <b>act of</b> malicious <b>sound, </b> i.e., malicious speech."
        },
        {
          "verseLocation": "Hosea 3:4",
          "verseText": "without ephod or teraphim”",
          "talmudLocation": "Zevachim 88b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/zevachim/88b#section-7",
          "talmudFullText": "R' Inini bar Sason continues: The <b>belt atones for thought of the heart. </b> The Talmud elaborates: The belt atones for the sins occurring <b>where it is</b> situated, i.e., over the heart. The <b>breastplate</b> of the High Priest <b>atones for</b> improper <b>judgments, as it is stated: “And you shall make a breastplate of judgment”</b> (Exodus 28:15). The <b>ephod</b> of the High Priest <b>atones for idol worship, as it is stated: </b> “And <b>without ephod or teraphim”</b> (Hosea 3:4), meaning that when there is no ephod, the sin of teraphim, i.e., idol worship, is found. Therefore, it may be inferred that if there is an ephod, there is no sin of idol worship."
        },
        {
          "verseLocation": "Hosea 3:5",
          "verseText": "“Afterward the children of Israel shall return, and seek the Lord their God and David their king”",
          "talmudLocation": "Megillah 18a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/18a#section-1",
          "talmudFullText": "<b>“Afterward the children of Israel shall return, and seek YHWH their God and David their king”</b> (Hosea 3:5), and consequently, the blessing of the kingdom of David follows the blessing of the building of Jerusalem. <b>And once</b> the scion of <b>David comes, </b> the time for <b>prayer will come, as it is stated: “I will bring them to My sacred mountain and make them joyful in My house of prayer”</b> (Isaiah 56:7). Therefore, the blessing of hearing prayer is recited after the blessing of the kingdom of David."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Hosea 4:2",
          "verseText": "flowed and touched the blood of Zechariah to fulfill what is stated: “And blood touches blood”",
          "talmudLocation": "Gittin 57b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/57b#section-1",
          "talmudFullText": "§ With regard to the Babylonian exile following the destruction of the First Temple, <b>R' Ḥiyya bar Avin says</b> that <b>R' Yehoshua ben Korḥa says: An old man from</b> among <b>the inhabitants of Jerusalem related to me: In this valley</b> that lies before you, <b>Nebuzaradan, captain of the guard</b> of the Babylonian king Nebuchadnezzar, <b>killed 2, 110, 000</b> people. <b>And in Jerusalem</b> itself <b>he killed 940, 000</b> people <b>on one stone, until the blood</b> of his victims <b>flowed and touched the blood of Zechariah to fulfill what is stated: “And blood touches blood”</b> (Hosea 4:2)."
        },
        {
          "verseLocation": "Hosea 4:2",
          "verseText": "are worse for the world than the generation of the flood, as it is stated: “Swearing and lying, and killing, and stealing, and committing adultery. They break all bounds, and blood touches blood”",
          "talmudLocation": "Kiddushin 13a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/13a#section-12",
          "talmudFullText": "<b>They then sat and said</b> additional statements in the name of R' Asi. One statement concerned <b>that which Rav Yehuda says</b> that <b>Shmuel says: Anyone who does not know the nature of bills of divorce and betrothals should have no dealings in them, </b> as his ignorance might lead people to commit serious sins. In this context, <b>R' Asi says</b> that <b>R' Yoḥanan says: And</b> those who deal with these issues without proper knowledge <b>are worse for the world than the generation of the flood, as it is stated: “Swearing and lying, and killing, and stealing, and committing adultery. They break all bounds, and blood touches blood”</b> (Hosea 4:2)."
        },
        {
          "verseLocation": "Hosea 4:3",
          "verseText": "“Therefore the land mourns and everyone who dwells there languishes, with the beasts of the field and the fowls of heaven, and the fishes of the sea are also taken away”",
          "talmudLocation": "Kiddushin 13a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/13a#section-14",
          "talmudFullText": "<b>And it is written</b> in the next verse: <b>“Therefore the land mourns and everyone who dwells there languishes, with the beasts of the field and the fowls of heaven, and the fishes of the sea are also taken away”</b> (Hosea 4:3). This indicates that those who cause illegitimate children to be born lead to such a great tragedy that even the fish of the sea will die, <b>whereas in the generation of the flood the decree was not imposed upon the fish in the sea, as it is stated: “Whatever was on dry land died”</b> (Genesis 7:22). The explicit mention of dry land indicates that <b>the fish in the sea did not</b> die. <b>But here, </b> in the punishment described in the verses in Hosea, <b>even the fish in the sea</b> died."
        },
        {
          "verseLocation": "Hosea 4:4",
          "verseText": "since it is stated: “For your people are as those who strive with a priest”",
          "talmudLocation": "Kiddushin 70b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/70b#section-11",
          "talmudFullText": "<b>Rav Yehuda says</b> that <b>Shmuel says: Four hundred slaves, and some say four thousand slaves, were owned by Pashḥur ben Immer, </b> a priest in the time of Jeremiah, <b>and</b> due to their greatness <b>they were assimilated into the priesthood</b> and became known as priests. <b>And any priest who has</b> the trait of <b>insolence is only from them. Abaye said: They all sit in the rows</b> of honor <b>that are in</b> the city of <b>Neharde’a. </b> The Talmud comments: And this statement <b>disagrees with</b> the statement <b>of R' Elazar, as R' Elazar says: If you see an insolent priest, do not speculate about him</b> that he may be of flawed lineage, <b>since it is stated: “For your people are as those who strive with a priest”</b> (Hosea 4:4), which indicates that priests had a reputation for being cantankerous."
        },
        {
          "verseLocation": "Hosea 4:4",
          "verseText": "for your people are like those that strive with the priest”",
          "talmudLocation": "Shabbat 149b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/149b#section-5",
          "talmudFullText": "The Mishnah taught that <b>one may draw lots for</b> the sacrifices but not for the specific portions. This statement is not entirely clear, and the Talmud asks: <b>What</b> is the meaning of the phrase: <b>But not for the</b> specific <b>portions? R' Ya’akov, son of the daughter of Ya’akov, said</b> that it means: <b>But</b> one may <b>not</b> draw lots <b>for the weekday [<i>ḥol</i>] portions on a Festival. </b> The Talmud challenges: This is <b>obvious. </b> The Talmud answers: <b>Lest you say</b> that <b>since</b> the priests are naturally quarrelsome, which the rabbis derive from that which <b>is written: </b> “Yet let no man strive, neither let any man reprove, <b>for your people are like those that strive with the priest”</b> (Hosea 4:4), and in order to maintain peace between them <b>even</b> lotteries for <b>weekday portions</b> were <b>also</b> permitted, therefore, the Mishnah <b>teaches us</b> that this is not the case."
        },
        {
          "verseLocation": "Hosea 4:5",
          "verseText": "a Torah scholar who sinned, he is not disgraced in public, as it is stated: “Therefore, you shall stumble in the day, and the prophet also shall stumble with you in the night”",
          "talmudLocation": "Menachot 99b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/menachot/99b#section-2",
          "talmudFullText": "<b>And Reish Lakish says: </b> With regard to <b>a Torah scholar who sinned, he is not disgraced in public, as it is stated: “Therefore, you shall stumble in the day, and the prophet also shall stumble with you in the night”</b> (Hosea 4:5). One can derive from the verse that if a prophet or any other Torah scholar stumbles and sins, one <b>should conceal</b> his offense <b>like the night</b> and not punish him in public."
        },
        {
          "verseLocation": "Hosea 4:5",
          "verseText": "in public, as it is stated: “Therefore, shall you fall in the day, and the prophet also shall fall with you in the night”",
          "talmudLocation": "Moed Katan 17a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/moed%20katan/17a#section-18",
          "talmudFullText": "The Talmud comments: This opinion <b>disagrees with</b> that of <b>Reish Lakish, </b> for <b>Reish Lakish said: </b> If <b>a Torah scholar sins, he is not ostracized</b> at all <b>in public, as it is stated: “Therefore, shall you fall in the day, and the prophet also shall fall with you in the night”</b> (Hosea 4:5). This is explained to mean: If a prophet or any other important person sins, his offense <b>should be concealed like the night</b> and not punished in public."
        },
        {
          "verseLocation": "Hosea 4:6",
          "verseText": "Torah, as it is stated: “My people are destroyed for lack of knowledge”",
          "talmudLocation": "Sotah 49a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/49a#section-4",
          "talmudFullText": "<b>And R' Ile’a bar Yeverekhya says: </b> If there are <b>two Torah scholars who reside in the same city and they are not pleasant to each other with regard to <i>halakha</i>, </b> but are constantly fighting, <b>one</b> of them will <b>die and</b> the other <b>one</b> will be <b>exiled. As</b> it <b>is stated: “That the manslayer might flee there, who slays his neighbor without knowledge”</b> (Deuteronomy 4:42), <b>and “knowledge”</b> means <b>nothing other</b> than <b>Torah, as it is stated: “My people are destroyed for lack of knowledge”</b> (Hosea 4:6)."
        },
        {
          "verseLocation": "Hosea 4:6",
          "verseText": "causes exile for his children, as it is stated: “Because you have forgotten the Torah of your God, I will also forget your children”",
          "talmudLocation": "Yoma 38b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/38b#section-12",
          "talmudFullText": "<b>R' Elazar</b> further <b>said: One who causes himself to forget a matter of his studies</b> ultimately <b>causes exile for his children, as it is stated: “Because you have forgotten the Torah of your God, I will also forget your children”</b> (Hosea 4:6). <b>R' Abbahu said: </b> With regard to he who causes his studies to be forgotten, <b>one reduces him from his prominence, as it is stated: “Because you have rejected knowledge, I will also reject you; you shall not serve Me”</b> (Hosea 4:6)."
        },
        {
          "verseLocation": "Hosea 4:10",
          "verseText": "Rabbi Yehuda? As it is written: “And they shall eat, and not have enough, they shall commit harlotry, and shall not increase”",
          "talmudLocation": "Yevamot 61b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/61b#section-2",
          "talmudFullText": "<b>Rav Huna said: What is the reason</b> for the opinion of <b>R' Yehuda? As it is written: “And they shall eat, and not have enough, they shall commit harlotry, and shall not increase”</b> (Hosea 4:10). He expounds the verse as follows: <b>Any sex that does not</b> have the possibility to <b>increase</b> the population because the woman is incapable of having children, <b>is nothing other</b> than <b>licentious sex. </b>"
        },
        {
          "verseLocation": "Hosea 4:11",
          "verseText": "and it is written: “Harlotry, wine, and new wine take away the heart”",
          "talmudLocation": "Gittin 68a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/68a#section-11",
          "talmudFullText": "<b>When</b> Ashmedai <b>came he checked his seal, opened</b> the pit, and <b>found it</b> to be filled with <b>wine. He said</b> that <b>it is written: “Wine is a mocker, strong drink is riotous; and whosoever wallows in it is not wise”</b> (Proverbs 20:1), <b>and it is written: “Harlotry, wine, and new wine take away the heart”</b> (Hosea 4:11). He concluded: <b>I will not drink</b> this wine. Eventually, <b>when he became thirsty, he was unable to</b> resist the wine and <b>he drank, became intoxicated, and fell asleep. </b>"
        },
        {
          "verseLocation": "Hosea 4:11",
          "verseText": "But it is written: “Harlotry, and wine, and tirosh take away the heart”",
          "talmudLocation": "Yoma 76b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/76b#section-5",
          "talmudFullText": "The Talmud objects: <b>But it is written: “Harlotry, and wine, and <i>tirosh</i> take away the heart”</b> (Hosea 4:11). Since <i>tirosh</i> leads the heart astray, it is clear that it is wine. Therefore, the Talmud accepts that <i>tirosh</i> means wine. <b>Rather, according to everyone, </b> the word <b><i>tirosh</i></b> in the Bible refers to <b>wine, but vows follow colloquial language. </b> During the time of the Mishnah, <i>tirosh</i> meant sweet fruits; the term included grapes but not wine. When dealing with vows, the intention of the speaker is what must be determined, but no inference can be drawn from colloquial language to the biblical definition of the word."
        },
        {
          "verseLocation": "Hosea 4:12",
          "verseText": "read the verse: “My nation ask counsel of their stock, and its staff [ maklo ] tells to them”",
          "talmudLocation": "Pesachim 52b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/52b#section-8",
          "talmudFullText": "<b>Rav Safra said: Take that principle of Rav Huna in your hand, </b> i.e., rely on it, <b>as he is scrupulous and he learned the <i>halakha</i> well from the mouth of its originator, as</b> the Sage <b>Raḥava</b> from the city of <b>Pumbedita</b> would do. Raḥava was famous for the precision with which he would transmit material that he learned from his teacher. The Talmud cites an example: <b>Raḥava said</b> that <b>Rav Yehuda said: The Temple Mount was a double colonnade [<i>stav</i>], </b> as there was <b>a colonnade within a colonnade</b> there. Here Raḥava used his teacher’s language in describing the structure of the Temple and the rows of columns. He did not employ the common term used for a colonnade, <i>itztaba</i>, but rather <i>stav</i>, using the language he heard from his teacher. With regard to the case where Rav Safra relied on Rav Huna’s opinion and was lenient, <b>Rav Yosef</b> mockingly <b>read the verse: “My nation ask counsel of their stock, and its staff [<i>maklo</i>] tells to them”</b> (Hosea 4:12) and interpreted it homiletically <b>with regard to</b> Rav Safra: <b>Anyone who is lenient [<i>mekel</i>] tells him</b> the <i>halakha</i>. He listens to the opinion of only the Sage who rules leniently."
        },
        {
          "verseLocation": "Hosea 4:12",
          "verseText": "to err”",
          "talmudLocation": "Sukkah 52b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52b#section-4",
          "talmudFullText": "<b>Rav Huna raised a contradiction</b> between two verses. <b>It is written: “For the spirit of harlotry caused</b> them <b>to err”</b> (Hosea 4:12), indicating that this spirit was a temporary phenomenon and not an integral part of their persona. <b>And it is</b> also <b>written: </b> “For the spirit of harlotry <b>is within them”</b> (Hosea 5:4), indicating that it is an integral part of their persona. The Talmud explains: <b>Initially, it causes them to err</b> from without, <b>and ultimately, </b> it is from <b>within them. </b>"
        },
        {
          "verseLocation": "Hosea 4:14",
          "verseText": "is stated: “I will not punish your daughters when they commit harlotry, nor your daughters-in-law when they commit adultery; for they",
          "talmudLocation": "Sotah 47a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47a#section-19",
          "talmudFullText": "The Mishnah teaches a similar occurrence: <b>From</b> the time <b>when adulterers proliferated, </b> the performance of the ritual of <b>the bitter waters was nullified; </b> they would not administer the bitter waters to the <i>sota</i>. <b>And</b> it was <b>R' Yoḥanan ben Zakkai</b> who <b>nullified it, as</b> it <b>is stated: “I will not punish your daughters when they commit harlotry, nor your daughters-in-law when they commit adultery; for they</b> consort with lewd women” (Hosea 4:14), meaning that when the husbands are adulterers, the wives are not punished for their own adultery."
        },
        {
          "verseLocation": "Hosea 4:14",
          "verseText": "And it states: “I will not punish your daughters when they commit harlotry,",
          "talmudLocation": "Sotah 47b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/47b#section-13",
          "talmudFullText": "The Mishnah also taught that <b>from</b> the time <b>when adulterers proliferated, </b> the performance of the ritual of the bitter water of a <i>sota</i> was nullified. <b>A baraita states: </b> It states: <b>“And the man shall be cleared of transgression, </b> and that woman shall bear her transgression” (Numbers 5:31), which indicates that <b>when the man is clear of transgression the waters evaluate</b> if <b>his wife</b> was unfaithful, but <b>if the man is not clear of transgression the waters do not evaluate</b> if <b>his wife</b> was unfaithful. <b>And it states: “I will not punish your daughters when they commit harlotry, </b> nor your daughters-in-law when they commit adultery; for they consort with lewd women, and they sacrifice with prostitutes; and the people that is without understanding is distraught” (Hosea 4:14)."
        }
      ]
    },
    {
      "chapterNumber": 5,
      "citations": [
        {
          "verseLocation": "Hosea 5:2",
          "verseText": "which is written: “And the apostates are deep in slaughter and I am rejected by them all”",
          "talmudLocation": "Sanhedrin 102a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102a#section-3",
          "talmudFullText": "The Talmud continues its discussion of Jeroboam. With regard to that <b>which is written: “And the apostates are deep in slaughter and I am rejected by them all”</b> (Hosea 5:2), <b>R' Yoḥanan says</b> that <b>God says: They</b> issued decrees that are <b>more profound</b> and more extreme <b>than my own. I said: Anyone who does not ascend</b> to Jerusalem <b>for the pilgrimage Festival violates a positive mitzva, and they said: Anyone who ascends</b> to Jerusalem <b>for the pilgrimage Festival will be stabbed with the sword. </b> In that way, Jeroboam successfully prevented the residents of the kingdom of Israel from ascending to Jerusalem."
        },
        {
          "verseLocation": "Hosea 5:4",
          "verseText": "is within them”",
          "talmudLocation": "Sukkah 52b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52b#section-4",
          "talmudFullText": "<b>Rav Huna raised a contradiction</b> between two verses. <b>It is written: “For the spirit of harlotry caused</b> them <b>to err”</b> (Hosea 4:12), indicating that this spirit was a temporary phenomenon and not an integral part of their persona. <b>And it is</b> also <b>written: </b> “For the spirit of harlotry <b>is within them”</b> (Hosea 5:4), indicating that it is an integral part of their persona. The Talmud explains: <b>Initially, it causes them to err</b> from without, <b>and ultimately, </b> it is from <b>within them. </b>"
        },
        {
          "verseLocation": "Hosea 5:7",
          "verseText": "inappropriately, as it is stated: “They have dealt treacherously against the Lord, for they have begotten strange children;",
          "talmudLocation": "Kiddushin 70a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/kiddushin/70a#section-8",
          "talmudFullText": "<b>Rabba bar Rav Adda says</b> that <b>Rav says: </b> In the case of <b>anyone who marries a woman</b> of flawed lineage only <b>for the sake of money, he will have offspring</b> who will act <b>inappropriately, as it is stated: “They have dealt treacherously against YHWH, for they have begotten strange children; </b> now shall the new moon devour them with their portions” (Hosea 5:7)."
        },
        {
          "verseLocation": "Hosea 5:7",
          "verseText": "as it is stated: “They have dealt treacherously against the Lord, for they have begotten strange children”",
          "talmudLocation": "Yevamot 17a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/17a#section-4",
          "talmudFullText": "<b>There are</b> those <b>who say</b> that Rav Yehuda actually related the following: <b>When I said this</b> <i>halakha</i> <b>before Shmuel, he said to me: They did not move from there, </b> the place where they deliberated on this matter, <b>until they rendered</b> all of <b>them, </b> including those who intermingled with the ten tribes in different locations, <b>full-fledged non-Jews. </b> Consequently, there is no concern that their betrothals might be of any effect, <b>as it is stated: “They have dealt treacherously against YHWH, for they have begotten strange children”</b> (Hosea 5:7)."
        },
        {
          "verseLocation": "Hosea 5:8",
          "verseText": "“Blow you the horn [ shofar ] in Giva”",
          "talmudLocation": "Berakhot 56b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/56b#section-11",
          "talmudFullText": "<b>One who sees a <i>shofar</i> in a dream</b> should <b>rise early and recite: “And it shall come to pass in that day, that a great <i>shofar</i> shall be sounded; </b> and they shall come that were lost in the land of Assyria, and they that were dispersed in the land of Egypt” (Isaiah 27:13), <b>before a different verse, </b> in which the <i>shofar</i> is a symbol of war, <b>can precede it</b> in becoming reality: <b>“Blow you the horn [<i>shofar</i>] in Giva”</b> (Hosea 5:8)."
        },
        {
          "verseLocation": "Hosea 5:8",
          "verseText": "for example: “Sound the shofar in Giva,",
          "talmudLocation": "Rosh Hashanah 32b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/32b#section-2",
          "talmudFullText": "Similarly, verses of <b>remembrance</b> that speak of a punishment may not be used in Rosh HaShana prayers, <b>for example: “So He remembered that they were but flesh, </b> a wind that passes away, and does not come again” (Psalms 78:39). Nor verses of <b><i>shofar</i>, </b> which refer to calamity, <b>for example: “Sound the <i>shofar</i> in Giva, </b> and the trumpet in Rama; sound an alarm at Beit Aven, behind you, O Benjamin” (Hosea 5:8)."
        },
        {
          "verseLocation": "Hosea 5:11",
          "verseText": "“Ephraim is oppressed, crushed in justice, because he willingly went after filth [ tzav ]”",
          "talmudLocation": "Sanhedrin 56b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/56b#section-10",
          "talmudFullText": "<b>Rav Ḥisda and Rav Yitzḥak bar Avdimi</b> both give answers to this question. <b>One</b> of them <b>says</b> that it is inferred from the verse: <b>“They have turned aside quickly out of the way that I commanded them; they have made them</b> a molten calf” (Exodus 32:8). The word “commanded” is mentioned here in the context of idol worship. <b>And</b> the other <b>one says</b> that it is inferred from the verse: <b>“Ephraim is oppressed, crushed in justice, because he willingly went after filth [<i>tzav</i>]”</b> (Hosea 5:11). The word <i>tzav</i>, used in this context in reference to idol worship, is the same Hebrew word used in the phrase: “And…commanded [<i>vaytzav</i>]. ”"
        },
        {
          "verseLocation": "Hosea 5:13",
          "verseText": "as it is stated: “And Ephraim saw his sickness and Judah his wound [ mezoro ]”",
          "talmudLocation": "Sanhedrin 92a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92a#section-13",
          "talmudFullText": "<b>And R' Elazar says: </b> With regard to <b>anyone who gives his bread to one without knowledge, afflictions befall him, as it is stated: “They who eat your bread will place <i>mazor</i> under you, in whom there is no discernment”</b> (Obadiah 1:7). <b>And <i>mazor</i></b> means <b>nothing other than afflictions, </b> based on the parallel with another verse, <b>as it is stated: “And Ephraim saw his sickness and Judah his wound [<i>mezoro</i>]”</b> (Hosea 5:13). This indicates that one who gives his bread to one without discernment will ultimately fall ill."
        },
        {
          "verseLocation": "Hosea 5:15",
          "verseText": "as it is stated: “I will go and return to My place”",
          "talmudLocation": "Rosh Hashanah 31a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/31a#section-14",
          "talmudFullText": "The Talmud elaborates. <b>The Shekhina traveled ten journeys, </b> as derived <b>from verses. </b> The ten journeys are: <b>From the Ark cover to the cherub; and from</b> one <b>cherub to</b> the other <b>cherub; and from</b> the second <b>cherub to the threshold</b> of the Sanctuary; <b>and from the threshold to the courtyard; and from the courtyard to the altar; and from the altar to the roof; and from the roof to the wall</b> of the Temple Mount; <b>and from the wall to the city; and from the city to a mountain</b> close to Jerusalem; <b>and from</b> that <b>mountain to the wilderness; and from the wilderness it ascended and rested in its place</b> in Heaven, isolated from humanity, <b>as it is stated: “I will go and return to My place”</b> (Hosea 5:15)."
        },
        {
          "verseLocation": "Hosea 5:15",
          "verseText": "as it is written: “I will go and return to My place",
          "talmudLocation": "Rosh Hashanah 31a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/31a#section-17",
          "talmudFullText": "<b>And from the city</b> the Shekhina arose <b>to the mountain</b> nearest the Sanctuary, i.e., the Mount of Olives, <b>as it is written: “And the glory of YHWH went up from the midst of the city, and stood upon the mountain, which is on the east side of the city”</b> (Ezekiel 11:23). <b>And from the mountain to the wilderness, as it is written: “It is better to live in the wilderness</b> than with a contentious and fretful woman” (Proverbs 21:19). <b>And from the wilderness it ascended and rested in its place</b> in Heaven, <b>as it is written: “I will go and return to My place</b> until they acknowledge their guilt” (Hosea 5:15)."
        }
      ]
    },
    {
      "chapterNumber": 6,
      "citations": [
        {
          "verseLocation": "Hosea 6:2",
          "verseText": "as it is stated: “After two days He will revive us”",
          "talmudLocation": "Rosh Hashanah 31a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/31a#section-8",
          "talmudFullText": "The Talmud comments: <b>And</b> these <i>tanna’im</i> <b>disagree with</b> regard to a statement <b>of Rav Ketina, as Rav Ketina said: The world will exist for six thousand years, and</b> for <b>one</b> thousand years it will be <b>destroyed, as it is stated: “And YHWH alone shall be exalted on that day”</b> (Isaiah 2:11), and one day for God is a thousand years, as indicated in the verse: “For a thousand years in Your sight are but as yesterday when it is past” (Psalms 90:4). Rav Ketina’s statement is in accordance with the opinion of R' Akiva. Conversely, <b>Abaye said: </b> The world will be <b>destroyed</b> for <b>two</b> thousand years, <b>as it is stated: “After two days He will revive us”</b> (Hosea 6:2). According to the opinion of Abaye that the destruction will be for two days, there is no connection between the future world and the day of Shabbat, which is only one day."
        },
        {
          "verseLocation": "Hosea 6:2",
          "verseText": "as it is stated: “After two days He will revive us; in the third day He will revive us, and we shall live in His presence”",
          "talmudLocation": "Sanhedrin 97a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/97a#section-12",
          "talmudFullText": "§ <b>Rav Ketina says: Six thousand years is</b> the duration of <b>the world, </b> and <b>it is in ruins</b> for <b>one</b> thousand years. The duration of the period during which the world is in ruins is derived from a verse, <b>as it is stated: “And YHWH alone shall be exalted on that day”</b> (Isaiah 2:11), and the day of God lasts one thousand years. <b>Abaye says: It is in ruins</b> for <b>two</b> thousand years, <b>as it is stated: “After two days He will revive us; in the 3rd day He will revive us, and we shall live in His presence”</b> (Hosea 6:2)."
        },
        {
          "verseLocation": "Hosea 6:3",
          "verseText": "eagerly strive to know the Lord”",
          "talmudLocation": "Berakhot 6b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/6b#section-9",
          "talmudFullText": "<b>R' Ḥelbo said</b> that <b>Rav Huna said: One who leaves the synagogue should not take large strides</b> because it creates the impression that he is eager to leave. <b>Abaye</b> explained Rav Huna’s statement and <b>said: </b> This <i>halakha</i> <b>was only said</b> with regard <b>to leaving</b> the synagogue, where large strides seem particularly disrespectful. <b>However, </b> with regard <b>to entering</b> a synagogue, <b>it is a mitzva to run</b> and one is permitted to rush and take large strides (R' Yoshiyahu Pinto). <b>As it is said: </b> “And let us know, <b>eagerly strive to know YHWH”</b> (Hosea 6:3). One who eagerly enters a synagogue displays his enthusiasm to follow the path of God."
        },
        {
          "verseLocation": "Hosea 6:3",
          "verseText": "the Holy One, Blessed be He, responded reasonably, as it is stated: “And let us know, eagerly strive to know the Lord. His going forth is sure as the morning, and He will come to us as the rain”",
          "talmudLocation": "Taanit 4a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/4a#section-11",
          "talmudFullText": "§ In light of the above statement, the Talmud returns to the issue of rain. <b>R' Berekhya said: The Congregation of Israel also entreated</b> God <b>unreasonably, and</b> yet <b>God responded reasonably, as it is stated: “And let us know, eagerly strive to know YHWH. His going forth is sure as the morning, and He will come to us as the rain”</b> (Hosea 6:3). They compared the revelation of God to the rain."
        },
        {
          "verseLocation": "Hosea 6:4",
          "verseText": "have no substance, as it is written: “For your goodness is as a morning cloud,",
          "talmudLocation": "Berakhot 59a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/59a#section-11",
          "talmudFullText": "<b>R' Shmuel bar Yitzḥak said: Morning clouds</b> dissipate immediately so they <b>have no substance, as it is written: “For your goodness is as a morning cloud, </b> and as the dew that early passes away” (Hosea 6:4). With regard to this, <b>Rav Pappa said to Abaye: But</b> don’t <b>people say</b> the maxim: <b>If there is rain when people open their doors</b> in the morning, <b>donkey-driver, fold your sack and go to sleep, </b> as rain will continue to fall all day. Apparently morning clouds indicate that there will be rain all day. The Talmud responds: This is <b>not difficult, </b> as <b>this, </b> that suggests that there will be considerable rain, refers to a case where the sky is <b>covered with thick clouds, </b> while <b>this</b> opinion, where R' Shmuel bar Yitzḥak said that morning clouds have no substance and will not produce much rain, refers to a case where the sky is <b>covered with flimsy clouds</b> which will certainly pass."
        },
        {
          "verseLocation": "Hosea 6:4",
          "verseText": "As it is written: “What can I do for you, Ephraim, what can I do for you, Judah, for your goodness is like a morning cloud”",
          "talmudLocation": "Taanit 6b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/6b#section-10",
          "talmudFullText": "<b>Abaye said: We said</b> this <b>only</b> if the rain fell during the day, <b>prior to</b> the recitation of <b>“and He will close up” of the evening</b> <i>Shema</i>. <b>However, </b> if a small amount of rain falls <b>prior to</b> the recitation of <b>“and He will close up” of the morning</b> <i>Shema</i>, <b>this</b> rain could still <b>constitute</b> an expression of <b>“and He will close up. ” As Rav Yehuda bar Yitzḥak said: These morning clouds have no substance; </b> they generally yield minimal or no rain. <b>As it is written: “What can I do for you, Ephraim, what can I do for you, Judah, for your goodness is like a morning cloud”</b> (Hosea 6:4). This verse indicates that morning clouds contain little benefit."
        },
        {
          "verseLocation": "Hosea 6:5",
          "verseText": "which is written: “Therefore I have hewn by the prophets, I have slain them by the words of My mouth”",
          "talmudLocation": "Taanit 5b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/5b#section-7",
          "talmudFullText": "The Talmud asks: <b>And is</b> one <b>man set aside before</b> another <b>man? </b> In other words, is Samuel’s life set aside simply because the time for David’s reign has arrived? The Talmud answers: <b>Yes, as R' Shmuel bar Naḥmani said</b> that <b>R' Yoḥanan said: What is</b> the meaning of that <b>which is written: “Therefore I have hewn by the prophets, I have slain them by the words of My mouth”</b> (Hosea 6:5)? It <b>is not stated: By their deeds, but</b> rather: <b>“By the words of My mouth, ”</b> i.e., God sometimes ends the life of an individual simply by virtue of His decree. <b>Apparently, </b> one <b>man is</b> indeed <b>set aside before</b> another <b>man. </b>"
        },
        {
          "verseLocation": "Hosea 6:7",
          "verseText": "is written here: “And they like men [ adam ] have transgressed the covenant”",
          "talmudLocation": "Sanhedrin 38b:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/38b#section-11",
          "talmudFullText": "<b>And Rav Yehuda says</b> that <b>Rav says: Adam the first</b> man <b>was a heretic, as it is stated: “And YHWH called to the man and said to him: Where are you”? </b> (Genesis 3:9), meaning, to <b>where has your heart turned, </b> indicating that Adam turned from the path of truth. <b>R' Yitzḥak says: He was</b> one who <b>drew his foreskin</b> forward, so as to remove any indication that he was circumcised. It <b>is written here: “And they like men [<i>adam</i>] have transgressed the covenant”</b> (Hosea 6:7), <b>and</b> it <b>is written there: </b> “And the uncircumcised male who is not circumcised in the flesh of his foreskin, that soul shall be cut off from his people; <b>he has broken My covenant”</b> (Genesis 17:14)."
        },
        {
          "verseLocation": "Hosea 6:8",
          "verseText": "as it is written: “Gilead is a city of those who work iniquity; it is covered [ akuba ] with blood”",
          "talmudLocation": "Makkot 10a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/10a#section-1",
          "talmudFullText": "Therefore, a greater number of cities of refuge per capita were required there, <b>as it is written: “Gilead is a city of those who work iniquity; it is covered [<i>akuba</i>] with blood”</b> (Hosea 6:8). <b>What</b> is the meaning of: <b>Covered [<i>akuba</i>] with blood? R' Elazar says: </b> It means <b>that they would set an ambush [<i>okevin</i>] to kill people. </b>"
        },
        {
          "verseLocation": "Hosea 6:9",
          "verseText": "Abaye said: Murderers are also common in Shechem, as it is written: “And as troops of robbers wait for a man, so does the band of priests; they murder in the way toward Shechem,",
          "talmudLocation": "Makkot 10a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/10a#section-3",
          "talmudFullText": "<b>Abaye said: Murderers are also common in Shechem, as it is written: “And as troops of robbers wait for a man, so does the band of priests; they murder in the way toward Shechem, </b> yes, they commit enormity” (Hosea 6:9). <b>What</b> is the meaning of <b>“the band of priests”? R' Elazar says: </b> It means <b>that</b> the people <b>would band together to kill people, like those priests who band together to distribute <i>teruma</i></b> among themselves <b>in the granaries. </b>"
        },
        {
          "verseLocation": "Hosea 6:11",
          "verseText": "from here: “Also, O Judah, there is a harvest appointed for you, when I would return the captivity of My people”",
          "talmudLocation": "Arakhin 33a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/arakhin/33a#section-7",
          "talmudFullText": "<b>Now, what connection does Josiah, </b> king of Judah, <b>have with the altar at Bethel, </b> a city in the kingdom of Israel? <b>Rather, </b> this indicates that <b>when Jeremiah brought back</b> the ten tribes, <b>Josiah ruled over them. Rav Naḥman bar Yitzḥak said: </b> The fact that the tribes returned may be derived <b>from here: “Also, O Judah, there is a harvest appointed for you, when I would return the captivity of My people”</b> (Hosea 6:11). That is, when the ten tribes will return from their captivity, a king of Judah will rule over them."
        },
        {
          "verseLocation": "Hosea 6:11",
          "verseText": "here: “Also, O Judah, there is a harvest appointed for you, when I would return the captivity of My people”",
          "talmudLocation": "Megillah 14b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/14b#section-8",
          "talmudFullText": "<b>And Josiah the son of Amon ruled over the</b> ten tribes, <b>as it is written: “Then he said: What monument is that which I see? And the men of the city told him, It is the tomb of the man of God who came from Judah and proclaimed these things that you have done against the altar of Bethel”</b> (II Kings 23:17). <b>Now what connection did Josiah, </b> king of Judea, <b>have with the altar at Bethel, </b> a city in the kingdom of Israel? <b>Rather, this teaches that Josiah ruled over the</b> ten tribes of Israel. <b>Rav Naḥman said: </b> Proof that the tribes returned may be adduced <b>from</b> the verse <b>here: “Also, O Judah, there is a harvest appointed for you, when I would return the captivity of My people”</b> (Hosea 6:11), which indicates that they returned to their places."
        }
      ]
    },
    {
      "chapterNumber": 7,
      "citations": [
        {
          "verseLocation": "Hosea 7:1",
          "verseText": "created a remedy for them beforehand, as it is stated: “When I would have healed Israel, then the iniquity of Ephraim was uncovered”",
          "talmudLocation": "Megillah 13b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/13b#section-13",
          "talmudFullText": "Rava explains: <b>As Reish Lakish said: God does not strike at the Jewish people unless He has</b> already <b>created a remedy for them beforehand, as it is stated: “When I would have healed Israel, then the iniquity of Ephraim was uncovered”</b> (Hosea 7:1). <b>But</b> this is <b>not so</b> with regard to <b>the nations of the world. </b> With them, God first <b>strikes them and</b> only <b>afterward does He create a remedy, as it is stated: “And YHWH shall smite Egypt, smiting and healing”</b> (Isaiah 19:22)."
        },
        {
          "verseLocation": "Hosea 7:5",
          "verseText": "anyone who scoffs, his sustenance is lessened, as it is stated: “He stretches out his hand with scorners”",
          "talmudLocation": "Avodah Zarah 18b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/18b#section-14",
          "talmudFullText": "<b>Rav Ketina says: </b> Concerning <b>anyone who scoffs, his sustenance is lessened, as it is stated: “He stretches out his hand with scorners”</b> (Hosea 7:5), meaning that God withdraws His providence from scoffers and does not provide for them. <b>R' Shimon ben Lakish says: Anyone who scoffs falls into Gehenna, as it is stated: “A proud and haughty man, scorner is his name, he acts in arrogant wrath”</b> (Proverbs 21:24). <b>And wrath</b> means <b>nothing other than Gehenna, as it is stated</b> with regard to the Day of Judgment: <b>“That day is a day of wrath”</b> (Zephaniah 1:15)."
        },
        {
          "verseLocation": "Hosea 7:5",
          "verseText": "the group of cynics, as it is written: “He withdrew His hand with cynics”",
          "talmudLocation": "Sanhedrin 103a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/103a#section-12",
          "talmudFullText": "Apropos the previous statement, the Talmud cites an additional statement. <b>And Rav Ḥisda says</b> that <b>R' Yirmeya bar Abba says</b> that <b>four groups do not receive the Shekhina: </b> This pertains to <b>the group of cynics, the group of liars, the group of flatterers, </b> and <b>the group of slanderers. </b> This pertains to <b>the group of cynics, as it is written: “He withdrew His hand with cynics”</b> (Hosea 7:5), indicating that God distanced Himself from them. This pertains to <b>the group of liars, as it is written: “He that speaks falsehoods shall not be established before My eyes”</b> (Psalms 101:7). This pertains to <b>the group of flatterers, as it is written: “That a flatterer shall not come before Him”</b> (Job 13:16). This pertains to <b>the group of slanderers, as it is stated: “For You are not a God who desires wickedness; evil shall not dwell with You”</b> (Psalms 5:5), which means: <b>You are righteous, and there will be no</b> form of <b>evil in Your dwelling. </b>"
        },
        {
          "verseLocation": "Hosea 7:5",
          "verseText": "The class of cynics, as it is written: “He draws His hand from cynics”",
          "talmudLocation": "Sotah 42a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42a#section-5",
          "talmudFullText": "The proof for this statement is as follows: <b>The class of cynics, as it is written: “He draws His hand from cynics”</b> (Hosea 7:5), i.e., God does not want to be in their presence; <b>the class of flatterers, as it is written: “That a flatterer cannot come before Him”</b> (Job 13:16); <b>the class of liars, as it is written: “He who speaks falsehood shall not dwell before My eyes”</b> (Psalms 101:7)."
        },
        {
          "verseLocation": "Hosea 7:13",
          "verseText": "which is written: “And though I will redeem them, they have spoken lies against Me”",
          "talmudLocation": "Avodah Zarah 4a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-9",
          "talmudFullText": "<b>And this is</b> the same as that <b>which R' Abba says: What</b> is the meaning of that <b>which is written: “And though I will redeem them, they have spoken lies against Me”</b> (Hosea 7:13)? <b>I said</b> that <b>I would redeem them through</b> taking away <b>their money in this world so that they should merit the World-to-Come, but they have spoken lies against Me, </b> by saying that I am angry and uninterested in them."
        },
        {
          "verseLocation": "Hosea 7:15",
          "verseText": "which is written: “Though I have trained [ yissarti ] and strengthened their arms, yet they consider evil against Me”",
          "talmudLocation": "Avodah Zarah 4a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-10",
          "talmudFullText": "<b>And this is</b> the same as that <b>which Rav Pappi says in the name of Rava: What</b> is the meaning of that <b>which is written: “Though I have trained [<i>yissarti</i>] and strengthened their arms, yet they consider evil against Me”</b> (Hosea 7:15)? <b>God says: I said</b> that <b>I would visit them [<i>ayasserem</i>] with afflictions in this world</b> for their benefit, <b>so that their arms would be strengthened in the World-to-Come, but they consider</b> that which <b>I</b> have done as <b>evil. </b>"
        }
      ]
    },
    {
      "chapterNumber": 8,
      "citations": [
        {
          "verseLocation": "Hosea 8:10",
          "verseText": "the Prophets, as it is written: “Though they have hired lovers [ yitnu ] among the nations, now I will gather them, and they will begin to be diminished by reason of the burden of kings and princes”",
          "talmudLocation": "Bava Batra 8a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/8a#section-4",
          "talmudFullText": "And you have transgressed the words of <b>the Prophets, as it is written: “Though they have hired lovers [<i>yitnu</i>] among the nations, now I will gather them, and they will begin to be diminished by reason of the burden of kings and princes”</b> (Hosea 8:10). With regard to this verse, <b>Ulla says: </b> Part of <b>this verse is stated in the Aramaic language; </b> the word <i>yitnu</i> should be understood here in its Aramaic sense: To learn. And the verse should be interpreted as follows: <b>If all</b> of Israel <b>learns</b> Torah, <b>I will gather them</b> already <b>now; and if</b> only <b>a few of them</b> learn Torah, <b>they will be excused from the burden</b> imposed <b>by kings and princes. </b> This indicates that those who study Torah should not be subject to paying taxes."
        },
        {
          "verseLocation": "Hosea 8:12",
          "verseText": "orally, as it is stated: “I wrote for him the greater part of My Torah; they were reckoned a strange thing”",
          "talmudLocation": "Gittin 60b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/60b#section-2",
          "talmudFullText": "§ The Talmud continues its discussion concerning the writing of the Torah: <b>R' Elazar says: The majority of the Torah</b> was transmitted <b>in writing, while the minority</b> was transmitted <b>orally, as it is stated: “I wrote for him the greater part of My Torah; they were reckoned a strange thing”</b> (Hosea 8:12), meaning that the majority of the Torah was transmitted in written form. <b>And R' Yoḥanan says: The majority</b> of the Torah was transmitted <b>orally [<i>al peh</i>], while the minority</b> was transmitted <b>in writing, as it is stated</b> with regard to the giving of the Torah to Moses on Mount Sinai: <b>“For on the basis of [<i>al pi</i>] these matters</b> I have made a covenant with you and with Israel” (Exodus 34:27), which indicates that the greater part of the Sinaitic covenant was taught orally."
        }
      ]
    },
    {
      "chapterNumber": 9,
      "citations": [
        {
          "verseLocation": "Hosea 9:1",
          "verseText": "and wrote to them: “Rejoice not, O Israel, to exultation, like the peoples”",
          "talmudLocation": "Gittin 7a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/7a#section-8",
          "talmudFullText": "The Talmud further relates: <b>They sent</b> the following question <b>to Mar Ukva: From where do we</b> derive that <b>song is forbidden</b> in the present, following the destruction of the Temple? <b>He scored</b> parchment <b>and wrote to them: “Rejoice not, O Israel, to exultation, like the peoples”</b> (Hosea 9:1)."
        },
        {
          "verseLocation": "Hosea 9:10",
          "verseText": "like grapes in the wilderness”",
          "talmudLocation": "Berakhot 56b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/56b#section-10",
          "talmudFullText": "Similarly, <b>one who sees grapes in a dream</b> should <b>rise early and recite: </b> “I found Israel <b>like grapes in the wilderness”</b> (Hosea 9:10), <b>before a different verse, </b> with a negative connotation, <b>can precede it</b> in becoming reality: <b>“Their grapes are grapes of gall, </b> their clusters are bitter” (Deuteronomy 32:32). <b>One who sees a mountain in a dream</b> should <b>rise early and recite: “How beautiful upon the mountains are the feet of the messenger</b> of good tidings, that announces peace, the harbinger of good tidings, that announces salvation” (Isaiah 52:7), <b>before a different verse, </b> with a negative connotation, <b>can precede it</b> in becoming reality: <b>“For the mountains will I take up a weeping and wailing”</b> (Jeremiah 9:9)."
        },
        {
          "verseLocation": "Hosea 9:10",
          "verseText": "Moreover, I will not leave you until you deny the Torah of Moses your teacher, as it is stated: “But when they came to Ba’al-Peor they separated themselves to the shameful item; and they became detestable like that which they loved”",
          "talmudLocation": "Sanhedrin 106a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/106a#section-11",
          "talmudFullText": "<b>He</b> then <b>said to her: Submit to me</b> and have sex with me. <b>She</b> then <b>removed</b> the <b>idol</b> that <b>she worshipped from her lap and said to him: Worship this. He said to her: Am I not Jewish? </b> I am therefore forbidden from engaging in idol worship. <b>She said to him: And what is your concern? We are asking you to do nothing more than defecate</b> in its presence. <b>But he does not know that its worship</b> is conducted <b>in that</b> manner. Once he did so, she said to him: <b>Moreover, I will not leave you until you deny the Torah of Moses your teacher, as it is stated: “But when they came to Ba’al-Peor they separated themselves to the shameful item; and they became detestable like that which they loved”</b> (Hosea 9:10). They devoted themselves to the disgrace of defecation, and detested the name of God."
        }
      ]
    },
    {
      "chapterNumber": 10,
      "citations": [
        {
          "verseLocation": "Hosea 10:5",
          "verseText": "from here: “The inhabitants of Samaria shall be in dread for the calves of Beth-aven; for its people shall mourn over it, and its priests shall tremble for it, for its glory, because it is departed from it”",
          "talmudLocation": "Megillah 25b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/25b#section-17",
          "talmudFullText": "Similarly, <b>Rav Naḥman said: All mockery</b> and obscenity <b>is forbidden except for mockery of idol worship, which is permitted, as it is written: “Bel bows down, Nevo stoops”</b> (Isaiah 46:1). The prophet mocks these idols by describing them as crouching in order to defecate. Additionally, <b>it is written: “They stoop, they bow down together; they could not deliver the burden”</b> (Isaiah 46:2). <b>R' Yannai said: </b> This principle that one is permitted to mock idol worship is derived <b>from here: “The inhabitants of Samaria shall be in dread for the calves of Beth-aven; for its people shall mourn over it, and its priests shall tremble for it, for its glory, because it is departed from it”</b> (Hosea 10:5). <b>Do not read</b> it is as <b>“its glory [<i>kevodo</i>], ” rather</b> read it as <b>its burden [<i>keveido</i>], </b> meaning that it is unable to restrain itself from defecating."
        },
        {
          "verseLocation": "Hosea 10:12",
          "verseText": "as it is stated: “Sow to yourselves according to charitableness, reap according to mercy”",
          "talmudLocation": "Avodah Zarah 5b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/5b#section-3",
          "talmudFullText": "<b>R' Yoḥanan says in the name of R' Bana’a: What</b> is the meaning of that <b>which is written: “Happy are you that sow beside all waters, that send forth freely the feet of the ox and the donkey”</b> (Isaiah 32:20)? <b>Happy are you Israel; when they, </b> i.e., the Jewish people, <b>engage in Torah</b> study <b>and in acts of kindness, their</b> evil <b>inclination is given over to them, and they are not given over to their</b> evil <b>inclination, as it is stated: “Happy are you that sow beside all waters. ” And</b> the term <b>sowing</b> is referring to <b>nothing other than</b> performing <b>charitable</b> deeds, <b>as it is stated: “Sow to yourselves according to charitableness, reap according to mercy”</b> (Hosea 10:12). <b>And</b> the term <b>waters</b> is referring to <b>nothing other than</b> the <b>Torah, as it is stated: “Ho, every one that thirsts, come for water”</b> (Isaiah 55:1)."
        },
        {
          "verseLocation": "Hosea 10:12",
          "verseText": "charity, as it is stated: “Sow for yourselves for charity, reap according to kindness”",
          "talmudLocation": "Bava Kamma 17a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/17a#section-9",
          "talmudFullText": "The Talmud explains how this is derived from the verse: <b>As it is stated: “Happy are you that sow. ” And</b> the reference to <b>sowing</b> refers <b>only</b> to acts of <b>charity, as it is stated: “Sow for yourselves for charity, reap according to kindness”</b> (Hosea 10:12). <b>And</b> the reference to <b>water</b> refers <b>only</b> to the study of <b>Torah, as it is stated</b> with regard to Torah study: <b>“Ho, all who are thirsty, go to water”</b> (Isaiah 55:1)."
        },
        {
          "verseLocation": "Hosea 10:12",
          "verseText": "is forbidden for consumption “until he comes and instructs righteousness to you”",
          "talmudLocation": "Bekhorot 24a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/24a#section-13",
          "talmudFullText": "The Talmud analyzes a similar case. <b>Rabba bar bar Ḥana says</b> that <b>R' Yoḥanan says: </b> If one <b>saw</b> a young animal resembling <b>a pig that</b> was <b>trailing after a ewe, </b> the ewe is <b>exempt from</b> having its future offspring counted <b>a firstborn. And</b> the pig-like animal <b>is forbidden for consumption “until he comes and instructs righteousness to you”</b> (Hosea 10:12), i.e., until Elijah the prophet arrives and determines the <i>halakha</i>."
        },
        {
          "verseLocation": "Hosea 10:12",
          "verseText": "are greater than charity, as it is stated: “Sow to yourselves according to charity, and reap according to kindness”",
          "talmudLocation": "Sukkah 49b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/49b#section-9",
          "talmudFullText": "§ <b>R' Elazar said: One who performs</b> acts of <b>charity is greater than</b> one who sacrifices <b>all</b> types of <b>offerings, as it is stated: “To perform charity and justice is more acceptable to YHWH than an offering”</b> (Proverbs 21:3), including all types of offerings. <b>And R' Elazar said: Acts of kindness, </b> assisting someone in need, <b>are greater than charity, as it is stated: “Sow to yourselves according to charity, and reap according to kindness”</b> (Hosea 10:12). This means: <b>If a person sows, </b> it is <b>uncertain</b> whether <b>he</b> will <b>eat or</b> whether <b>he</b> will <b>not eat, </b> since much can go wrong before the seed becomes food. However, if <b>a person reaps, he certainly eats. </b> In this verse, charity is likened to sowing, while acts of kindness are likened to reaping."
        },
        {
          "verseLocation": "Hosea 10:14",
          "verseText": "volition, as it is written: “A mother was forsaken [ rutasha ] with her sons”",
          "talmudLocation": "Bava Metzia 39a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/39a#section-1",
          "talmudFullText": "The Talmud explains: <b>Abandoned</b> property <b>[<i>netushim</i>]; </b> this is referring to property that the owners vacated <b>perforce. When it is written: “But the 7th year you shall let it rest and lie fallow [<i>untashtah</i>]”</b> (Exodus 23:11), that is <b>expropriation by</b> edict of <b>the King</b> of the Universe. <b>Forsaken</b> property <b>[<i>retushim</i>]; </b> this is referring to property that the owners vacated <b>of their</b> own <b>volition, as it is written: “A mother was forsaken [<i>rutasha</i>] with her sons”</b> (Hosea 10:14), indicating that the mother was left with the sons, as all the men left."
        }
      ]
    },
    {
      "chapterNumber": 11,
      "citations": [
        {
          "verseLocation": "Hosea 11:4",
          "verseText": "as it is written: “I drew them with cords of man, with bands of love, and I was to them as they that take off the yoke on their jaws, and I fed them gently”",
          "talmudLocation": "Shabbat 89b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/89b#section-6",
          "talmudFullText": "And since the Talmud mentioned Jacob’s descent to Egypt, the Talmud cites that which <b>R' Ḥiyya bar Abba said</b> that <b>R' Yoḥanan said: Our father Jacob should have gone down to Egypt in iron chains</b> as would an exile against his will, as decreed by God and related to Abraham. <b>However, his merit caused him</b> to descend without suffering, <b>as it is written: “I drew them with cords of man, with bands of love, and I was to them as they that take off the yoke on their jaws, and I fed them gently”</b> (Hosea 11:4)."
        },
        {
          "verseLocation": "Hosea 11:9",
          "verseText": "as it is stated: “The sacred is in your midst; and I will not come into the city”",
          "talmudLocation": "Taanit 11b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/11b#section-1",
          "talmudFullText": "<b>as though a sacred</b> object <b>is immersed in his bowels, </b> which he may not damage, <b>as it is stated: “The sacred is in your midst; and I will not come into the city”</b> (Hosea 11:9). This statement indicates that it is prohibited to take a fast upon oneself. The Talmud answers: This is <b>not difficult. This</b> first ruling, that one who fasts is sacred, is referring to a case <b>where he is able to distress himself</b> without causing bodily harm. <b>That</b> second ruling, that one may not overly burden his body, deals with a situation <b>when he is unable to distress himself</b> while avoiding all harm, and he proceeds to fast nevertheless."
        },
        {
          "verseLocation": "Hosea 11:9",
          "verseText": "which is written: “It is sacred in your midst, and I will not enter the city”",
          "talmudLocation": "Taanit 5a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/5a#section-11",
          "talmudFullText": "<b>And Rav Naḥman said to R' Yitzḥak: What is</b> the meaning of that <b>which is written: “It is sacred in your midst, and I will not enter the city”</b> (Hosea 11:9)? This verse is puzzling: <b>Because it is sacred in your midst, will</b> God <b>not enter the city? </b> R' Yitzḥak <b>said to</b> Rav Naḥman that <b>R' Yoḥanan said</b> the verse should be understood <b>as follows: God said: I shall not enter Jerusalem above, </b> in heaven, <b>until I enter Jerusalem</b> on earth down <b>below</b> at the time of the redemption, when it will be sacred in your midst."
        },
        {
          "verseLocation": "Hosea 11:10",
          "verseText": "One should always run for a matter of halakha , even on Shabbat, as it is stated: “They shall walk after the Lord, who will roar like a lion”",
          "talmudLocation": "Berakhot 6b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/6b#section-10",
          "talmudFullText": "<b>R' Zeira said: Initially, when I saw the rabbis running to the</b> R'’s <b>lecture on Shabbat, I said: These rabbis are desecrating Shabbat. </b> One is prohibited from running on Shabbat in deference to the sanctity of the day. <b>Once I heard that which R' Tanḥum said</b> that <b>R' Yehoshua ben Levi</b> said: <b>One should always run for a matter of <i>halakha</i>, even on Shabbat, as it is stated: “They shall walk after YHWH, who will roar like a lion”</b> (Hosea 11:10). In other words, one should rush as though he were chased by a lion (<i>Birkat Hashem</i>), <b>I too run. </b>"
        }
      ]
    },
    {
      "chapterNumber": 12,
      "citations": [
        {
          "verseLocation": "Hosea 12:1",
          "verseText": "as it is stated: “Ephraim surrounds Me with lies and the house of Israel with deceit, and Judah is yet wayward toward God [ rad im El ]”",
          "talmudLocation": "Sotah 37a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/37a#section-3",
          "talmudFullText": "<b>R' Yehuda said</b> to R' Meir: <b>That is not how the incident</b> took place. <b>Rather, this tribe said: I am not going into the sea first, and that</b> tribe <b>said: I am not going into the sea first. </b> Then, in <b>jumped</b> the prince of Judah, <b>Nahshon ben Amminadab, and descended into the sea first, </b> accompanied by his entire tribe, <b>as it is stated: “Ephraim surrounds Me with lies and the house of Israel with deceit, and Judah is yet wayward toward God [<i>rad im El</i>]”</b> (Hosea 12:1), which is interpreted homiletically as: And Judah descended [<i>rad</i>] with God [<i>im El</i>]."
        },
        {
          "verseLocation": "Hosea 12:5",
          "verseText": "“So he strove [ vayyasar ] with an angel, and prevailed; he wept, and made supplication to him;",
          "talmudLocation": "Chullin 92a:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/92a#section-2",
          "talmudFullText": "The Talmud continues to discuss Jacob wrestling with the angel. The prophet states: <b>“So he strove [<i>vayyasar</i>] with an angel, and prevailed; he wept, and made supplication to him; </b> at Beth El he would find him, and there he would speak with us” (Hosea 12:5). From this verse <b>I do not know who became master [<i>sar</i>], </b> i.e., was victorious, <b>over whom. When</b> another verse <b>states: </b> “And he said: Your name shall no longer be called Jacob, but Israel; <b>for you have striven with angels</b> and with men, and have prevailed” (Genesis 32:29), <b>you must say</b> that <b>Jacob became master over the angel. </b>"
        },
        {
          "verseLocation": "Hosea 12:8",
          "verseText": "nothing other than merchants, as it is stated: “As for the merchant [ kena’an ], the balances of deceit are in his hand. He loves to oppress”",
          "talmudLocation": "Bava Batra 75a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/75a#section-5",
          "talmudFullText": "<b>And</b> with regard to <b>the remainder</b> of the leviathan, they will <b>divide it and use it for commerce in the markets of Jerusalem, as it is stated: “They will part him among the <i>kena’anim</i>”</b> (Job 40:30). <b>And <i>kena’anim</i></b> means <b>nothing other than merchants, as it is stated: “As for the merchant [<i>kena’an</i>], the balances of deceit are in his hand. He loves to oppress”</b> (Hosea 12:8). <b>And if you wish, say</b> that the proof is <b>from here: “Whose merchants are princes, whose traffickers [<i>kinaneha</i>] are the honorable of the earth”</b> (Isaiah 23:8)."
        },
        {
          "verseLocation": "Hosea 12:8",
          "verseText": "the daughter of a merchant, as it is written: “As for the merchant [ kena’an ], the balances of deceit are in his hand. He loves",
          "talmudLocation": "Pesachim 50a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/50a#section-15",
          "talmudFullText": "<b>And from where do we</b> derive <b>that a merchant can be called a <i>kena’ani</i>? As it is written: “And Judah saw there the daughter of a certain <i>kena’ani</i>…</b>and he took her, and went in unto her” (Genesis 38:2). <b>What is</b> the meaning of the word <b><i>kena’ani</i></b> in this context? <b>If you say</b> it refers to <b>an actual Canaanite, is it possible that Abraham warned Isaac</b> not to marry a Canaanite woman, and <b>Isaac warned Jacob</b> to the same effect, <b>and</b> nonetheless <b>Judah went and married</b> a Canaanite woman? <b>Rather, R' Shimon ben Lakish said: </b> She was <b>the daughter of a merchant, as it is written: “As for the merchant [<i>kena’an</i>], the balances of deceit are in his hand. He loves</b> to oppress” (Hosea 12:8). <b>And if you wish, say</b> instead that this meaning of the word can be understood from the following verse, which describes Tyre: <b>“Whose traders are princes, whose merchants [<i>kinaneha</i>] are the honorable of the earth”</b> (Isaiah 23:8)."
        },
        {
          "verseLocation": "Hosea 12:12",
          "verseText": "“Their altars shall also be like droppings in the furrows of the field”",
          "talmudLocation": "Sanhedrin 102b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/102b#section-6",
          "talmudFullText": "With regard to Ahab, it is written: <b>“And it came to pass, the most minor of his transgressions was his walking in the sins of Jeroboam, son of Nebat”</b> (I Kings 16:31). <b>R' Yoḥanan says: The minor</b> sins <b>that Ahab performed</b> were <b>on par with the major</b> sins <b>that Jeroboam performed, </b> as the transgressions committed by Ahab were much more serious than those committed by Jeroboam. <b>And for what</b> reason <b>did the verse attribute</b> the sins of all the kings of Israel <b>to Jeroboam, </b> even though the sins of Ahab were more substantial? It is <b>due to</b> the fact <b>that he was first to</b> engage in <b>iniquity. </b> With regard to the verse: <b>“Their altars shall also be like droppings in the furrows of the field”</b> (Hosea 12:12), <b>R' Yoḥanan says: You do not have even one furrow in Eretz Yisrael upon which Ahab did not place</b> an object of <b>idol worship and bow to it. </b>"
        }
      ]
    },
    {
      "chapterNumber": 13,
      "citations": [
        {
          "verseLocation": "Hosea 13:2",
          "verseText": "which is written: “And now they continue to sin, and have made for themselves molten images of their silver, according to their own understanding, idols,",
          "talmudLocation": "Sanhedrin 63b:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/63b#section-13",
          "talmudFullText": "<b>Rav Yitzḥak says: What</b> is the meaning of that <b>which is written: “And now they continue to sin, and have made for themselves molten images of their silver, according to their own understanding, idols, </b> all of them the work of the craftsmen; of them they say: Those who sacrifice men kiss calves” (Hosea 13:2)? <b>What</b> is the meaning of the expression: <b>“According to their own understanding [<i>kitvunam</i>], idols”? </b> The word <i>kitvunam</i> is interpreted as meaning: According to their image [<i>ketavnitam</i>], and the verse <b>teaches that each and every</b> person <b>would make an image of his god and place it in his pocket. When he would remember it, he would remove it from his bosom and embrace it and kiss it. </b>"
        },
        {
          "verseLocation": "Hosea 13:6",
          "verseText": "Filling his stomach is a type of sin, as it is stated: “When they were fed and became full they were sated, and their hearts were lifted and they have forgotten Me”",
          "talmudLocation": "Berakhot 32a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/32a#section-12",
          "talmudFullText": "On a similar note, <b>Rav Aḥa, son of Rav Huna, said</b> that <b>Rav Sheshet said: That is what people say</b> in a popular maxim: <b>Filling his stomach is a type of sin, as it is stated: “When they were fed and became full they were sated, and their hearts were lifted and they have forgotten Me”</b> (Hosea 13:6). <b>Rav Naḥman said: </b> This principle is derived not from the verse in Hosea, but <b>from here: “And your heart is lifted and you forget YHWH”</b> (Deuteronomy 8:14). <b>And the Rabbis say</b> that this principle is derived <b>from here: “And they will have eaten and been sated and fattened, and they will turn</b> to other gods” (Deuteronomy 31:20)."
        },
        {
          "verseLocation": "Hosea 13:6",
          "verseText": "as it is stated: “When they were fed, they became full,",
          "talmudLocation": "Sukkah 52b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sukkah/52b#section-6",
          "talmudFullText": "<b>R' Yoḥanan said: A man has a small organ</b> used in sexual sex. <b>If he starves</b> the organ, and does not overindulge, it <b>is satiated; </b> however, <b>if he satiates</b> the organ and overindulges in sexual sex, it <b>is starving, </b> and desires more, <b>as it is stated: “When they were fed, they became full, </b> they were filled, and their heart was exalted; therefore have they forgotten Me” (Hosea 13:6)."
        },
        {
          "verseLocation": "Hosea 13:14",
          "verseText": "which is stated: “I shall ransom them from the power of the netherworld, I shall redeem them from death”",
          "talmudLocation": "Pesachim 87b:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/pesachim/87b#section-20",
          "talmudFullText": "<b>R' Ḥiyya teaches: What is</b> the meaning of that <b>which is written: “God understands its ways and He knows its place”</b> (Job 28:23)? <b>God knows the Jewish people, who are unable to withstand the</b> harsh <b>decrees of the Romans. Therefore, He exiled them to Babylonia, </b> whose people are less cruel. <b>And R' Elazar said: God exiled Israel to Babylonia only due to</b> the fact <b>it is</b> a land <b>as deep as the netherworld, </b> i.e., it is a land of plains and valleys, which alludes to that <b>which is stated: “I shall ransom them from the power of the netherworld, I shall redeem them from death”</b> (Hosea 13:14). <b>R' Ḥanina said: It is due to</b> the fact <b>that their language, </b> Aramaic, <b>is similar to the language of the Torah, </b> which enables the Jews who live there to study Torah."
        },
        {
          "verseLocation": "Hosea 13:14",
          "verseText": "is deeper than the netherworld, as is stated: “Shall I ransom them from the power of the netherworld? Shall I redeem them from death?”",
          "talmudLocation": "Yevamot 17a:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/17a#section-7",
          "talmudFullText": "§ The Talmud asks: <b>What is</b> the meaning of the name <b>Harpanya? R' Zeira said: </b> It means <b>the mountain to which all turn [<i>har shehakol ponin bo</i>]. </b> In other words, it is the destination for all those who could not find wives anywhere else, as most of its population is of flawed lineage. <b>It is taught in a <i>baraita</i>: All those who do not know their family or tribe turn there. Rava said: This</b> type of flaw is appalling and <b>is deeper than the netherworld, as is stated: “Shall I ransom them from the power of the netherworld? Shall I redeem them from death? ”</b> (Hosea 13:14). This verse indicates that it is possible to be ransomed and released from the netherworld, <b>whereas their disqualification cannot be rectified. </b>"
        },
        {
          "verseLocation": "Hosea 13:15",
          "verseText": "“For though he be fruitful among the reed-plants, an east wind shall come, the wind of the Lord coming up from the wilderness, and his spring shall become dry,",
          "talmudLocation": "Gittin 31b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/31b#section-14",
          "talmudFullText": "<b>Rav Naḥman bar Yitzḥak, </b> who was present, <b>said</b> about their statements: <b>And the three of them derived</b> their statements <b>from one verse, </b> as it is stated: <b>“For though he be fruitful among the reed-plants, an east wind shall come, the wind of YHWH coming up from the wilderness, and his spring shall become dry, </b> and his fountain shall be dried up; he shall spoil the treasure of all precious vessels” (Hosea 13:15). The statement that a woman miscarries in its wake is based on the phrase <b>“His spring shall become dry, ”</b> as <b>this</b> is referring to <b>a woman’s womb. </b> With regard to the phrase <b>“And his fountain shall be dried up, ” this</b> is referring to the <b>semen that is in a woman’s womb. </b> And with regard to the phrase <b>“He shall spoil the treasure of all precious vessels, ” this</b> is referring to <b>a pearl in the sea. </b>"
        }
      ]
    },
    {
      "chapterNumber": 14,
      "citations": [
        {
          "verseLocation": "Hosea 14:2",
          "verseText": "Rabbi Levi said: Great is repentance, as it reaches the heavenly throne, as it is stated: “Return, Israel, to the Lord your God”",
          "talmudLocation": "Yoma 86a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/86a#section-16",
          "talmudFullText": "Similarly, <b>R' Yehuda raised a contradiction</b> between two verses. <b>It is written: “Return, you backsliding children I will heal your backsliding”</b> (Jeremiah 3:22), implying that anyone can achieve healing, which is dependent only on repentance. But it also states: “Return, O backsliding children, says YHWH, <b>for I am a lord to you, and I will take you one from a city, and two from a family”</b> (Jeremiah 3:14), implying that repentance is available only to certain individuals. He resolved the contradiction and explained that this is <b>not difficult: Here, </b> it is referring to repentance <b>out of love or fear, </b> which few people achieve; <b>there, </b> it referring is repentance <b>through suffering, </b> as everyone has thoughts of repentance when they suffer. <b>R' Levi said: Great is repentance, as it reaches the heavenly throne, as it is stated: “Return, Israel, to YHWH your God”</b> (Hosea 14:2). This implies that repentance literally reaches to God."
        },
        {
          "verseLocation": "Hosea 14:2",
          "verseText": "intentional sins are counted for him as unwitting transgressions, as it is stated: “Return, Israel, to the Lord your God, for you have stumbled in your iniquity”",
          "talmudLocation": "Yoma 86b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/86b#section-3",
          "talmudFullText": "<b>Reish Lakish said: Great is repentance, as</b> the penitent’s <b>intentional sins are counted for him as unwitting transgressions, as it is stated: “Return, Israel, to YHWH your God, for you have stumbled in your iniquity”</b> (Hosea 14:2). The Talmud analyzes this: <b>Doesn’t “iniquity”</b> mean <b>an intentional sin? Yet</b> the prophet <b>calls it stumbling, </b> implying that one who repents is considered as though he only stumbled accidentally in his transgression. The Talmud asks: <b>Is that so? Didn’t Reish Lakish</b> himself <b>say: Great is repentance, as one’s intentional sins are counted for him as merits, as it is stated: “And when the wicked turns from his wickedness, and does that which is lawful and right, he shall live thereby”</b> (Ezekiel 33:19), and all his deeds, even his transgressions, will become praiseworthy? The Talmud reconciles: This is <b>not difficult: Here, </b> when one repents <b>out of love, </b> his sins become like merits; <b>there, </b> when one repents <b>out of fear, </b> his sins are counted as unwitting transgressions."
        },
        {
          "verseLocation": "Hosea 14:3",
          "verseText": "is appeased by words, as it is stated: “Take with you words and return to God”",
          "talmudLocation": "Yoma 86b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/86b#section-6",
          "talmudFullText": "<b>But</b> with regard to <b>God, </b> if <b>a person commits a transgression in private, </b> God <b>is appeased by words, as it is stated: “Take with you words and return to God”</b> (Hosea 14:3). <b>And not only that, but</b> God <b>considers it</b> as though he has done <b>a favor</b> for God by repenting, <b>as it is stated: “Accept that which is good”</b> (Hosea 14:3). <b>And not only that, but the verse ascribes him</b> credit <b>as though he had sacrificed bulls, as it is stated: “So we will render for bulls the offering of our lips”</b> (Hosea 14:3). <b>Lest you say</b> he is considered only like one who offers <b>obligatory bulls, </b> therefore <b>the verse states: “I will heal their backsliding, I will love them freely”</b> (Hosea 14:5). Repentance is considered as though it were the sacrifice of a free-will offering."
        },
        {
          "verseLocation": "Hosea 14:5",
          "verseText": "Rabbi Ḥama bar Ḥanina said: Great is repentance, as it brings healing to the world, as it is stated: “I will heal their backsliding, I will love them freely”",
          "talmudLocation": "Yoma 86a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/86a#section-14",
          "talmudFullText": "§ Further on the topic of repentance, <b>R' Ḥama bar Ḥanina said: Great is repentance, as it brings healing to the world, as it is stated: “I will heal their backsliding, I will love them freely”</b> (Hosea 14:5), which teaches that repentance from sin brings healing."
        },
        {
          "verseLocation": "Hosea 14:5",
          "verseText": "the verse states: “I will heal their backsliding, I will love them freely”",
          "talmudLocation": "Yoma 86b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/86b#section-6",
          "talmudFullText": "<b>But</b> with regard to <b>God, </b> if <b>a person commits a transgression in private, </b> God <b>is appeased by words, as it is stated: “Take with you words and return to God”</b> (Hosea 14:3). <b>And not only that, but</b> God <b>considers it</b> as though he has done <b>a favor</b> for God by repenting, <b>as it is stated: “Accept that which is good”</b> (Hosea 14:3). <b>And not only that, but the verse ascribes him</b> credit <b>as though he had sacrificed bulls, as it is stated: “So we will render for bulls the offering of our lips”</b> (Hosea 14:3). <b>Lest you say</b> he is considered only like one who offers <b>obligatory bulls, </b> therefore <b>the verse states: “I will heal their backsliding, I will love them freely”</b> (Hosea 14:5). Repentance is considered as though it were the sacrifice of a free-will offering."
        },
        {
          "verseLocation": "Hosea 14:5",
          "verseText": "individual who repents, as it is stated: “I will heal their backsliding, I will love them freely; for My anger has turned away from him”",
          "talmudLocation": "Yoma 86b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/86b#section-7",
          "talmudFullText": "<b>It was taught</b> in a <i>baraita</i> that <b>R' Meir would say: Great is repentance because the entire world is forgiven on account of</b> one <b>individual who repents, as it is stated: “I will heal their backsliding, I will love them freely; for My anger has turned away from him”</b> (Hosea 14:5). <b>It does not say: From them, </b> i.e., from the sinners, <b>but “from him, ”</b> i.e., from that individual. Because he repented, everyone will be healed."
        },
        {
          "verseLocation": "Hosea 14:6",
          "verseText": "as it is stated: “I will be as the dew to Israel”",
          "talmudLocation": "Taanit 4a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/4a#section-12",
          "talmudFullText": "In response, <b>God said to</b> the Jewish people: <b>My daughter, you request</b> the manifestation of My Presence by comparing Me to <b>a matter, </b> rain, <b>that is sometimes desired, but is sometimes undesired, </b> e.g., during the summer. <b>However, I will be to you</b> like <b>a matter that is always desired, </b> dew, <b>as it is stated: “I will be as the dew to Israel”</b> (Hosea 14:6), since dew appears in all seasons and is invariably a blessing."
        },
        {
          "verseLocation": "Hosea 14:7",
          "verseText": "Rav said: The young men of Israel are destined to emit a sweet scent as the Lebanon, as it is stated: “His branches shall spread and his beauty will be as the olive tree, and his fragrance as Lebanon”",
          "talmudLocation": "Berakhot 43b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/43b#section-4",
          "talmudFullText": "<b>And Rav Zutra bar Toviya said</b> that <b>Rav said: The young men of Israel are destined to emit a sweet scent as the Lebanon, as it is stated: “His branches shall spread and his beauty will be as the olive tree, and his fragrance as Lebanon”</b> (Hosea 14:7)."
        },
        {
          "verseLocation": "Hosea 14:10",
          "verseText": "this verse: “For the ways of the Lord are right, and the just walk in them; but transgressors stumble over them”",
          "talmudLocation": "Bava Batra 89b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/89b#section-7",
          "talmudFullText": "<b>Rabban Yoḥanan ben Zakkai said with regard to all</b> these <i>halakhot</i>: <b>Woe to me if I say</b> them, and <b>woe unto me if I do not say</b> them. <b>If I say</b> them, <b>perhaps swindlers will learn</b> new methods of cheating of which they were previously unaware. <b>And if I do not say</b> them, <b>perhaps swindlers will say: Torah scholars are not well versed in our handiwork. A dilemma was raised before</b> the rabbis: <b>Did</b> Rabban Yoḥanan ben Zakkai decide to <b>say</b> these <i>halakhot</i> in public <b>or did he not say</b> them? <b>Rav Shmuel bar Rav Yitzḥak says: He said them, and he said them on</b> the basis of <b>this verse: “For the ways of YHWH are right, and the just walk in them; but transgressors stumble over them”</b> (Hosea 14:10)."
        },
        {
          "verseLocation": "Hosea 14:10",
          "verseText": "which is written: “For the ways of the Lord are right, and the righteous will walk in them and transgressors will stumble in them”",
          "talmudLocation": "Horayot 10b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/horayot/10b#section-7",
          "talmudFullText": "§ <b>Rabba bar bar Ḥana said</b> that <b>R' Yoḥanan said: What</b> is the meaning of that <b>which is written: “For the ways of YHWH are right, and the righteous will walk in them and transgressors will stumble in them”</b> (Hosea 14:10)? It is <b>comparable to</b> an incident involving <b>two people who roasted their Paschal offerings. One ate it for the sake of</b> the <b>mitzva, and</b> the other <b>one ate it</b> with gusto, <b>for the sake of excessive eating. </b> With regard to <b>that</b> person <b>who ate it for the sake of</b> the <b>mitzva, </b> it is written: <b>“The righteous will walk in them. ”</b> With regard to <b>that</b> person <b>who ate it for the sake of excessive eating, </b> it is written: <b>“And transgressors will stumble in them. ”</b>"
        },
        {
          "verseLocation": "Hosea 14:10",
          "verseText": "which is written: “For the paths of the Lord are right, and the just walk in them, but transgressors stumble over them”",
          "talmudLocation": "Nazir 23a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nazir/23a#section-12",
          "talmudFullText": "§ <b>Rabba bar bar Ḥanna said</b> that <b>R' Yoḥanan said: What</b> is the meaning of that <b>which is written: “For the paths of YHWH are right, and the just walk in them, but transgressors stumble over them”</b> (Hosea 14:10)? How can the same path lead to such different outcomes? This is <b>comparable to two people who roasted their Paschal offerings</b> on Passover eve, in the proper manner. <b>One ate it for the sake of the mitzva, and one ate it for the sake of excessive eating. This</b> one, <b>who ate it for the sake of the mitzva, </b> has fulfilled: <b>“And the just walk in them, ” while that</b> one, <b>who ate it for the sake of excessive eating, </b> is described by the end of the verse: <b>“But transgressors stumble over them. ”</b>"
        }
      ]
    }
  ]
}