{
  "bookName": "Jonah",
  "totalEntries": 21,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Jonah 1:3",
          "verseText": "so he paid its cost and went down into it”",
          "talmudLocation": "Nedarim 38a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/38a#section-15",
          "talmudFullText": "<b>Jonah</b> was wealthy, <b>as it is written: </b> “And he went down to Jaffa, and found a ship going to Tarshish, <b>so he paid its cost and went down into it”</b> (Jonah 1:3), <b>and R' Yoḥanan said: He paid the cost of the entire ship. R' Romanus said: The cost for the</b> entire <b>ship was four thousand gold dinars. </b>"
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Jonah 2:1",
          "verseText": "As it is written: “And the Lord prepared a great fish [ dag ] to swallow up Jonah”",
          "talmudLocation": "Nedarim 51b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/51b#section-6",
          "talmudFullText": "<b>Rav Pappa said to Abaye: From where</b> is it derived <b>that</b> the phrase: <b>Fish [<i>dag</i></b>] is <i>konam</i> for me, and for <b>that</b> reason <b>I</b> will not <b>taste</b> it, a reference to <b>a large</b> fish? <b>As it is written: “And YHWH prepared a great fish [<i>dag</i>] to swallow up Jonah”</b> (Jonah 2:1). The Talmud asks: <b>But isn’t it written</b> in the following verse: <b>“Then Jonah prayed to YHWH his God out of the belly of the fish [<i>daga</i>]”</b> (Jonah 2:2)? This indicates that a large fish can be referred to as a <i>daga</i> as well."
        },
        {
          "verseLocation": "Jonah 2:2",
          "verseText": "“Then Jonah prayed to the Lord his God out of the belly of the fish [ daga ]”",
          "talmudLocation": "Nedarim 51b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/51b#section-6",
          "talmudFullText": "<b>Rav Pappa said to Abaye: From where</b> is it derived <b>that</b> the phrase: <b>Fish [<i>dag</i></b>] is <i>konam</i> for me, and for <b>that</b> reason <b>I</b> will not <b>taste</b> it, a reference to <b>a large</b> fish? <b>As it is written: “And YHWH prepared a great fish [<i>dag</i>] to swallow up Jonah”</b> (Jonah 2:1). The Talmud asks: <b>But isn’t it written</b> in the following verse: <b>“Then Jonah prayed to YHWH his God out of the belly of the fish [<i>daga</i>]”</b> (Jonah 2:2)? This indicates that a large fish can be referred to as a <i>daga</i> as well."
        },
        {
          "verseLocation": "Jonah 2:3",
          "verseText": "“Out of the belly of the netherworld [ She’ol ] I cried, and You did hear my voice”",
          "talmudLocation": "Eruvin 19a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/19a#section-13",
          "talmudFullText": "<b>In the sea</b> there is a second entrance to Gehenna, <b>as it is written</b> about Jonah in the fish’s belly: <b>“Out of the belly of the netherworld [<i>She’ol</i>] I cried, and You did hear my voice”</b> (Jonah 2:3)."
        },
        {
          "verseLocation": "Jonah 2:3",
          "verseText": "She’ol, as it is written: “Out of the belly of the netherworld [ she’ol ] I cried and You did hear my voice”",
          "talmudLocation": "Eruvin 19a:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/eruvin/19a#section-17",
          "talmudFullText": "<b>She’ol, as it is written: “Out of the belly of the netherworld [<i>she’ol</i>] I cried and You did hear my voice”</b> (Jonah 2:3). <b>Avadon, as it is written: “Shall Your steadfast love be reported in the grave or Your faithfulness in destruction [<i>avadon</i>]? ”</b> (Psalms 88:12). <b>Be’er Shaḥat, as it is written: “For You will not abandon my soul to the netherworld; nor will You suffer Your pious one to see the pit [<i>shaḥat</i>]”</b> (Psalms 16:10). <b>And Bor Shaon and Tit HaYaven, as it is written: “He brought me up also out of the gruesome pit [<i>bor shaon</i>], out of the miry clay [<i>tit hayaven</i>]”</b> (Psalms 40:3). <b>And Tzalmavet, as it is written: “Such as sat in darkness and in the shadow of death [<i>tzalmavet</i>], </b> bound in affliction and iron” (Psalms 107:10). <b>And</b> with regard to <b>Eretz Taḥtit, </b> i.e., the underworld, <b>it is</b> known by <b>tradition</b> that this is its name."
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Jonah 3:1",
          "verseText": "“And the word of the Lord came to Jonah a second time, saying”",
          "talmudLocation": "Yevamot 98a:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/98a#section-6",
          "talmudFullText": "<b>Come</b> and <b>hear</b> another proof, <b>as ben Yasiyan said: When I went to cities overseas, I found one convert who married the wife of his maternal</b> half <b>brother. I said to him: My son, who permitted</b> this to <b>you? He said to me: There is</b> a local <b>woman and her seven sons</b> to whom this was permitted. <b>On this</b> very <b>bench [<i>safsal</i>], R' Akiva sat and said two statements: </b> He said that <b>a convert may marry the</b> former <b>wife of his maternal</b> half <b>brother, and he said</b> that the verse <b>“And the word of YHWH came to Jonah a second time, saying”</b> (Jonah 3:1) implies that the <b>Shekhina spoke with him</b> only <b>a second</b> time. However, <b>a 3rd</b> time the <b>Shekhina did not speak with him, </b> i.e., Jonah did not receive any more prophecies. <b>In any event, </b> this <i>baraita</i> <b>teaches</b> that <b>a convert may marry the wife of his maternal brother. What, is it not</b> referring to a case <b>where</b> the convert’s <b>brother married her when he</b> himself <b>was</b> already <b>a convert? </b>"
        },
        {
          "verseLocation": "Jonah 3:3",
          "verseText": "the great city. When it says: “And Nineveh was a great city of God, a three-day journey across”",
          "talmudLocation": "Yoma 10a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/10a#section-5",
          "talmudFullText": "The Torah continues: <b>“Out of that land went forth Asshur”</b> (Genesis 10:11). <b>Rav Yosef taught: Asshur, that is Silek, </b> meaning that is the region where the town Silkiya was built. <b>“And built Nineveh and Rehoboth-ir and Calah”</b> (Genesis 10:11). <b>Nineveh, in accordance with its plain meaning; Rehovoth-ir, that is</b> the town later known as <b>Perat of Meishan; Calah, that is Perat of Bursif. “And Resen between Nineveh and Calah, it is the great city”</b> (Genesis 10:12). <b>Resen, that is</b> the town later known as <b>Akteisfon. It is the great city; I do not know whether</b> this means that <b>Nineveh</b> is <b>the great city, </b> or <b>whether</b> it means that <b>Resen</b> is <b>the great city. When it says: “And Nineveh was a great city of God, a three-day journey across”</b> (Jonah 3:3), <b>you must say</b> that <b>Nineveh is the great city. </b>"
        },
        {
          "verseLocation": "Jonah 3:4",
          "verseText": "“Nineveh will be overturned”",
          "talmudLocation": "Sanhedrin 89b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89b#section-5",
          "talmudFullText": "The Talmud challenges: <b>But</b> in the case of <b>Jonah, they reconsidered it and did not inform them</b> that the people of Nineveh had repented for their sins and were therefore spared the foretold destruction. The Talmud explains: In the case of <b>Jonah, from the outset, </b> the heavenly court <b>told him</b> to say: <b>“Nineveh will be overturned”</b> (Jonah 3:4). Still, <b>he did not know if</b> the sentence would be <b>for the good, </b> as their corruption would be overturned through repentance, <b>or</b> if it would be <b>for the bad, </b> as the city would be overturned through destruction. Therefore, the prophecy was never revoked, but simply fulfilled in accordance with one of its possible interpretations."
        },
        {
          "verseLocation": "Jonah 3:8",
          "verseText": "“But let them be covered with sackcloth, both man and beast”",
          "talmudLocation": "Taanit 16a:11",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/16a#section-11",
          "talmudFullText": "§ Apropos the repentance of the inhabitants of Nineveh, the Talmud discusses their behavior further. The verse states: <b>“But let them be covered with sackcloth, both man and beast”</b> (Jonah 3:8). <b>What did they do? They confined the</b> female <b>animals alone, and</b> their <b>young alone, </b> in a different place. <b>They</b> then <b>said before</b> God: <b>God!, if You do not have mercy on us, we will not have mercy on these</b> animals. Even if we are not worthy of Your mercy, these animals have not sinned."
        },
        {
          "verseLocation": "Jonah 3:8",
          "verseText": "“And let them cry mightily to God”",
          "talmudLocation": "Taanit 16a:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/16a#section-12",
          "talmudFullText": "It is further stated with regard to the people of Nineveh: <b>“And let them cry mightily to God”</b> (Jonah 3:8). The Talmud asks: <b>What did they say</b> that could be described as calling out “mightily”? The Talmud explains that <b>they said before</b> God: <b>God!, </b> if there is a dispute between <b>a submissive one and an intractable one, </b> or between <b>a righteous one and a wicked one, who must yield before whom? </b> Certainly the righteous forgives the wicked. Likewise, You must have mercy on us."
        },
        {
          "verseLocation": "Jonah 3:8",
          "verseText": "“And let them turn, every one from his evil way, and from the violence that is in their hands”",
          "talmudLocation": "Taanit 16a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/16a#section-13",
          "talmudFullText": "The verse states: <b>“And let them turn, every one from his evil way, and from the violence that is in their hands”</b> (Jonah 3:8). <b>What is</b> the meaning of the phrase <b>“and from the violence that is in their hands”? Shmuel said</b> that the king of Nineveh proclaimed: <b>Even</b> if <b>one stole a beam and built it into</b> his <b>building, </b> he must <b>tear down the entire building and return the beam to its owner. </b> Although the rabbis decreed that one need only pay financial compensation in a case of this kind, these people wanted to repent completely by removing any remnant of stolen property from their possession."
        },
        {
          "verseLocation": "Jonah 3:8",
          "verseText": "violence, as it is stated: “And from the violence that is in their hands”",
          "talmudLocation": "Taanit 7b:12",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/7b#section-12",
          "talmudFullText": "<b>R' Ami said: The rains are withheld only due to the sin of robbery, as it is stated: “He covers His hands with the light, </b> and He has commanded it due to imploring” (Job 36:32). This means that due <b>to the sin of</b> stealing <b>hands, </b> God <b>has covered the light</b> and no rain will fall. <b>And</b> R' Ami adds that the term <b>“hand”</b> means <b>nothing other</b> than a sin of <b>violence, as it is stated: “And from the violence that is in their hands”</b> (Jonah 3:8). <b>And “light” means nothing other</b> than <b>rain, as it is stated: “He spreads abroad the cloud of His light”</b> (Job 37:11)."
        },
        {
          "verseLocation": "Jonah 3:10",
          "verseText": "as it is written: “And God saw their deeds”",
          "talmudLocation": "Rosh Hashanah 16b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/rosh%20hashanah/16b#section-6",
          "talmudFullText": "<b>And R' Yitzḥak said: A person’s sentence is torn up on</b> account of <b>four</b> types of <b>actions. These are: </b> Giving <b>charity, crying out</b> in prayer, <b>a change of</b> one’s <b>name, and a change of</b> one’s <b>deeds</b> for the better. An allusion may be found in Scripture for all of them: Giving <b>charity, as it is written: “And charity delivers from death”</b> (Proverbs 10:2); <b>crying out</b> in prayer, <b>as it is written: “Then they cry to YHWH in their trouble, and He brings them out of their distresses”</b> (Psalms 107:28); <b>a change of</b> one’s <b>name, as it is written: </b> “As for <b>Sarai your wife, you shall not call her name Sarai, but Sarah shall her name be”</b> (Genesis 17:15), <b>and it is written</b> there: <b>“And I will bless her, and I will also give you a son from her”</b> (Genesis 17:16); <b>a change of</b> one’s <b>deeds</b> for the better, <b>as it is written: “And God saw their deeds”</b> (Jonah 3:10), <b>and it is written</b> there: <b>“And God repented of the evil, which He had said He would do to them, and He did not do</b> it” (Jonah 3:10)."
        },
        {
          "verseLocation": "Jonah 3:10",
          "verseText": "“And God saw their deeds, that they had turned from their evil way”",
          "talmudLocation": "Taanit 15a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/15a#section-5",
          "talmudFullText": "<b>The eldest</b> member <b>of the</b> community <b>says to</b> the congregation <b>statements of reproof, </b> for example: <b>Our brothers, it is not stated with regard to the people of Nineveh: And God saw their sackcloth and their fasting. Rather, </b> the verse says: <b>“And God saw their deeds, that they had turned from their evil way”</b> (Jonah 3:10). <b>And in the Prophets it says: “And rend your hearts and not your garments, </b> and return to YHWH your God” (Joel 2:13). This teaches that prayer and fasting are insufficient, as one must also repent and amend his ways in practice."
        },
        {
          "verseLocation": "Jonah 3:10",
          "verseText": "“And God saw their deeds, that they had turned from their evil way”",
          "talmudLocation": "Taanit 16a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/taanit/16a#section-10",
          "talmudFullText": "What does he say? <b>Our brothers, </b> it is <b>not sackcloth and fasting</b> that <b>cause</b> atonement for our sins. <b>Rather, repentance and good deeds</b> will <b>cause</b> our atonement. This is <b>as we find with regard to the people of Nineveh, that it is not stated about them: And God saw their sackcloth and their fasting. Rather, </b> the verse states: <b>“And God saw their deeds, that they had turned from their evil way”</b> (Jonah 3:10)."
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Jonah 4:8",
          "verseText": "“And it came to pass, when the sun arose, that God prepared a vehement [ ḥarishit ] east wind”",
          "talmudLocation": "Gittin 31b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/31b#section-8",
          "talmudFullText": "§ Having mentioned the east wind, the Talmud quotes a related verse: <b>“And it came to pass, when the sun arose, that God prepared a vehement [<i>ḥarishit</i>] east wind”</b> (Jonah 4:8). The Talmud asks: <b>What</b> is the meaning of the word <b>“<i>ḥarishit</i>”? Rav Yehuda says: </b> It means a wind that plows [<i>ḥoreshet</i>], as <b>at the time that</b> the wind <b>blows, it forms many furrows in the sea, </b> as though it were plowing the sea."
        },
        {
          "verseLocation": "Jonah 4:8",
          "verseText": "“And the sun beat upon the head of Jonah and he fainted”",
          "talmudLocation": "Gittin 31b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/31b#section-9",
          "talmudFullText": "<b>Rabba said to him: If that is so, </b> then <b>that which is written</b> in the continuation of the verse: <b>“And the sun beat upon the head of Jonah and he fainted”</b> (Jonah 4:8), is difficult; it seems from the continuation of the verse that the wind was extremely hot, not strong. <b>Rather, Rabba says: At the time that it blows, it silences all the winds before it. </b> Therefore, it is called <i>ḥarishit</i>, because all other winds are silent [<i>maḥarishot</i>] before it. Since only this wind was blowing, it became very hot. <b>And this is as it is written: “You whose garments are hot, when the earth is still by reason of the south wind”</b> (Job 37:17). <b>R' Taḥalifa bar Rav Ḥisda says</b> that <b>Rav Ḥisda says</b> in explanation of this verse: <b>When are your garments hot, </b> i.e., when is there the greatest heat? It is <b>when the earth is still by reason of the south wind, as at the time that</b> the southern wind <b>blows, it silences all the winds before it. </b>"
        },
        {
          "verseLocation": "Jonah 4:11",
          "verseText": "“And many animals [ uvhema rabba ]”",
          "talmudLocation": "Bekhorot 4b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bekhorot/4b#section-9",
          "talmudFullText": "The Talmud asks: <b>And say</b> the word <i>behemat</i> is referring to many animals, as in the phrase: <b>“And many animals [<i>uvhema rabba</i>]”</b> (Jonah 4:11). The Talmud answers: <b>If so, let the verse write either: <i>Behema</i></b> of the Levites <b>in exchange for <i>behema</i>, or: <i>Behemtam</i> in exchange for <i>behemtam</i>. What</b> is the significance of the phrase <b>“<i>behemat</i></b> the Levites <b>in exchange for <i>behemtam</i>”? Learn from it</b> that <b>one</b> lamb of a Levite <b>rendered many</b> donkeys of Israelites <b>exempt. </b>"
        },
        {
          "verseLocation": "Jonah 4:11",
          "verseText": "But isn’t it written: “And should I not have pity on Nineveh,",
          "talmudLocation": "Keritot 6b:22",
          "talmudLocationUrl": "https://chavrutai.com/tractate/keritot/6b#section-22",
          "talmudFullText": "The Talmud raises another difficulty: <b>But isn’t it written: “And should I not have pity on Nineveh, </b> that great city, wherein are more than one hundred and twenty thousand people [<i>adam</i>] who cannot discern between their right hand and their left hand, and also much cattle” (Jonah 4:11). The inhabitants of Nineveh were non-Jews. The Talmud answers: <b>That</b> term serves <b>to exclude</b> them from the <b>animals</b> mentioned in the verse."
        },
        {
          "verseLocation": "Jonah 4:11",
          "verseText": "behema , as it is stated: “And many animals [ uvhema rabba ]”",
          "talmudLocation": "Temurah 9a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/temurah/9a#section-16",
          "talmudFullText": "The first <i>tanna</i> <b>said to</b> R' Shimon: <b>We have found that</b> a group of <b>animals is called</b> by the singular term <b><i>behema</i>, as it is stated: “And many animals [<i>uvhema rabba</i>]”</b> (Jonah 4:11). The Talmud notes: <b>And R' Shimon</b> could respond that many animals <b>are</b> indeed <b>called “<i>behema rabba</i>, ”</b> but they <b>are not called “<i>behema</i>” without</b> further <b>specification. </b>"
        },
        {
          "verseLocation": "Jonah 4:11",
          "verseText": "“Wherein are more than one hundred and twenty thousand men [ adam ] that cannot discern between their right hand and their left hand, and also much cattle”",
          "talmudLocation": "Yevamot 61a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/61a#section-3",
          "talmudFullText": "The Talmud raises another difficulty based upon a verse with regard to the city of Nineveh: <b>“Wherein are more than one hundred and twenty thousand men [<i>adam</i>] that cannot discern between their right hand and their left hand, and also much cattle”</b> (Jonah 4:11). The Talmud answers: There, too, the non-Jews are given this title <b>due to</b> the need to distinguish them from the <b>animals</b> mentioned in the verse."
        }
      ]
    }
  ]
}