{
  "bookName": "Nahum",
  "totalEntries": 11,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Nahum 1:2",
          "verseText": "and it is written: “The Lord is a jealous and furious God”",
          "talmudLocation": "Avodah Zarah 4a:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-5",
          "talmudFullText": "<b>R' Ḥama ben Ḥanina, raises a contradiction</b> between the following verses. <b>It is written: “Fury is not in Me”</b> (Isaiah 27:4), <b>and it is written: “YHWH is a jealous and furious God”</b> (Nahum 1:2). The Talmud answers: This is <b>not difficult; here, </b> where it states that God has no fury, it is speaking <b>with regard to the Jewish people, </b> whereas <b>there, </b> where it says that God has fury, it is speaking <b>with regard to the nations of the world. Rav Ḥinnana bar Pappa says</b> in explanation of the verse: “Fury is not in Me; would that I were as the briers and thorns in flame! I would with one step burn it altogether” (Isaiah 27:4). <b>“Fury is not in Me, ” as I have already taken an oath</b> that I will not destroy the Jewish people; <b>“would that I” had not taken this oath, </b> since then <b>I would be</b> active <b>“as the briers and thorns</b> in flame! I would with one step burn it altogether. ”"
        },
        {
          "verseLocation": "Nahum 1:3",
          "verseText": "and the clouds are the dust of His feet”",
          "talmudLocation": "Chullin 91a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chullin/91a#section-18",
          "talmudFullText": "The Talmud asks: <b>And the Rabbis, what do they derive</b> from <b>this</b> phrase: <b>“As he wrestled with him”</b> (Genesis 32:26)? The Talmud answers: They <b>require it for the other</b> interpretation <b>of R' Yehoshua ben Levi, as R' Yehoshua ben Levi said: </b> This <b>teaches that the dust [<i>avak</i>] from their feet ascended to the throne of glory. It is written here: “As he wrestled [<i>behe’avko</i>] with him, ” and it is written there</b> in a description of how God will punish the wicked: “YHWH, in the whirlwind and in the storm is His way, <b>and the clouds are the dust of His feet”</b> (Nahum 1:3)."
        },
        {
          "verseLocation": "Nahum 1:4",
          "verseText": "Reish Lakish said: When the Holy One, Blessed be He, created the sea, it continued to expand until the Holy One, Blessed be He, rebuked it and made it dry, as it is stated: “He rebukes the sea and makes it dry, and desiccates all the rivers”",
          "talmudLocation": "Chagigah 12a:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/12a#section-15",
          "talmudFullText": "<b>And Rav Yehuda said</b> that <b>Rav said, </b> with regard to the same matter: <b>When God created the world, it continued to expand like two balls of a warp, </b> whose cord lengthens as they unravel, <b>until God rebuked it and made it stand still, as it is stated: “The pillars of heaven tremble and are astonished at His rebuke”</b> (Job 26:11). <b>And this is</b> the same as that which <b>Reish Lakish said: What is</b> the meaning of that <b>which is written: “I am God God</b> [<b><i>El Shaddai</i></b>]” (Genesis 17:1)? It means: <b>I am He Who said to the world “enough [dai], ”</b> instructing it to stop expanding. Similarly, <b>Reish Lakish said: When God created the sea, it continued to expand until God rebuked it and made it dry, as it is stated: “He rebukes the sea and makes it dry, and desiccates all the rivers”</b> (Nahum 1:4)."
        },
        {
          "verseLocation": "Nahum 1:4",
          "verseText": "withered, as it stated: “And the blossoms of Lebanon wither”",
          "talmudLocation": "Yoma 21b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/21b#section-2",
          "talmudFullText": "The Talmud asks: <b>And are there no more</b> miracles performed in the Temple? <b>But didn’t Rav Oshaya say: When Solomon built the Temple he planted all sorts of precious golden fruits there, and</b> these <b>brought forth their fruit in their</b> appointed <b>season</b> like other trees, <b>and when the wind blew them</b> the fruit <b>would fall, as it is stated: “May his fruits rustle like Lebanon”</b> (Psalms 72:16). This indicates that fruits grew in Lebanon, which the rabbis interpreted as a reference to the Temple, which was built with cedar trees from Lebanon. <b>And when the non-Jews entered the Sanctuary</b> the golden tree <b>withered, as it stated: “And the blossoms of Lebanon wither”</b> (Nahum 1:4). <b>And God will restore the</b> miraculous trees to Israel <b>in the future, as it is stated: “It shall blossom abundantly, it shall also rejoice and shout, the glory of Lebanon will be given to it”</b> (Isaiah 35:2). Apparently, there were additional miracles in the Temple."
        },
        {
          "verseLocation": "Nahum 1:4",
          "verseText": "withered, as it states “And the blossoms of Lebanon wither”",
          "talmudLocation": "Yoma 39b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yoma/39b#section-9",
          "talmudFullText": "<b>But once the</b> non-Jew <b>nations entered the Sanctuary</b> the golden trees <b>withered, as it states “And the blossoms of Lebanon wither”</b> (Nahum 1:4). <b>And in the future</b> hour of redemption, <b>God will restore</b> them <b>to us as it is stated: “It shall blossom abundantly, it shall also rejoice and shout, the glory of Lebanon will be given to it”</b> (Isaiah 35:2)."
        },
        {
          "verseLocation": "Nahum 1:6",
          "verseText": "and it is written: “Who can stand before His indignation?”",
          "talmudLocation": "Avodah Zarah 4a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/4a#section-18",
          "talmudFullText": "<b>Rav Pappa raises a contradiction</b> between the following verses. <b>It is written: “A God that has indignation every day”</b> (Psalms 7:12), and yet the world still exists, <b>and it is written: “Who can stand before His indignation? ”</b> (Nahum 1:6). The Talmud answers: This is <b>not difficult; here, </b> where the verse states that no one can stand before His indignation, it is referring <b>to an individual, </b> whereas <b>there, </b> when it is written that God is indignant every day, it is referring <b>to the community, </b> which can withstand the indignation of God, due to its cumulative merits."
        },
        {
          "verseLocation": "Nahum 1:9",
          "verseText": "that a gale force wind does not last two hours, to fulfill that which is stated: “Trouble shall not rise up a second time”",
          "talmudLocation": "Berakhot 59a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/59a#section-8",
          "talmudFullText": "We <b>also</b> learned in the Mishnah <b>that over wind</b> one recites the blessing: Whose strength and power fill the world. The Talmud asks: <b>What are</b> these <b>winds? Abaye said: </b> These are <b>gale force winds. Abaye said: We learned</b> through tradition <b>that there are no gale force winds at night. </b> The Talmud asks: <b>Don’t we see that there are</b> gale force winds at night? The Talmud answers: <b>This</b> gale force wind that blows at night does not begin blowing at night; rather, it <b>begins</b> blowing <b>during the day. And Abaye said: We learned</b> through tradition <b>that a gale force wind does not last two hours, to fulfill that which is stated: “Trouble shall not rise up a second time”</b> (Nahum 1:9). The Talmud asks: <b>Don’t we see that it does last</b> longer than two hours? The Talmud answers: Actually, it does not last longer than two hours. The fact that we sense that it does last longer is due to cases where it does not blow uninterruptedly, but <b>it</b> briefly <b>stops in between. </b>"
        },
        {
          "verseLocation": "Nahum 1:11",
          "verseText": "and likewise it says: “From you [ mimmekh ] he emerged, who devised evil against the Lord, an adviser of wickedness”",
          "talmudLocation": "Sanhedrin 87a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/87a#section-1",
          "talmudFullText": "it is <b>with regard to the most distinguished [<i>mufla</i>]</b> member <b>of the court, </b> an ordained, expert judge, that <b>the verse is speaking. “For you [<i>mimmekha</i>]”; this is</b> a reference to <b>an adviser, </b> who is consulted with regard to significant matters, e.g., intercalation of the year; <b>and likewise it says: “From you [<i>mimmekh</i>] he emerged, who devised evil against YHWH, an adviser of wickedness”</b> (Nahum 1:11). <b>“A matter”; this <i>halakha</i></b> transmitted to Moses from Sinai. <b>“In judgment”; this is a logical inference, </b> which is one of the hermeneutical principles."
        },
        {
          "verseLocation": "Nahum 1:12",
          "verseText": "which is written: “Thus says the Lord: Though they be in full strength [ shelemim ], and likewise many, even so shall they be cut down, and he shall pass away;",
          "talmudLocation": "Gittin 7a:20",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/7a#section-20",
          "talmudFullText": "The Talmud cites another statement by the same rabbis. <b>Rav Avira interpreted</b> a verse <b>homiletically. Sometimes he would say it in the name of Rav Ami, and sometimes he would say it in the name of Rav Asi: What</b> is the meaning of that <b>which is written: “Thus says YHWH: Though they be in full strength [<i>shelemim</i>], and likewise many, even so shall they be cut down, and he shall pass away; </b> and though I have afflicted you, I will afflict you no more” (Nahum 1:12). This means: <b>If a person sees that his sustenance is limited he should use it for charity, and all the more so when it is plentiful. </b> In other words, if his livelihood has finished [<i>nishlam</i>] he should perform charity, and he should certainly act in this manner if his means are plentiful."
        },
        {
          "verseLocation": "Nahum 1:12",
          "verseText": "“And though I have afflicted you [ ve’innitikh ]”",
          "talmudLocation": "Gittin 7b:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/gittin/7b#section-1",
          "talmudFullText": "The Talmud addresses the continuation of the verse: <b>“And though I have afflicted you [<i>ve’innitikh</i>]”</b> (Nahum 1:12). <b>Mar Zutra says: </b> This means that <b>even a poor person [<i>ani</i>] who is sustained from charity</b> must also <b>perform charity. </b> With regard to the expression: <b>“And I will afflict you [<i>a’anekh</i>] no more, ” Rav Yosef teaches: </b> This means that if he gives charity to others, God <b>will no longer show him signs of poverty [<i>aniyyut</i>]. </b>"
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Nahum 2:13",
          "verseText": "But isn’t it written: “The lion tears apart for its young,",
          "talmudLocation": "Bava Kamma 16b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/16b#section-5",
          "talmudFullText": "The Talmud asks: <b>Is this to say that tearing apart</b> its prey <b>is not the</b> typical <b>manner of</b> a lion? <b>But isn’t it written: “The lion tears apart for its young, </b> and it strangles for its lionesses, and it fills its caves with prey, and its den with that which was torn apart” (Nahum 2:13). The description in the verse clearly indicates that it is the typical manner of a lion to tear apart its prey. The Talmud answers that each phrase of this verse is referring not to a situation where the lion catches prey for its own immediate use, but to one where it provides food <b>for its young, </b> as it says: “The lion tears apart for its young”; to provide food <b>for its lionesses: “And it strangles for its lionesses”; </b> to provide food <b>for</b> the young cubs in <b>its lair: “And it filled its lair with prey”; </b> and to provide food <b>for</b> the young cubs in <b>its den: “And its den with that which was torn apart. ”</b> Therefore, we cannot learn from this verse that it is the typical manner of a lion to tear apart prey for its own immediate use."
        }
      ]
    }
  ]
}