{
  "bookName": "Obadiah",
  "totalEntries": 7,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Obadiah 1:1",
          "verseText": "“The vision of Obadiah. So says the Lord God concerning Edom:",
          "talmudLocation": "Sanhedrin 39b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/39b#section-14",
          "talmudFullText": "The verse states: <b>“The vision of Obadiah. So says YHWH God concerning Edom: </b> We have heard a message from YHWH, and an ambassador is sent among the nations: Arise, and let us rise up against her in battle” (Obadiah 1:1). The Talmud asks: <b>What is different, </b> i.e., what is the reason, that specifically <b>Obadiah</b> prophesied <b>concerning Edom? </b>"
        },
        {
          "verseLocation": "Obadiah 1:2",
          "verseText": "“Behold, I made you small among the nations”",
          "talmudLocation": "Avodah Zarah 10a:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/10a#section-10",
          "talmudFullText": "The Talmud asks: <b>And do</b> the Romans actually <b>appoint</b> as <b>king the son of the king? But didn’t Rav Yosef teach: </b> The verse relating a prophesy about Edom, associated with the Roman Empire: <b>“Behold, I made you small among the nations”</b> (Obadiah 1:2), is a reference to the fact <b>that</b> the Romans <b>do not place</b> on the throne as <b>king the son of the king. </b> The continuation of the verse: <b>“You are greatly despised, ”</b> is a reference to the fact <b>that</b> the Romans <b>have neither</b> their own <b>script nor</b> their own <b>language, </b> but use those of other nations. The Talmud therefore rejects the explanation of the <i>baraita</i> that distinguishes between coronation of a king and coronation of the king’s son: <b>Rather, what is the day of <i>geinuseya</i>? </b> It is <b>the</b> king’s <b>birthday. </b>"
        },
        {
          "verseLocation": "Obadiah 1:3",
          "verseText": "Obadiah said: “The pride of your heart has beguiled you”",
          "talmudLocation": "Sanhedrin 89a:18",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/89a#section-18",
          "talmudFullText": "An example of identical content expressed in different styles is the prophecy where <b>Obadiah said: “The pride of your heart has beguiled you”</b> (Obadiah 1:3), and <b>Jeremiah said</b> a similar message employing slightly different language: <b>“Your terribleness has deceived you, even the pride of your heart”</b> (Jeremiah 49:16). <b>And</b> with regard to <b>these</b> false prophets, <b>from</b> the fact <b>that</b> in their case <b>all</b> the prophets <b>are saying</b> their prophecies <b>like each other, </b> i.e., employing an identical style, <b>conclude from it</b> that <b>they are saying nothing</b> of substance and that it is a false prophecy."
        },
        {
          "verseLocation": "Obadiah 1:6",
          "verseText": "Eating, as it is written: “How is Esau searched out [ neḥpesu ]; how are his hidden places revealed [ nivu ]”",
          "talmudLocation": "Bava Kamma 3b:15",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20kamma/3b#section-15",
          "talmudFullText": "<b>And Shmuel says: <i>Maveh</i>, this is the</b> category of <b>Eating, as it is written: “How is Esau searched out [<i>neḥpesu</i>]; how are his hidden places revealed [<i>nivu</i>]”</b> (Obadiah 1:6)? The terms <i>nivu</i> and <i>maveh</i> share a common root. The Talmud asks: <b>From where may</b> it <b>be inferred</b> that <i>nivu</i> connotes Eating? The Talmud explains that it is <b>as Rav Yosef translates</b> the verse into Aramaic: <b>How is Esau searched out [<i>itbelish</i>]; how are his hidden places revealed [<i>itgaleyan</i>]? </b> The meaning of the Aramaic term <i>itgaleyan</i> means revealed, and that is the meaning of the Hebrew term “<i>nivu</i>. ” <i>Maveh</i> references the animal’s teeth, which are covered when its mouth is closed and revealed when it eats."
        },
        {
          "verseLocation": "Obadiah 1:7",
          "verseText": "anyone who gives his bread to one without knowledge, afflictions befall him, as it is stated: “They who eat your bread will place mazor under you, in whom there is no discernment”",
          "talmudLocation": "Sanhedrin 92a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/92a#section-13",
          "talmudFullText": "<b>And R' Elazar says: </b> With regard to <b>anyone who gives his bread to one without knowledge, afflictions befall him, as it is stated: “They who eat your bread will place <i>mazor</i> under you, in whom there is no discernment”</b> (Obadiah 1:7). <b>And <i>mazor</i></b> means <b>nothing other than afflictions, </b> based on the parallel with another verse, <b>as it is stated: “And Ephraim saw his sickness and Judah his wound [<i>mezoro</i>]”</b> (Hosea 5:13). This indicates that one who gives his bread to one without discernment will ultimately fall ill."
        },
        {
          "verseLocation": "Obadiah 1:18",
          "verseText": "said to him: But isn’t it written: “And there shall not be any remaining of the house of Esau”",
          "talmudLocation": "Avodah Zarah 10b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/avodah%20zarah/10b#section-8",
          "talmudFullText": "On another occasion, Antoninus <b>said to</b> R' Yehuda HaNasi: Will <b>I enter the World-to-Come? </b> R' Yehuda HaNasi <b>said to him: Yes. </b> Antoninus <b>said to him: But isn’t it written: “And there shall not be any remaining of the house of Esau”</b> (Obadiah 1:18)? R' Yehuda HaNasi answered: The verse is stated <b>with regard to</b> those who <b>perform actions</b> similar to those <b>of</b> the wicked <b>Esau, </b> not to people like you."
        },
        {
          "verseLocation": "Obadiah 1:18",
          "verseText": "delivered only to the hand of the descendants of Joseph, as it is stated: “And the house of Jacob shall be a fire, and the house of Joseph a flame, and the house of Esau for straw,",
          "talmudLocation": "Bava Batra 123b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/123b#section-2",
          "talmudFullText": "§ <b>R' Ḥelbo asked R' Shmuel bar Naḥmani: It is written: “And it came to pass, when Rachel gave birth to Joseph, </b> that Jacob said to Laban: Send me away, that I may go to my own place, and to my country” (Genesis 30:25). <b>What was different when Joseph was born, </b> that Jacob decided only then to return home? R' Shmuel bar Naḥmani <b>said to him: Jacob our patriarch saw</b> prophetically <b>that the descendants of Esau</b> will be <b>delivered only to the hand of the descendants of Joseph, as it is stated: “And the house of Jacob shall be a fire, and the house of Joseph a flame, and the house of Esau for straw, </b> and they shall kindle in them, and devour them” (Obadiah 1:18). Jacob had left Eretz Yisrael to escape Esau, but he now felt confident that he could return without endangering his family."
        }
      ]
    }
  ]
}