{
  "bookName": "Ruth",
  "totalEntries": 39,
  "chapters": [
    {
      "chapterNumber": 1,
      "citations": [
        {
          "verseLocation": "Ruth 1:1",
          "verseText": "which is written: “And it happened in the days of the judging of the Judges”",
          "talmudLocation": "Bava Batra 15b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/15b#section-10",
          "talmudFullText": "<b>And</b> further, with regard to R' Elazar’s statement in the <i>baraita</i> that the generation of the judging of the Judges was one of vanity, <b>R' Yoḥanan says: What</b> is the meaning of that <b>which is written: “And it happened in the days of the judging of the Judges”</b> (Ruth 1:1)? This indicates <b>a generation that judged its judges. </b> If a judge would <b>say to</b> the defendant standing before him: <b>Remove the splinter from between your eyes, </b> meaning rid yourself of some minor infraction, the defendant would <b>say to him: Remove the beam from between your eyes, </b> meaning you have committed far more severe sins. If the judge would <b>say to him: “Your silver is become dross”</b> (Isaiah 1:22), meaning your coins are counterfeit, the defendant would <b>say to him: “Your wine is mixed with water”</b> (Isaiah 1:22), meaning you yourself dilute your wine with water and sell it. Since nobody behaved in proper manner, the judges were unable to judge."
        },
        {
          "verseLocation": "Ruth 1:1",
          "verseText": "was Haman. “And it came to pass [ vayhi ] in the days when the judges ruled”",
          "talmudLocation": "Megillah 10b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/megillah/10b#section-5",
          "talmudFullText": "The Talmud cites several proofs corroborating this interpretation. <b>“And it came to pass [<i>vayhi</i>] in the days of Ahasuerus”</b> led to grief, as there <b>was Haman. “And it came to pass [<i>vayhi</i>] in the days when the judges ruled”</b> (Ruth 1:1) introduces a period when there <b>was famine. “And it came to pass [<i>vayhi</i>], when men began to multiply”</b> (Genesis 6:1) is immediately followed by the verse: <b>“And YHWH saw that the wickedness of man was great in the earth”</b> (Genesis 6:5)."
        },
        {
          "verseLocation": "Ruth 1:2",
          "verseText": "It is written: “Mahlon and Chilion”",
          "talmudLocation": "Bava Batra 91b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/91b#section-7",
          "talmudFullText": "The Talmud returns to its discussion of the story of Ruth. <b>It is written: “Mahlon and Chilion”</b> (Ruth 1:2), <b>and it is written</b> elsewhere: <b>“Joash and Saraph, </b> who had dominion in Moab” (I Chronicles 4:22). Apparently, both names refer to the same individuals who married Moabite wives. <b>Rav and Shmuel</b> disagreed with regard to their true names. <b>One says: Their</b> given <b>names were Mahlon and Chilion, and why were they called</b> by the <b>names Saraph and Joash? </b> One was called <b>Joash [<i>yoash</i>] because they despaired [<i>nitya’ashu</i>] of the redemption</b> of Eretz Yisrael, as they established themselves in Moab and lived there for many years. The other was called <b>Saraph, because they were liable</b> to receive the punishment of <b>burning [<i>sereifa</i>] for</b> their sins against <b>God, </b> because they left their community."
        },
        {
          "verseLocation": "Ruth 1:3",
          "verseText": "each one [ ish ]",
          "talmudLocation": "Bava Batra 113a:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/113a#section-3",
          "talmudFullText": "The Talmud comments: <b>In any event, </b> according to <b>everyone, </b> i.e., according to both <i>baraitot</i>, the phrase in <b>the verse “from one tribe to another tribe” speaks of</b> the <b>transfer</b> of the inheritance <b>by means of the husband. </b> The Talmud asks: <b>From where</b> is this <b>inferred? </b> The Talmud supplies <b>a mnemonic. Rabba bar Rav Sheila said</b> that the latter part of <b>the verse states: </b> “So shall no inheritance transfer from one tribe to another tribe; for the tribes of the children of Israel shall cleave <b>each one [<i>ish</i>]</b> to its own inheritance,” alluding to the transfer by means of the husband, as the word “<i>ish</i>” means husband, in the context of: “Elimelech the husband [<i>ish</i>] of Naomi” (Ruth 1:3). The Talmud asks: But the word <b>“<i>ish</i>” is written in both of</b> the verses. Therefore, both verses should be interpreted with regard to the transfer of the inheritance by means of the husband."
        },
        {
          "verseLocation": "Ruth 1:3",
          "verseText": "and a woman dies only to her husband. A man dies only to his wife, as it is stated: “And Elimelech, Naomi’s husband, died”",
          "talmudLocation": "Sanhedrin 22b:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/22b#section-4",
          "talmudFullText": "It is <b>taught</b> in a <i>baraita</i>: <b>A man dies only to his wife, </b> i.e., it is primarily she who suffers the pain and sadness resulting from his death, <b>and a woman dies only to her husband. A man dies only to his wife, as it is stated: “And Elimelech, Naomi’s husband, died”</b> (Ruth 1:3), <b>and a woman dies only to her husband, as it is stated</b> in Jacob’s parting words to Joseph: <b>“And as for me, when I came from Paddan, Rachel died on me”</b> (Genesis 48:7)."
        },
        {
          "verseLocation": "Ruth 1:4",
          "verseText": "it is written: “Orpah”",
          "talmudLocation": "Sotah 42b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-7",
          "talmudFullText": "<b>It is written</b> that Goliath’s mother was: <b>“Harafa”</b> (II Samuel 21:16), <b>and</b> in another place <b>it is written: “Orpah”</b> (Ruth 1:4), and the Talmud will soon explain that this was the same woman. <b>Rav and Shmuel</b> engaged in a dispute concerning this matter. <b>One</b> of them <b>said: Her name was Harafa, and why is she called</b> by the <b>name Orpah? </b> It is <b>because everyone came at her from behind [<i>orfin</i>] her, </b> i.e., sodomized her. <b>And one</b> of them <b>said: Her name was Orpah, and why is she called</b> by the <b>name Harafa? </b> It is <b>because everyone threshed her like groats [<i>harifot</i>], </b> i.e., had sex with her, <b>and so it says</b> that this word means groats: <b>“And the woman took and spread the covering over the well’s mouth, and strewed groats [<i>harifot</i>] thereon”</b> (II Samuel 17:19). <b>And if you wish, </b> you can <b>say from here: “Though you should crush a fool in a mortar with a pestle among groats [<i>harifot</i>], </b> yet will not his foolishness depart from him” (Proverbs 27:22)."
        },
        {
          "verseLocation": "Ruth 1:13",
          "verseText": "it states: “Would you tarry for them until they were grown? Would you shut yourselves off for them [ te’agena ] and have no husbands?”",
          "talmudLocation": "Bava Batra 73a:4",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/73a#section-4",
          "talmudFullText": "<strong>Talmud: </strong> The <b><i>toren</i></b> is the <b>mast [<i>iskarya</i>]. And</b> in this regard <b>it states: “They have taken cedars from Lebanon to make masts [<i>toren</i>] for you”</b> (Ezekiel 27:5). The <b><i>nes</i></b> is the <b>sail, and</b> in this regard <b>it states: “Of fine linen with richly woven work from Egypt was your sail, that it might be to you for an ensign [<i>nes</i>]”</b> (Ezekiel 27:7). With regard to the meaning of <b><i>ogin</i>, R' Ḥiyya teaches: These are</b> the ship’s <b>anchors, and</b> so <b>it states: “Would you tarry for them until they were grown? Would you shut yourselves off for them [<i>te’agena</i>] and have no husbands? ”</b> (Ruth 1:13). This demonstrates that the root <i>ayin</i>, <i>gimmel</i>, <i>nun</i>, means being shut up and held firmly in one place."
        },
        {
          "verseLocation": "Ruth 1:14",
          "verseText": "And was it Boaz’s habit to cling to women? Rabbi Elazar said: Since he saw “And Orpah kissed her mother-in-law and Ruth clung to her”",
          "talmudLocation": "Shabbat 113b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/113b#section-8",
          "talmudFullText": "<b>It was taught in a <i>baraita</i>: He saw a matter of modesty in her</b> when she was collecting stalks. She picked stalks that were <b>upright</b> while she was <b>standing, </b> and stalks that had <b>fallen</b> she picked while <b>sitting; </b> due to her modesty she did not bend over to take them. It also says: “And Boaz said to Ruth: Do you hear, my daughter? Do not go to glean in another field and do not leave from here, <b>but cling to my maidens”</b> (Ruth 2:8). This is also surprising. <b>And was it Boaz’s habit to cling to women? R' Elazar said: Since he saw “And Orpah kissed her mother-in-law and Ruth clung to her”</b> (Ruth 1:14), <b>he said: It is permitted to cling to</b> a woman like this."
        },
        {
          "verseLocation": "Ruth 1:14",
          "verseText": "as it is written: “And Orpah kissed her mother-in-law, and Ruth cleaved to her”",
          "talmudLocation": "Sotah 42b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sotah/42b#section-9",
          "talmudFullText": "It says: <b>“And they fell into the hands of David and his servants. ”</b> Why? It is because of the acts of their forebears, <b>as it is written: “And Orpah kissed her mother-in-law, and Ruth cleaved to her”</b> (Ruth 1:14). <b>R' Yitzḥak says: God said: The children of the one who kissed, </b> referring to the four giants descended from Orpah, <b>will come and fall into the hand of the children of the one who cleaved, </b> referring to David, who was descended from Ruth. <b>Rava taught: As a reward for the four tears that Orpah shed</b> in sadness <b>over her mother-in-law, she merited four mighty warriors descended from her, as it is stated: “And they lifted up their voice and wept again”</b> (Ruth 1:14)."
        },
        {
          "verseLocation": "Ruth 1:16",
          "verseText": "“Where you go, I shall go”",
          "talmudLocation": "Yevamot 47b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/47b#section-8",
          "talmudFullText": "The Talmud reconstructs the original dialogue in which Naomi attempted to dissuade Ruth from converting: Naomi <b>said to her: </b> On Shabbat, <b>it is prohibited for us</b> to go beyond <b>the Shabbat limit. </b> Ruth responded: <b>“Where you go, I shall go”</b> (Ruth 1:16), and no further. Naomi said to her: <b>It is forbidden for us to be alone together</b> with a man with whom it is forbidden to engage in sex. Ruth responded: <b>“Where you lodge, I shall lodge”</b> (Ruth 1:16), and in the same manner."
        },
        {
          "verseLocation": "Ruth 1:16",
          "verseText": "“Your people are my people”",
          "talmudLocation": "Yevamot 47b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/47b#section-9",
          "talmudFullText": "Naomi said to her: <b>We are commanded</b> to observe <b>six hundred and thirteen mitzvot. </b> Ruth responded: <b>“Your people are my people”</b> (Ruth 1:16). Naomi said to her: <b>Idolatrous worship is forbidden to us. </b> Ruth responded: <b>“Your God is my God”</b> (Ruth 1:16). Naomi said to her: <b>Four types of capital punishment were handed over to a court</b> with which to punish those who transgress the mitzvot. Ruth responded: <b>“Where you die, I shall die”</b> (Ruth 1:17). Naomi said to her: <b>Two burial grounds were handed over to the court, </b> one for those executed for more severe crimes and another for those executed for less severe crimes. Ruth responded: <b>“And there I shall be buried”</b> (Ruth 1:17)."
        },
        {
          "verseLocation": "Ruth 1:17",
          "verseText": "“Where you die, I shall die”",
          "talmudLocation": "Yevamot 47b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/47b#section-9",
          "talmudFullText": "Naomi said to her: <b>We are commanded</b> to observe <b>six hundred and thirteen mitzvot. </b> Ruth responded: <b>“Your people are my people”</b> (Ruth 1:16). Naomi said to her: <b>Idolatrous worship is forbidden to us. </b> Ruth responded: <b>“Your God is my God”</b> (Ruth 1:16). Naomi said to her: <b>Four types of capital punishment were handed over to a court</b> with which to punish those who transgress the mitzvot. Ruth responded: <b>“Where you die, I shall die”</b> (Ruth 1:17). Naomi said to her: <b>Two burial grounds were handed over to the court, </b> one for those executed for more severe crimes and another for those executed for less severe crimes. Ruth responded: <b>“And there I shall be buried”</b> (Ruth 1:17)."
        },
        {
          "verseLocation": "Ruth 1:18",
          "verseText": "“And when she saw that she was steadfastly minded",
          "talmudLocation": "Yevamot 47b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/47b#section-10",
          "talmudFullText": "<b>Immediately</b> following this dialogue, the verse states: <b>“And when she saw that she was steadfastly minded</b> she left off speaking with her” (Ruth 1:18). Once Naomi saw Ruth’s resolve to convert, she desisted from her attempts to dissuade her."
        },
        {
          "verseLocation": "Ruth 1:18",
          "verseText": "As it is written: “And when she saw that she was steadfastly minded to go with her, she left off speaking with her”",
          "talmudLocation": "Yevamot 47b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/47b#section-7",
          "talmudFullText": "The <i>baraita</i> continues: <b>And they inform him</b> of <b>the sin</b> of neglecting the mitzva to allow the poor to take <b>gleanings, forgotten sheaves, and</b> produce in the <b>corner</b> of one’s field. <b>And they do not overwhelm him</b> with threats, <b>and they are not exacting with him</b> about the details of the mitzvot, i.e., the court should not overly dissuade the convert from converting. <b>R' Elazar said: What is the verse</b> from which this ruling is derived? <b>As it is written: “And when she saw that she was steadfastly minded to go with her, she left off speaking with her”</b> (Ruth 1:18). When Naomi set out to return to Eretz Yisrael, Ruth insisted on joining her. The Talmud understands this to mean that Ruth wished to convert. Naomi attempted to dissuade her, but Ruth persisted. The verse states that once Naomi saw Ruth’s resolve to convert, she desisted from her attempts to dissuade her. The Talmud infers from here that the same approach should be taken by a court in all cases of conversion."
        },
        {
          "verseLocation": "Ruth 1:19",
          "verseText": "“And all the city was astir concerning them, and the women said: Is this Naomi?”",
          "talmudLocation": "Bava Batra 91a:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/91a#section-8",
          "talmudFullText": "<b>And R' Shimon ben Yoḥai would likewise say: Elimelech</b> and his sons <b>Mahlon and Chilion were prominent</b> members <b>of</b> their <b>generation and were leaders of</b> their <b>generation. And for what</b> reason <b>were they punished? </b> They were punished <b>because they left Eretz</b> Yisrael <b>to</b> go <b>outside of Eretz</b> Yisrael, <b>as it is stated</b> concerning Naomi and Ruth: <b>“And all the city was astir concerning them, and the women said: Is this Naomi? ”</b> (Ruth 1:19). The Talmud asks: <b>What</b> is the meaning of the phrase: <b>“Is this Naomi”? </b> How does this indicate that her husband and sons were punished for leaving Eretz Yisrael? <b>R' Yitzḥak says</b> that the women <b>said: Have you seen what befell Naomi, who left Eretz</b> Yisrael <b>for outside of Eretz</b> Yisrael? Not only did she not escape tribulations there, but she lost her status entirely."
        }
      ]
    },
    {
      "chapterNumber": 2,
      "citations": [
        {
          "verseLocation": "Ruth 2:3",
          "verseText": "“And she went, and she came, and she collected in the field",
          "talmudLocation": "Shabbat 113b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/113b#section-7",
          "talmudFullText": "And the verse in Ruth states: <b>“And she went, and she came, and she collected in the field</b> after the harvesters” (Ruth 2:3). <b>R' Elazar said: </b> This verse teaches <b>that she went and came, went and came, until she found suitable people with whom to walk. </b> It also says: <b>“And Boaz said to his youth who was standing over the harvesters: To whom does this young woman belong? ”</b> (Ruth 2:5). This is surprising: <b>And was it Boaz’s habit to inquire about a young woman? R' Elazar said: He saw in her a matter of wisdom</b> and Torah, and that is why he asked about her. What he saw was that <b>she collected two stalks, </b> but <b>she did not collect three stalks. </b> She thereby acted in accordance with the <i>halakha</i> that three stalks lying together are not considered to be gleanings left for the poor; rather, they remain in the possession of the owner of the field."
        },
        {
          "verseLocation": "Ruth 2:4",
          "verseText": "as it is stated: “And presently Boaz came from Bethlehem and said to the harvesters, The Lord is with you, and they said to him, May the Lord bless you”",
          "talmudLocation": "Berakhot 54a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/berakhot/54a#section-9",
          "talmudFullText": "The rabbis also <b>instituted that one should greet another in the name</b> of God, i.e., one should mention God’s name in his greeting, <b>as it is stated: “And presently Boaz came from Bethlehem and said to the harvesters, YHWH is with you, and they said to him, May YHWH bless you”</b> (Ruth 2:4). <b>And it says: </b> “And the angel of God appeared to him <b>and said to him, God is with you, mighty man of valor”</b> (Judges 6:12). <b>And it says: “And despise not your mother when she is old”</b> (Proverbs 23:22), i.e., one must not neglect customs which he inherits. <b>And</b> lest you say that mentioning God’s name is prohibited, <b>it says: “It is time to work for YHWH; they have made void Your Torah”</b> (Psalms 119:126), i.e., it is occasionally necessary to negate biblical precepts in order to perform God’s will, and greeting another is certainly God’s will. <b>R' Natan says</b> another interpretation of the verse: <b>“Make void Your Torah” because “it is the time to work for YHWH, ”</b> i.e., occasionally it is necessary to negate biblical precepts in order to bolster the Torah."
        },
        {
          "verseLocation": "Ruth 2:4",
          "verseText": "as it is written: “And presently Boaz came from Bethlehem and said to the harvesters: The Lord is with you, and they said to him: May the Lord bless you”",
          "talmudLocation": "Makkot 23b:10",
          "talmudLocationUrl": "https://chavrutai.com/tractate/makkot/23b#section-10",
          "talmudFullText": "<b>And greeting</b> another with the name of God is derived from a verse, <b>as it is written: “And presently Boaz came from Bethlehem and said to the harvesters: YHWH is with you, and they said to him: May YHWH bless you”</b> (Ruth 2:4). <b>And it states: </b> “And the angel of YHWH appeared to him and said to him: <b>YHWH is with you, mighty man of valor”</b> (Judges 6:12). The Talmud asks: <b>What</b> is the reason that the Talmud cites the additional source about Gideon, introduced with the phrase: <b>And it states? </b> Why was the proof from Boaz’s statement to the harvesters insufficient? The Talmud explains: <b>And if you would say: It is Boaz who did</b> so <b>on his own, and from Heaven they did not agree with him; come</b> and <b>hear</b> proof, <b>and it says: “YHWH is with you, mighty man of valor. ”</b> The angel greeted Gideon with the name of God, indicating that there is agreement in Heaven that this is an acceptable form of greeting."
        },
        {
          "verseLocation": "Ruth 2:5",
          "verseText": "“And Boaz said to his youth who was standing over the harvesters: To whom does this young woman belong?”",
          "talmudLocation": "Shabbat 113b:7",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/113b#section-7",
          "talmudFullText": "And the verse in Ruth states: <b>“And she went, and she came, and she collected in the field</b> after the harvesters” (Ruth 2:3). <b>R' Elazar said: </b> This verse teaches <b>that she went and came, went and came, until she found suitable people with whom to walk. </b> It also says: <b>“And Boaz said to his youth who was standing over the harvesters: To whom does this young woman belong? ”</b> (Ruth 2:5). This is surprising: <b>And was it Boaz’s habit to inquire about a young woman? R' Elazar said: He saw in her a matter of wisdom</b> and Torah, and that is why he asked about her. What he saw was that <b>she collected two stalks, </b> but <b>she did not collect three stalks. </b> She thereby acted in accordance with the <i>halakha</i> that three stalks lying together are not considered to be gleanings left for the poor; rather, they remain in the possession of the owner of the field."
        },
        {
          "verseLocation": "Ruth 2:8",
          "verseText": "but cling to my maidens”",
          "talmudLocation": "Shabbat 113b:8",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/113b#section-8",
          "talmudFullText": "<b>It was taught in a <i>baraita</i>: He saw a matter of modesty in her</b> when she was collecting stalks. She picked stalks that were <b>upright</b> while she was <b>standing, </b> and stalks that had <b>fallen</b> she picked while <b>sitting; </b> due to her modesty she did not bend over to take them. It also says: “And Boaz said to Ruth: Do you hear, my daughter? Do not go to glean in another field and do not leave from here, <b>but cling to my maidens”</b> (Ruth 2:8). This is also surprising. <b>And was it Boaz’s habit to cling to women? R' Elazar said: Since he saw “And Orpah kissed her mother-in-law and Ruth clung to her”</b> (Ruth 1:14), <b>he said: It is permitted to cling to</b> a woman like this."
        },
        {
          "verseLocation": "Ruth 2:11",
          "verseText": "been told me,",
          "talmudLocation": "Nedarim 37b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/37b#section-9",
          "talmudFullText": "Words that are <b>read but not written</b> are included in the <i>halakha</i> transmitted to Moses from Sinai. For example, the word <b>“Euphrates” that</b> is in the phrase <b>“as he went</b> to establish his control over the river Euphrates” (II Samuel 8:3) is not written in the text of the Bible. The same is true for the word <b>“man” that</b> is in the verse “now the counsel of Ahithophel, which he counseled in those days, <b>was as if a man inquired of the word of God”</b> (II Samuel 16:23); and for the word <b>“come” that</b> is in the verse “behold, the days come, says YHWH, that the city <b>shall be built</b> to YHWH from the tower of Hananel unto the gate of the corner” (Jeremiah 31:37); and for <b>“her” that</b> is in the phrase “let her not have <b>escape”</b> (Jeremiah 50:29); <b>unto that</b> is in the verse “it has <b>been told me, </b> all that you have done unto your mother-in-law” (Ruth 2:11); and for <b>“to me” that</b> is found in the passage “and she said unto her: All that you say to me I will do. And she went down to <b>the threshing floor”</b> (Ruth 3:4–5); and for <b>“to me” that</b> is in the verse “he gave me these six measures of <b>barley; </b> for he said to me” (Ruth 3:17). <b>These</b> words <b>are read but not written. </b>"
        },
        {
          "verseLocation": "Ruth 2:12",
          "verseText": "you have come to take refuge”",
          "talmudLocation": "Yevamot 48b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/yevamot/48b#section-16",
          "talmudFullText": "<b>Others say: </b> It is <b>because they waited before entering under the wings of the Shekhina, </b> i.e., they are punished for not converting sooner than they did. <b>R' Abbahu said, and some say</b> it was <b>R' Ḥanina</b> who said: <b>What is the verse</b> from which it is derived that one should convert at the earliest opportunity? Boaz said to Ruth: <b>“YHWH shall recompense your work, and your reward shall be complete from YHWH, the God of Israel, </b> under whose wings <b>you have come to take refuge”</b> (Ruth 2:12)."
        },
        {
          "verseLocation": "Ruth 2:14",
          "verseText": "And similarly it states: “And he pinched [ vayitzbat ] some parched corn for her”",
          "talmudLocation": "Chagigah 22b:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/chagigah/22b#section-16",
          "talmudFullText": "§ The Mishnah teaches: <b>And its place for gripping. </b> The Talmud asks: <b>What is</b> the meaning of: <b>Place for gripping [<i>beit hatzevita</i>]? Rav Yehuda said</b> that <b>Shmuel said: </b> It is the <b>place</b> where <b>he</b> grips the vessel in order to <b>pass [<i>tzovet</i>]</b> it, a kind of indentation used for grasping the vessel. <b>And similarly it states: “And he pinched [<i>vayitzbat</i>] some parched corn for her”</b> (Ruth 2:14), which means that he gave her a little of the corn. Therefore, the term is referring to a place on the vessel used to grasp it. <b>R' Asi</b> said that <b>R' Yoḥanan said: </b> It is the <b>place that fastidious people</b> use for <b>dipping. </b> A small receptacle for spices and the like would be attached to the sides of vessels for dipping one’s food."
        },
        {
          "verseLocation": "Ruth 2:14",
          "verseText": "“And Boaz said to her at mealtime: Come here [ halom ]",
          "talmudLocation": "Shabbat 113b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/113b#section-9",
          "talmudFullText": "It also says: <b>“And Boaz said to her at mealtime: Come here [<i>halom</i>]</b> and eat from the bread and dip your bread in vinegar. And she sat beside the harvesters and he gave her roasted grain and she ate, and she was satiated, and she left some over” (Ruth 2:14). <b>R' Elazar</b> interpreted this and <b>said</b> that <b>he hinted to her</b> prophetically: <b>In the future the kingdom of David will come from you, as it is written with regard to it, </b> i.e., the kingdom of David: <b>“Here, ” as it is stated: “And King David came and sat before God and said: Who am I, Lord, God, and who is my family that You have brought me to here [<i>halom</i>]? ”</b> (II Samuel 7:18). With regard to his saying: <b>“And dip your bread in vinegar”</b> (Ruth 2:14), <b>R' Elazar said: From here</b> we see <b>that vinegar</b> is <b>good</b> to have <b>in hot weather. </b>"
        }
      ]
    },
    {
      "chapterNumber": 3,
      "citations": [
        {
          "verseLocation": "Ruth 3:3",
          "verseText": "“And you shall bathe, and anoint yourself, and put on your robes,",
          "talmudLocation": "Shabbat 113b:5",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/113b#section-5",
          "talmudFullText": "The Talmud continues to discuss Shabbat. Naomi advised Ruth: <b>“And you shall bathe, and anoint yourself, and put on your robes, </b> and go down to the threshing floor. Do not make yourself known to the man until he has finished eating and drinking” (Ruth 3:3). <b>R' Elazar said: These</b> robes <b>are Shabbat garments</b> that Naomi told her to wear in honor of the occasion. Apropos the book of Ruth, the Talmud cites additional statements of R' Elazar with regard to Ruth: <b>“Give to the wise one and he will become wiser; </b> let the righteous one know and he will learn more” (Proverbs 9:9). <b>R' Elazar said: This</b> refers to <b>Ruth the Moabite and Samuel of Rama, </b> who received advice and added to it with their wisdom."
        },
        {
          "verseLocation": "Ruth 3:6",
          "verseText": "herself it is written, “And she went down to the threshing floor”",
          "talmudLocation": "Shabbat 113b:6",
          "talmudLocationUrl": "https://chavrutai.com/tractate/shabbat/113b#section-6",
          "talmudFullText": "The Talmud elaborates. <b>Whereas Naomi said to Ruth: “And you shall bathe, and anoint yourself, and put on your robes, and go down to the threshing floor, ” but with regard to</b> Ruth <b>herself it is written, “And she went down to the threshing floor”</b> (Ruth 3:6), <b>and</b> only <b>afterward does it say, “And she did according to all that her mother-in-law commanded her. ”</b> Ruth decided to anoint herself at the threshing floor and not on the road so that people would not meet her on the way there and suspect her of immorality. <b>Whereas Eli said to Samuel: </b> “Go and <b>lie down and if He calls you, you say: Speak, Lord, for Your servant is listening”</b> (I Samuel 3:9), <b>but with regard to</b> Samuel <b>himself it is written: “And YHWH came and stood, and He called like He did the other times: Samuel, Samuel. And Samuel said: Speak, for Your servant is listening”</b> (I Samuel 3:10), <b>and he did not say: Speak, Lord, </b> since he would not assume it was God speaking to him until he was sure of it."
        },
        {
          "verseLocation": "Ruth 3:8",
          "verseText": "“And it came to pass at midnight that the man was startled and turned himself,",
          "talmudLocation": "Sanhedrin 19b:21",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-21",
          "talmudFullText": "<b>R' Yoḥanan says: Joseph’s power</b> is the <b>humility of Boaz, </b> as Joseph is praised for showing strength with regard to an accomplishment that was insignificant for Boaz (see Genesis, chapter 39). Likewise, <b>Boaz’s power</b> is the <b>humility of Palti, son of Laish, </b> as Palti’s capacity for restraint was greater still. <b>Joseph’s power</b> is the <b>humility of Boaz, as it is written</b> about Boaz: <b>“And it came to pass at midnight that the man was startled and turned himself, </b> and behold, a woman lay at his feet” (Ruth 3:8). <b>What</b> is the meaning of <b>“and turned himself [<i>vayyilafet</i>]”? Rav says: </b> The meaning is <b>that his flesh became like the heads of turnips [<i>lefatot</i>], </b> his sexual organ hardening out of arousal, but even though Ruth was not married he refrained from having sex with her; while Joseph had to exert more effort, despite the fact that Potiphar’s wife was married."
        },
        {
          "verseLocation": "Ruth 3:12",
          "verseText": "a near kinsman”",
          "talmudLocation": "Nedarim 38a:1",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/38a#section-1",
          "talmudFullText": "The same is true for <b>“this” that</b> is in the verse “and this is <b>the mitzva”</b> (Deuteronomy 6:1); and for <b>“bend” that</b> is in the verse “let <b>the archer</b> bend his bow” (Jeremiah 51:3); and for <b>“five” that</b> is in the verse “and <b>the south side</b> four thousand and five hundred” (Ezekiel 48:16); and for <b>“if” that</b> is in the verse <b>“that</b> if I am <b>a near kinsman”</b> (Ruth 3:12). All <b>these are written but not read. </b>"
        },
        {
          "verseLocation": "Ruth 3:17",
          "verseText": "barley;",
          "talmudLocation": "Nedarim 37b:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/nedarim/37b#section-9",
          "talmudFullText": "Words that are <b>read but not written</b> are included in the <i>halakha</i> transmitted to Moses from Sinai. For example, the word <b>“Euphrates” that</b> is in the phrase <b>“as he went</b> to establish his control over the river Euphrates” (II Samuel 8:3) is not written in the text of the Bible. The same is true for the word <b>“man” that</b> is in the verse “now the counsel of Ahithophel, which he counseled in those days, <b>was as if a man inquired of the word of God”</b> (II Samuel 16:23); and for the word <b>“come” that</b> is in the verse “behold, the days come, says YHWH, that the city <b>shall be built</b> to YHWH from the tower of Hananel unto the gate of the corner” (Jeremiah 31:37); and for <b>“her” that</b> is in the phrase “let her not have <b>escape”</b> (Jeremiah 50:29); <b>unto that</b> is in the verse “it has <b>been told me, </b> all that you have done unto your mother-in-law” (Ruth 2:11); and for <b>“to me” that</b> is found in the passage “and she said unto her: All that you say to me I will do. And she went down to <b>the threshing floor”</b> (Ruth 3:4–5); and for <b>“to me” that</b> is in the verse “he gave me these six measures of <b>barley; </b> for he said to me” (Ruth 3:17). <b>These</b> words <b>are read but not written. </b>"
        },
        {
          "verseLocation": "Ruth 3:17",
          "verseText": "barley he gave me”",
          "talmudLocation": "Sanhedrin 93a:19",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/93a#section-19",
          "talmudFullText": "§ Apropos Hananiah, Mishael, and Azariah, the Talmud cites that which <b>R' Tanḥum says</b> that <b>bar Kappara taught in Tzippori: What</b> is the meaning of that <b>which is written</b> with regard to the statement of Ruth to Naomi concerning Boaz: <b>“These six</b> grains of <b>barley he gave me”</b> (Ruth 3:17). <b>What</b> is the meaning of the phrase <b>“six</b> grains of <b>barley”? If we say</b> that the reference is to <b>six actual</b> grains of <b>barley, is it the</b> typical <b>manner of Boaz to give</b> a minimal <b>gift of six</b> grains of <b>barley? </b>"
        }
      ]
    },
    {
      "chapterNumber": 4,
      "citations": [
        {
          "verseLocation": "Ruth 4:1",
          "verseText": "Salmon, and So-and-so,",
          "talmudLocation": "Bava Batra 91a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20batra/91a#section-13",
          "talmudFullText": "The Talmud provides <b>a mnemonic</b> for the ensuing statements that Rav Ḥanan bar Rava said that Rav said: <b>Melech; Abraham; ten years; when he died; and He alone was exalted. Rav Ḥanan bar Rava says</b> that <b>Rav says: </b> With regard to <b>Elimelech, and</b> Boaz’s father, <b>Salmon, and So-and-so, </b> the unnamed relative who was a closer relative to Elimelech than Boaz (Ruth 4:1), <b>and Naomi’s father, all of these are descendants of Nahshon, son of Amminadab, </b> the head of the tribe of Judah (see Ruth 4:20–21 and Numbers 2:3). The Talmud asks: <b>What is he teaching us</b> by this statement? He is teaching <b>that even</b> in the case of <b>one who has the merit of his ancestors</b> to protect him, this merit <b>does not stand for him when he leaves Eretz</b> Yisrael <b>to</b> go <b>outside of Eretz</b> Yisrael, as Elimelech died on account of this sin."
        },
        {
          "verseLocation": "Ruth 4:2",
          "verseText": "“And he took ten men of the Elders of the city and said: Sit you here, and they sat”",
          "talmudLocation": "Ketubot 7a:13",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/7a#section-13",
          "talmudFullText": "The Talmud asks: <b>And does a widower who married a widow not</b> require a benediction to be recited? <b>But didn’t Rav Naḥman say: Huna bar Natan said to me</b> that it was <b>taught: From where</b> is it derived <b>that the benediction of the grooms</b> is recited <b>in</b> a quorum of <b>ten</b> men? It <b>is as it is stated</b> with regard to Boaz, who married Ruth: <b>“And he took ten men of the Elders of the city and said: Sit you here, and they sat”</b> (Ruth 4:2). <b>And</b> when <b>Boaz</b> married Ruth, <b>he was a widower marrying a widow. </b> As that is the primary source for the obligation to recite the benediction, apparently the benediction is recited even in that case."
        },
        {
          "verseLocation": "Ruth 4:2",
          "verseText": "as it is stated: “And he took ten men of the Elders of the city and said: Sit you here,",
          "talmudLocation": "Ketubot 7b:3",
          "talmudLocationUrl": "https://chavrutai.com/tractate/ketubot/7b#section-3",
          "talmudFullText": "§ Apropos the source for the benediction of the grooms, the Talmud discusses <b>the</b> matter <b>itself. Rav Naḥman said: Huna bar Natan said to me</b> that it was <b>taught: From where</b> is it derived <b>that the benediction of the grooms</b> is recited <b>in</b> a quorum of <b>ten</b> men? It is <b>as it is stated: “And he took ten men of the Elders of the city and said: Sit you here, </b> and they sat” (Ruth 4:2). <b>And R' Abbahu said</b> that the source is <b>from here: “In assemblies [<i>mak’helot</i>], bless God, YHWH, from the source of Israel”</b> (Psalms 68:27). This verse indicates that a congregation [<i>kahal</i>], which contains at least ten men, blesses God when reciting a benediction related to the source of Israel, i.e., sex, which will lead to the birth of Jewish children."
        },
        {
          "verseLocation": "Ruth 4:7",
          "verseText": "“Now this was the custom in former time in Israel concerning redemption and concerning substitution, to confirm all matters; a man drew off his shoe, and gave it to his neighbor”",
          "talmudLocation": "Bava Metzia 47a:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/47a#section-14",
          "talmudFullText": "The Talmud comments: This dispute between Rav and Levi is <b>parallel to</b> a dispute between <b><i>tanna’im</i>. </b> The verse states: <b>“Now this was the custom in former time in Israel concerning redemption and concerning substitution, to confirm all matters; a man drew off his shoe, and gave it to his neighbor”</b> (Ruth 4:7). The verse is interpreted: <b>“Redemption”; that is a sale. And likewise it says: </b> “Neither shall be sold <b>nor shall be redeemed”</b> (Leviticus 27:28). <b>“Substitution”; that is</b> the transaction of <b>exchange. And likewise it says: “He may neither exchange it nor substitute it”</b> (Leviticus 27:10)."
        },
        {
          "verseLocation": "Ruth 4:7",
          "verseText": "of Rav Naḥman? The verse states: “His shoe”",
          "talmudLocation": "Bava Metzia 47a:16",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/47a#section-16",
          "talmudFullText": "§ It <b>was taught: One can acquire</b> property through a symbolic exchange <b>by</b> using <b>a vessel, even if it does not</b> have the <b>value of one <i>peruta</i>. Rav Naḥman says: </b> The rabbis <b>taught</b> that this symbolic exchange can be effected <b>only by</b> using <b>a vessel, but not by</b> using <b>produce, </b> i.e., any item other than a vessel. <b>Rav Sheshet says: </b> It can be effected <b>even by</b> using <b>produce. </b> The Talmud explains: <b>What is the reason</b> for the opinion <b>of Rav Naḥman? The verse states: “His shoe”</b> (Ruth 4:7), from which it is derived: With regard to <b>a shoe</b> and any other item similar to a shoe, i.e., a vessel, <b>yes, </b> the symbolic exchange can be effected; with regard to any <b>item other</b> than a vessel, <b>no, </b> it cannot be effected."
        },
        {
          "verseLocation": "Ruth 4:7",
          "verseText": "and gave it to his neighbor;",
          "talmudLocation": "Bava Metzia 7a:9",
          "talmudLocationUrl": "https://chavrutai.com/tractate/bava%20metzia/7a#section-9",
          "talmudFullText": "<b>Rav Mesharshiyya said: Learn</b> a <i>halakha</i> with regard to the symbolic transfer of <b>a cloth</b> as a formal act of acquisition <b>from</b> Rav Pappa’s statement: The entire cloth need not change hands. Rather, <b>once</b> the recipient of the cloth <b>has grasped three by three</b> fingerbreadths <b>of</b> the cloth, which is the minimum size of a cloth that can be considered a utensil, the transaction takes effect, as <b>we consider</b> such an action to be an implementation of the verse upon which acquisition by means of a cloth is based: “Now this was the custom in former times in Israel…to confirm all things: A man drew off his shoe, <b>and gave it to his neighbor; </b> and this was the attestation in Israel” (Ruth 4:7)."
        },
        {
          "verseLocation": "Ruth 4:7",
          "verseText": "“Now this [ vezot ] was the custom in former times in Israel”",
          "talmudLocation": "Niddah 45b:17",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/45b#section-17",
          "talmudFullText": "<b>Rav Naḥman bar Yitzḥak says: And your mnemonic, </b> to remember which rabbis said which ruling, is the verse: <b>“Now this [<i>vezot</i>] was the custom in former times in Israel”</b> (Ruth 4:7). The Sage whose name has a feminine form like the word <i>vezot</i>, namely, Rav Ḥanina, maintains that the development of pubic hairs during the time is considered as before the time, like the former times mentioned in the verse."
        },
        {
          "verseLocation": "Ruth 4:13",
          "verseText": "and the Lord gave her conception [ herayon ]”",
          "talmudLocation": "Niddah 38b:2",
          "talmudLocationUrl": "https://chavrutai.com/tractate/niddah/38b#section-2",
          "talmudFullText": "<b>Mar Zutra said: What is the reasoning of the early</b> generations of <b>pious</b> men, who state that a woman does not give birth before 271 days have passed from the time of insemination? <b>As it is written</b> with regard to Boaz and Ruth: “And he went in unto her, <b>and YHWH gave her conception [<i>herayon</i>]”</b> (Ruth 4:13). The letters that constitute the word <b><i>herayon</i> are 271 in numerical value. </b>"
        },
        {
          "verseLocation": "Ruth 4:17",
          "verseText": "from here: “And the neighbors gave him a name, saying: There is a son born to Naomi”",
          "talmudLocation": "Sanhedrin 19b:14",
          "talmudLocationUrl": "https://chavrutai.com/tractate/sanhedrin/19b#section-14",
          "talmudFullText": "The Talmud presents <b>a mnemonic</b> for the following discussion: <b>Ḥanina called; Yoḥanan and his wife; Elazar and redemption; and Shmuel in my studies. R' Ḥanina says: </b> Proof for the aforementioned statement can be derived <b>from here: “And the neighbors gave him a name, saying: There is a son born to Naomi”</b> (Ruth 4:17). <b>And did Naomi give birth</b> to the son? <b>But didn’t Ruth give birth</b> to him? <b>Rather, Ruth gave birth and Naomi raised</b> him. <b>Therefore, he was called by her name: </b> “A son born to Naomi. ”"
        }
      ]
    }
  ]
}